{
    "articles": [
        {
            "content": [
                "<p>Over the last three weeks, I’ve been writing about how I manage my bookmarks.\nhow I <a href=\"https://alexwlchan.net/2025/bookmarks-static-site/\">use a static site to store them</a>, how I <a href=\"https://alexwlchan.net/2025/personal-archive-of-the-web/\">built a personal web archive by hand</a>, and <a href=\"https://alexwlchan.net/2025/learning-how-to-make-websites/\">what I learnt about web development along the way</a>.</p>\n\n<p>I wanted to end this series on a lighter note, so here’s a handful of my favorite sites I rediscovered while reviewing my bookmarks – fun, creative corners of the web that make me smile.</p>\n\n<blockquote class=\"toc\">\n  <p>This article is the final part of a four part bookmarking mini-series:</p>\n  <ol>\n    <li>\n      <a href=\"https://alexwlchan.net/2025/bookmarks-static-site/\"><strong>Creating a static site for all my bookmarks</strong></a> – why I bookmark, why I use a static site, and how it works.\n    </li>\n    <li>\n      <a href=\"https://alexwlchan.net/2025/personal-archive-of-the-web/\"><strong>Building a personal archive of the web, the slow way</strong></a> – how I built a web archive by hand, the tradeoffs between manual and automated archiving, and what I learnt about preserving the web.\n    </li>\n    <li>\n      <a href=\"https://alexwlchan.net/2025/learning-how-to-make-websites/\"><strong>What I learnt about making websites by reading two thousand web pages</strong></a> – how to write thoughtful HTML, new-to-me features of CSS, and some quirks and relics I found while building my personal web archive.\n    </li>\n    <li>\n      <strong>My favourite websites from my bookmark collection</strong> (this article) – websites that change randomly, that mirror the real world, or even follow the moon and the sun, plus my all-time favourite website design.\n      <ul>\n        <li><a href=\"https://alexwlchan.net/2025/my-favourite-websites/#kottke\">The ever-changing “planets” of kottke.org</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/my-favourite-websites/#panic\">Physical meets digital on panic.org</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/my-favourite-websites/#circadium\">A Tumblr theme that follows the sun</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/my-favourite-websites/#campsanto\">Subtle transitions at Campo Santo</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/my-favourite-websites/#owltastic\">The hand-drawn aesthetic of Owltastic</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/my-favourite-websites/#final_thoughts\">Final thoughts</a></li>\n      </ul>\n    </li>\n  </ol>\n</blockquote>\n\n\n\n<hr />\n\n<h2 id=\"kottke\">The ever-changing “planets” of kottke.org</h2>\n\n<p>Jason Kottke’s website, <a href=\"https://kottke.org/\">kottke.org</a>, has a sidebar that shows four coloured circles, <a href=\"https://kottke.org/24/03/kottkeorg-redesigns-with-2024-vibes#:~:text=Billions%20and%20Billions.\">different for every visitor</a>.\nThere are nearly a trillion possible combinations, which means everyone gets their own unique version of the page.</p>\n\n<figure>\n   <source type=\"image/png\" /> <img alt=\"A web page with black text on a white background, and down the left hand side are four circles showing different textures in a variety of pink/red shades.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2025/bookmarks/kottke_1x.png\" width=\"600\" /> \n  <figcaption>\n    I happened to capture a particularly aesthetically pleasing collection of reds and pinks in this preserved snapshot.\n    They add a pop of colour to the page, but they don’t overwhelm it.\n  </figcaption>\n</figure>\n\n<p>I think this adds a dash of fun whimsy, and I’ve tried adding something similar to my own sites, but it’s easy to get wrong.\nMy experiments in randomness often failed because they lacked constraints – for example, I’d pick random tint colours, but some combinations were unreadable.\nThe Kottke “planets” strike a nice balance: the randomness stands out, but it’s reined in so the overall page will always look good.</p>\n\n<p>There are thousands of snapshots of kottke.org in the Wayback Machine, many saved automatically.\nThat means there are unique combinations of circles already archived that have yet to be seen by a person – frozen moments that may only be seen by a future reader, long after this design has gone.\nI rather like that: a tiny, quiet, time capsule on the web.</p>\n\n<h2 id=\"panic\">Physical meets digital on panic.org</h2>\n\n<p>The software company <a href=\"https://panic.com\">Panic</a> has a circular logo: <a href=\"https://commons.wikimedia.org/wiki/File:Panic_Inc_Logo.svg\">a stylised “P”</a> on a two-tone blue background.\nBut for years, if you visited their website, you might see that logo in a different colour, like this:</p>\n\n<figure>\n   <source type=\"image/png\" /> <img alt=\"A screenshot of the Panic blog, with a dark blue P logo in the top left-hand corner.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2025/bookmarks/panic_blue_1x.png\" width=\"300\" /> \n   <source type=\"image/png\" /> <img alt=\"A screenshot of the Panic blog, with a red/green P logo in the top left-hand corner.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2025/bookmarks/panic_green_1x.png\" width=\"300\" /> \n</figure>\n\n<p>Where did those colours come from?\nThe logo image gets loaded from <code>signserver.panic.com</code>, which makes me think it reflected the current colours of <a href=\"https://panic.com/blog/the-panic-sign/\">the physical sign on their building</a>.\nThey even had a website where anybody could change the colours of the sign (though it’s offline now – they took the sign down when they moved offices).</p>\n\n<p>I love this detail: a tiny bit of the physical world seeping into the digital.</p>\n\n<h2 id=\"circadium\">A Tumblr theme that follows the sun</h2>\n\n<p>Another instance of the physical world affecting the digital comes from one of my <a href=\"https://three--rings.tumblr.com/post/625948601747636224/when-i-was-15-i-spent-a-month-working-on-an\">bookmarked Tumblr posts</a>, which has a remarkable theme <a href=\"https://linthm.tumblr.com/post/626279447390257152/theme-28-circadium-20-yes-sweet-baby-jesus\">Circadium 2.0</a>, made by Tumblr user Laighlin.\nForget a binary switch between light and dark mode, this is a theme that slowly changes the appearance through the entire day.</p>\n\n<p>The background changes colour, stars fade in and out, and the moon and the sun gradually rise and set.\nIt cycles through noon, twilight, and dusk, before starting the same thing over again.\nIt’s hard to describe it in words, so here’s a screen recording <a href=\"https://circadium-theme.tumblr.com/page/3\">of the demo site</a> for a 24 hour cycle:</p>\n\n<video class=\"screenshot\" loop=\"\" poster=\"https://alexwlchan.net/images/2025/bookmarks/circadium_loop.png\" src=\"https://alexwlchan.net/images/2025/bookmarks/circadium_loop.mp4\"></video>\n\n<p>This effect is very subtle, because the appearance is set based on the time you loaded the page, and doesn’t change after that.\nUnless you reload the same page repeatedly, you may even not notice the background is changing.</p>\n\n<p>This is the sort of creativity I love about sites like Tumblr and LiveJournal, where users can <em>really</em> customise the appearance of their sites – not just pick a profile picture and a tint colour.</p>\n\n<h2 id=\"campsanto\">Subtle transitions at Campo Santo</h2>\n\n<p>The <a href=\"http://blog.camposanto.com/post/162685206999/love-at-first-site-a-few-months-ago-we-got-a\">Campo Santo blog</a> has a more restrained design, but still makes fun use of shifting colours – the tint colour of the page gradually switches from a reddish orange to brown, to green, to a dark yellow, and back to orange.\nThis tint colour affects multiple elements on the page: the header, the sidebar promo, headings and social media links.</p>\n\n<p>Here’s what it looks like:</p>\n\n<figure>\n  <video class=\"screenshot\" loop=\"\" poster=\"https://alexwlchan.net/images/2025/bookmarks/campo_santo_loop.png\" src=\"https://alexwlchan.net/images/2025/bookmarks/campo_santo_loop.mp4\"></video>\n  <figcaption>\n    I so enjoyed <em>Firewatch</em>, and I’m still a little bitter that <a href=\"https://www.youtube.com/watch?v=UFOXIGzdMv8\"><em>In the Valley of Gods</em></a> got <a href=\"https://www.polygon.com/2019/12/3/20994257/valve-in-the-valley-of-gods-campo-santo-half-life-alyx\">cancelled</a>.\n    I would have loved another first-person exploration game from that team.\n  </figcaption>\n</figure>\n\n<p>Sadly, this animation only lives on in web archives and in memory – something has broken in the JavaScript that means it no longer works on the live site.\nThe fragility of the web isn’t just entire pages or sites going offline, it’s also the gradual breaking of pages that remain online.</p>\n\n<h2 id=\"owltastic\">The hand-drawn aesthetic of Owltastic</h2>\n\n<p>My favourite website is the old design of <a href=\"https://owltastic.com\">Meagan Fisher Couldwell’s</a> website.\nIt has a beautiful, hand-drawn aesthetic, and it’s full of subtle texture and round corners – no straight lines, no hard edges.\nIt has a soft and gentle appearance, and a friendly owl mascot to boot.</p>\n\n<p>I bookmarked this particular page in 2013, before iOS 7 when loud textures and skeuomorphism were still in fashion – but unlike many designs from that era which now look dated, I think this site still looks good today.</p>\n\n<figure>\n   <source type=\"image/png\" /> <img alt=\"Screenshot of a website with a light turquoise background, with various similar shades of teal, with a light brown as an accent colour. In the top left is a hand-drawn illustration of an owl, which is smiling and gesturing towards an article titled ‘Writign and publishing are important’.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2025/bookmarks/owltastic_1x.png\" width=\"600\" /> \n  <figcaption>\n    I just know that owl and I would be friends.\n  </figcaption>\n</figure>\n\n<p>Owltastic is the first site I remember seeing and thinking “wow”, and wanting to build something that looked that good.\nMeagan has since redesigned her site, but I have a lot of nostalgia for that hand-drawn look.</p>\n\n<hr />\n\n<h2 id=\"final_thoughts\">Final thoughts</h2>\n\n<p>A lot of the creativity has been squeezed out of the web.\nI’ve been working on a separate social media archiving project recently, and it’s depressing how many sites look essentially the same – black sans serif text on a white background.\n(Many of them even use the default system font, because heaven forbid a site have <em>any</em> personality.)</p>\n\n<p>Going through my bookmarks has been a fun reminder that the web is still a creative, colourful, and diverse space – the variety is there, even if it’s getting harder to find.\nLots of people are doing interesting stuff on the web, and my bookmarks are a way to remember and celebrate that.</p>\n\n<p>Revamping the way I organise my bookmarks has taken a lot of work, but I’m so pleased with the result.\nNow I have a list of my most important web pages in an open format, saved locally, with an archived copy of each page as well.\nI can browse them in a simple web interface, and see every page as I remember it, even if the original website has disappeared.</p>\n\n<p>I don’t like making predictions, but this feels like a system that should last a long time.\nThere are no third-party dependencies, nothing that will need upgrading, no external service that could be abandoned or enshittified.\nI feel like I could manage my bookmarks this way for the rest of my life – stay tuned to see if that holds true!</p>\n\n<p>Writing this four-part series has been the capstone to this year-long project.\nI had a lot of time to think about bookmarks and web archiving, and I didn’t want those thoughts to disappear.\nI hope you’ve enjoyed it, and that I’ve given you some new ideas.\nThank you for reading this far.</p>\n\n<p>My favourite parts of the web are the spaces where people share interesting ideas.\nThis mini-series – and this entire blog – is my contribution to that collective work.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2025/my-favourite-websites/\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2025/my-favourite-websites/?utm_source=rss",
            "publishedAt": "2025-06-02",
            "source": "Alex Chan",
            "summary": "Websites that change randomly, that mirror the real world, or even follow the moon and the sun, plus my all-time favourite website design.",
            "title": "My favourite websites from my bookmark collection"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Over the years, I've learned not to question inspiration. To simply let it drive when it shows up with a full tank. Quite often, I don't exactly know where we're going or even why we're going, but it's repeatedly taken me to just the right place at just the right time, so now I just hop in and say: Let's go!</div><div><br />Case in point: <a href=\"https://archlinux.org/\">Arch</a> + <a href=\"https://hyprland.org/\">Hyprland</a>. It's been over a year since I created <a href=\"https://omakub.org/\">Omakub</a> to smooth out my own exit path from macOS to Linux, and in the process, helped thousands of others enjoy a beautiful, preconfigured, and relatively familiar desktop experience with Ubuntu. And I continue to think this is an excellent choice for Linux, especially for first-time Mac and Windows defectors.<br /><br /></div><div>But this weekend, I just happened to be home alone, and the <a href=\"https://www.youtube.com/watch?v=2CP_9-jCV6A\">hype</a> <a href=\"https://www.youtube.com/watch?v=UzUu77RZGSE\">around</a> Arch + Hyprland got the better of me. While Ubuntu is all about being a friendly place for newcomers to Linux, Arch + Hyprland is the exact opposite: It's Linux on hard mode!&nbsp;</div><div><br />At least that's the reputation, and there's certainly something to that. The Arch ISO literally just dumps you into a terminal with scarcely any direction. Just getting on the Wi-Fi requires learning the arcane command-line options for the iwctl terminal configurator.</div><div><br />But besides iwctl, it's actually not that bad anymore. We now have a cheat code for installing Arch in the form of <a href=\"https://www.youtube.com/watch?v=y9nKjTfDHLA\">archinstall</a>. It's a terminal interface for getting all the bits like picking a disk and creating the first user done in the correct order, without having to set aside an entire evening just to get the OS installed. So it didn't take long to get Arch up and running.<br /><br /></div><div>That doesn't get you much further, though! By default, Arch is about as minimal as it gets. There's no default graphical interface. There are no niceties. Not even wget or curl by default! It really is just a bare-bones installation of Linux.</div><div><br />But on the other hand, Arch is blessed with the <a href=\"https://wiki.archlinux.org/title/Arch_User_Repository\">AUR</a> — a Wikipedia-style, community-maintained package management system that seems to have literally every piece of software ever released on Linux, and always in the latest version.</div><div><br />A quarter of Omakub is trying to work around the fact that helpful tools like Alacritty or LazyGit or whatever rarely have official packages for Ubuntu, so you're left doing a lot of manual scripting to get everything a developer would want from a modern Linux setup. Not so with the AUR!</div><div><br />So that's Arch. But Hyprland is even more hilarious. It's a tiling window manager with something as rare in the Linux world as a keen focus on aesthetics! It looks like it was written by visual artists rather than neckbeards. And it's at the core of <a href=\"https://www.reddit.com/r/unixporn/top/?t=all\">the modern r/unixporn Linux ricing subculture</a>.<br /><br /></div><div>That's not the funny part, though. The funny part is how ridiculously atomized the entire thing is. Hyprland comes with absolutely nothing out of the box. No login screen, no menu bar, no notification system, no file manager, no visual settings application. Just a text-based configuration file, a wiki, and an outline on a map for how to design your own adventure.</div><div><br />This means that if you're interested in running Hyprland, and you intend to set it all up from scratch, you're probably signing up for at least a good 10+ hours — just to install and configure everything! Now, there are some precompiled setup scripts out there already, but most of them still require you to do a ton of manual legwork before you reach that beautiful summit of a complete system.<br /><br /></div><div>So while the downside of Arch + Hyprland is that literally every last detail requires you to make a choice and a config file to move on, it's also its upside: you can change EVERYTHING! And the core window tiling magic of Hyprland is one of the most intoxicating ways of using a computer that I've ever experienced. <a href=\"https://www.youtube.com/watch?v=gOGM0uHCDFk\">It looks amazing</a>; it feels amazing (if you prefer using a keyboard instead of a mouse!).</div><div><br />I've poured hours and hours into this quest over the weekend, and yet I'm still not even done with my first Arch + Hyprland build! My login screen looks like shit. I haven't decided on a final menu bar configuration. But what is working — the basic tiling flow and look — is so nice that the inspiration keeps driving the project forward.<br /><br /></div><div>Which, of course, I've already decided to codify. I'm not going through all this work to set up a beautiful, preconfigured, fully-functional, out-of-the-box Arch + Hyprland combo and then not share it with anyone who's curious (and might not have 10–20 hours for this kind of side quest available in their schedule). So of course I registered a domain and found a way to draw some ASCII art: <a href=\"https://omarchy.org\"><strong>Omarchy</strong></a> is on the way!</div><div><br />  <figure class=\"attachment attachment--preview attachment--lightboxable attachment--png\">\n      <a href=\"https://world.hey.com/dhh/cd75e26b/blobs/eyJfcmFpbHMiOnsiZGF0YSI6MjE0MDU5ODk3MSwicHVyIjoiYmxvYl9pZCJ9fQ--b86966afc12307c2502d3bc3ccec19861da09d446c6a2da89c960ff5047f4d7b/image.png?disposition=attachment\" title=\"Download image.png\">\n        <img alt=\"image.png\" src=\"https://world.hey.com/dhh/cd75e26b/representations/eyJfcmFpbHMiOnsiZGF0YSI6MjE0MDU5ODk3MSwicHVyIjoiYmxvYl9pZCJ9fQ--b86966afc12307c2502d3bc3ccec19861da09d446c6a2da89c960ff5047f4d7b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemVfdG9fbGltaXQiOlszODQwLDI1NjBdLCJxdWFsaXR5Ijo2MCwibG9hZGVyIjp7InBhZ2UiOm51bGx9LCJjb2FsZXNjZSI6dHJ1ZX0sInB1ciI6InZhcmlhdGlvbiJ9fQ--7edc7b21f6fad97fa22412618822c4d19725431f296c7ce47dc174b61535d27c/image.png\" />\n</a>\n  </figure></div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/omarchy-bottling-that-inspiration-before-it-spoils-cd75e26b",
            "publishedAt": "2025-06-02",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Over the years, I've learned not to question inspiration. To simply let it drive when it shows up with a full tank. Quite often, I don't exactly know where we're going or even why we're going, but it's repeatedly taken me to just the right place at just the right time, so now I just hop in and say: Let's go!</div><div><br />Case in point: <a href=\"https://archlinux.org/\">Arch</a> + <a href=\"https://hyprland.org/\">Hyprland</a>. It's been over a year since I created <a href=\"https://omakub.org/\">Omakub</a> to smooth out my own exit path from macOS to Linux, and in the process, helped thousands of others enjoy a beautiful, preconfigured, and relatively familiar desktop experience with Ubuntu. And I continue to think this is an excellent choice for Linux, especially for first-time Mac and Windows defectors.<br /><br /></div><div>But this weekend, I just happened to be home alone, and the <a href=\"https://www.youtube.com/watch?v=2CP_9-jCV6A\">hype</a> <a href=\"https://www.youtube.com/watch?v=UzUu77RZGSE\">around</a> Arch + Hyprland got the better of me. While Ubuntu is all about being a friendly place for newcomers to Linux, Arch + Hyprland is the exact opposite: It's Linux on hard mode!&nbsp;</div><div><br />At least that's the reputation, and there's certainly something to that. The Arch ISO literally just dumps you into a",
            "title": "Omarchy: Bottling that inspiration before it spoils"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>When you encounter a simpler system, a simpler idea, or a simpler implementation, you have an opportunity.<br /><br />You can say \"it's not enough, it doesn't have, it wouldn't work\". That’s the common reflexive response.<br /><br />Or you can reflect. “What is it about how we work that prevents us from using such a simple, succinct system?” “How did we get so twisted, so tangled, so dependent on so much that we can’t seem to get anywhere otherwise?”<br /><br />Depending on more can often mean being able to do less.<br /><br />Turning back can be getting ahead.<br /><br />Downshift.<br /><br /></div><div>-Jason</div>\n</div>"
            ],
            "link": "https://world.hey.com/jason/turning-back-can-be-getting-ahead-53d0b66b",
            "publishedAt": "2025-06-02",
            "source": "Jason Fried",
            "summary": "<div class=\"trix-content\"> <div>When you encounter a simpler system, a simpler idea, or a simpler implementation, you have an opportunity.<br /><br />You can say \"it's not enough, it doesn't have, it wouldn't work\". That’s the common reflexive response.<br /><br />Or you can reflect. “What is it about how we work that prevents us from using such a simple, succinct system?” “How did we get so twisted, so tangled, so dependent on so much that we can’t seem to get anywhere otherwise?”<br /><br />Depending on more can often mean being able to do less.<br /><br />Turning back can be getting ahead.<br /><br />Downshift.<br /><br /></div><div>-Jason</div> </div>",
            "title": "Turning back can be getting ahead"
        },
        {
            "content": [
                "<p>I recently started to subscribe to <a href=\"https://www.whoop.com\">Whoop</a> again after I canceled it around a year ago.\nI was partly dissatisfied with my <a href=\"https://www.garmin.com/en-US/p/884585/\">Garmin watch</a> as a fitness and health tracker and I also wanted a new tech device to tinker with.</p>\n<p>The plan was to write a short post about what I like and don’t like about <a href=\"https://www.whoop.com\">Whoop</a> but as usual I’m struggling with writing shorter posts.</p>\n<blockquote>\n<p>If I had more time I would write a shorter letter.\n</p>\n<footer><span class=\"author\">Attributed to Blaise Pascal\n</span></footer>\n</blockquote>\n<p>The TLDR is that <a href=\"https://www.whoop.com\">Whoop</a> is still expensive and imperfect;\nyet it’s the most helpful smart device I’ve used\nand a <a href=\"https://www.whoop.com\">Whoop</a> in your underwear is the best way to track your heart rate while hugging spandex-wearing adults.</p>\n<section id=\"A-brief-history-of-my-experiences-with-smart-devices\">\n<h2><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#A-brief-history-of-my-experiences-with-smart-devices\">A brief history of my experiences with smart devices</a></h2>\n<p>I’m not an elite athlete, not even close;\nI’m just a programmer who struggles to stay active.\nAs I also like to play with tech I’ve tried out various smart devices in the hopes that they can help me to live a healthier life\n(with various levels of success).</p>\n<p>Here’s the devices I’ve used, in purchase order:</p>\n<div class=\"timeline \"><div class=\"events\">\n<div class=\"event smartband\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Fitbit, -2020</time>\n        <div class=\"text\">\n        \n<p>I had some smartband from Fitbit that I liked.\nWhen that bugged out I bought the <a href=\"https://www.theverge.com/2018/3/26/17163210/fitbit-versa-smartwatch-review-wearable-tech-apple-watch\">Fitbit Versa</a>, with a square display.</p>\n</div></div></div>\n<div class=\"event oura\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Oura ring, 2020-2021</time>\n        <div class=\"text\">\n        \n<p>I wanted to track my sleep better, so I bought <a href=\"https://ouraring.com/\">a ring</a>.\nIt worked well.</p>\n</div></div></div>\n<div class=\"event smartband\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Garmin Venu Sq, 2020-2023</time>\n        <div class=\"text\">\n        \n<p>The Fitbit kept disconnecting, so I abandoned it for a <a href=\"https://www.garmin.com/sv-SE/p/707174/\">Garmin</a>.</p>\n</div></div></div>\n<div class=\"event oura\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Oura ring Gen 3, 2021-2023</time>\n        <div class=\"text\">\n        \n<p>I had to recharge the ring all the time so I upgraded to the newer version.\n(The battery of the new ring also deteriorated and I stopped using it when I had to charge it every 1–3 days.)</p>\n</div></div></div>\n<div class=\"event withings\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Withings Body+, 2022-</time>\n        <div class=\"text\">\n        \n<p>I wanted to track my weight so I bought <a href=\"https://www.withings.com/se/se/body-plus\">a smart scale</a>.</p>\n</div></div></div>\n<div class=\"event hrtracker\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Polar Verity Sense, 2022-2023</time>\n        <div class=\"text\">\n        \n<p>I can’t track my Submission Grappling training with a watch or a ring,\nso I bought <a href=\"https://www.polar.com/en/products/accessories/polar-verity-sense\">a heart rate monitor</a> you put on the bicep.\nIt was okay.</p>\n</div></div></div>\n<div class=\"event smartwatch\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Fossil Gen 6 Wellness Edition, 2022</time>\n        <div class=\"text\">\n        \n<p>Maybe I should try a <em>real</em> <a href=\"https://www.theverge.com/23511584/fossil-gen-6-wellness-edition-review-wear-os-smartwatch\">smartwatch</a> with lots of smart features…?\nI use Android so maybe a watch with WearOS is good?</p>\n<p>Jokes on me, WearOS was garbage and having to charge the watch every day is a nightmare.\nI went back to the Garmin.</p>\n</div></div></div>\n<div class=\"event smartwatch\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Garmin vivosmart 5, 2023-2024</time>\n        <div class=\"text\">\n        \n<p>I wasn’t happy with the <a href=\"https://www.garmin.com/sv-SE/p/707174/\">Garmin Venu Sq</a> (can’t remember why) and disappointed with smart watches I figured <a href=\"https://www.garmin.com/sv-SE/p/782585/\">a simple smart band</a> would suffice.</p>\n</div></div></div>\n<div class=\"event whoop\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Whoop 4.0, 2023-2024</time>\n        <div class=\"text\">\n        \n<p>The battery of my <a href=\"https://ouraring.com/\">Oura</a> was failing again so I tried <a href=\"https://www.whoop.com\">Whoop</a> for a year.\nTracking Submission Grappling with a device in my underwear is so next level!</p>\n</div></div></div>\n<div class=\"event smartwatch\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Garmin Instinct 2X Solar, 2024-</time>\n        <div class=\"text\">\n        \n<p>Charging the devices got annoying; I found the <a href=\"https://www.garmin.com/en-US/p/884585/\">Garmin Instinct</a>\nyou only charge once a month and it comes with a <em>flashlight</em>.</p>\n<p>Seriously, you haven’t truly lived before you’ve had a flashlight on your watch—it’s glorious.\n(Jokes aside, it’s awesome.)</p>\n</div></div></div>\n<div class=\"event eightsleep\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Eight Sleep Pod 4, 2024</time>\n        <div class=\"text\">\n        \n<p>Sleep is important so <a href=\"https://www.jonashietala.se/blog/2024/10/05/trying_and_returning_the_eight_sleep_pod_4/\">I tried (and returned) a ludicrously expensive smart mattress</a>.</p>\n</div></div></div>\n<div class=\"event whoop\">\n      <svg class=\"marker\" height=\"12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n        <circle cx=\"6\" cy=\"6\" r=\"6\">\n      </svg>\n      <div class=\"content\">\n        <time>Whoop MG, 2025</time>\n        <div class=\"text\">\n        \n<p>I was feeling down and I needed something to help me get back to prioritizing fitness and health,\nand I just happened to check back on <a href=\"https://www.whoop.com\">Whoop</a> right when Whoop MG was released…</p>\n<p>So I threw financial responsibility out the window and ordered the MG on release day.</p>\n</div></div></div>\n</div></div>\n<p>Gosh, I’ve been good about not changing my phone that often but I didn’t realize I’ve wasted so much time and money on smart devices…</p>\n<p>Anyway, I’m currently using the <a href=\"https://www.garmin.com/en-US/p/884585/\">Garmin Instinct 2X Solar</a> as a “don’t glance at my phone” device and <a href=\"https://www.whoop.com\">Whoop</a> as my fitness and health tracker,\nignoring the Garmin’s health and fitness tracking features.</p>\n</section>\n<section id=\"The-point-is-to-change-behaviours\">\n<h2><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#The-point-is-to-change-behaviours\">The point is to change behaviours</a></h2>\n<p>While it’s fun to play with new things,\nthe main point of these smart devices is to (hopefully) help me change my behaviours in a positive way.\nIt doesn’t matter if the device is super accurate or produces the most beautiful graphs God has created;\nif it doesn’t help me do things differently then the device is a failure.</p>\n<p>Here are two examples:</p>\n<ol>\n<li>\n<p>My first Fitbit smartband was great.</p>\n<p>It’s true that it was quite limited in what it could do,\nthe tracking of steps/calories/steps/etc was wildly inaccurate,\nand it disconnected from my phone <em>all the time</em> making notifications completely unreliable.</p>\n<p>However, it presented the daily steps/calories/steps as pretty bars on the screen—bars that I should fill over the course of the day—and that caused me to move more than I’d have done otherwise.</p>\n<p>(This is a feature in most smartwatches today but nothing I’ve tried captured the feeling as well as my very first Fitbit device.)</p>\n</li>\n<li>\n<p>The <a href=\"https://www.garmin.com/en-US/p/884585/\">Garmin Instinct</a> is useful, but not as a fitness or health device.</p>\n<p>I think the watch is very nice;\nit’s got a fantastic battery life,\nit’s not bothering me when I sleep,\nI don’t have to reach for my phone to see if I have any notifications,\nand the flashlight is <em>amazing</em>.</p>\n<blockquote>\n<p>It [the flashlight] is just super effin’ functional and useful day-to-day, with just as much utility as the flashlight on your phone (if not more, since your hands are still free).</p>\n<p></p>\n<footer><span class=\"author\"><a href=\"https://www.dcrainmaker.com/2023/05/flashlight-multiband-everyone.html\">DCRainmaker</a>\n</span></footer>\n</blockquote>\n<p>The Garmin also has lots of various measurements (and with much more accuracy than my old Fitbit);\nI can see the daily steps;\nI can follow how my “body battery” is doing;\nI can track walks or runs very well (although I don’t run);\nand I can follow my stress and heart rate throughout the day…</p>\n<p>But that doesn’t <em>do</em> anything for me.\nI have all these bars and graphs and circles on the watch that I should fill to meet my daily step count for example… But I just don’t.\nMaybe my neanderthal brain needs more colors or something.</p>\n<p>The Garmin app is also not designed in a way to help me get motivated.\nMaybe it’s more geared towards runners\nor athletes that already train hard every day,\ninstead of middle-aged programmers who need that extra push to get out there?</p>\n<p>For whatever reason, as a device to improve my fitness and health, the Garmin is a failure.</p>\n</li>\n</ol>\n</section>\n<section id=\"Why-I-left-Whoop-last-year\">\n<h2><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Why-I-left-Whoop-last-year\">Why I left Whoop last year</a></h2>\n<p>About a year ago I chose to not renew my Whoop subscription and I <a href=\"https://www.reddit.com/r/whoop/comments/1e1hzbe/today_i_cancelled_my_whoop_subscription_let_me/\">made a post on Reddit</a> explaining why.</p>\n<p>Here’s a quick summary of my issues with <a href=\"https://www.whoop.com\">Whoop</a>:</p>\n<ul>\n<li>\n<p>If I had the Whoop in my boxers it thinks I’m sleeping when I sit in front of the computer or lie in the sofa.<br />\n(This is still a big issue.)</p>\n</li>\n<li>\n<p>No custom insights for the journal.<br />\n(Still nothing.)</p>\n</li>\n<li>\n<p>The UI for the strength trainer portion of the app sucked.<br />\n(You can now add exercises after the training—a big step forward.)</p>\n</li>\n<li>\n<p>It’s too expensive if all it provides is tracking for Submission Grappling.<br />\n(I realized I’m missing some of the other stuff.)</p>\n</li>\n</ul>\n<section id=\"What-made-me-change-my-mind\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#What-made-me-change-my-mind\">What made me change my mind?</a></h3>\n<p>When I quit <a href=\"https://www.whoop.com\">Whoop</a> I was in a pretty good place in my life; I was feeling good, I was training consistently, and\nI didn’t need external stimuli to keep going.</p>\n<p>But things have been different recently.\nI’ve been <a href=\"https://www.jonashietala.se/blog/2023/03/14/battling_burnout\">struggling with depression</a>, haven’t been able to get back to a regular training routine,\nand I feel that I need all help I can get to get back on track.</p>\n<p>During the 10 months without <a href=\"https://www.whoop.com\">Whoop</a> I relied on <a href=\"https://www.garmin.com/en-US/p/884585/\">my Garmin watch</a>\nand I realized that the watch simply wasn’t helping me to improve my fitness or health the way I wanted from a smart device.</p>\n<p>I looked at alternatives but in the end I couldn’t find an alternative that matched <a href=\"https://www.whoop.com\">Whoop</a>’s feature set, so here I am.</p>\n<aside class=\"important\">\n<p>Please don’t think that any smart device can replace professional help.\nI use these devices as a complement to, not in place of, a therapist and a coach.</p>\n</aside>\n</section>\n</section>\n<section id=\"Whoop-screwed-over-their-customers\">\n<h2><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Whoop-screwed-over-their-customers\">Whoop screwed over their customers</a></h2>\n<p>It was an interesting feeling to visit <a href=\"https://www.reddit.com/r/whoop\">r/whoop</a> after having placed my order\nand see it overrun by people extremely upset about how <a href=\"https://www.whoop.com\">Whoop</a> was treating their existing subscribers.</p>\n<p>I agree that <a href=\"https://www.whoop.com\">Whoop</a> displayed some real corporate bullshit by telling people to pay an upgrade fee despite claiming for years that upgrades would be free (then walking back on the upgrade fee somewhat),\nclaiming that the 6-month subscription requirement for new hardware was “a mistake on their blog”,\nand by breaking compatibility with the 4.0 bands.</p>\n<p>Some people claim that <a href=\"https://www.whoop.com\">Whoop</a> broke the band compatibility intentionally but as I’ve experienced the same at work I think incompetence is more likely.</p>\n<blockquote>\n<p>I don’t want to be constrained by the old design!</p>\n<p></p>\n<footer><span class=\"author\">Programmer, before corporate disaster\n</span></footer>\n</blockquote>\n<p>It sucks but corporations screwing us over in various ways is more or less expected.\nThis whole situation made me regret resubscribing to <a href=\"https://www.whoop.com\">Whoop</a> immediately, before letting the dust settle.</p>\n</section>\n<section id=\"Thoughts-on-Whoop-in-2025\">\n<h2><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Thoughts-on-Whoop-in-2025\">Thoughts on Whoop in 2025</a></h2>\n<p>Here are my first impressions after using the <a href=\"https://www.whoop.com\">Whoop MG</a> for almost a month after resubscribing.</p>\n<section id=\"Battery-life-is-excellent\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Battery-life-is-excellent\">Battery life is excellent</a></h3>\n<p>Some people don’t mind charging their devices a few times a week but I personally loath it.\nWith the new <a href=\"https://www.whoop.com\">Whoop</a> and its battery life of ~2 weeks I can finally leave the battery pack when I go on my one week work trips and it’s <em>super nice</em>.</p>\n</section>\n<section id=\"The-app-UI-is-great\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#The-app-UI-is-great\">The app UI is great</a></h3>\n<p>Maybe it’s “just” pretty UI but I find Whoop’s presentation much more helpful than the rawer presentation that Garmin has.</p>\n<p>For example I’ve always liked to look at sleep information ever since I started wearing an <a href=\"https://ouraring.com/\">Oura ring</a> and\n<a href=\"https://www.whoop.com\">Whoop</a>’s (recently redesigned) presentation is very good as it focuses on actionable metrics:</p>\n<figure class=\"flex-50\">\n<a href=\"https://www.jonashietala.se/images/whoop/whoop_sleep.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/whoop_sleep.png\" /></a>\n<a href=\"https://www.jonashietala.se/images/whoop/garmin_sleep.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/garmin_sleep.png\" /></a>\n<figcaption>\n<p>Whoop to the left focuses on metrics that I can change\nwhile Garmin to the right focuses on sleep stages that I have no idea how to influence.</p>\n</figcaption>\n</figure>\n<p>I also think Whoop is immediately more useful than Garmin’s when you open it up:</p>\n<figure class=\"flex-50\">\n<a href=\"https://www.jonashietala.se/images/whoop/whoop_start.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/whoop_start.png\" /></a>\n<a href=\"https://www.jonashietala.se/images/whoop/garmin_start.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/garmin_start.png\" /></a>\n<figcaption>\n<p>Whoop’s landing page to the left and Garmin’s on the right.</p>\n</figcaption>\n</figure>\n<figure class=\"flex-50\">\n<a href=\"https://www.jonashietala.se/images/whoop/strain_recovery.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/strain_recovery.png\" /></a>\n<a href=\"https://www.jonashietala.se/images/whoop/hours_needed.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/hours_needed.png\" /></a>\n<figcaption>\n<p>I’m a sucker for pretty graphs and Whoop has a lot of them.</p>\n</figcaption>\n</figure>\n<p>I have some gripes with the UI—I would like to be able to customize the home screen more for example—but overall I think Whoop’s app is a lot\nbetter designed and more useful than any alternative I’ve tried.</p>\n<aside class=\"note\">\n<p>It’s been a few years since I last used <a href=\"https://ouraring.com/\">Oura</a> but from what I remember their app is also very good—just a shame that their exercise tracking is unusable for strength training and Submission Grappling.</p>\n</aside>\n</section>\n<section id=\"Whoop-in-the-boxers\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Whoop-in-the-boxers\">Whoop in the boxers</a></h3>\n<p>As I mentioned before, Whoop still thinks that I’m sleeping when I sit with Whoop in the boxers.\nEither before I go to bed, after I go to bed, and sometimes it thinks I’m napping when I’m sitting during the day.</p>\n<p>Very annoying.</p>\n<p>But they’re still a killer feature for me because it’s the best way to track Submission Grappling.\n<a href=\"https://www.whoop.com\">Whoop</a> is less accurate than the <a href=\"https://www.polar.com/en/all-sensors\">Polar bicep/chest straps</a>\nbut a biceps band or a chest strap sometimes gets in the way during training,\nwhile I’ve never noticed the Whoop in my boxers.</p>\n<figure><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/jones_sub.png\" />\n<figcaption>Submission grappling. A version of hugging where you try to strangle each other.\n</figcaption></figure>\n<p>The Whoop 5.0 / MG also fits the 4.0 boxers well—lucky me as I have a bunch of the older 4.0 boxers.\nI’ve gotta admit, I like their boxers and I kept using them even after I canceled my subscription.</p>\n<figure class=\"flex-50\">\n<a href=\"https://www.jonashietala.se/images/whoop/boxer_4.0.jpg\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/boxer_4.0.jpg\" /></a>\n<a href=\"https://www.jonashietala.se/images/whoop/boxer_mg.jpg\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/boxer_mg.jpg\" /></a>\n<figcaption>\n<p>The Whoop MG in the 4.0 boxers to the left and the MG in the new boxers to the right.</p>\n</figcaption>\n</figure>\n<p>I was skeptical to their new design with the “pods” but I think they’re an improvement as it’s a lot easier to add/remove the device while wearing the boxers,\nand if you remove the pod they’re just like regular boxers.\nThe holders on my old 4.0 boxers have started to peel away and started to chafe but I think there’s less of a risk with the new design.</p>\n</section>\n<section id=\"ECG\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#ECG\">ECG</a></h3>\n<p>The ECG feature is why I went with Whoop MG instead of Whoop 5.0.</p>\n<figure class=\"flex-50\">\n<a href=\"https://www.jonashietala.se/images/whoop/ecg2.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/ecg2.png\" /></a>\n<a href=\"https://www.jonashietala.se/images/whoop/ecg1.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/ecg1.png\" /></a>\n<figcaption>\n<p>Outputs from Whoop’s ECG feature.\nIt’s a little difficult to take an ECG as you need to stay very still—you can see where I moved too much in the top-right picture.</p>\n</figcaption>\n</figure>\n<p>I’ve had a couple of episodes with chest pain where I’ve hurried to the hospital to get a check-up.\nThey never showed anything out of the ordinary (it was ruled as “something muscular”) but the experience has left me worried.</p>\n<p>If the ECG and background “Irregular Heart Rhytm” detection makes me relax a little (or if they do detect something) then I figured it’s worth the price jump from the 5.0 to the MG.</p>\n<aside class=\"important\">\n<p>Despite Whoop <strong>MG</strong> hinting at <strong>M</strong>edical <strong>G</strong>rade I’m skeptical about it being medical grade as they make it clear that the neither the ECG nor background AFib detection provides a medical diagnosis.\nMaybe it’s a marketing sleight of hand that they chose “MG” instead of “Medical Grade”…</p>\n</aside>\n</section>\n<section id=\"Whoop-age\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Whoop-age\">Whoop age</a></h3>\n<figure class=\"flex-50\">\n<a href=\"https://www.jonashietala.se/images/whoop/age1.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/age1.png\" /></a>\n<a href=\"https://www.jonashietala.se/images/whoop/age2.png\"><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/age2.png\" /></a>\n<figcaption>\n<p>My “Whoop age” right after it unlocked after 3 weeks.\nYou can see that I’ve been exercising way to little and that I’m slightly overweight.</p>\n</figcaption>\n</figure>\n<p>I’ve seen Reddit warriors call the Whoop age metric a “gimmick” and dismiss it as just a combination of metrics available elsewhere.</p>\n<p>But for me—a middle-aged programmer dad who’s struggling to exercise consistently—the Whoop age metric is a fantastic addition to Whoop as it gives me a pretty <em>and actionable</em> way to improve my overall health.</p>\n<p>I already know that I need to lose weight and exercise more, but sometimes you need someone else to hit you with the reality before you internalize the problem and start doing something about it.</p>\n<aside class=\"important\">\n<p>Aging faster might not matter that much <em>right now</em>, but later in life feeling a few years younger instead of older can have a massive effect for your quality of life.</p>\n</aside>\n<p>It’s too early to tell how useful the Whoop age metric ultimately ends up being but my first impression is very positive.</p>\n</section>\n<section id=\"More-measures\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#More-measures\">More measures</a></h3>\n<p>Whoop also comes with more “raw” measures that I glance at from time to time:</p>\n<ul>\n<li>\n<p>Body weight and body composition</p>\n<p>Whoop now syncs with my <a href=\"https://www.withings.com/se/se/body-plus\">Withings smart scale</a> and I do need to lose weight; it’s nice to have it in the Whoop app so I don’t have to open up Withing’s app just to see my weight trend.</p>\n</li>\n<li>\n<p>Steps</p>\n<p>Again, I have (more accurate) step tracking in Garmin but it’s nice to have it all in one app.\nI try to hit a reasonable step goal and step counting—even if inaccurate—has made me try to move around more.</p>\n</li>\n<li>\n<p>VO<sub>2</sub> MAX</p>\n<p>It seems like an important metric but I’m <a href=\"https://www.youtube.com/watch?v=7zcXM1IYtqU\">not sure about it’s accuracy</a> and it hasn’t caused me to change any behaviours.\n(I also need to calibrate it with a 15 minutes run. I haven’t been on a run the last decade…)</p>\n</li>\n<li>\n<p>Blood pressure</p>\n<p>I calibrated the blood pressure insights but I’m not sure how useful it is for me.\nMaybe it can act as an early indicator that my health is deteriorating but so far it’s just a pretty statistic.</p>\n</li>\n</ul>\n</section>\n<section id=\"Journaling-and-insights\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Journaling-and-insights\">Journaling and insights</a></h3>\n<p>The journal that correlates your behaviours with your recovery scores is an amazing feature and\n<em>in theory</em> this feature alone could carry a device such as Whoop by itself…</p>\n<p>If it wasn’t for the fact that the usefulness tapers off hard as soon as you learn how the various behaviours affect your body.\nAt the end of my last subscription I even turned off the journal as it didn’t provide any new information and filling it in only became a chore.</p>\n<p>Right now I use it but I only track a handful of behaviours that I want to remind myself of.\nHowever, I’ll probably turn off the journal in a few months when the newness wears off again.</p>\n</section>\n<section id=\"Bands\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Bands\">Bands</a></h3>\n<p>It was a really shitty move by <a href=\"https://www.whoop.com\">Whoop</a> to break backwards compatibility with the old bands.\nGranted, I don’t care that much about appearance so I never bought a lot of bands but I still want to switch between bands when they get wet after shower.</p>\n<p>Where corporations fails the 3D printer community steps up to save the day.\nYou can 3D print a <a href=\"https://makerworld.com/en/models/1449870-whoop-5-0-mg-adapter?from=search#profileId-1510220\">whoop 5.0 / MG adapter</a> to continue using your existing bands:</p>\n<figure><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/whoop_4_arm.jpg\" />\n<figcaption>A 4.0 band together with my Whoop MG.\n</figcaption></figure>\n<figure><img alt=\"\" src=\"https://www.jonashietala.se/images/whoop/woop_4_adapter.jpg\" />\n<figcaption>A <a href=\"https://makerworld.com/en/models/1449870-whoop-5-0-mg-adapter?from=search#profileId-1510220\">3D printed adapter</a> making the 4.0 clasp compatible with a 5.0/MG device.\n</figcaption></figure>\n<p>It’s not as secure as a proper 5.0/MG band and the old 4.0 battery doesn’t fit but it works well enough for regular usage (I don’t dare to swim with it).</p>\n<p>I’ll probably buy another band anyway so I have another ECG-compatible clasp; possibly a colorful <a href=\"https://shop.whoop.com/en-eu/products/mg-sportflex-band/?sku=810114363560\">SportFlex</a> band for when I swim with the kids.</p>\n<aside class=\"tip\">\n<p><a href=\"https://www.whoop.com\">Whoop</a> could’ve avoided so much backlash if they had given out an adapter to everyone who upgraded…</p>\n<p>The 5.0/MG release has quite a few lessons of things not to do when you release a new product.</p>\n</aside>\n</section>\n<section id=\"Pricing\">\n<h3><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Pricing\">Pricing</a></h3>\n<p>Whoop outdid themselves and the MG took something already expensive and made it even more expensive.\nWhile I don’t regret going with the more expensive option,\nthe “Peak” plan (without Blood pressure and ECG) probably makes more sense for most people.</p>\n<p>Still, if <a href=\"https://www.whoop.com\">Whoop</a> can help me improve my fitness or health—even in a small way—the cost is worth it for me.</p>\n</section>\n</section>\n<section id=\"Conclusion\">\n<h2><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#Conclusion\">Conclusion</a></h2>\n<p>Despite its faults and corporate bullshit, the <a href=\"https://www.whoop.com\">Whoop</a> is still my favorite smart device for fitness and health.\nI’ve tried to find alternatives but nothing has been as convenient or as helpful (or as expensive) as the Whoop.</p>\n<p>But the jury is still out on how helpful <a href=\"https://www.whoop.com\">Whoop</a> will be for me this time and in a year I may have moved on to try something else.</p>\n<aside class=\"tip\">\n<p>I’ve heard that some people sync the raw data from a ring, smartwatch, and heart rate monitor with an app, separating the data collection and data processing.\nI haven’t tried that route yet but it sounds intriguing.</p>\n</aside>\n</section>"
            ],
            "link": "https://www.jonashietala.se/blog/2025/06/02/why_im_back_to_whoop_for_now",
            "publishedAt": "2025-06-02",
            "source": "Jonas Hietala",
            "summary": "<p>I recently started to subscribe to <a href=\"https://www.whoop.com\">Whoop</a> again after I canceled it around a year ago. I was partly dissatisfied with my <a href=\"https://www.garmin.com/en-US/p/884585/\">Garmin watch</a> as a fitness and health tracker and I also wanted a new tech device to tinker with.</p> <p>The plan was to write a short post about what I like and don’t like about <a href=\"https://www.whoop.com\">Whoop</a> but as usual I’m struggling with writing shorter posts.</p> <blockquote> <p>If I had more time I would write a shorter letter. </p> <footer><span class=\"author\">Attributed to Blaise Pascal </span></footer> </blockquote> <p>The TLDR is that <a href=\"https://www.whoop.com\">Whoop</a> is still expensive and imperfect; yet it’s the most helpful smart device I’ve used and a <a href=\"https://www.whoop.com\">Whoop</a> in your underwear is the best way to track your heart rate while hugging spandex-wearing adults.</p> <section id=\"A-brief-history-of-my-experiences-with-smart-devices\"> <h2><a class=\"heading-ref\" href=\"https://www.jonashietala.se/#A-brief-history-of-my-experiences-with-smart-devices\">A brief history of my experiences with smart devices</a></h2> <p>I’m not an elite athlete, not even close; I’m just a programmer who struggles to stay active. As I also like to play with tech I’ve tried out various smart devices in the hopes that they can help me to live a healthier life (with various levels of success).</p> <p>Here’s the devices I’ve used, in purchase order:</p>",
            "title": "Why I'm back to Whoop (for now)"
        },
        {
            "content": [
                "<p>In most places, most areas of life are dominated either by competition between multiple units, or by the governance of a single organization. Of course governments have usually themselves faced competition at larger scales, and governance often makes use of internal competition at smaller scales.</p><p>A key social and political question has long been: how much of society shall governments run? In the ancient world, the answer was mostly: only a small part. There were a few experiments with more totalitarian governance, such as in ancient Egypt and China, but mostly government was limited. Also, most private orgs were quite small, and so needed little only modest governance.</p><p>We can evaluate governance by three criteria: preference, effectiveness, and adaptiveness. How much do people just like to have more government, all else equal, how effective is government as solving the areas and problems it is assigned compared to the competitive alternative, and how adaptive is the resulting society (in the standard biological sense).</p><p>Effectiveness and adaptiveness of governance will depend on demand and supply factors. How severe are the market failure and other coordination problems for which governance seems especially appropriate, and how competent are the governance mechanisms available to deal with such problems?</p><p>Plausibly most societies were pretty adaptive until a few centuries ago, and so typical governance levels were roughly adaptive. And that is plausibly because governance was then not very competent at dealing with most social areas, compared to competition. Places with more severe coordination problems, like those arising from large scale irrigation opportunities in ancient Egypt and China, tended to have more governance.</p><p>In the last few centuries the world has greatly increase its average governance levels, having governments do more to manage more areas of life, and at larger spatial scales. Non-government orgs have also greatly increased their scales. In fact, this org scale increase is plausibly THE great change of the industrial era, with other changes resulting more from this key change.</p><p>One plausible cause of this change is a great increase in the competence of governance, compared to competition. Other possible causes include an increase in the preference for governance, due to a drift to forager attitudes, and an increase in the severity of coordination problems, due to larger scales of war, production, trade, and culture.</p><p>I&#8217;m a tenured professor at GMU econ, which is famously libertarian, and with my colleagues I do in fact tend to think that we have too much government today, even in the US. But I&#8217;m not an axiomatic libertarian, using primarily moral reasons. My stance has been more about seeing both less severe coordination problems, and less competent existing governance mechanisms.</p><p>However, I also happen to be the proud inventor of a new governance mechanism, futarchy, that promises to be vastly more competent that prior mechanisms. And so I have to admit that if this mechanism is as successful as I hope, we&#8217;d then get a lot more governance:</p><blockquote><p>In such a world orgs should be larger, as their more effective governance reduces the scale diseconomies that limit org sizes today. Governments and nonprofits may also encompass more social activity, if they can learn to adopt simple robust futarchy outcome measures. This plausibly cuts their disadvantages relative to for profit orgs today. We might well even get bigger national alliances, or even a world government. (<a href=\"https://www.overcomingbias.com/p/futarchy-futurism\">More</a>)</p></blockquote><p>A key question then is: to what purposes would this new stronger governance be directed? I&#8217;ve <a href=\"https://www.overcomingbias.com/p/futarchy-futurism\">hoped</a> that we could use it to solve our big key problem of <a href=\"https://www.overcomingbias.com/p/our-big-oops?utm_source=publication-search\">cultural drift</a>, and in fact I can&#8217;t actually think of a more promising solution to that problem. But I have to admit that most societies may in fact <a href=\"https://www.overcomingbias.com/p/seek-what-outcomes-via-futarchy\">direct</a> it to other purposes.</p><p>In the past, weak governance may actually have been a big reason why we&#8217;ve had so much competition, which has induced so much cultural evolution. Stronger governance could let places function with much less competition, which then results in much less adaptive cultural evolution. Which would then allow those cultures to drift even worse into dysfunction.</p><p>So if our world soon acquires a much more competent form of governance, we might then suffer a new much larger <em>variance</em> in adaptability. Places where this governance is directed toward maladaptive goals would become more maladaptive even faster, while places where this new power is directed toward adaptive goals could become far more adaptive, reversing the decay of prior cultural drift. </p><p>Overall, in the long run, this variance would be highly adaptive of course. But there might be quite painful transition period.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/dangers-of-competent-governance",
            "publishedAt": "2025-06-02",
            "source": "Robin Hanson",
            "summary": "In most places, most areas of life are dominated either by competition between multiple units, or by the governance of a single organization.",
            "title": "Dangers of Competent Governance"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">meetup </a>this week in Berkeley (Wed 6:30, 2740 Telegraph). I&#8217;ll probably advertise this as a main post tomorrow, but just getting it out there early.</p><p><strong>2:</strong> Tyler Cowen responds to my continued disagreement with him <a href=\"https://marginalrevolution.com/marginalrevolution/2025/05/scott-alexander-replies.html\">here</a>. We are still on different pages on this, but I don&#8217;t think it&#8217;s a fair use of your or Tyler&#8217;s time to continue writing about this, so I&#8217;ll leave it there.</p><p><strong>3: </strong>It was good to meet some of you last weekend at LessOnline, and probably will be good to meet even more of you next weekend at Manifest. Blogging may be lighter than usual as I attend all of this, sorry</p><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-384",
            "publishedAt": "2025-06-02",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">meetup </a>this week in Berkeley (Wed 6:30, 2740 Telegraph). I&#8217;ll probably advertise this as a main post tomorrow, but just getting it out there early.</p><p><strong>2:</strong> Tyler Cowen responds to my continued disagreement with him <a href=\"https://marginalrevolution.com/marginalrevolution/2025/05/scott-alexander-replies.html\">here</a>. We are still on different pages on this, but I don&#8217;t think it&#8217;s a fair use of your or Tyler&#8217;s time to continue writing about this, so I&#8217;ll leave it there.</p><p><strong>3: </strong>It was good to meet some of you last weekend at LessOnline, and probably will be good to meet even more of you next weekend at Manifest. Blogging may be lighter than usual as I attend all of this, sorry</p><p></p>",
            "title": "Open Thread 384"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3097/",
            "publishedAt": "2025-06-02",
            "source": "XKCD",
            "summary": "<img alt=\"Pontoon bridges are just linear open-sided waterbeds.\" src=\"https://imgs.xkcd.com/comics/bridge_types.png\" title=\"Pontoon bridges are just linear open-sided waterbeds.\" />",
            "title": "Bridge Types"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-02"
}