{
    "articles": [
        {
            "content": [
                "<p>The idea of “processed food” may simultaneously be the most and least controversial concept in nutrition. So I did a self-experiment alternating between periods of eating whatever and eating only “minimally processed” food, while tracking my blood sugar, blood pressure, pulse, and weight.</p>\n\n<h2 id=\"the-case-against-processing\">The case against processing</h2>\n\n<p>Carrots and barley and peanuts are “unprocessed” foods. Donuts and cola and <a href=\"https://en.wikipedia.org/wiki/Chicken-fried_steak\">country-fried steak</a> are “processed”. It seems like the latter are bad for you. But why? There are several overlapping theories:</p>\n\n<ol>\n  <li>\n    <p>Maybe unprocessed food contains more “good” things (nutrients, water, fiber, omega-3 fats) and less “bad” things (salt, sugar, trans fat, microplastics).</p>\n  </li>\n  <li>\n    <p>Maybe processing (by grinding everything up and removing fiber, etc.) means your body has less time to extract nutrients and gets more dramatic spikes in blood sugar.</p>\n  </li>\n  <li>\n    <p>Maybe capitalism has engineered processed food to be “hyperpalatable”. Cool Ranch® flavored tortilla chips sort of exploit bugs in our brains and are too rewarding for us to deal with. So we eat a lot and get fat.</p>\n  </li>\n  <li>\n    <p>Maybe we feel full based on the <em>amount</em> of food we eat, rather than the number of calories. Potatoes have around 750 calories per kilogram while Cool Ranch® flavored tortilla chips have around 5350. Maybe when we eat the latter, we eat more calories and get fat.</p>\n  </li>\n  <li>\n    <p>Maybe eliminating highly processed food reduces the <em>variety</em> of food, which in turn reduces how much we eat. If you could eat (1) unlimited burritos (2) unlimited iced cream, or (3) unlimited iced cream and burritos, you’d eat the most in situation (3), right?</p>\n  </li>\n</ol>\n\n<p>Even without theory, everyone used to be skinny and now everyone is fat. What changed? Many things, but one is that our “food environment” now contains lots of processed food.</p>\n\n<p>There is also some experimental evidence. <a href=\"https://doi.org/10.1016/j.cmet.2019.05.008\">Hall et al. (2019)</a> had people live in a lab for a month, switching between being offered unprocessed or ultra-processed food. They were told to eat as much as they want. Even though the diets were matched in terms of macronutrients, people still ate less and lost weight with the unprocessed diet.</p>\n\n<h2 id=\"the-case-against-that-case\">The case against that case</h2>\n\n<p>On the other hand, what even <em>is</em> processing? The USDA—uhh—may have deleted their page on the topic. But they <em>used</em> to define it as:</p>\n\n<blockquote>\n  <p>washing, cleaning, milling, cutting, chopping, heating, pasteurizing, blanching, cooking, canning, freezing, drying, dehydrating, mixing, or other procedures that alter the food from its natural state. This may include the addition of other ingredients to the food, such as preservatives, flavors, nutrients and other food additives or substances approved for use in food products, such as salt, sugars and fats.</p>\n</blockquote>\n\n<p>It seems crazy to try to avoid a category of things so large that it includes <em>washing</em>, <em>chopping</em>, and <em>flavors</em>.</p>\n\n<p>Ultimately, “processing” <em>can’t</em> be the right way to think about diet. It’s just too many unrelated things. Some of them are probably bad and others are probably fine. When we finally figure out how nutrition works, surely we will use more fine-grained concepts.</p>\n\n<h2 id=\"why-i-did-this-experiment\">Why I did this experiment</h2>\n\n<p>For now, I guess I believe that our fuzzy concept of “processing” is at least <em>correlated</em> with being less healthy.</p>\n\n<p>That’s why, even though I think seed oil theorists <a href=\"https://dynomight.net/seed-oil/\">are confused</a>, I expect that avoiding seed oils is probably good in practice: Avoiding seed oils means avoiding almost all processed food. (For now. The seed oil theorists seem to be busily inventing seed-oil free versions of all the ultra-processed foods.)</p>\n\n<p>But what I really want to know is: What benefit would I get from making my diet better?</p>\n\n<p>My diet is already fairly healthy. I don’t particularly want or need to lose weight. If I tried to eat in the healthiest way possible, I guess I’d eliminate all white rice and flour, among other things. I <em>really</em> don’t want to do that. (Seriously, this experiment has shown me that flour contributes a non-negligible fraction of my total joy in life.) But if that would make me live 5 years longer or have 20% more energy, I’d do it anyway.</p>\n\n<p>So is it worth it? What would be the payoff? As far as I can tell, nobody knows. So I decided to try it. For at least a few weeks, I decided to go hard and see what happens.</p>\n\n<h2 id=\"the-rules\">The rules</h2>\n\n<p>I alternated between “control” periods and two-week “diet” periods. During the <strong>control periods</strong>, I ate whatever I wanted.</p>\n\n<p>During the <strong>diet periods</strong> I ate the “most unprocessed” diet I could imagine sticking to long-term. To draw a clear line, I decided that I could eat whatever I want, but it had to <em>start</em> as single ingredients. To emphasize, if something had a list of ingredients and there was more than one item, it was prohibited. In addition, I decided to ban flour, sugar, juice, white rice, rolled oats (steel-cut oats allowed) and dairy (except plain yogurt).</p>\n\n<p>Yes, in principle, I was allowed to buy wheat and mill my own flour. But I didn’t.</p>\n\n<p>I made no effort to control portions at any time. For reasons unrelated to this experiment, I also did not consume meat, eggs, or alcohol.</p>\n\n<h2 id=\"impressions\">Impressions</h2>\n\n<p>This diet was hard. In theory, I could eat almost anything. But after two weeks on the diet, I started to have bizarre reactions when I saw someone eating bread. It went beyond envy to something bordering on contempt. <em>Who are you to eat bread? Why do you deserve that?</em></p>\n\n<p>I guess you can interpret that as evidence in favor of the diet (bread is addictive) or against it (life sucks without bread).</p>\n\n<p>The struggle was starches. For breakfast, I’d usually eat fruit and steel-cut oats, which was fine. For the rest of the day, I basically replaced white rice and flour with barley, faro, potatoes, and brown basmati rice, which has the lowest <a href=\"https://en.wikipedia.org/wiki/Basmati#Glycemic_index\">GI</a> of all rice. I’d eat these and tell myself they were good. But after this experiment was over, guess how much barley I’ve eaten voluntarily?</p>\n\n<p>Aside from starches, it wasn’t bad. I had to cook a lot and I ate a lot of salads and nuts. My options were <em>very</em> limited at restaurants.</p>\n\n<p>I noticed no obvious difference in sleep, energy levels, or mood, aside from the aforementioned starch-related emotional problems.</p>\n\n<h2 id=\"results\">Results</h2>\n\n<p>I measured my blood sugar first thing in the morning using a blood glucose monitor. I abhor the sight of blood, so I decided to sample it from the back of my upper arm. Fingers get more circulation, so blood from there is more “up to date”, but I don’t think it matters much if you’ve been fasting for a few hours.</p>\n\n<p>Here are the results, along with a <a href=\"https://en.wikipedia.org/wiki/Local_regression\">fit</a>, and a <a href=\"https://en.wikipedia.org/wiki/Bootstrapping_(statistics)\">95% confidence interval</a>:</p>\n\n<p><a href=\"https://dynomight.net/img/unprocessed-food/sugar.pdf\"><img alt=\"blood sugar graph\" src=\"https://dynomight.net/img/unprocessed-food/sugar.svg\" /></a></p>\n\n<p>Each of those dots represents at least one hole in my arm. The gray regions show the two two-week periods during which I was on the unprocessed food diet.</p>\n\n<p>I measured my systolic and diastolic blood pressure twice each day, once right after waking up, and once right before going to bed.</p>\n\n<p><a href=\"https://dynomight.net/img/unprocessed-food/systolic.pdf\"><img alt=\"systolic pressure graph\" src=\"https://dynomight.net/img/unprocessed-food/systolic.svg\" /></a></p>\n\n<p><a href=\"https://dynomight.net/img/unprocessed-food/diastolic.pdf\"><img alt=\"diastolic pressure graph\" src=\"https://dynomight.net/img/unprocessed-food/diastolic.svg\" /></a></p>\n\n<p>Oddly, it looks my systolic—but not diastolic—pressure was slightly higher in the evening.</p>\n\n<p>I also measured my pulse twice a day.</p>\n\n<p><a href=\"https://dynomight.net/img/unprocessed-food/pulse.pdf\"><img alt=\"pulse graph\" src=\"https://dynomight.net/img/unprocessed-food/pulse.svg\" /></a></p>\n\n<p>(<a href=\"https://dynomight.net/2021/01/25/how-to-run-without-all-the-agonizing-pain/\">Cardio</a>.) Apparently it’s common to have a higher pulse at night.</p>\n\n<p>Finally, I also measured my weight twice a day. To preserve a small measure of dignity, I guess I’ll show this as a difference from my long-term baseline.</p>\n\n<p><a href=\"https://dynomight.net/img/unprocessed-food/weight.pdf\"><img alt=\"weight graph\" src=\"https://dynomight.net/img/unprocessed-food/weight.svg\" /></a></p>\n\n<h2 id=\"thoughts\">Thoughts</h2>\n\n<p>Here’s how I score that:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Measure</th>\n      <th>Effect</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Blood sugar</td>\n      <td>Nothing</td>\n    </tr>\n    <tr>\n      <td>Systolic blood pressure</td>\n      <td>Nothing?</td>\n    </tr>\n    <tr>\n      <td>Diastolic blood pressure</td>\n      <td>Nothing?</td>\n    </tr>\n    <tr>\n      <td>Pulse</td>\n      <td>Nothing</td>\n    </tr>\n    <tr>\n      <td>Weight</td>\n      <td><em>Maybe</em> ⅔ of a kg?</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Urf.</p>\n\n<p><strong>Blood sugar.</strong> Why was there no change in blood sugar? Perhaps this shouldn’t be surprising. Hall et al.’s experiment <a href=\"https://www.cell.com/cell-metabolism/fulltext/S1550-4131(19)30248-7#:~:text=Table%203,-Fasting\">also found</a> little difference in blood glucose between the groups eating unprocessed and ultra-processed food. Later, when talking about glucose tolerance they speculate:</p>\n\n<blockquote>\n  <p>Another possible explanation is that exercise can prevent changes in insulin sensitivity and glucose tolerance during overfeeding (Walhin et al., 2013). Our subjects performed daily cycle ergometry exercise in three 20-min bouts […] It is intriguing to speculate that perhaps even this modest dose of exercise prevented any differences in glucose tolerance or insulin sensitivity between the ultra-processed and unprocessed diets.</p>\n</blockquote>\n\n<p>I also exercise on most days. On the other hand, <a href=\"https://doi.org/10.2337/dc06-0606\">Barnard et al. (2006)</a> had a group of people with diabetes follow a low-fat vegan (and thus “unprocessed”?) diet and <em>did</em> see <a href=\"https://diabetesjournals.org/care/article-pdf/29/8/1777/594017/zdc00806001777.pdf#page=4\">large reductions</a> in blood glucose (-49 mg/dl). But they only give data after 22 weeks, and my baseline levels are already lower than the mean of that group even after the diet.</p>\n\n<p><strong>Blood pressure.</strong> Why was there no change in blood pressure? I’m not sure. In the <a href=\"https://doi.org/10.1056/NEJM199704173361601\">DASH trial</a>, subjects with high blood pressure ate a diet rich in fruits and vegetables saw large decreases in blood pressure, almost all within <a href=\"https://www.nejm.org/doi/full/10.1056/NEJM199704173361601#:~:text=Figure%201,-Mean\">two weeks</a>. One possibility is that my baseline blood pressure isn’t that high. Another is that in this same trial, they got much bigger reductions by limiting fat, which I did not do.</p>\n\n<p>Another possibility is that unprocessed food just doesn’t have much impact on blood pressure. The above study from Barnard et al. only saw <a href=\"https://diabetesjournals.org/care/article-pdf/29/8/1777/594017/zdc00806001777.pdf#page=4\">small</a> decreases in blood sugar (3-5 mm Hg), even after 22 weeks.</p>\n\n<p><strong>Pulse.</strong> As far as I know, there’s zero reason to think that unprocessed food would change your pulse. I only included it because my blood pressure monitor did it automatically.</p>\n\n<p><strong>Weight.</strong> Why did I seem to lose weight in the second diet period, but not the first? Well, I think I did something stupid. A few weeks before this experiment, I started taking a small dose of creatine each day, which is well-known to cause an increase in water weight. I assumed that my creatine levels had plateaued before this experiment started, but after reading about <a href=\"https://doi.org/10.1152/jappl.1996.81.1.232\">creatine pharmacokinetics</a> I’m not so sure.</p>\n\n<p>I suspect that during the first diet period, I <em>was</em> losing dry body mass, but my creatine levels were still increasing and so that decrease in mass was masked by a similar increase in water weight. By the second diet period, my creatine levels had finally stabilized, so the decrease in dry body mass was finally visible. But there’s also a good chance that water weight has nothing to do with it and for some reason I simply didn’t have an energy deficit during the first period.</p>\n\n<h2 id=\"tldr\">TLDR</h2>\n\n<p>This experiment gives <em>good</em> evidence that switching from my already-fairly-healthy diet to an extremely non-fun “unprocessed” diet doesn’t have immediate miraculous benefits. If there is any effect on blood sugar, blood pressure, or pulse, they’re probably modest and long-term. This experiment gives <em>decent</em> evidence that the unprocessed diet causes weight loss. But I hated it, so if I wanted to lose weight, I’d use a different strategy. This experiment provides very strong evidence that I like bread.</p>"
            ],
            "link": "https://dynomight.net/unprocessed-food/",
            "publishedAt": "2025-07-10",
            "source": "Dynomight",
            "summary": "<p>The idea of “processed food” may simultaneously be the most and least controversial concept in nutrition. So I did a self-experiment alternating between periods of eating whatever and eating only “minimally processed” food, while tracking my blood sugar, blood pressure, pulse, and weight.</p> <h2 id=\"the-case-against-processing\">The case against processing</h2> <p>Carrots and barley and peanuts are “unprocessed” foods. Donuts and cola and <a href=\"https://en.wikipedia.org/wiki/Chicken-fried_steak\">country-fried steak</a> are “processed”. It seems like the latter are bad for you. But why? There are several overlapping theories:</p> <ol> <li> <p>Maybe unprocessed food contains more “good” things (nutrients, water, fiber, omega-3 fats) and less “bad” things (salt, sugar, trans fat, microplastics).</p> </li> <li> <p>Maybe processing (by grinding everything up and removing fiber, etc.) means your body has less time to extract nutrients and gets more dramatic spikes in blood sugar.</p> </li> <li> <p>Maybe capitalism has engineered processed food to be “hyperpalatable”. Cool Ranch® flavored tortilla chips sort of exploit bugs in our brains and are too rewarding for us to deal with. So we eat a lot and get fat.</p> </li> <li> <p>Maybe we feel full based on the <em>amount</em> of food we eat, rather than the number of calories. Potatoes have around 750 calories per kilogram",
            "title": "My 9-week unprocessed food self-experiment"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-07-10_4e0403d6dda0_when-in-rome/",
            "publishedAt": "2025-07-10",
            "source": "Harper Reed",
            "summary": "<p>When in Rome</p> <figure> <img alt=\"image_1.jpg\" height=\"2400\" src=\"https://harper.blog/notes/2025-07-10_4e0403d6dda0_when-in-rome/image_1.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #274"
        },
        {
            "content": [],
            "link": "https://www.ssp.sh/blog/data-engineering-toolkit-devops-iac/",
            "publishedAt": "2025-07-10",
            "source": "Simon Spati",
            "summary": "<p>Remember when data scientists spent 80% of their time wrestling with data wrangling instead of building models?</p> <p>I&rsquo;d argue that today&rsquo;s data engineers face similar challenges, but with the added complexity of infrastructure setup. We&rsquo;re architects of entire data ecosystems, orchestrating everything from real-time pipelines to AI workflows. The secret? Infrastructure as Code and DevOps principles that transform scattered server management into elegant, declarative configurations.</p> <p>The catch is that while abstractions have made complex deployments more accessible, the toolkit has exploded in scope. One day, you&rsquo;re optimizing SQL queries, the next, you&rsquo;re debugging Kubernetes deployments, and by afternoon, you&rsquo;ll be explaining data quality metrics to stakeholders who just want to know why their dashboard is empty.</p>",
            "title": "The Data Engineering Toolkit: Infrastructure, DevOps, and Beyond"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3895\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3895",
            "publishedAt": "2025-07-10",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3895\"> Read more </a> </p>",
            "title": "Hidden Open Thread 389.5"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-10"
}