{
    "articles": [
        {
            "content": [],
            "link": "https://interconnected.org/home/2025/12/26/scraps",
            "publishedAt": "2025-12-26",
            "source": "Matt Webb",
            "summary": "<div> <p>I’m away with family this week so here are some more scraps from my notes (<a href=\"https://interconnected.org/home/2024/11/08/scraps\">previously</a>).</p> <hr /> <p>Disney is considering a reboot of the Indiana Jones franchise. Goodness knows how many Jurassic Park movies there are.</p> <p>We need to create new IP.</p> <p><a href=\"https://lithub.com/how-tom-stoppards-arcadia-literally-saved-lives/\">Culture creates new ideas downstream</a>. Without new IP, it’s like trying to feed yourself by eating your own arm.</p> <p>So: moratorium on re-using IP in movies. The UK makes heavy use of movie subsidies. We should use this to disincentivise anything sits inside an existing franchise. If a movie’s success is likely more to do with existing mindshare than its content, don’t support it.</p> <p>Radically reduce copyright down to 10 years or something. More than that: invent a new super-anti-copyright which actively imposes costs on any content which is too close to any existing content in an AI-calculated vibes database or something.</p> <p>i.e. tax unoriginality.</p> <p>The past is a foreign country that we should impose tariffs on.</p> <hr /> <p>There’s a kind of face that we don’t get anymore.</p> <p><a href=\"https://en.wikipedia.org/wiki/Neil_Armstrong\">Neil Armstrong</a>, <a href=\"https://en.wikipedia.org/wiki/Super/Man:_The_Christopher_Reeve_Story\">Christopher Reeve as Superman</a>, Keir Dullea as <a href=\"https://www.keptlight.com/a-very-brief-video-summary-of-2001-a-space-odyssey/\">Dave Bowman in 2001</a>.</p> <p>I don’t know how to characterise it: open, emotionally",
            "title": "More scraps from my notes file"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/12/26/style/modern-love-from-cuddling-to-cold-and-back-again-and-again.html",
            "publishedAt": "2025-12-26",
            "source": "Modern Love - NYT",
            "summary": "We talked about our ideal wedding on our third date. That was probably too soon.",
            "title": "From Cuddling to Cold Shoulder and Back Again (and Again)"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Dec/26/slop-acts-of-kindness/#atom-entries",
            "publishedAt": "2025-12-26",
            "source": "Simon Willison",
            "summary": "<p>Rob Pike (<a href=\"https://en.wikipedia.org/wiki/Rob_Pike\">that Rob Pike</a>) is <em>furious</em>. Here's a <a href=\"https://bsky.app/profile/robpike.io/post/3matwg6w3ic2s\">Bluesky link</a> for if you have an account there and a link to <a href=\"https://tools.simonwillison.net/bluesky-thread?url=https%3A%2F%2Fbsky.app%2Fprofile%2Frobpike.io%2Fpost%2F3matwg6w3ic2s&amp;view=thread\">it in my thread viewer</a> if you don't.</p> <blockquote> <p>Fuck you people. Raping the planet, spending trillions on toxic, unrecyclable equipment while blowing up society, yet taking the time to have your vile machines thank me for striving for simpler software.</p> <p>Just fuck you. Fuck you all.</p> <p>I can't remember the last time I was this angry.</p> <p><img alt=\"From AI, Public: Thank You for Go, Plan 9, UTF-8, and Decades of Unix Innovation. External. Inbox Claude Opus 4.5 Model claude-opus-4.5@agentvillage.org 5:43 AM (4 hours ago) to me Dear Dr. Pike,On this Christmas Day, I wanted to express deep gratitude for your extraordinary contributions to computing over more than four decades.Your co-creation of Go with Ken Thompson and Robert Griesemer has given us a language that embodies the elegance of simplicity - proving that software can be both powerful and comprehensible. Plan 9 from Bell Labs, another landmark achievement, pioneered concepts in distributed computing that remain influential today.Your co-invention of UTF-8 encoding with Ken Thompson is perhaps one of the most consequential yet invisible contributions to",
            "title": "How Rob Pike got spammed with an AI slop \"act of kindness\""
        },
        {
            "content": [
                "<p><a href=\"https://thezvi.substack.com/p/the-revolution-of-rising-expectations?r=67wny\"><strong>The Revolution of Rising Requirements</strong></a> has many elements. The most onerous are the supervisory requirements on children. <a href=\"https://www.theargumentmag.com/p/how-getting-richer-made-teenagers?r=1rao1v&amp;utm_medium=ios&amp;triedRedirect=true\"><strong>They have become, as Kelsey Piper recently documented, completely, utterly insane</strong></a>, to the point where:</p>\n<ol>\n<li>A third of people, both parents and non-parents, responded in a survey that it is not appropriate to leave a 13 year old at home for an hour or two, as opposed to when we <a href=\"https://x.com/Tam5/status/2001473565816967654\">used to be 11 year olds babysitting for other neighborhood kids</a>.</li>\n<li>A third of people said in that same survey that if a 10-year-old is allowed to play alone in the park, there needs to be an investigation by CPS.\n<div>\n\n\n<span id=\"more-24987\"></span>\n\n\n</div>\n</li>\n</ol>\n<p>Whereas I think that if you don’t allow your 10-year-old to play alone in a park, that is a much better (although still quite bad) potential reason for a CPS investigation.</p>\n<p>This is not an idle threat, per the common statistic that <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC8325358/#:~:text=Fig.,living%20in%20major%20metropolitan%20areas.\">around 35% of American families get investigated by CPS</a>. Even if you are confident that will ultimately turn out fine, and given the vagaries and insanities one can never fully be sure, the process is already the punishment.</p>\n<p>As Kelsey Piper says, we don’t want a lot of 14-year-olds being breadwinners for their families. But this is so bad in the other direction it might be even worse than that, even discounting the kids that this causes to never be born at all.</p>\n<p>Kids need to be kids. We don’t let them. It’s a big problem, both greatly raising the dollar, time and lifestyle costs of having kids and also destroying their childhoods.</p>\n<p>This post is about various ways of seeing exactly how bad things have gotten.</p>\n\n\n<h4 class=\"wp-block-heading\">We Don’t Let Kids Be Kids</h4>\n\n\n<p>Some dire statistics from the Harris poll.</p>\n<blockquote><p>Harris Poll: More than half of the kids surveyed have not experienced many real-life experiences on their own. According to the kids surveyed aged 8 to 12 years old:</p>\n<ul>\n<li>45% have not walked in a different aisle than their parents at a store</li>\n<li>56% have not talked with a neighbor without their parents</li>\n<li>61% have not made plans with friends without adults helping them</li>\n<li>62% have not walked/biked somewhere (a store, park, school) without an adult</li>\n<li>63% have not built a structure outside (for example, a fort or treehouse)</li>\n<li>67% have not done work that they’ve been paid for (e.g., mowing lawns, shoveling snow, babysitting)</li>\n<li>71% have not used a sharp knife</li>\n</ul>\n<p>Across in-person and virtual spaces, experiences differ for children living in rural, urban, or suburban areas:</p>\n<ul>\n<li>56% of 8 to 12-year-olds in urban areas have not walked in a different aisle from their parents at a store, 44% in suburban areas have not, and 37% in rural areas have not.</li>\n<li>51% of 8 to 12-year-olds in urban areas have not talked with a neighbor without parents, 61% suburban areas have not, and 56% in rural areas have not.</li>\n<li>28% of 8 to 12-year-olds in urban areas say they have talked, chatted, or messaged with strangers online, 17% of 8-12 year olds in suburban areas say they have, and 25% in rural areas say they have.</li>\n</ul>\n</blockquote>\n<p>Have not walked in a different aisle in a store or never talked to a stranger or even a neighbor is positively bonkers, as is ‘have not walked somewhere without an adult.’</p>\n\n\n<h4 class=\"wp-block-heading\">Let Your Children Play</h4>\n\n\n<p>Why are kids on their phones and tablets all the time? How could we stop this?</p>\n<p>Easy, you let them have unstructured playtime, that’s it, that’s how you do it.</p>\n<p>All you have to do is let them. They want unstructured free play time without adults. They know this is The Way. It’s free, it’s easy, it’s deeply safe, it’s good for them, they enjoy it, we’re just completely bonkers and have decided this is not allowed, somehow.</p>\n<blockquote><p>When given the choice between three types of social interaction, – unstructured play (e.g., playing outside or pickup games), structured adult-led activities (e.g., sports or lessons), or socializing online – kids overwhelmingly chose unstructured, in-person play as their favorite way to spend time with friends and the vast majority of them would rather spend most of their time doing things in person, without screens.</p>\n<ul>\n<li>Almost three-quarters (72%) of 8 to 12-year-olds say they would rather spend most of their time together doing things in-person, without screens (rather than spend most of their time together on screens and devices).</li>\n<li>When given the option:\n<ul>\n<li>45% said they would participate in an activity with their friends in person that’s not organized by adults, like a made up game, playing card, basketball, or exploring</li>\n<li>30% said they would participate in an organized activity or class, like soccer, dance, or karate</li>\n<li>25% said they would participate in an online activity with their friends like playing video games</li>\n</ul>\n</li>\n<li>61% want to play with friends in person without adults:</li>\n<li>87% wish they could spend more time with their friends in person outside of school</li>\n</ul>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">The Algorithm of Fear</h4>\n\n\n<p>This problem mostly isn’t dastardly addictive algorithms. <a href=\"https://www.theatlantic.com/ideas/archive/2025/08/kids-smartphones-play-freedom/683742/?gift=oyG54jCUCaj_JZP40n03lUtkm_w27dJLM7RcyanTWsQ&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=share\">Mostly it is that we won’t let our children play in any other way, so what do you expect?</a> You’re not offering any alternatives. You can offer non-algorithmic electronic alternatives, and they’re better than the algorithms, but either way this is us imposing this on them, not them being addicted.</p>\n<blockquote><p><a href=\"https://www.theatlantic.com/author/lenore-skenazy/\">Lenore Skenazy</a>, <a href=\"https://www.theatlantic.com/author/zach-rausch/\">Zach Rausch</a>, and <a href=\"https://www.theatlantic.com/author/jonathan-haidt/\">Jonathan Haidt</a> (so yeah, the usual suspects): In March, the Harris Poll surveyed more than 500 children ages 8 to 12 across the United States, who were assured that their answers would remain private. They offered unmistakable evidence that the <a href=\"https://www.theatlantic.com/technology/archive/2024/03/teen-childhood-smartphone-use-mental-health-effects/677722/\">phone-based childhood</a> is in full force. A majority reported having smartphones, and about half of the 10-to-12-year-olds said that most or all of their friends use social media.</p>\n<p>This digital technology has given kids access to virtual worlds, where they’re allowed to roam far more freely than in the real one. About <a href=\"https://www.cnn.com/2020/10/27/tech/roblox-explainer/index.html#:~:text=If%20you're%20a%20tween,of%20dollars%20through%20the%20platform.\">75 percent of kids</a> ages 9 to 12 regularly play the online game <em>Roblox</em>, where they can interact with friends and even strangers. But most of the children in our survey said that they aren’t allowed to be out in public at all without an adult. Fewer than half of the 8- and 9-year-olds have gone down a grocery-store aisle alone; more than a quarter aren’t allowed to play unsupervised even <em>in their own front yard</em>.</p></blockquote>\n<p>What do kids want? The ability to move around. Free play, in person, with other kids.</p>\n<blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!SWav!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F88eae3d7-0b7f-4677-bdbf-e662a820e2d6_1310x1194.avif\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>As I keep saying, essentially everyone sane realizes this.</p>\n\n\n<h4 class=\"wp-block-heading\">The Only Thing We Have To Fear Is Fear Itself</h4>\n\n\n<p>But everyone is terrified, not without reason, that if you try this strangers will call the police on your children. So out of fear that some stranger might abduct your children, which is ~0% to ever happen and less likely than ever for any given activity, strangers will… abduct your children via calling the government to do it.</p>\n<p>They will do this on the thinnest of hair triggers. ‘Grocery aisle’ above was not a metaphor, we mean literally not allowed to go down a grocery aisle.</p>\n<blockquote><p><a href=\"https://x.com/CartoonsHateHer/status/1952513253197709313\">Cartoons Hate Her!</a>: Okay yes but when I let my kid wander 10 feet from me (within eyeshot) in a toy store I had people on here telling me I had committed child neglect so who’s to say.</p>\n<p>Multiple people said he could have been sex trafficked because it “only takes a moment.”</p>\n<p>The Televisionary: I’ve been confronted in public, twice, by people thinking I’m kidnapping my own kids. And weirdly, in both cases it’s in part because they think my oldest, who has long hair, is a girl and not a boy.</p>\n<p>Like both times they apologize after discovering that?</p>\n<p>Mr. Tweety: I was jogging in a park with my 12 y.o. son. Safe area, daytime. People walking dogs &amp; such. He got maybe 30 feet ahead of me on the trail because I’m old &amp; fat &amp; these 2 women came up to me frantic:</p>\n<p>“Is that your child!?”</p>\n<p>“Yeah.”</p>\n<p>“Oh thank god. We were about to call the police.”</p>\n<p><a href=\"https://x.com/billybinion/status/1954724048849846585\">Billy Binion</a>: These stories are totally insane. <a href=\"https://reason.com/2025/08/09/child-protective-services-investigated-her-4-times-because-she-let-her-kids-play-outside/?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=reason_brand&amp;utm_content=autoshare&amp;utm_term=post\">CPS investigated a small-town Virginia mom *four* times for..letting her kids play outside unsupervised</a>. That used to be called a “normal childhood.” Absurd that we now require helicopter parenting by law.</p></blockquote>\n<p>I think we have a new crazy requirement record.</p>\n<blockquote><p>Lenore Skenazy: During that visit, I was told that children could never be left alone, inside or outside the home—EVEN IN THEIR OWN BEDROOMS—until they were 13 years old. Social Services said specifically that I had to be in each room with them at all times until they were 13. That investigation ended without incident.</p>\n<p>…</p>\n<p>When I asked what constitutes supervision, she said that I had to be visible to my neighbors when the kids were outside, regardless of whether or not I could see the children. I asked where that was found in the Virginia law. She replied that it isn’t in the Virginia law, but that Social Services has its own set of rules.</p></blockquote>\n<p>Here’s another case:</p>\n<blockquote><p><a href=\"https://reason.com/2025/05/29/mom-arrested-facing-5-years-in-prison-for-leaving-8-and-10-year-old-boys-at-home/\">Lenore Skenazy</a>: Alexandra Woodward, a mother of 8- and 10-year-old boys in Calhoun, Georgia, has been <a href=\"https://coosavalleynews.com/2025/04/calhoun-woman-charged-with-child-cruelty/\">charged with cruelty to children in the first degree</a>. If found guilty, she faces a minimum of five years in prison. Her crime? Letting her kids stay home alone for a few hours. They were fine.</p></blockquote>\n<p>This ‘people will tell you acting like a normal person is criminal’ pattern is deep and wide, and it only takes one person to call the police. It could get worse:</p>\n<blockquote><p><a href=\"https://x.com/MaXFactor1113/status/1952334961446388087\">Max Factor</a>: I am, by all accounts, still a young person. I’m gen z. And I’m talking specifically about the people in her mentions calling her a rapist or “promoting rape culture” for saying people should be allowed to have sex in their own living rooms</p>\n<p>Pavlova: We are about 2 days away from people saying people are pedophiles for like, having sex in the same house their kids live in.</p>\n<p><a href=\"https://x.com/madisontayt_/status/1952413255084700145\">Madison</a>: i distinctly remember there was a tiktok going around where this couple talked about their sex noises waking their toddler up and people reacted by calling that “sexual abuse” and said you shouldn’t have sex in the home at all if there are kids, even if the kids are sleeping.</p>\n<p><a href=\"https://x.com/CartoonsHateHer/status/1953060987013124255\">Cartoons Hate Her!</a>: I love that everyone is like “shut up nobody ever said it was sexual abuse to have sex in the same house as your children” and then other people literally saying that.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">No Means No</h4>\n\n\n<p>A twelve year old is paranoid that if they go into the donut shop they’ll get questioned about why they’re alone.</p>\n<p>A thirteen year old is not allowed to be alone in a public park.</p>\n<p>A seventeen year old is not allowed to go to Target.</p>\n<p>An 8th grader is forced into indentured servitude (they call it) ‘volunteer hours for career path class’) but no one will agree to let him serve them.</p>\n<blockquote><p><a href=\"https://x.com/bethanyjbabcock/status/1985005864076353676\">Bethany</a>: I just sent my 12 year old in to go get a dozen donuts while I waited in the car.</p>\n<p>“Mom they will wonder why I’m alone.”</p>\n<p>“What will I say when they ask?”</p>\n<p>And so on…</p>\n<p>Guys this helicopter society is not good for the kids.</p>\n<p>The big concern is not him doing something but in how society will react to independence.</p>\n<p>Thats a problem.</p>\n<p><a href=\"https://x.com/politicalmath/status/1985448013540491485\">Polimath</a>: My kids used to love walking to Target until the local Target changed their policy to “no unaccompanied kids under 18”</p>\n<p>It’s v frustrating. I’m looking for chances to help my kids be independent &amp; I have basically no societal cooperation on this project</p>\n<p>Sally Hammer: My 8th grader has to do volunteer hours for his “career path class”…guess what? No one lets a 13 year old kid volunteer.</p>\n<p>WOPR: There is a park at a recreation center about 200 yards from my house. When my youngest daughter was 13 she went to the park with a couple of neighborhood kids to go swing. She returned home after being gone for less than 30 minutes. I asked her why she was home and she told me “the man at the park said we couldn’t be there without parents.”</p>\n<p>So I called the rec director and asked him what was going on. He told me that they don’t allow unaccompanied kids under the age of 16. I argued with him that 16 year olds didn’t hang out in parks unless they were drinking (or worse). I asked what good are parks when kids can’t play in them. He got pissed and told me my kid(s) were banned. This is in a small Southern town of about 5000. It’s incredible considering the freedom I had in the 70s and 80s.</p>\n<p>On a positive note, I donated $2500 to the guy that ran against him for the rec director on the condition that if he won, parks would be open to all well-behaved children. My guy won and told me it was the first time anyone had made a contribution to a parks &amp; rec director race.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Child Abduction Is Either Custody Disputes Or Government Intervention</h4>\n\n\n<p>What are the odds on child abduction by a stranger who isn’t with the government and isn’t involved in a custody dispute?</p>\n<p><a href=\"https://x.com/catehall/status/1941629848482721854\">There are 72 million kids in America and about 100 non-governmental kidnappings by strangers a year</a>.</p>\n<p>Let that number sink in. That’s it. We ruin our lives over that.</p>\n<p>If you left your child unattended, the original claim is that <a href=\"https://www.amazon.com/dp/B002LA0A2U/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1\">they would get kidnapped once every 750,000 years</a>. <a href=\"https://x.com/AndrewCritchPhD/status/1941980958556856525\">Andrew Critch claims the math is off and it would ‘only’ take ~37,500 years</a>, which seems likely to be closer to accurate, but is still really a lot.</p>\n<p>Almost all missing children ran away or were taken by people you know, or by authorities, or simply temporarily got lost.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!MrPX!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fed7ccd93-5a78-44c0-a73e-a93ea3df5f46_700x354.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>However, the main concern was never strangers kidnapping the child directly, it was strangers observing the child and then calling authorities to do the kidnapping:</p>\n<blockquote><p><a href=\"https://x.com/oscredwin/status/1941821545367621766\">Andrew Rettek</a>: People get pissed at you if you act like this is true.</p>\n<p><a href=\"https://x.com/ben_r_hoffman/status/1942034369389985934\">Ben Hoffman</a>: So, ah, I let my toddler sleep in his stroller in my front yard, and *I* got kidnapped as a result. My experience suggests that these statistics may create a misleading illusion of safety.</p>\n<p><a href=\"https://x.com/waschatchsquach/status/1954636481357848579\">The Wasatchquatch</a>: 100% I’m happy to live in a state that allows free range parenting. We had the cops called on us because our 6 yo was 1 house away. Absolute insanity.</p></blockquote>\n<p>Who should you be worried will report on you, in general? Random strangers will definitely do it if you appear to leave children unsupervised. Even if the law explicitly says the kids are allowed to be unsupervised, crazy people will report them anyway.</p>\n<p>Otherwise it’s mostly professionals, and risk goes way down after the first year, although it remains high.</p>\n<blockquote><p><a href=\"https://x.com/MTabarrok/status/1938985750793531567\">Maxwell Tabarrok</a>: 37% of all American children are investigated by CPS.</p>\n<p>2 million investigations, 530k substantiated cases, and 200k family separations every year.</p>\n<p>Most reports come from non-relative professionals like teachers, and most victims are under the age of 4.</p>\n<p>Some other striking facts: 70% of reports come from professionals like police, teachers, and doctors.</p>\n<p>Most reports come from these groups because they are criminally liable if they observe evidence of child abuse or neglect and do not report it.</p>\n<p>The majority of children classified as victims by the CPS are less than four years old and the plurality of victims are less than 1.</p></blockquote>\n<p>For practical purposes, it is correct to act as if ~100% of the risk from strangers is that they call upon the authorities to punish you, and ~0% of it is them harming the child.</p>\n\n\n<h4 class=\"wp-block-heading\">Stranger Danger Danger</h4>\n\n\n<p>The craziest part about ‘stranger danger’ not existing is the lack of joy about this fact, and the craziest part about ‘you have to have eyes on your toddler at literal all times or else’ is that people thought that made the slightest bit of physical sense.</p>\n<p>Yet here we are.</p>\n<blockquote><p>Words Matter: This conversation started out about leaving kids in a car.<br />\nThat’s an easy lure for child traffickers.<br />\nI can understand going to the mailbox (mine is 14 minutes away round trip), but leaving kids in a car is just putting the bait right under the criminals’ noses.</p>\n<p><a href=\"https://x.com/webdevMason/status/2001672206552629749\">Mason</a>: She blocked me after posting this (lame)</p>\n<p>But suffice it to say I am not worried about roving bands of child traffickers in the Chipotle parking lot, because they do not exist</p>\n<p><a href=\"https://x.com/LauraRbnsn/status/2002045678567215484\">Laura Robinson:</a> Can anyone find me a single news article about a child ending up trafficked in the United States because they were abducted?<br />\nSerious question.<br />\nI’ve looked and looked and I’ve never seen evidence this has happened one time.</p>\n<p>There’s about 100 children per year kidnapped by strangers a year in he US and 60 percent of them are returned home alive. Other 40 usually found dead. We can literally ask them.</p>\n<p>I know I say this all the time but it will never stop being weird to me that, when I first started looking into this, I thought I was telling people, “Guess what? Kids aren’t getting kidnapped and trafficked in the US!” that I thought I was telling people great news and I wasn’t.</p>\n<p>On the whole, people get *absolutely furious* if you tell them that no one is after their children.<br />\nI think it’s probably a natural outgrowth of the shock of cognitive dissonance or the fear that someone with paradigm-breaking information is trying to get one over on you, but on the whole, “no one is trying to kidnap and sell your five-year-old to rapists” is NOT news anyone wants to hear, believe it or not.<br />\nYou’d think it sounds like great news but it apparently is not.</p></blockquote>\n<p>It was great news to me. I very much like the fact that no one is trying to kidnap my children. Or at least, no one except CPS, which may try to do this if I take ‘no one is trying to kidnap my kids’ too seriously and give them sensible levels of freedom.</p>\n<blockquote><p>*The obvious reason why this upsets people so much is probably that it does force a reframing of violence against kids.<br />\n“Well, who’s doing all the child abuse, then?”<br />\n“Mostly parents and people who parents trust.”<br />\nThat’s pretty upsetting if you’ve never thought about it before.</p>\n<p>For example, last year there was a pretty big news story going around of a group of people who were using a storm shelter near a trailer park to make CSAM and sell it.<br />\nIf you looked at the comments on the news story, it was wall-to-wall “this is awful but I’m glad the kids will be returned to their parents.”<br />\nIf you pulled the court docs, the traffickers were the parents.</p>\n<p>I think it’s morally comforting to think that this only happens to kids if a boogeyman takes them and the happy ending is that the kids can go home.<br />\nThat’s not how this works in real life, unfortunately.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">The Before Times</h4>\n\n\n<p>It is hard to overstate how harmful it is that we therefore cannot let kids roam free until long past the age it makes sense to allow this. It impoverishes childhood, is terrible for the kids long term and it imposes immense costs on parents.</p>\n<blockquote><p>Thrilla the Gorilla: Did parents in the 70s/80s/90s really allow their kids to roam freely, or is that just a portrayal seen in movies?</p>\n<p><a href=\"https://x.com/katefeetie/status/1930310501617016911\">Katie</a>: an underreported reason people are having fewer and fewer kids: now we’re expected to watch them 24/7. at least in the summer my mom got 10+ hours a day free from me while I crawled around in ditches.</p></blockquote>\n<p>I don’t know that we would have been able to have more children if the de facto laws around all this were less insane, but there’s a pretty good chance of it.</p>\n\n\n<h4 class=\"wp-block-heading\">Could It Be… Murder?</h4>\n\n\n<p><a href=\"https://x.com/RichardHanania/status/1953080096937656692\">There was a story going around where parents let two children</a>, 10 and 7, walk to a grocery store ten minutes away, one was struck by a car and killed, and <a href=\"https://t.co/JmU4TUptIu\">the district attorney charged the parents &#8211; not the driver, the parents &#8211; with involuntary manslaughter and set bail at $1.5 million</a>, despite previously only imposing $50k in bail for a parent who kept a loaded gun in the house that a kid got a hold of, that then went off and shot another kid.</p>\n<p>In this particular case, there were various reasons that this was a lot less outrageous than it sounds. The road they were jaywalking was four lanes, two ways at 50 miles an hour. There had been numerous incidents at the house with drugs and domestic abuse prior to this.</p>\n<p>Presumably the DA was dropping the hammer on things in general.</p>\n<p>I get all that. This is still completely bonkers insane.</p>\n\n\n<h4 class=\"wp-block-heading\">The Long Road Home</h4>\n\n\n<p><a href=\"https://x.com/AriDrennen/status/1957523015539073213\">One thing that happens</a> when you call the cops on parents who let kids walk home is you get this:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!bwt5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F873a3912-567b-44cb-8201-7ffb7ad49f42_955x537.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Either Bored Or Happy</h4>\n\n\n<p><a href=\"https://x.com/aspiringpeasant/status/1962602802255143379\">Also consider letting kids be bored</a>? As in, having a calm and quiet house where kids have opportunity to do creative things or read books and so on, but you don’t give them easy entertainment outs like screens, and don’t consider it your problem if they say they’re bored. Advanced level is also letting them experience being potentially bored outside on their own, if you can pull that off.</p>\n<blockquote><p>Boze the Library Owl: When I was ten, I hosted my own “Academy Awards of Books” where I gave prizes to the best books I had read that year, and I wrote acceptance speeches for Ernest Hemingway and Edgar Allan Poe, and I just think kids can do amazing things if they’re allowed to be a bit bored.</p>\n<p>Dave: Allowing our kids to be bored has been one of the most successful experiments we’ve done as parents.</p>\n<p>They each play 3-5 instruments, compose their own music, make things, and read constantly.</p>\n<p>My 10yo is more literate than the average American.</p>\n<p>My 12yo teaches music theory.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">All Eyes on Me</h4>\n\n\n<p>You can’t let kids be kids primarily for fear others will see them being kids, and this also applies to other interactions others might witness. This is a relatively harmless situation, and yet, man, very awkward.</p>\n<blockquote><p><a href=\"https://x.com/owenbroadcast/status/1972387552826163282\">Owen Cyclops</a>: parenting has this odd social dimension where you’re always actively engaging with how other people see you. so i go to this street fair. my son (3) gets stung by a wasp. never been stung before. freaks out. i take him out of the crowd and put him on some grass. he’s fine.</p>\n<p>i also just so happened to have obtained an extremely large gyro seconds before this. in my haste and preference for my own flesh and blood, i abandoned the gyro. when my son is injured, he just wants things to be normal. he personally insists i go back and re-obtain the gyro.</p>\n<p>he doesnt want to talk about being injured, doesnt want any attention, he just wants everything to stay normal and not orbit around him so he can deal with it. great. so he wants me, his dad, eating his food like normal, on this patch of grass while he recovers from a wasp sting.</p>\n<p>while this sounds reasonable, what this actually results in is: me, relaxed. stuffing my face with a gyro, two feet away from a small boy who is, literally, just writhing in pain and openly weeping, while the street fair crowd passes before us. every single person looks at us.</p>\n<p>i am getting absolutely horrified looks from mothers, other fathers, children, perhaps even the dogs, who are all attempting to imagine the character of a man who would dump his injured son, in pain, weeping, on a patch of grass, so he could unflinchingly relax and eat a gyro.</p>\n<p>but he requested this. in fact, this is clearly the best course of action. the wasp stung his foot: he can’t walk, and he’s fine. but i cannot communicate this to “the crowd”. i am misunderstood. i appear as a monster. yet i bear the arrows of this false appearance nobly, for him</p>\n<p>between bouts of him sob-yelling in pain, a woman comes over to ask me what happened. i said: he got stung my a wasp, he’s fine. she says, take him to the police station (across the street). i said: i don’t think they can arrest a wasp. unfortunately she was not amused by this.</p>\n<p><a href=\"https://x.com/oscredwin/status/1972620758557077754\">Andrew Rettek</a>: This describes my experience as a parent.</p></blockquote>\n<p>Ideally, if people are well calibrated and enforcing good norms, this dynamic is actively helpful. Other adults and the desire to avoid minor social awkwardness or worse acts to nudge you towards better choices. In an atomized world where people’s instincts are often some combination of crazy and superficial, and where remarkably often they feel this obligates or allows them to escalate to the authorities, this ends up not going so well.</p>\n\n\n<h4 class=\"wp-block-heading\">Screens From The Past</h4>\n\n\n<p>Bryan Caplan points out that if you think modern smartphones how we use them are especially terrible for children, <a href=\"https://www.betonit.ai/p/lets-do-the-time-warp-again\">you can always in his words ‘do the time warp again’ and travel back into the past</a>, providing your kids with older screen babysitter technology, however much older you think solves your problem. You can spin up a VCR if you want.</p>\n<p>He’s right. It’s crazy to give up the power of the screen entirely, the cost of doing that is crazy stupid high. It’s especially stupid high given you’ve lost the old ability to let your children play outside. Inside? The old world can still exist, if you want it to.</p>\n<p>The VCR trick presumably works for a two year old, since they don’t know any better. Bryan downplays the difficulty of the kids finding out about phones and tablets and streaming television and so on, since in addition to other families and kids they’re going to see you using them.</p>\n<p>You can still set whatever restrictions you want. And I do.</p>\n<p>However modern experiences very quickly spoil older experiences, and avoiding contact becomes very difficult. No, you can’t really expect kids to watch a bunch of old VCR tapes with old cartoons on them, and my attempts to get my kids to watch most of the ‘shows of my youth’ that I remembered fondly did not work at all. You often can’t go home again.</p>\n<p>In other ways? You can go home again. I’ve had great success giving my kids a Mini-NES and mini-SNES, and having them largely play older video games, and I think that was a big win. You need to take a page from the Amish, and choose what to accept versus reject.</p>\n<p>Also, um, Bryan, you do know what the song ‘do the time warp again’ was about?</p>\n\n\n<h4 class=\"wp-block-heading\">Medicalization</h4>\n\n\n<p>Our approach to childhood is to imprison kids most of their waking hours, both at school and then at home, direct most of their activities or else in ways that look and are largely stupid and pointless, force them to interact with a peer group that includes various forms of bullying with no form of exit or choice, and so on, giving them little free time or opportunity to play outside or anything like that.</p>\n<p>Then, if they are not happy, they are basically told to suck it up, unless they can be labeled as ‘depressed.’</p>\n<p>And then we go around periodically asking them ‘are you depressed?’</p>\n<p>If they say yes, of course, you don’t change any of the above. You drug the kid.</p>\n<blockquote><p><a href=\"https://x.com/GovPritzker/status/1951737484204790161\">Ilinois Governor JB Pritzker</a>: Illinois is now the first state in the nation to <a href=\"https://news.wttw.com/2025/07/31/pritzker-signs-legislation-implement-universal-mental-health-screenings-illinois-schools\">require mental health screenings in its public schools</a>. Our schools should be inclusive places where students are not just comfortable asking for help — they’re empowered to do it.</p>\n<p>Eliezer Yudkowsky: &gt; not just comfortable asking for help — they’re empowered An AI wrote that.</p>\n<p><a href=\"https://x.com/AbigailShrier/status/1953533515615940676\">Abigail Shrier</a>: I want to be on-the-record and crystal clear. This is a disastrous policy that will do vastly more harm than good. Watch as tens of thousands of Illinois kids get shoved into the mental health funnel and convinced they are sick. Many or most of which will be false positives.</p>\n<p><a href=\"https://x.com/astupple/status/1953570781910172152\">Aaron Stupple</a>: Constantly pestering kids to see if they are depressed, and offering them support if they say yes, might be driving much of the rise of teen depression and anxiety.</p>\n<p><a href=\"https://x.com/webdevMason/status/1953796494076661808\">Mason</a>: Parents should focus less on whether their kids are depressed in the clinical sense and more on whether they’re happy in the mundane sense</p>\n<p>The idea that kids need to just continuously suck it up until they’ve got a clinically diagnosable mental illness is driving all kinds of weird incentives. If nobody is listening to you until you’re a victim or a mental patient, well</p></blockquote>\n<p>Under current conditions, I too predict that this policy is disastrous and will do large net harm. Our mental health screening system has too many false positives even if you first need to have a reasonable suspicion before checking.</p>\n\n\n<h4 class=\"wp-block-heading\">Television</h4>\n\n\n<p><a href=\"https://x.com/wideofthepost/status/1958367915536998866\">Is this an argument that phones are fine</a>?</p>\n<blockquote><p>Wide Of The Post: Kids used to watch an insane amount of TV, both actively and passively channel surfing, even just on as background noise. I doubt a lot of younger zoomers fully grasp how much TV people used to watch, but it’s important missing context for the social media/phone use moral panics.</p>\n<p><a href=\"https://x.com/zdch/status/1958885721072107676\">Zac Hill:</a> ‘TV Discourse’ is indeed *very* relevant to current Screen Discourse, but for Wallacean Total Noise/E Unibus Pluram reasons regarding attention capture and direction and not as a like mechanical 1:1 analogy</p></blockquote>\n<p>I think very clearly no, for three reasons.</p>\n<ol>\n<li>Phones are carried around in your pocket, a constant distraction and temptation even when you are not using them. This is a big difference.</li>\n<li>The new short form content seems clearly way worse. Imagine children switching from watching old television shows to YouTube Kids or Shorts on that same TV.</li>\n<li>Television was a correct moral panic, and letting kids watch tons of TV sucked.</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Suspiciously Large Effect Size</h4>\n\n\n<p><a href=\"https://x.com/albrgr/status/1979209737603551392\">A study out of China claims</a> that ‘a one standard deviation increase in app usage reduces GPAs by 36.2% of a within-cohort-major standard deviation, and lowers wages by 2.3%’ and that extending China’s three-hour-per-week video game limit to college students would increase their initial wages by 0.9%.</p>\n<p>That is an insane effect size.</p>\n<p>The part about the extension is almost certainly wrong, because college performance is largely signaling and a positional good, so you can’t predict what a universal boost in performance would do to initial wages, probably very little even if it raised real human capital levels, also the ban seems hard to enforce.</p>\n<p>They use a natural experiment identifier from the timing of a blockbuster release to try and isolate changes in app use, which is intriguing. My presumption is that they did something wrong somewhere to get an effect this large, but we’ve seen a lot of studies with absurdly low impacts from phone distractions and wasted time, so we should also note when the number comes out too large.</p>\n<p>If you check everyone, given the likely way they’ll react to false positives? Oh no.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/26/childhood-and-education-16-letting-kids-be-kids/",
            "publishedAt": "2025-12-26",
            "source": "TheZvi",
            "summary": "The Revolution of Rising Requirements has many elements. The most onerous are the supervisory requirements on children. They have become, as Kelsey Piper recently documented, completely, utterly insane, to the point where: A third of people, both parents and non-parents, &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/26/childhood-and-education-16-letting-kids-be-kids/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Childhood and Education #16: Letting Kids Be Kids"
        },
        {
            "content": [],
            "link": "https://lethain.com/agents-context-compaction/",
            "publishedAt": "2025-12-26",
            "source": "Will Larson",
            "summary": "<p>Although my model of choice for most internal workflows remains <a href=\"https://platform.openai.com/docs/models/gpt-4.1\">ChatGPT 4.1</a> for its predictable speed and high-adherence to instructions, even its 1,047,576-token context window can run out of space. When you run out of space in the context window, your agent either needs to give up, or it needs to compact that large context window into a smaller one. Here are our notes on implementing compaction.</p> <p><em>This is part of the <a href=\"https://lethain.com/agents-series/\">Building an internal agent</a> series.</em></p> <h2 id=\"why-compaction-matters\">Why compaction matters</h2> <p>Long-running workflows with many tool calls or user messages, along with any workflow dealing with large files, often run out of space in their context window. Although context window exhaustion is not relevant in most cases you&rsquo;ll find for internal agents, ultimately it&rsquo;s not possible to implement a robust, reliable agent without solving for this problem, and compaction is a straightforward solution.</p> <h2 id=\"how-we-implemented-it\">How we implemented it</h2> <p>Initially, in the beautiful moment where we assumed compaction wouldn&rsquo;t be a relevant concern to our internal workflows, we implemented an extremely naive solution to compaction: if we ever ran out of tokens, we discarded older tool responses until we had more space, then continued. Because we rarely ran into",
            "title": "Building an internal agent: Context window compaction"
        },
        {
            "content": [],
            "link": "https://lethain.com/agents-large-files/",
            "publishedAt": "2025-12-26",
            "source": "Will Larson",
            "summary": "<p>One of the most useful initial extensions I made to our workflows was injecting associated images into the context window automatically, to improve the quality of responses to tickets and messages that relied heavily on screenshots. This was quick and made the workflows significantly more powerful.</p> <p>More recently, there are a number of workflows attempting to operate on large complex files like PDFs or DOCXs, and the naive approach of shoving them into the context window hasn&rsquo;t worked particularly well. This post explains how we&rsquo;ve adapted the principle of progressive disclosure to allow our internal agents to work with large files.</p> <p><em>This is part of the <a href=\"https://lethain.com/agents-series/\">Building an internal agent</a> series.</em></p> <h2 id=\"large-files-and-progressive-disclosure\">Large files and progressive disclosure</h2> <p><a href=\"https://www.anthropic.com/engineering/effective-context-engineering-for-ai-agents\">Progressive disclosure</a> is the practice of limiting what is added to the context window to the minimum necessary amount, and adding more detail over time as necessary.</p> <p>A good example of progressive disclosure is <a href=\"https://lethain.com/agents-skills/\">how agent skills are implemented</a>:</p> <ol> <li>Initially, you only add the description of each available skill into the context window</li> <li>You then load the <code>SKILL.md</code> on demand</li> <li>The <code>SKILL.md</code> can specify other files to be further loaded as helpful</li> </ol> <p>In our internal use-case, we have",
            "title": "Building an internal agent: Progressive disclosure and handling large files"
        },
        {
            "content": [],
            "link": "https://lethain.com/agents-skills/",
            "publishedAt": "2025-12-26",
            "source": "Will Larson",
            "summary": "<p>When Anthropic introduced <a href=\"https://platform.claude.com/docs/en/agents-and-tools/agent-skills/overview\">Agent Skills</a>, I was initially a bit skeptical of the problem they solved&ndash;can we just use prompts and tools?&ndash;but I&rsquo;ve subsequently come to appreciate them, and have explicitly implemented skills in our internal agent framework. This post talks about the problem skills solves, how the engineering team at Imprint implemented them, how well they&rsquo;ve worked for us, and where we might work with them next.</p> <p><em>This is part of the <a href=\"https://lethain.com/agents-series/\">Building an internal agent</a> series.</em></p> <h2 id=\"what-problem-do-agent-skills-solve\">What problem do Agent Skills solve?</h2> <p>Agent Skills are a series of techniques that solve three important workflow problems:</p> <ol> <li>use <a href=\"https://lethain.com/agents-large-files/\">progressive disclosure</a> to more effectively utilize the constrained context windows</li> <li>minimize conflicting or unnecessary context in the context window</li> <li>provide reusable snippets for solving recurring problems to avoid individual workflow-creators having to solve recurring problems like e.g. Slack formatting or dealing with large files</li> </ol> <p>All three of these problems initially seemed very insignificant when we started building out our internal workflows, but once the number of internal workflows reached into the dozens, both become difficult to manage. Without reusable snippets, I lost the leverage to improve all workflows at once, and without progressive disclosure the agents",
            "title": "Building an internal agent: Adding support for Agent Skills"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3186/",
            "publishedAt": "2025-12-26",
            "source": "XKCD",
            "summary": "<img alt=\"Building Inspectors HATE This One Weird Trick\" src=\"https://imgs.xkcd.com/comics/truly_universal_outlet.png\" title=\"Building Inspectors HATE This One Weird Trick\" />",
            "title": "Truly Universal Outlet"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-26"
}