{
    "articles": [
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Oct/6/openai-devday-live-blog/#atom-entries",
            "publishedAt": "2025-10-06",
            "source": "Simon Willison",
            "summary": "<p>I'm at <a href=\"https://devday.openai.com/2025\">OpenAI DevDay</a> in Fort Mason, San Francisco today. As <a href=\"https://simonwillison.net/2024/Oct/1/openai-devday-2024-live-blog/\">I did last year</a>, I'm going to be live blogging the announcements from the kenote. Unlike last year, this year <a href=\"https://www.youtube.com/live/hS1YqcewH0c\">there's a livestream</a>.</p><p><em>You are only seeing the long-form articles from my blog. Subscribe to <a href=\"https://simonwillison.net/atom/everything/\">/atom/everything/</a> to get all of my posts, or take a look at my <a href=\"https://simonwillison.net/about/#subscribe\">other subscription options</a>.</em></p>",
            "title": "OpenAI DevDay 2025 live blog"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Meetups this week include Austin, Berlin, Canberra, Jakarta, Salt Lake City, Tel Aviv, and others - see <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-2025-times-and\">the meetup post</a> for more information.</p><p><strong>2:</strong> I sent emails October 1 to people who received ACX Grants. The following people haven&#8217;t replied and should check their spam folders: Diego E, Lewis W, David Ro, Jacob Ar, Nino O, Nishank B, Alejandro A, Alyssia J, Chetan K, Bryan Da. If you&#8217;ve replied and it didn&#8217;t reach me for some reason, send me a message on Substack or Twitter. If you haven&#8217;t received an email and are not on the list above, you didn&#8217;t win, sorry. I&#8217;ll post the public announcement once I&#8217;m in touch with all winners and have run some final formalities by them. Again, sorry for limited posts as I get some of this finished up.</p><p><strong>3: </strong>Speaking of grants: <a href=\"http://openphilanthropy.org\">Open Philanthropy</a>&#8217;s program to reduce catastrophic risks from biology asks me to advertise that they are both hiring grantmakers, and looking for potential grantees with ambitious project ideas. They&#8217;re especially interested in work on physical transmission suppression, metagenomic sequencing, PPE, medical countermeasures, biosecurity capacity-building, and projects at the intersection of AI and catastrophic biological risk. No prior bio experience needed. For would-be grantmakers, see their <a href=\"https://jobs.ashbyhq.com/openphilanthropy?utm_source=105\">job description</a>, applications due Oct 19. For would-be grantees, see their <a href=\"https://airtable.com/appk4qxUG2dzCJUT2/pagHnnCDjCWQ0tCv9/form\">expression of interest form</a>.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-402",
            "publishedAt": "2025-10-06",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Meetups this week include Austin, Berlin, Canberra, Jakarta, Salt Lake City, Tel Aviv, and others - see <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-2025-times-and\">the meetup post</a> for more information.</p><p><strong>2:</strong> I sent emails October 1 to people who received ACX Grants. The following people haven&#8217;t replied and should check their spam folders: Diego E, Lewis W, David Ro, Jacob Ar, Nino O, Nishank B, Alejandro A, Alyssia J, Chetan K, Bryan Da. If you&#8217;ve replied and it didn&#8217;t reach me for some reason, send me a message on Substack or Twitter. If you haven&#8217;t received an email and are not on the list above, you didn&#8217;t win, sorry. I&#8217;ll post the public announcement once I&#8217;m in touch with all winners and have run some final formalities by them. Again, sorry for limited posts as I get some of this finished up.</p><p><strong>3: </strong>Speaking of grants: <a href=\"http://openphilanthropy.org\">Open Philanthropy</a>&#8217;s program to reduce catastrophic risks from biology asks me to",
            "title": "Open Thread 402"
        },
        {
            "content": [
                "<p>Some amazing things are going on, not all of which involve mRNA, although please please those of you with the ability to do so, do your part to ensure that stays funded, either via investment or grants.</p>\n<p>As for mRNA, please do what you can to help save it, so we can keep getting more headlines like ‘<a href=\"https://x.com/DrCatharineY/status/1958930965071634540\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">a new cancer vaccine just wiped out tumors</a>’ even if it is sufficiently early that the sentence <a href=\"https://t.co/7WQDUpBD6N\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">this time inevitably concludes ‘IN MICE.</a>’</p>\n<p><span id=\"more-24766\"></span></p>\n<h4>Heart Disease</h4>\n<p><a href=\"https://x.com/cremieuxrecueil/status/1911895857739579643\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Wait, what, you’re saying we might soon ‘mostly defeat’ heart disease</a>?</p>\n<blockquote><p>Cremieux: It&#8217;s hard to oversell how big a discovery this is.</p>\n<p>Heart disease is America&#8217;s #1 cause of death. With a combination of two drugs administered once every six months, it might be mostly defeated.</p>\n<p>Just think about that how big this is! You will know your great-grandkids!</p>\n<p>It is insanely optimistic that we have drugs that can reduce Lp(a) levels by [65%-]98% in trials right now.</p>\n<p>If they succeed, they could help to crush heart disease and stroke.</p>\n<p>Unlike LDL in general, Lp(a) levels are basically entirely genetic in origin and not open to lifestyle intervention. It is also widely accepted that the race differences are down to genes.</p>\n<p>These drugs are examples of genetic discovery leading to a group difference fix via tech.</p>\n<p><a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(24)01308-4/abstract\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">The future of medicine is still very bright</a>.</p></blockquote>\n<p>I wouldn’t go that far. Even if these trials are successful, it seems unlikely we’re talking about ‘mostly defeat,’ although we could plausibly be at ‘greatly reduce.’ Which could still be worth several years of life expectancy across the board. If we could also similarly help with other major causes of death and aging, you’d see compounding gains, but without that aging still catches up with everyone.</p>\n<p>Unfortunately, America under the current administration is making deep cuts in basic research funding that leads to advances like this. Hopefully AI can make up for that.</p>\n<h4>Alcohol</h4>\n<p><a href=\"https://www.vox.com/health/460086/rfk-jr-trump-maha-cancer-alcohol-study-health\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A new major study finds that alcohol causes cancer</a>, so government worked to bury the study. Time and time again we get presented with the fact that small amounts of drinking correlate with improved health in various ways, fooling many into thinking a little alcohol is healthy.</p>\n<p>As opposed to the reality, which is that alcohol is bad for you no matter what, but that inability to drink is highly correlated with alcoholism and other traits that go along with poor health, whereas ability to drink only in moderation is a good sign.</p>\n<p>So drinking in moderation, which is only a small amount bad for your health, is still a good sign for your health if you are drinking in moderation. Whereas heavier drinking consistently looks bad, perhaps even worse than it is.</p>\n<p>Trump himself is not fooled, and does not drink at all, as he has seen the dangers of alcoholism in his own family. A wise choice.</p>\n<blockquote><p>Dylan Scott: They broke out their findings by different drinking levels — from one drink per day to three — and focused on health outcomes that have been proven to be associated with alcohol use. Their big-picture conclusion:</p>\n<p>Among the US population, the negative health effects of drinking alcohol start at low levels of consumption and begin to increase sharply the more a person drinks. A man drinking one drink per day has roughly a one in 1,000 chance of dying from any alcohol-related cause, whether an alcohol-associated cancer or liver disease or a drunk driving accident. Increase that to two drinks per day, and the odds increase to one in 25.</p>\n<p>…</p>\n<p>In that context, the report is a harrowing read: Alcohol use is associated with increased mortality for seven types of cancer — colorectal, breast cancer in women, liver, oral, pharynx, larynx, and esophagus. Risk for these cancers increases with any alcohol use and continues to grow with higher levels of use, the study’s authors concluded.</p>\n<p>Women experience a higher risk of an alcohol-attributable cancer per drink consumed than men. Men and women who die from an alcohol-attributable cause die 15 years earlier on average.</p></blockquote>\n<p>A 4% chance of dying on average 15 years earlier is a big deal.</p>\n<p>This is not the first time a Trump administration defied the data on this.</p>\n<blockquote><p>US officials always solicit expert opinion as they prepare a fresh set of dietary guidelines. The input is usually compiled into one massive report from a group of experts called the US Dietary Guidelines Advisory Committee and then submitted to the Department of Health and Human Services and the Department of Agriculture, the two agencies that produce the guidelines.</p>\n<p>That was how the process went in 2020, and at that time, the subcommittee of researchers dedicated to alcohol (including Naimi) advised the government to reduce the recommended limit down to <a href=\"https://archive.is/o/DDkDc/https://www.wsj.com/articles/men-urged-to-limit-alcohol-to-one-drink-a-day-amid-new-concerns-11597688916\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">one drink per day for men</a>, from two. The Trump administration ultimately <a href=\"https://archive.is/o/DDkDc/https://www.nytimes.com/2020/12/29/health/dietary-guidelines-alcohol-sugar.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">decided not to follow the recommendation</a>.</p></blockquote>\n<p>&nbsp;</p>\n<h4>Legal Reforms</h4>\n<p>Montana passes SB 535 with broad bipartisan backing, further expands its ‘right to try’ rules, <a href=\"https://marginalrevolution.com/marginalrevolution/2025/05/montana-bucks-the-fda-establishes-biotech-and-longevity-hub.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=montana-bucks-the-fda-establishes-biotech-and-longevity-hub\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">with a license path for experimental treatment centers to administer any drug that got through Phase I trials</a>, to anyone who wants it. This is The Way.</p>\n<p>Alex Tabarrok is correct that <a href=\"https://marginalrevolution.com/marginalrevolution/2025/08/free-the-patient-a-competitive-federalism-fix-for-telemedicine.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=free-the-patient-a-competitive-federalism-fix-for-telemedicine\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">we could greatly improve healthcare if we allowed telemedicine across state lines</a>. As long as a doctor is licensed where the doctor is physically located, it shouldn’t matter where the patient is located. The best part is that <a href=\"https://x.com/Cotton_MT/status/1955782779616289050\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">this could be done with an admin rules change of two words</a>.</p>\n<p><a href=\"https://www.alexkesin.com/p/mr-secretary-reclassify-the-statin?utm_source=post-email-title&amp;publication_id=104087&amp;post_id=163639638&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3o9&amp;triedRedirect=true&amp;utm_medium=email\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A call to make statins be sold over the counter (OTC)</a>. This seems obviously correct, even if you are highly skeptical that the correlations cited here imply causation, or that they imply that intervening via statin cause this causation without important side effects. That’s a decision people can make for themselves at this point. But then a whole host of things should be OTC at this point that aren’t.</p>\n<h4>Embryo Selection and Gene Editing</h4>\n<p><a href=\"https://t.co/CW2McjqY3p\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A new embryo selection company, Herasight</a> has launched <a href=\"https://x.com/cremieuxrecueil/status/1950590708647178518\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">that is allowing users to select for IQ</a>. They claim that with as few as 10 embryos you can already go from an expected IQ of 100 to a new average of 107. Or you can do things like go from 45% chance of Type 2 Diabetes to 25%.</p>\n<blockquote><p>Alex Young: I’ve been working with an IVF startup, @herasight, that has already screened hundreds of embryos. Today we come out of stealth with a paper showing that our predictors for 17 diseases — validated within-family — beat the competition, with improved performance in non-Europeans.</p>\n<p>In our paper, we detail our polygenic scores (PGS) for 17 diseases using a custom meta-analysis. We used state-of-the-art methods to create PGSs based on 7.3M SNPs. Our most predictive PGSs explained ~20% of the variance in liability for prostate cancer and type-II diabetes.</p></blockquote>\n<p>In practice what happens is you get your 5, 10 or 20 embryos, they profile each one, and you are choosing based on a variety of traits. What do you actually care about most? You are about to find out.</p>\n<blockquote><p><a href=\"https://x.com/kitten_beloved/status/1950654502396477929\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Kitten:</a> Within a few years they&#8217;re going to be able to show you a very accurate picture of what each baby will look like as an adult.</p>\n<p>That will trump every other consideration by a large margin.</p></blockquote>\n<p>I agree that this technology is coming. I agree it will matter to people. And why shouldn’t it matter, at least from a selfish point of view? It also might be a better way to select for other good things than you might think, as in general health and other positive traits are correlated with beauty. I do not think it will be anything like ‘this overrides everything else.’</p>\n<p>Even the graceful failure mode for things like this is a really big deal.</p>\n<blockquote><p><a href=\"https://x.com/webdevMason/status/1950656906445705219\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Mason</a>: I think this just ignores the realities of IVF tbh</p>\n<p>20 healthy embryos is, for most people, 3-5 IVF cycles</p>\n<p>Success for a single embryo transfer is 40-60%.</p>\n<p>&#8220;Well, your dad and I wanted a boy and you were the second highest IQ male after Embryo 6 failed to implant.&#8221;</p>\n<p>Yeah, these numbers are for mothers &lt;35. It&#8217;s crazy how many people think IVF is a safety net for aging out of your fertility window when you actually need to start the process quite young in order for it to be likely to work.</p></blockquote>\n<p>I mean that sounds pretty great? You got your choice of gender and a couple of IQ points, while presumably also dodging a variety of potential genetic disorders. That’s a pretty good haul.</p>\n<p>What you actually get is not maximizing on one to two traits, although you do have that option. What you get is to do a general maximization over many traits. That is a lot more valuable if you are making reasonable decisions.</p>\n<p>Mason is however making the very important point that if you want to use IVF and have confidence it will work at all, let alone confidence it will give you selection, you need to do it early. The younger you are, the better all of this will on average go, until such time as we figure out how to generate new eggs (which is plausibly only a few years away).</p>\n<p><a href=\"https://x.com/GeneSmi96946389/status/1951417531547496860\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">As Gene Smith points out in this thread, academics are super against all of this.</a></p>\n<blockquote><p>Gene Smith: We&#8217;re in this insane world right now where rich parents are going through IVF just to do embryo selection, and middle class parents who are ALREADY doing IVF are being told by doctors that embryo selection doesn&#8217;t work or is unethical.</p>\n<p>If you&#8217;ve been to conferences on embryo selection or ones where the topic is discussed, you will realize the truth is basically the opposite. Most academic discussion of this is dominated by ethicists talking about how problematic it is or academics talking about its limitations.</p>\n<p>And make no mistake, these discussions matter. They&#8217;re the main reason why even doctors who understand embryo selection rarely recommend it to their patients, even when it could significantly reduce the odds of a patient passing along a disease to their child.</p>\n<p>Among the academics that care about this, a large majority are opposed to embryo selection for ideological reasons. There hasn&#8217;t been all that much quantitative analysis done on it. And what has been done often fails to capture how embryo selection is actually done in industry.</p>\n<p>A lot of work has focused on selection on a single trait, which is easier to model, but not how selection actually works in practice. And many of the conclusions about its efficacy rely on outdated predictors which have improved substantially since publication.</p>\n<p>The effect size of embryo selection for IQ <a href=\"https://t.co/e4o1BbsxdN\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">has nearly tripled since the publication of this paper</a>, which was still being cited relatively recently.</p></blockquote>\n<p>He also reminds us that we are spending all our gene editing resources on rare diseases where we can stick the government gigantic bills and the ‘ethicists’ stop trying to ban you from helping, whereas the places where most of the value lies are complete ignored, even by people who would directly benefit.</p>\n<blockquote><p><a href=\"https://x.com/GeneSmi96946389/status/1955184499509314002\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Gene Smith</a>: The situation in the gene editing field right now is kind of unbelievable. We&#8217;ve spent over a decade throwing billions of dollars at the gene editing for rare diseases and we still can&#8217;t get the editors inside most of the cell types we need to modify.</p>\n<p>Everything is either for the liver or the eye or the bone marrow. We can&#8217;t get to the brain. We can&#8217;t get to the lungs. We can&#8217;t get to the heart. And we can barely fit a single editor into the best delivery vector so no one is even thinking about polygenic disease.</p>\n<p>There is an extremely simple way to fix this: edit in embryos. All the stuff we can&#8217;t target right now because of delivery issues becomes almost trivial in embryos. You can literally stick a needle into the egg and squirt the editors in.</p>\n<p>Alzheimer&#8217;s? Tractable. Diabetes? You can pretty much get rid of it. Heart disease? You can mostly make it a thing of the past. Breast cancer? Same deal.</p>\n<p>…</p>\n<p>The blame for this delay lies at the feet of academics. There are literally professors who go to conferences on gene editing and brag about how they&#8217;ve gotten governments to ban embryo gene editing.</p>\n<p>[thread continues]</p>\n<p>Bex: surely this is being done black budget and for the uber wealthy already. but I guess all that learning is hidden:(</p>\n<p>Gene Smith: As someone working on the cutting edge of this field, I can tell you it&#8217;s definitely NOT. You underestimate how maddeningly myopic wealthy people can be about new tech. Fred Koch literally didn&#8217;t ask the cancer research center he funded to look into ways to treat his cancer.</p>\n<p>The most cutting edge thing wealthy people are actually doing right now is embryo selection a la Herasight and Orchid.</p></blockquote>\n<p>I mean, it’s not that simple, of course it is not that simple, but it is a little bit that simple?</p>\n<p>If you have the option to use the technology we do have, it seems crazy not to use it. <a href=\"https://x.com/noor_siddiqui_/status/1956193329928134696\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Noor Siddiqui is being too righteous and superior about it even for me here</a>, but if it really does cost as little as $2,500 to get selection over potential embryos, that is a better deal than essentially any remotely optional interventions you have access to after birth. The replies to such proposals are full of people saying how horrible all this is and having instinctual disgust and purity reactions, and calling everyone involved and the proposal itself various names, all of it patently absurd without any actual justifications.</p>\n<p>I do strongly agree with Vitalik Buterin that while <a href=\"https://x.com/VitalikButerin/status/1957156680430715120\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">we should be very much in favor of embryo selection</a> and most of the attacks on it are deranged, it is counterproductive and wrong to strike back by saying that since it condemns your children to be worse off that not using selection is unethical.</p>\n<blockquote><p><a href=\"https://x.com/VitalikButerin/status/1957156680430715120\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Vitalik Buterin</a>: If you publicly telegraph that if you win your fight for acceptance you will immediately follow it up with a fight for imposition, do not be surprised if people decide to oppose your fight for acceptance from day one with a vigor only reserved for resisting imposition.</p></blockquote>\n<p>We’ve been over this one many times. If that which is not forbidden is compulsory, then that which I do not want to be compulsory must be forbidden.</p>\n<h4>GLP-1s Work</h4>\n<p>Oh no, all these GLP-1 drugs are going to prevent people from dying, <a href=\"https://x.com/peterwildeford/status/1905280400051798290\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">and that could have a negative impact on pensions</a>?</p>\n<p><a href=\"https://x.com/ESYudkowsky/status/1905689757403021367\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Eliezer does a survey</a>, finds ~80% of those who tried GLP-1 drugs report it helped lots versus those that didn’t, roughly confirming industry claims. That’s a fantastic success rate.</p>\n<p>Now we are potentially seeing <a href=\"https://x.com/cremieuxrecueil/status/1912959600686465116\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Eli Lily have a pill that’s ~55% as effective as Ozempic in phase-3 trials</a>, their stock was up 14% on the news. They also have Retatrutide coming in a year or two, which is claimed to be a more effective GLP-1 drug that also causes less muscle loss.</p>\n<p>These marginal improvements make a huge practical difference. GLP-1s are now a lot like AI, in that we keep getting better versions and people’s impressions don’t update.</p>\n<p><a href=\"https://www.astralcodexten.com/p/links-for-april-2025?utm_source=post-email-title&amp;publication_id=89120&amp;post_id=161001546&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=67wny&amp;triedRedirect=true&amp;utm_medium=email\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Unfortunately, it’s not always easy to get a line on the necessary supply.</a></p>\n<blockquote><p>Scott Alexander: Update on <a href=\"https://www.astralcodexten.com/p/the-ozempocalypse-is-nigh\" rel=\"noopener\" target=\"_blank\">Ozempocalypse</a>: some pharmacies have stopped selling compounded GLP-1 drugs, <a href=\"https://www.cnbc.com/2025/03/21/zepbound-copycats-tirzepatide-compounding-online-fda-ban.html\" rel=\"noopener\" target=\"_blank\">others continue</a>, with various flimsy legal excuses. Cremieux <a href=\"https://www.cremieux.xyz/p/how-to-get-cheap-ozempic\" rel=\"noopener\" target=\"_blank\">has a guide (partly subscriber-only)</a> on how to order and use cheap “research chemical” GLP-1 from from peptide companies. And the Trump administration <a href=\"https://apnews.com/article/trump-medicare-coverage-wegovy-zepbound-54bf291135fa9efec7d0ad9672c850a1\" rel=\"noopener\" target=\"_blank\">cancelled a Biden initiative</a> to make GLP-1 drugs available via insurance.</p></blockquote>\n<p><a href=\"https://www.astralcodexten.com/p/the-ozempocalypse-is-nigh\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">There were official shortages of GLP-1 drugs</a>, <a href=\"https://marginalrevolution.com/marginalrevolution/2025/03/the-shortage-that-increased-ozempic-supply.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-shortage-that-increased-ozempic-supply\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">which allowed compounders to make and sell those drugs cheaply</a>, on the order of $300/month, in essentially unlimited quantities. Alas, there is now no longer an official shortage, so the price is shooting back up again (~$1k/month) and supply is harder to find. We really should find a way to buy out those patents and make these drugs available for low prices (ideally for free, with at most a minimal consultation) for whoever wants them.</p>\n<p><a href=\"https://x.com/EganPeltan/status/1937156300032610438\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Is it possible that if you combine a GLP-1 with anabolic agent Bimagrumab</a>, you can lose fat without losing muscle? Eli Lily is in phase 2b of trying to find out.</p>\n<blockquote><p>Egan Peltan: Today, Lilly revealed the weight loss &amp; composition at 48 weeks</p>\n<p>Sema: -13.5% (72% Fat)</p>\n<p>Bima: -8.6% (100% Fat)</p>\n<p>Bima + Sema: -16.4% (&gt;90% Fat)</p>\n<p>Patients on bima+sema saw &gt;40% decrease in body fat with **no change** in lean mass at 24W. Overall, bima and bima+sema were well tolerated No striking SAE imbalances.</p></blockquote>\n<p><a href=\"https://x.com/EricTopol/status/1963265157900996960\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">What we don’t know works</a> with GLP-1s <a href=\"https://www.washingtonpost.com/health/2025/09/03/microdosing-glp-1-longevity-wellness/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU2ODcyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU4MjU0Mzk5LCJpYXQiOjE3NTY4NzIwMDAsImp0aSI6ImJkMDkyZmIwLWU3ODEtNGRjNy1hYjJmLTJjYjgwN2RjODhmOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wOS8wMy9taWNyb2Rvc2luZy1nbHAtMS1sb25nZXZpdHktd2VsbG5lc3MvIn0.-DhElnXjyay4Y8NhPItxU43QJ-QxXO76o_kCwV1rSOE\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">is microdosing</a>.</p>\n<blockquote><p>Eric Topol: The GLP-1 microdosing wellness and longevity craze without any data for dose or evidence of effect.</p></blockquote>\n<p>As usual this as worded confuses lack of formalized data and evidence for a lack of data and evidence. These are not the same thing. It is an entirely sensible strategy to experiment with different doses and to choose, with a drug that has big benefits, but also downsides, and is clearly safe. Self-experimentation can provide highly useful data and evidence, and clearly different people respond differently in terms of benefits and side effects at different doses.</p>\n<blockquote><p>Babb (from the WSJ article): What feels healthiest is taking the lowest amount that’s providing what I’m perceiving to be these health benefits.</p></blockquote>\n<p>The marketing involving microdosing does sound not great, especially its claims of other vague and hard to measure benefits.</p>\n<h4>There Is No Catch Other Than Availability And Price</h4>\n<p>There are still some potential <a href=\"https://x.com/ben_r_hoffman/status/1942235395908898857\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">safety issues where it would be good to have more confidence</a>, I agree that we are not treating checking for such possibilities as seriously as we should given how many people are on these drugs. But also given how many people are on these drugs (about 6% of Americans right now), and how much many people are inherently suspicious that there is a catch, and how long people have been taking them for (including previously for diabetes) I am confident that if there was a showstopper problem it would have been found by now.</p>\n<blockquote><p><a href=\"https://x.com/oscredwin/status/1941565346777063759\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Andrew Rettek</a>: Ozempic type drugs have been on the market for over seven years. It&#8217;s been about five years since 1 million Americans have been taking them. We have a pretty good idea of their side effects at this point. It&#8217;s longer than you thought, because people have been taking them for diabetes for years before they became popular for weight loss.</p></blockquote>\n<p>People instinctively think there must be a catch to GLP-1s. But for people in most circumstances there mostly isn’t one, at least not one of magnitude similar to the benefits, other than that for some people it doesn’t work?</p>\n<blockquote><p><a href=\"https://x.com/GSVBemusementPk/status/1941533996468289856\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">GSV Bemusement Park</a>: Look if you are trying to lose weight there is no reason to not be padding your efforts with a GLP-1 drug unless everyone in your family gets thyroid cancer.</p>\n<p>If you buy smartly the cost is literally negative after accounting for the food you don&#8217;t eat, and you can always go back on if you regain weight.</p>\n<p>If you follow me then your mutuals almost certainly include several helpful, literate people who will be thrilled to advise you.</p>\n<p>You have nothing to lose but waistline.</p>\n<p><a href=\"https://x.com/peterrhague/status/1941402380400246947\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Peter Hague:</a> Ozempic skepticism seems entirely based on the animist-like idea that there is a conservation law for good fortune &#8211; all good things must have some equal cost imposed elsewhere. It’s not scientific skepticism, it’s superstition.</p>\n<p>I’m really concerned too how “big pharma is trying to kill you/sterilise you with fake medicine” has gone from the fringes of Facebook mummy groups to the mainstream. It used to be the main complaint was they were greedy and withholding good medicine from sick people.</p>\n<p><a href=\"https://x.com/dystopiangf/status/1942339964181647843\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Dystopina GF</a>: Anti-Ozempic people don’t understand that the average person isn’t supposed to be an iron-willed Übermensch. Average people simply reflect the quality of their society; they’re obese bc modernity is sick, not bc of some moral failing. Being thin should be effortless, the default!</p>\n<p>A well-designed society is a system that makes good things as frictionless as possible. A poorly-designed society is one where it takes a Herculean effort to achieve the most basic elements of human health and fulfillment</p>\n<p><a href=\"https://x.com/jd_pressman/status/1942379992786296911\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">John Pressman</a>: The replies on this inspire serious misanthropy. The QT is straightforwardly correct and the replies make it obvious that all good things come from brutally, ruthlessly destroying the perverse costly signaling equilibria people naturally cover up utility with.</p></blockquote>\n<p>Of course, here I am saying that and then not taking them, but I am a bizarro case where I was able to get to my target through sheer willpower, and I have decades of experience dealing with essentially permanent hunger. That almost never works.</p>\n<p><a href=\"https://x.com/oscredwin/status/1932673979333935408\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Andrew Rettek reports from a week discussing</a> diet, exercise and GLP-1s at LessOnline and Manifest. Lots of people wanted to exercise, but felt they needed ‘demystifying’ of the gym and the general procedures involved. I very much feel this. Our on ramps suck, and mostly amount to ‘find a source and trust it.’ Which is way better than not exercising but doesn’t fill one with confidence or motivation &#8211; I’m spending a substantial portion of my time and willpower and energy on this, and different implementations differ a lot. Whereas for diet, Andrew observed people mostly weren’t interested, my guess is because they’ve already heard so many contradictory things.</p>\n<h4>The Societal Impact of GLP-1s</h4>\n<p>GLP-1s served as a large scale experiment in drug compounding, and in sidestepping the FDA’s various usual regulatory requirements. The results were amazingly great, everything went smoothly. This is even more evidence for FDA Delenda Est, while noting that ‘fire a bunch of people at the FDA’ makes things worse rather than better. Removing requirements is good, but if there are going to be requirements it is necessary to be able to handle the paperwork and meetings promptly.</p>\n<p>Going forward, the bigger question is: What happens if this actually works?</p>\n<blockquote><p><a href=\"https://x.com/cremieuxrecueil/status/1937317845970333936\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Cremieux</a>: Eli Lilly just showed that you can lose tons of fat while barely losing any muscle using their activin type-II receptor inhibitor, bimagrumab.</p>\n<p>We are approaching a golden era of weight loss, where everyone can easily be muscular and skinny.</p>\n<p>Prepare for hordes of hot Americans.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"563\" src=\"https://substackcdn.com/image/fetch/$s_!TeeZ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fea674ece-1a06-4b4a-b22c-48e48208e1be_900x563.jpeg\" title=\"\" width=\"900\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/Devon_Eriksen_/status/1937337456501661808\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Devon Eriksen</a>: And I am predicting, here and now, that there will be a massive social pushback from people who would rather see their fellow Americans live out their lives sick, fat, and miserable than give up their just-universe fallacy.</p></blockquote>\n<p>At what point do we start to think of weight loss as fully treatable?</p>\n<blockquote><p><a href=\"https://x.com/shakoistsLog/status/1941200081052631451\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Shako</a>: Increasingly in public I see obese people as glp1 deficient. I mean this seriously. There is a 200 pound 15 year old girl at this playground. It’s heartbreaking and we can treat it now.</p>\n<p>Lots of people commenting diet and exercise work better. And yet vast amounts of Americans, often stupid and poor, die every year from preventable metabolic diseases. Do you think they just don’t know about diets?</p>\n<p>Eliezer Yudkowsky: Tirzepatide doesn&#8217;t work on 20% of people, including me.</p>\n<p>Shako: <img alt=\"🙏🏻\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f64f-1f3fb.png\" style=\"height: 1em;\" /> hope something does soon.</p></blockquote>\n<p>Not every case can be treated, since we have a non-response problem, and some people will run into side effects or risk factors. But a large majority of people with a problem still haven’t attempted treatment. Most of them should try. If you were already going to lose the weight on your own, you could do it easier with help?</p>\n<p>What about the equilibrium, signaling and status arguments? That if we allow people to lose weight without willpower or personal virtue then that will make the signals harder to read and be Just Awful? Yeah, I don’t care.</p>\n<h4>I’m Not a Yo-Yo</h4>\n<p><a href=\"https://x.com/cremieuxrecueil/status/1920996913525952669\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Cremieux claims that it is a myth</a> that yo-yo weight loss reduces muscle mass and makes you fatter. <a href=\"https://x.com/oscredwin/status/1921001228835692544\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Andrew Rettek responds that the studies</a> claiming to bust this were on wrestlers, which doesn’t apply to normal people, and I buy his explanation of the mechanism here, which is:</p>\n<ol>\n<li>If you lose weight without resistance training you’ll lose some muscle mass.</li>\n<li>If you gain weight without resistance training you won’t gain muscle mass.</li>\n<li>Thus, if you do both, yes, you end up worse off.</li>\n<li>But that’s a choice, and it’s fixable by attacking ‘without resistance training.’</li>\n</ol>\n<p>There are also other exercise methods. The point is clear.</p>\n<h4>Back Problems Are An Underrated Reason To Lose Weight</h4>\n<p><a href=\"https://x.com/ManDownTed/status/1901213554532823497\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Weight loss helps resolve back problems</a> and otherwise make things hurt less. Few appreciate how big a deal this is. This was a big game changer for me on its own.</p>\n<blockquote><p>Man Down Ted: I may have a bit less hair, but I have FAR fewer body aches and pains than I did 10 years ago.</p>\n<p>A lot of that is due to lowering the weight my body has to carry, but at least some of it is due to the fact that I will just make myself do 10 mins of yoga to loosen up, any time.</p>\n<p>Meanwhile, half my male friends near my age have thrown their back out this year. Possibly more than half wake up stiff and sore from sleep every day.</p>\n<p>Dropping the weight is good for dating,, but it&#8217;s GREAT for your long-term health and self image. And not THAT hard.</p></blockquote>\n<h4>No One Knows Much About Nutrition</h4>\n<p>That is, no one knows much about how to do it right.</p>\n<p>We do know many ways in which one can do it wrong.</p>\n<p><a href=\"https://www.cremieux.xyz/p/nutrition-beliefs-are-just-so-stories\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Cremieux points out that in general ‘nutrition beliefs are just-so stories</a>.’</p>\n<p>If there were two concrete specific things I would have said I was confident about, one of them would have been ‘vegetables mostly good’ and the other would be ‘sugar bad.’ I don’t think it’s bad enough to stop me all that much on either front, but I do buy that sugar is bad on the margin.</p>\n<p>And yet when Americans cut sugar consumption (modestly by ~10%, note the y-axis) the obesity rate still mostly kept moving up.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"434.14903846153845\" src=\"https://substackcdn.com/image/fetch/$s_!LPJa!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff5a88bfb-b53f-4c15-b08f-ef480c57ed68_1456x971.webp\" title=\"\" width=\"651\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>He blames this mess on selection. Once sugar got blamed, choosing to consume more sugar became correlated with other health decisions, some of which matter. The associations between sugar and health only show up, he claims, after 2012. And he says this generalizes &#8211; certain people eat certain diets. He finishes with a survey of some of the other problems.</p>\n<p>I am inclined to be kinder, and see the epistemic problems here as actually super hard. Nutrition is remarkably different for different people, doing proper studies on humans is extremely hard, there are distinct effects for short, medium and long terms, a lot of this is about how you psychologically respond, lots of details matter and are hard to measure and can be changed without you realizing, and so on.</p>\n<p><a href=\"https://x.com/hamandcheese/status/1950342391870755239\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">As far as anyone can tell Aspartame, a zero calorie sweetener, seems benign</a>. I agree that this is great news so long as no one forces anyone to use it. I think the people this most annoys are people who believe that it is not as good an experience as sugar, and don’t want their sugar taken away, either legally or by those ‘worried about their health.’ Also, since no one knows anything about nutrition, I wouldn’t assume that there isn’t a catch.</p>\n<h4>Ketogenic Diets Can Go Very Wrong</h4>\n<p>From what I’ve seen, they go wrong enough often enough that starting to mess with them probably doesn’t make sense if you aren’t already messing with them.</p>\n<p><a href=\"https://x.com/cremieuxrecueil/status/1922727968285048844\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Do ketogenic diets</a> <a href=\"https://x.com/ChristofferBN/status/1922334762963771683\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">dramatically raise risk</a> of stroke and heart attack?</p>\n<blockquote><p>Christoffer Bausted Nilsen: “When the facts change, I change my mind. What do you do, sir?” (<a href=\"https://x.com/ChristofferBN/status/1922905632576839725\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">source</a>)</p></blockquote>\n<p>The graphs show dramatically accelerated PAV (Percent Atheroma Volume) and NCPV (Non-Calcified Plaque Volume) in those on Keto diets.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"468.1967213114754\" src=\"https://substackcdn.com/image/fetch/$s_!OHuZ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7bcb0aec-48d6-427b-a48a-2c830b1a67d9_488x680.jpeg\" title=\"\" width=\"336\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"413.768352365416\" src=\"https://substackcdn.com/image/fetch/$s_!0MwX!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9c3150a8-4bb8-4931-9168-61d956105a66_613x680.png\" title=\"\" width=\"373\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>As always, beware conclusions from intermediate endpoints, and also different people often have very different reactions and averages can be misleading. But I agree this does not look good.</p>\n<blockquote><p><a href=\"https://x.com/cremieuxrecueil/status/1922736776117993807\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Cremieux</a>: I&#8217;m a little annoyed that I spent so many years thinking keto was obviously good.</p>\n<p>Now that we have a lot of data, it turns out that the people who said &#8220;fat—especially saturated fat—clogs your arteries&#8221; were just totally correct.</p>\n<p>I should not have believed the contrarians.</p></blockquote>\n<p>I don’t think we have enough evidence here to draw that conclusion either?</p>\n<p>Here’s a counterargument from someone thoughtful and sympathetic to Keto:</p>\n<blockquote><p><a href=\"https://x.com/WilliamAEden/status/1923119242745983059\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">William Eden</a> (not endorsed): As someone who has recommended paleo/keto diets in the past, let me lay out my current thinking:</p>\n<p>ApoB is directly related to atherosclerosis progression (experts are right)</p>\n<p>*Some* people who go on keto skyrocket ApoB, and yes I think keto is bad for those people. This is where ultimately empirical results overcame the same things he derides in this discussion (“mechanistic” reasoning to support the answer you’re hoping to see).</p>\n<p>Human PCSK9 mutants with no CVD changed my mind &#8211; and are the basis for a class of very strong therapeutics! However… I still think mechanisms are real. Some are better established, others speculative. Good theories predict the (very complicated) data My favorite thinker on the subject is <a href=\"https://t.co/7TYCUdBcNf\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Peter over at Hyperlipid</a>, though he’s almost impossible to understand.</p>\n<p>Just because high sat fat keto increases heart disease doesn’t mean the answer is to eat huge amounts of polyunsaturated fats either. Yes, I am a seed oil disrespecter. Mechanistically I think it causes the liver to hang onto fat instead of circulating it, but we can do better.</p>\n<p><a href=\"https://t.co/HcirerfKPQ\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">This video from Peter Attia is just 10 minute</a>s and lays out the good drug options available today, including ones with better risk/reward than statins (though a *low dose* statin I think is fine with CoQ10 supplementation).</p>\n<p>(Btw I think it’s absolutely clear that LDL must play some role in the body or it wouldn’t exist. I don’t 100% know all of its functions, but when you look across countries, low LDL is seen in developing countries with lots of infectious disease and other cardiovascular issues)</p>\n<p>In terms of my diet advice, I do think a higher-fat diet that dips occasionally in and out of ketosis is likely optimal for long term performance and health. If you get high ApoB, swap out sat fat for monounsaturated fat, and consider drugs. Keto for &gt;&gt;1 month I have concerns.</p>\n<p>In terms of my epidemic advice, I do think contrarians should try harder to grapple with mainstream evidence instead of dismissing it. *Especially* the really strong evidence, and being able to see it as such. That’s why short term diet studies didn’t get me, but PCSK9 did. Fin.</p></blockquote>\n<p><a href=\"https://x.com/nathancofnas/status/1923794912539021740\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Nathan Cofnas defends Keto on multiple fronts</a> while also offering warnings.</p>\n<ol>\n<li>He gives us the standard ‘correlation is not causation’ warnings that are at their peak in nutrition and a reminder that no one knows anything beyond that you need a basic set of nutrients and that different people are different.</li>\n<li>The key thing about Keto, as its fans envision it, is it is the ultimate case of never do anything by halves. The idea of Keto is that you force your body into ketosis. That means consistent hardcore restricting of carbs. Most people can’t do it.</li>\n<li>So almost any observational study is going to include a bunch of people who don’t actually do the thing and stay in ketosis, and being kind-of-keto doesn’t work.</li>\n<li>Remember, when evaluating diets, that people basically neve stick to one for very long. The majority of people who say they’re ‘vegetarian’ will then admit they’ve eaten meat in the past week.</li>\n<li>Keto is not optimized for longevity. You do it to feel and look better now, not to live for longer. Even if it has longevity costs, it might still be worth it. If you do want primarily longevity he suggests caloric restriction and pescetarianism, which is kind of the opposite of keto.</li>\n<li>Keto is the only diet that worked for him in terms of current health, but of course different things work for different people.</li>\n</ol>\n<p>I find these defenses:</p>\n<ol>\n<li>Reasonable arguments.</li>\n<li>Clear indications that very few people should be trying to be on a keto diet.</li>\n</ol>\n<p>For keto to make sense, even if you mostly buy the counterarguments, given the risks involved (over a range of possible worlds):</p>\n<ol>\n<li>You need to have extraordinary willpower and discipline, keeping in mind that most people who think they have it, don’t have it.</li>\n<li>You need to be willing to spend that, and give up carbs, and endure all the hedonic and social costs involved, to stick to keto for real.</li>\n<li>You need to prioritize short term health over longevity.</li>\n<li>You need to have a body where keto happens to be relatively beneficial for you.</li>\n<li>You keep avery close eye on various markers and your experience as you try it, and abort on the spot if an issue emerges, either in terms of your health or experience, or simply exposing that the willpower price is too damn high.</li>\n</ol>\n<p>And that’s if you buy the counterarguments.</p>\n<p>In practice, even if you think this is right for you to try, I’m willing to go ahead and say that on average you are wrong about that.</p>\n<h4>Weight Loss The Hard Way</h4>\n<p><a href=\"https://x.com/AllyTaft/status/1894842907431154033\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Congratulations to Allyson Taft on her transformation</a>, including losing 120+ pounds in just under a year by walking a lot, drinking a lot of water and tracking calories.</p>\n<p>Not everyone can do this. Not everyone should attempt this. And most people in the position to need to do it should probably take GLP-1s.</p>\n<p>It was still very nice to see a clear example of someone pulling off the pure willpower route who wasn’t me. And it sounds like she didn’t even use GLP-1s.</p>\n<h4>We Ask Far Too Much Of Satiety</h4>\n<p>One thing I would push back on very hard is the idea that there is something perverse and modern about the fact that<a href=\"https://www.exfatloss.com/p/satiety-graphed-and-the-horsemen\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> if we eat until we feel satiated with reasonable access to a variety of foods then we will gain weight</a>:</p>\n<blockquote><p>exfatloss: If you can maintain a healthy body weight by restricting your total food intake, but never give in to eat ad libitum because you know you’d gain fat, your satiety &amp; appetite are broken. Until very recently, nobody needed to count calories to remain thin.</p></blockquote>\n<p>I’m not saying that staying thin did not get harder on many fronts, and it is entirely possible that there are other things making things harder on top of that, but the idea that in the past eating as much as you wanted of what you wanted wouldn’t have made you fat is Obvious Nonsense. Rich people from the past who could eat as much as they wanted, and didn’t care, totally got fat. Sure, people mostly stayed thin, but largely out of lack of opportunity.</p>\n<p>Needing to control yourself to stay thin does not mean that your <a href=\"https://www.exfatloss.com/p/satiety-graphed-and-the-horsemen\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">satiety is broken</a>. You’re asking way too much of satiety. You’re asking it to give you the right highly calibrated signal in a radically different world than the one it was trained for.</p>\n<p>This doesn’t require toxins or any particular villain beyond widespread variety and caloric availability, including many calorically dense foods, and greatly increased food variety and quality, and various cultural expectations of eating frequently. <a href=\"https://x.com/cremieuxrecueil/status/1858704235853979878\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">It is enough</a>, and regardless of the original cause life is not fair.</p>\n<blockquote><p>Cremieux: Attempts to explain the obesity epidemic through contamination, toxins, conspiracies, seed oils, sugar, high-fructose corn syrup, lithium, or whatever else always strike me as annoying.</p>\n<p>What we must explain is an increase of ~200-350 calories a day in energy balance. That&#8217;s all.</p></blockquote>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"675\" src=\"https://substackcdn.com/image/fetch/$s_!KSVi!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbdb04437-3063-4126-85c5-e8b3a1f0324a_1200x675.jpeg\" title=\"\" width=\"1200\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>My answer is simple, and similar to Cremieux’s in the thread, that there was never really any robust natural ‘balance.’</p>\n<p>For full disclosure, I say this as someone whose satiety has always been utterly broken to the point of uselessness. If left to my own devices I would put on insane amounts of weight very quickly. I might double my caloric intake. That’s what actually broken looks like. But don’t ask an evolutionary mechanism to give the right answer in a radically changed world, and don’t call it ‘broken’ when you have to adapt.</p>\n<p>Yes, until recently that meant you had to work for it. That’s one option. The other? Good news, now we have Ozempic and other GLP-1s.</p>\n<h4>Supplements</h4>\n<blockquote><p>Key Smash Bandit: I started taking a million supplements and I do feel meaningfully better but the new problem is I have no idea which one did it, and taking all of them is expensive and annoying</p>\n<p><a href=\"https://x.com/moultano/status/1951333043613966839\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Ryan Moulton</a>: This is a fun task to try to design an experiment to resolve.</p>\n<p>I would randomize to taking 50% each day, (ideally blinded, but whatever) and then record how I felt each day. Then after you have ~a month of data, fit a regression model from what you took to how you felt, probably also with at least terms for 1 day lag. Lean on L1 in lasso a lot, because you&#8217;re probably looking for a single thing rather than a large set.</p></blockquote>\n<p>Unfortunately there are what the economists call ‘long and variable lags’ in vitamin impact, both positive and negative. Even if it originally helped or hurt in a day, it might take a while for a supplement to wear off. Others only work via accumulation over time, or work on things other than observable mood.</p>\n<p>Experimental design here is very hard. I would not want to maximize purely on the basis of how I feel within 24 hours.</p>\n<p>Also, for various reasons, you cannot by default confidently equate any given pill with other pills from another source that claim to deliver the same dose of the same vitamin.</p>\n<p>If I was going to run such tests, as much I would like to randomize every day, I would at minimum want to wait three or so days between swaps, and I would limit the multiple hypothesis testing. The data is going to be super noisy at best.</p>\n<h4>A Cure For Some Depression</h4>\n<p><a href=\"https://x.com/joshwhiton/status/1891488522542145548\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A story worth sharing</a>.</p>\n<blockquote><p>Josh Whiton: Halfway through university I was diagnosed with clinical depression. After a battery of tests and interviews with psychologists I eventually met with the psychiatrist who was to dispense my medication.</p>\n<p>Instead he asked me a question that no one had ever asked.</p>\n<p>&#8220;Why are you depressed?&#8221;</p>\n<p>So I told him about the meaninglessness of life in an accidental universe where all life was just the product of chance.</p>\n<p>&#8220;You want me to put you on medication because you&#8217;re an intellectual?&#8221; he said.</p>\n<p>Then he said the wildest thing: &#8220;My concern is that your depression is part of a process and the drugs will slow it down.&#8221;</p>\n<p>He told me to go home and observe all the thoughts in my mind instead of trying to escape from them. If in three days I still wanted the drugs, to come back and he&#8217;d give them to me.</p>\n<p>So I went home and spent three days journaling, had three epiphanies about the nature of reality, and the year-long depression immediately lifted.</p>\n<p>I wonder about all the kids like me who got the drugs instead.</p></blockquote>\n<h4>Assisted Suicide</h4>\n<blockquote><p><a href=\"https://x.com/zdch/status/1956771192406196362\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Zac Hill</a>: One of the things I was most brazenly wrong about was just basically making fun of people who thought that Canada’s euthanasia program would achieve scale.</p></blockquote>\n<p>As in, MAID now is already 5% of all deaths in Canada and is about to be available for mental conditions and parliament wants to grant access to minors, and I see a bunch of claims about it being aggressively pushed onto people in various ways. One wonders where this stops, once it starts. If it stops.</p>\n<p>Former <a href=\"https://x.com/matthew_loftus/status/1924698070828089668\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Quebec officials suggest that best “solution” for intellectually disabled woman</a> without adequate support might be death. Which might be true, but wowie. This highlights where things might be going. Do you trust the state to not push such solutions on people who are financial burdens? To not cut off aid to them as part of an attempt to force such choices upon them? I notice my answer is very much no.</p>\n<h4>Bioethics Delenda Est</h4>\n<p><a href=\"https://x.com/jpsenescence/status/1952862465517101150\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A lot of ‘ethics’ people think the only ethical thing for you to do is hurry up and die.</a></p>\n<blockquote><p>Joao Pedro de Magalhães: &#8220;It is highly unethical to stop aging&#8221; &#8211; reviewer commenting on one of my grant applications.</p>\n<p>The grant focused on cellular rejuvenation, no mention to curing aging, but it shows we still have a long way to go to convince even fellow scientists that curing aging is desirable.</p></blockquote>\n<p>As in, you are trying to solve people’s health problems, but this might also cure aging, And That’s Terrible.</p>\n<p><a href=\"https://x.com/dylanmatt/status/1897821508258419007\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Once again: Bioethicists know nothing of ethics.</a> This is them answering:</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"325.25379170879677\" src=\"https://substackcdn.com/image/fetch/$s_!pYa4!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe49a4863-190a-44c8-bbc4-fa4086ea9686_989x548.jpeg\" title=\"\" width=\"587\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/wideawake_media/status/1899022626745409647\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Here’s a bioethicist giving a Ted talk advocating that humans</a> be ‘engineered’ to be, no not more intelligent or healthy or happy but (checks notes) intolerant to meat, at the same time that other ‘ethicists’ are screaming about how awful it is we might do embryo selection on positive traits.</p>\n<p>And 41% stand ready here to outright deny physical reality.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"628\" src=\"https://substackcdn.com/image/fetch/$s_!8Kdk!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc73eb99a-eaeb-4385-aa56-d31270e20b53_1998x862.jpeg\" title=\"\" width=\"1456\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>How exactly would we design society such that it is not a disadvantage to be blind?</p>\n<p>If I was blind and I heard people were claiming this, I’d be pretty pissed off at them.</p>\n<p>Do you think, by answering that way, you are helping anyone?</p>\n<h4>Ignorance Can Be Bliss</h4>\n<p><a href=\"https://x.com/robinhanson/status/1895260963496251671\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Learning about your HIV status, when treatment is not available</a>, dramatically reduces long term survival rates. Some of this is people adjusting rationally to the news, and engaging in generally riskier (to themselves) behaviors and having higher discount rates. Some of it is despair or overreaction. However it isn’t really an option not to tell them or not run the tests, for obvious reasons.</p>\n<p>Here in New York they take every opportunity to push you to get tested for HIV, even when there is no reason to do that, as I found out on a recent hospital visit (it was an infection, I am 100% fine now, don’t worry).</p>\n<h4>Living Forever In Your Apartment</h4>\n<blockquote><p><a href=\"https://x.com/clashreport/status/1963210782247661642\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Clash Report</a>: Hot-mic moment at the Beijing parade.</p>\n<p>Xi: “People rarely lived past 70 before. Now at 70 you’re still a child.”</p>\n<p>Putin: “With biotech, organs can be replaced endlessly… people could even reach immortality.”</p>\n<p>Xi: “Some predict people might live to 150 this century.”</p></blockquote>\n<p>I do see hope that some people might live to 150 this century, or even that some people alive today might live far longer than that. It will not happen because ‘organs can be replaced endlessly’ because that does not reverse aging, so the rate of new problems will keep doubling roughly every seven years, but we have other options.</p>\n<p>Also, yeah, thinking ‘at 70 you’re still a child’ is both obviously false and reflective of the geriatric ruling class that is doing so much damage. Until your anti-aging technology gets a lot better no one 70+ should be in high office.</p>\n<h4>In Other Health News</h4>\n<p>In response to RFK’s War on Vaccinations and as Florida repeals all vaccine requirements, <a href=\"https://x.com/DrCatharineY/status/1963771164376920479\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">there are now two state coalitions</a> trying to defend our health. California, Oregon, Washington and Hawaii are going to form one set of recommendations. New York, Massachusetts, Connecticut, Delaware, Pennsylvania and Rhode Island will form another, likely with New Jersey, Vermont and Maine.</p>\n<p><a href=\"https://x.com/TaliaGraceSable/status/1939387397382549568\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Freezing sperm young, if you can spare a little cash to do it</a>, is a pretty great deal. Even if everything keeps working fine you cut down on mutation load a lot, and if something does go wrong you’re going to be very happy about it. It’s a lot of optionality and insurance at a remarkably cheap price, even if you factor in the chance that in the long term we’ll have other tech that renders it unnecessary.</p>\n<p><a href=\"https://x.com/Dr_Singularity/status/1941233441930145855\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">This could end up being a big one</a>: <a href=\"https://healthspanaction.org/germany-calls-for-medicine-to-treat-aging-not-just-disease/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Germany’s national academy of sciences</a> correctly urges that we treat aging like a disease. If we can get momentum behind this, it will supercharge progress towards the (non-AI) thing that is actually killing most of us.</p>\n<p><a href=\"https://x.com/moreisdifferent/status/1923128182217097388\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">New study claims</a> <a href=\"https://t.co/ChefNuUr8z\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">living near (within 1-3 miles of) a golf course doubles risk of Parkinson’s Disease</a>, which is presumed to be due to pesticides.</p>\n<p>Ross Rheingans-Yoo <a href=\"https://t.co/Vw4e6NcteI\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">is doing a video podcast series</a> on why our drug development process is so broken and expensive.</p>\n<p><a href=\"https://x.com/oscredwin/status/1927400048146497982\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Scott Adams has prostate cancer</a>, we wish him well, thread has illustrations of exactly how unhinged a certain type of thinking got and how wide a set of medical topics. Luckily he himself has realized the mistake and although the odds are against him he now appears to be setting aside the quacks and getting real treatment.</p>\n<p><a href=\"https://x.com/owl_posting/status/1931442743336739148\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A new claim from a randomized trial</a> that getting immunotherapy in the morning has a doubled survival rate versus getting it in the evening, <a href=\"https://www.owlposting.com/p/the-time-of-day-that-immunotherapy\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Abhishaike Mahajan speculates potential reasons why</a>.</p>\n<p>A potentially serious incentive problem: If CRISPR treatments can permanently cure conditions, <a href=\"https://x.com/patrickc/status/1927166573749366913\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">insurance companies have no reason to value a permanent solution more than a temporary one</a>, so the whole system will underinvest in such treatments. Ultimately it should be fine, since at most this is a limited cost factor and thus not enough distortion to stop this from happening, and AI should improve development costs enough to compensate.</p>\n<p><a href=\"https://x.com/simonmaechling/status/1949112103236780271\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">They did finally run a decade-long study of GMOs in monkeys</a>, and of course they found zero adverse effects on any measured health indicator.</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/10/06/medical-roundup-5/",
            "publishedAt": "2025-10-06",
            "source": "TheZvi",
            "summary": "Some amazing things are going on, not all of which involve mRNA, although please please those of you with the ability to do so, do your part to ensure that stays funded, either via investment or grants. As for mRNA, &#8230; <a href=\"https://thezvi.wordpress.com/2025/10/06/medical-roundup-5/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Medical Roundup #5"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3151/",
            "publishedAt": "2025-10-06",
            "source": "XKCD",
            "summary": "<img alt=\"The Nobel Prize in Physiology or Medicine or Home Improvement or DIY\" src=\"https://imgs.xkcd.com/comics/window_screen.png\" title=\"The Nobel Prize in Physiology or Medicine or Home Improvement or DIY\" />",
            "title": "Window Screen"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/jetbrains-on-acp",
            "publishedAt": "2025-10-06",
            "source": "Zed Blog",
            "summary": "The Agent Client Protocol reaches a major milestone: JetBrains is committing to bringing ACP support to their entire ecosystem.",
            "title": "ACP Brings JetBrains on Board"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-10-06"
}