{
    "articles": [
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-09-03_70eb342ce5a2_it-is-me-i-am-mysterious/",
            "publishedAt": "2025-09-03",
            "source": "Harper Reed",
            "summary": "<p>It is me. I am mysterious.</p> <figure> <img alt=\"image_1.jpg\" height=\"2700\" src=\"https://harper.blog/notes/2025-09-03_70eb342ce5a2_it-is-me-i-am-mysterious/image_1.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #285"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-09-03_4c6bef5caa91_waiting/",
            "publishedAt": "2025-09-03",
            "source": "Harper Reed",
            "summary": "<p>Waiting</p> <figure> <img alt=\"image_1.jpg\" height=\"1484\" src=\"https://harper.blog/notes/2025-09-03_4c6bef5caa91_waiting/image_1.jpg\" width=\"1484\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #284"
        },
        {
            "content": [
                "<p>I didn&#8217;t much like Wally from the first time I met him. We worked in the same circles, but not on the same projects. I was aware of his work, but not involved or dependent on it. My initial reaction to Wally, &#8220;Complains. Nitpicks. Doesn&#8217;t act.&#8221; I made this judgment in a moment.</p>\n<p>Months passed, and none of Wally&#8217;s observed actions changed this initial perspective. In conversation, he was the guy who pedantically and exhaustively pointed out flaws, but did not suggest the means by which we address the flaws. My impression was unchanged: &#8220;He believes identifying the problem magically fixes the problem.&#8221;</p>\n<p>Several years after we first met, Wally and I were paired on the same project. I was the technical lead, and he was one of three engineers contributing. From the moment it was announced that we were on the project, I knew there would be a Wally situation.</p>\n<p>To his credit, Wally didn&#8217;t Wally for almost six months. I figured there was something about the project or the team structure that prevented the endless critique, but I was wrong. Seven months in, the project went sideways, and the Wally flood began. The good news is that I&#8217;d been preparing my speech for him for just under a year. I know what I wanted to say, and the moment the debate became unhelpful, I took him aside and executed on my speech.</p>\n<p>&#8220;Wally, it&#8217;s clear that you care about this project. So do I. It&#8217;s why they put this on the effort. You have experience. You work hard. You listen to the team, but when it comes to solving hard problems, you… endlessly analyze. You scratch at that problem itch way past the point of uselessness. Yes, we need to understand problems, but the understanding should begin to reveal solutions. Please help us find solutions faster.&#8221;</p>\n<p>From that moment on, Wally and I got along famously. Problem solved.</p>\n<p>I am not joking even a little; I am, however, lying quite a bit.</p>\n<h2>A Vacuum Full of Fear</h2>\n<p>I&#8217;ve never actually met Wally. Yes, we had a tremendous amount of interaction over the years, but the entirety of our interaction has been text-based; it was online. We never worked together. All of my impressions were real, and, yes, we did end up co-contributing on a volunteer project virtually. And, yes, the Wally talk did finally occur, and it did fix our relationship, but the situation had very little to do with Wally and everything to do with me.</p>\n<p>The rule is: &#8220;In the absence of information, humans will fill the vacuum with their worst fears.&#8221; The reason I lied to you is that I&#8217;m wondering: <em>Did your perspective change when I told you I&#8217;d never met Wally in person?</em></p>\n<p>Without a doubt, I know that a distributed company can work. I&#8217;ve helped build several and watched them work. We can communicate well in a virtual environment. However, if someone is sitting on the other side of Slack, everyone is missing context. A look here. A sideways glance there. Perhaps a critical pause.</p>\n<p>What is aggregated with these small bits of missing information is an increasing vacuum. In that vacuum, you do what all humans do: you make an educated guess on how to fill the vacuum. <em>Well, she responded to the message slowly, so I guess she doesn&#8217;t care that much about the project.</em> <em>His written answers are always so terse, I guess he&#8217;s mad… about something.</em> <em>He keeps typing and typing about the problem. I don&#8217;t <strong>think</strong> he&#8217;s that strategic.</em></p>\n<p>Wally is strategic. I&#8217;d trust Wally to handle any curveball these days because I have… and he does. Wally isn&#8217;t the problem. <strong>I&#8217;m the problem</strong>. From his first few communications, I defined my Wally judgement and hung on for dear life. I never rechecked my assumptions.</p>\n<p>Relative to me, the core issue with text communication is that I have decades of senior leadership experience and a truly impressive short attention span. These have served me well, but in order to read the room, I require a physical room populated with real, live humans. I need to see where you&#8217;re looking when you&#8217;re speaking. I understand more when I hear the length of your pause before you answer the question. I see discomfort as well as I see joy — you don&#8217;t have to say a thing.<sup id=\"fnref-5344-1\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5344-1\" title=\"Read footnote.\">1</a></sup></p>\n<p>The skills you develop as a senior leader over decades <a href=\"https://randsinrepose.com/archives/act-last-read-the-room-and-taste-the-soup/\">in the room soup tasting</a> have given me the impression that I am good at leaping to judgment or inferring intent quickly based on the vibes in the room. <em>The room is not confident in what this person is saying, I will ask questions.</em> <em>No one is asking any questions about any of this presentation? What are they scared of? I will ask others to speak.</em> <em>He didn&#8217;t answer my question. I will ask again.</em></p>\n<p>In a remote or virtual set-up, context vanishes. The amount of correct information you have about this person, their true thoughts about this topic, and others&#8217; impressions drops significantly.</p>\n<p>The written word gives you a powerful medium to define and refine your thoughts. Continued practice will improve the quality of your writing. However, you are the writer, not the reader. What publishing hundreds of articles and several books has taught me is that the reader plops themselves in the middle of your narrative and <strong>reads the story they want to hear.</strong> You shape their perspective, but you do not own it; they do.</p>\n<p>Check your context. If you rely on written communication on a team: mail, Slack, messaging, the burden is on everyone involved, not just to read, but to understand. My belief: you&#8217;re missing 50% (probably more) of the context in the first draft of short-form written communication.</p>\n<p>Check your context:</p>\n<ul>\n<li>Any question you have, however small, is worth asking. Ask them. Ask them again. Ask until you are satisfied you understand. </li>\n<li>In text, your impression of the emotion behind their words is your emotions speaking, not theirs. Clarify — do you mean this? I am reading your feelings as that? The incorrect snap judgment on emotion is a sure-fire way to point your understanding in the wrong direction.</li>\n<li>If the writing seems clear, if the conclusions are reasonable, and you believe you understand, great. Does this thought lead us to a high-risk decision? Can you sense enormous consequences if we head down their suggested path? Repeat their thought in your words or use theirs. Watch what happens.</li>\n</ul>\n<h2>The One Conversation</h2>\n<p>In person, you are swimming in context. You&#8217;re so used to it that you take it for granted. The murmur of agreement — <em>that&#8217;s good.</em> The complete silence after the key point — <em>that&#8217;s bad.</em> Frank, nodding in the corner when she finishes speaking, <em>Frank never nods unless he&#8217;s super on board, and Frank is <strong>never</strong> on board.</em></p>\n<p>The reason the Wally conversation &#8220;fixed&#8221; my relationship was <strong>it was the first time I took time to give Wally feedback.</strong> Lunacy on my part. I know. I was sitting there hiding behind my keyboard, thinking Wally could infer my poorly informed judgment from my silence, from my lack of sharing context.</p>\n<p>I find great comfort in the written word. It gives me satisfaction to translate the mess in my head into occasional helpful words and phrases. If you and your team are heavily relying on written communication to get the work done, you, the reader, have extra work to find the errors in their thinking and ask them questions to gauge the substance of what they write.</p>\n<p>And, sorry again, Wally. You&#8217;re aces. And you already know that because I told you and you heard me.</p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-5344-1\">\nHere&#8217;s the thing. The problem isn&#8217;t senior leaders who are being thrust into distributed environments where they need to rely on their writing skills and reading comprehension ability. The problem is that even to be able to deduce intent from written communication, you need to spend months, nay years, of your life in the room with other humans. It&#8217;s how you build a mental model for how other humans work. If you haven&#8217;t built this model, if you&#8217;ve spent your career typing versus talking with humans, then the above advice won&#8217;t resonate because you&#8217;ll believe the way to interact with the humans is via short, pithy statements via the keyboard. It&#8217;s not. You stopped reading in the first paragraph. This footnote didn&#8217;t stand a chance.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5344-1\" title=\"Return to main content.\">&#8617;</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://randsinrepose.com/archives/check-your-context/",
            "publishedAt": "2025-09-03",
            "source": "Rands in Repose",
            "summary": "I didn&#8217;t much like Wally from the first time I met him. We worked in the same circles, but not on the same projects. I was aware of his work, but not involved or dependent on it. My initial reaction to Wally, &#8220;Complains. Nitpicks. Doesn&#8217;t act.&#8221; I made this judgment in a moment. Months passed,&#8230; <a class=\"excerpt-more\" href=\"https://randsinrepose.com/archives/check-your-context/\">more</a>",
            "title": "Check Your Context"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/open-thread-3975\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-3975",
            "publishedAt": "2025-09-03",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/open-thread-3975\"> Read more </a> </p>",
            "title": "Open Thread 397.5"
        },
        {
            "content": [
                "<p>Startup Roundups (<a href=\"https://thezvi.substack.com/p/startup-roundup-1-happy-demo-day?utm_source=publication-search\">#1</a>, <a href=\"https://thezvi.substack.com/p/startup-roundup-2?utm_source=publication-search\">#2</a>) look like they’re settling in as an annual tradition.</p>\n<p>I’ve been catching up on queued roundups this week as the family was on vacation. I am back now but the weekly may be pushed to Friday as I dig out from the backlog.</p>\n\n\n<h4 class=\"wp-block-heading\">The Central Themes</h4>\n\n\n<p>There is a common theme to the vignettes offered across the years. The central perspective has not much changed.</p>\n<p>I would summarize the perspective this way, first in brief and then with more words:</p>\n<ol>\n<li>Founding SV-style startups or being an early employee is great alpha.</li>\n<li>You create more value, and you capture more of that value.\n<div>\n\n\n<span id=\"more-24694\"></span>\n\n\n</div>\n</li>\n<li>Building real things that scale is so valuable that you can afford a lot of nonsense.</li>\n<li>Venture capital similarly does foolish stuff a lot but the successes are so good that if they have good deal flow they still win.</li>\n<li>Venture capitalists and others offering advice say many valuable things but also have their own best interests at heart, not yours, and will lie to you.</li>\n</ol>\n<p>Or, with more words:</p>\n<ol>\n<li>The central idea of founding or joining as an early employee of a startup, building something people want, raising venture capital funding in successive rounds and mostly adhering to Silicon Valley norms is an excellent one. If you have the opportunity to do YC you probably want to do that too.</li>\n<li>Because you get equity you capture a vastly higher percentage of the value you create than you would if you worked for someone else. This is all a great way to change and improve the world, and also a great way to earn rather <a href=\"https://www.youtube.com/watch?v=dYfH7WziTTs&amp;ab_channel=HayleyMcAllister\">quite a lot of money</a>. This is risky in the sense that most of the time your startup will fail, but failure is not so bad and you can try again in various ways. If you’re up for it, strongly consider doing it.</li>\n<li>This works because the value in building real things that scale, at all, is orders of magnitude higher than the value of an ordinary job, plus you are capturing far more of it. The structure is hugely inefficient and wasteful and stupid and perverse in various ways, most of your activity is likely going to be built around assembling and selling the team and proving that it can Do The Thing, and learning how to Do The Thing, but it does result in attempting to Do The Thing at all, which is what matters. There is ‘a lot of ruin’ in this nation.</li>\n<li>Venture capital returns, and especially the strong returns of the best VCs, are largely about selection and deal flow, and marketing themselves. <a href=\"https://x.com/robinhanson/status/1960051783583047930\">The VCs tend to herd</a> <a href=\"https://x.com/HiFromMichaelV/status/1960212492040491509\">to an extent that it should challenge one’s overall epistemology</a> and model of capitalism, and have similar flawed heuristics and are largely evaluating whether other VCs will be willing to fund in the future, and evaluating the team and its ability to pitch itself, and so on. Which again is hugely inefficient and wasteful and stupid and perverse compared to how it would ideally work, and it leaves a ton on the table, but it Does The Thing at all, so it beats out all the alternatives.</li>\n<li>Venture capitalists will offer you lots of free advice, which as we know is seldom cheap. A lot of what they say is good advice, and you need to absorb their culture, but a lot of it is them talking their books and marketing themselves and the idea of doing a startup, or trying to get you to do what the VCs want to do for various reasons. Some of that will align with what is good for you. A lot of it won’t, and you have to keep in mind that when your interests are in conflict they are lying liars who lie, and at other times they fool themselves or don’t understand.</li>\n<li>In particular, VCs and Paul Graham in particular will try to pretend that ‘what you do to succeed outside of fundraising’ and ‘how to set yourself up to fundraise’ are the same question, or have the same answer, and you should not think of this as a multi-part strategic problem. This is very obviously an adversarial message.</li>\n<li>This type of adversarial message will happen one-to-many in general advice, and will also happen one-to-one when they talk to you. Listen, but also be on guard.</li>\n</ol>\n<p>Here are some vignettes on this theme from the past year.</p>\n\n\n<h4 class=\"wp-block-heading\">How To Interpret Advice From Paul Graham</h4>\n\n\n<p><a href=\"https://x.com/eshear/status/1880109348690723269\">Emmett Shear offers advice on how to interpret advice from Paul Graham</a>.</p>\n<p>According to Emmett:</p>\n<ol>\n<li>Filter his creative ideas, but pay attention, there’s gold in them hills.</li>\n<li>If Paul tells you how a decision gets made, he’s often right even if he isn’t telling you the whole picture.</li>\n<li>Paul’s advice is non-strategic, he’s saying what his model thinks you should do.</li>\n</ol>\n<p>My reactions based on what I know, keeping in mind I’ve never met him:</p>\n<ol>\n<li>Strongly agree, same as his public ideas.</li>\n<li>Based on his public statements, I’d say he’s bringing you a part of the picture, often an important or neglected part, but he’s often being strategic in how it is presented and framed, and in particular by the selection effect of when to explain what parts, and what parts to leave out.</li>\n<li>I strongly believe many Paul Graham statements in public are strategic. I also think Paul’s model in many places is at least partially strategically motivated. Even if his motivation in the moment is non-strategic, the process that led to Paul having that opinion was, de facto, strategic.\n<ol>\n<li>I can believe that Paul’s private advice is mostly non-strategic beyond that.</li>\n</ol>\n</li>\n</ol>\n<p>Given the overall skill and knowledge levels, with that level of trustworthiness, that’s still an amazingly great source of information. One of the best. Use it if you have access to it.</p>\n<p>One common pattern of advice from Paul Graham has been talking up the UK.</p>\n<blockquote><p>Rohit: This is a pretty remarkable tweet, and a sign of the times.</p>\n<p><a href=\"https://x.com/paulg/status/1912147018501529937\">Paul Graham (April 15, 2025)</a>: A smart foreign-born undergrad at a US university asked me if he should go to the UK to start his startup because of the random deportations here. I said that while the median startup wasn&#8217;t taking things to this extreme yet, it would be an advantage in recruiting.</p>\n<p>What an interesting twist of history it would be if the UK became a hub of intellectual refugees the way the US itself did in the 1930s and 40s. It wouldn&#8217;t take much more than what&#8217;s already happening.</p>\n<p>It has lower GDP per capita, but it also has rule of law.</p>\n<p>G: what if it was Europe instead of the UK? would you still recommend?</p>\n<p>Paul Graham: It&#8217;s the same tradeoff, yes.</p></blockquote>\n<p>Graham agrees the regulatory burdens of being in Europe are extreme, so for now he sees a mixed strategy as appropriate. Those who are worried about being in America can be recruited to the UK or Europe, which justifies (in his mind) more UK-or-Europe-based startups than we currently have.</p>\n<p>Paul Graham is the best case scenario. When you see advice from other venture capitalists, assume they are less informed and skilled, and also more self-interested, until proven otherwise.</p>\n<blockquote><p>Zain Rizavi: wild that it only took 4 months of building to realize I’d take back nearly every piece of “advice” I gave founders over 4.5 years investing. Most VC advice is cosplay</p>\n<p><a href=\"https://x.com/martin_casado/status/1959049535998894297\">Martin Casado</a>: yup</p></blockquote>\n<p>Martin Casado has been on an absolute ‘saying the quiet part out loud’ tear recently. No matter how vile and bad faith I find his statements about AI policy and existential risk and everything surrounding effective altruism and so on, he’s got the Trump-style honest liar thing going especially on the venture side, and yes it is refreshing.</p>\n\n\n<h4 class=\"wp-block-heading\">Investor Meetings Do Not Create Optimal Strategic Choices</h4>\n\n\n<p><a href=\"https://x.com/paulg/status/1954267188581519440\">Never conflate the medium and the message</a>, or the map and the territory, or the margin and the limit.</p>\n<p>I don’t think Paul is being naive here.</p>\n<p>I think he is doing a combination of thinking on the margin and talking his book:</p>\n<blockquote><p>Paul Graham: Figuring out what a startup should say to investors is strangely useful for figuring out what it should actually do. Most people treat these questions as separate, but ideally they converge. If you can cook up a plausible plan to become huge, you should go ahead and do it.</p>\n<p>For example, I&#8217;m always looking for ways to add network effects to a startup&#8217;s idea. Investors love those. But network effects are genuinely good to have. So any we come up with in order to feed to investors, they should probably go and make happen.</p>\n<p>Experienced investors are pretty rational. But those are the ones you want anyway.</p></blockquote>\n<p>Should you be thinking big, and about what scales, and taking big swings? Absolutely, although the VCs want you to do it more than you should want to do it due to different incentives.</p>\n<p>On the margin, founders benefit from VCs pushing founders to do more of the things that VCs want to hear, as a lot of why they want to hear them is that those actions correlate with big success. The danger is when you are not on the margin, and stop being grounded in reality and start to believe your own hype and stories.</p>\n\n\n<h4 class=\"wp-block-heading\">Y-Combinator Is A Great Deal</h4>\n\n\n<p>If you have the option to do YC, <a href=\"https://x.com/paulg/status/1931305599939043485\">rest assured that as long as you’re not collapsing a huge bunch of SAFEs the valuation boost from YC’s reputation is worth vastly more than the share of your company YC takes</a>. You’ll be net ahead on cash and equity very quickly.</p>\n\n\n<h4 class=\"wp-block-heading\">Avoiding Marking to Market</h4>\n\n\n<p>Matt Levine has often mentioned how valuable it can be to not have to mark your investments to market. Early stage VCs are experts at controlling how and when their investments are marked to different numbers.</p>\n<blockquote><p><a href=\"https://x.com/paulg/status/1914410500512743862\">Joe Weisenthal </a>(April 21, 2025): Blackstone is now down 40% from its November highs, and is right back at its post-Liberation Day lows. Remember, this is probably the best run manager of private assets in the world, so just consider how your run of the mill PE or VC shop is looking right now.</p>\n<p>Paul Graham: Early stage VCs are presumably looking better, because an early stage investment in a startup is mostly a bet on whether the founders are Larry &amp; Sergey or not, and that is independent of global political and financial trends.</p>\n<p>Joe Weisenthal: Sure, but that only pertains to an individual bet, not the entire asset class, right?</p>\n<p>Paul Graham: You mean the value of a sufficiently large number of such bets should vary with the market&#8217;s expectations about future growth? In theory yes. But in practice not so much.</p>\n<p>In practice the effects on early stage valuation are muted by (a) the fact that big exits, where all the returns are, will be 10 years in the future or more, and (b) the dynamics of fundraising; there&#8217;s no such thing as value investing at the seed stage.</p>\n<p>There are certainly ups and downs in early stage startup valuations, but they&#8217;re driven mostly by variations in how excited investors are about startups. E.g. valuations are high now because investors are (justifiably in my opinion) excited about AI.</p>\n<p>Mr. Plumpkin: Not how math works sorry. The difference between them building a $1T company and a $2T company due to market valuations still impacts the option math today.</p>\n<p>Paul Graham: Only by 2x, whereas great vs ok founders can increase the outcome by 1000x or more.</p></blockquote>\n<p>Yes, that would be only by 2x, but that’s a 50% markdown.</p>\n<p>This is purely not marking to market and strategic ignorance about market prices. It is price fixing by a VC cabal via norms. It is a conspiracy in restraint of trade and collective fiction.</p>\n<p>Sure, the best founders might increase value by 1000x, but the best founders under bad conditions are then worth 500x of what the bad founders were worth under good conditions, rather than 1000x. Still counts.</p>\n<p>What Paul Graham is effectively saying here is that VCs are a conspiracy in restraint of trade, that (among other things) refuses to pay fair prices for top startups, instead setting what are effectively highly constrained norm-based prices to avoid the best founders charging what they are worth, so top VCs can bid with reputations and connections and capture that surplus rather than bidding against each other with dollars.</p>\n<p>I do believe this is true. The top VCs are in collusion to bid with reputation and services and connections and future promises rather than with dollars, such that the top investments are both obvious to most VCs and also vastly cheaper than their expected value. And they persuade the founders involved that this is good, actually, because of things like worries about a down round.</p>\n<p>Graham himself has noted that <a href=\"https://x.com/aphysicist/status/1827336926711427171\">the difference in price for the best startups is dwarfed by how much better their prospects are</a>, that the smart VC mostly ignores price. That indicates the prices for the good prospects are way too low.</p>\n<p>Whereas if a top founder actually got what they were on average worth, VCs who invest would be unsure if they were getting a great deal.</p>\n<p>Why should the VCs get that deep discount to actual value, despite the fact that if the founder insisted plenty of those same VCs would pay up happily? Because they tell a story that the company isn’t entitled?</p>\n<p>And if you can get away with that, then yeah, who cares if the exit value is down by half, I guess? It doesn’t change any of the norm-based prices? And for worse founders, instead of the prices dropping so the market clears, a few survive and lot of those deals die.</p>\n\n\n<h4 class=\"wp-block-heading\">Worse Deals Are Worse</h4>\n\n\n<p>One of the best reasons to distrust VCs is that they make a lot of arguments that you should beware when they give you ‘too good’ a deal, including but not limited to them paying more money to get less, and instead you should give away additional large stakes in your company or other things specifically <a href=\"https://x.com/paulg/status/1827064034174390459\">in order to ensure the vibes remain good and you can tell a story to future other VCs</a>.</p>\n<p>As in, because you might have to raise at a lower number in the future, you should raise at a lower number than that now, so you don’t have a ‘down round.’ Or because you couldn’t handle having the cash.</p>\n<p>I do agree that ‘down rounds’ can kill companies and that is bad, but come on.</p>\n<blockquote><p>Paul Graham: Believe it or not, it&#8217;s dangerous for a startup to raise too much at too high a valuation. This sounds like a good problem to have, but it isn&#8217;t. Both make your next round harder.</p>\n<p>Raising too much makes you spend too much, which makes it harder to reach profitability. And a high valuation makes it harder for the next round to be an up round, which both investors and founders prefer.</p>\n<p>Why do founders raise too much at too high a valuation? Because most VCs want to own a large percentage of the company. They&#8217;re less price sensitive though. They&#8217;re willing to spend a lot to get it. So the result of these constraints is: large investment at a high valuation.</p></blockquote>\n<p>That last paragraph is a partial answer to an importantly different question: ‘Why are founders sometimes ABLE to raise so much money, at such a high valuation, that it becomes difficult to have an ‘up round’ next?’</p>\n<p>Yes, the answer is that VCs are ‘not price sensitive’ when deciding to invest (there are limits, eventually, of course, at least one hopes), they are ‘vibe sensitive’ to whether it all feels right and how it would look. And they have heuristics that say, if the deal is great, you do not care about the price, the real danger is missing out. The ultimate case of FOMO. So in many cases you can kind of ‘name your price.’</p>\n<p>It is also a hell of a thing to frame getting a great deal that way.</p>\n<p>The second paragraph points to the real danger. You cannot afford to let what happened go to your head. You cannot afford to then spend money like you are actually worth what the VCs paid, and that you will soon be able to raise more at an even higher number.</p>\n<p>Instead, you need to do something rarely done, which is to understand that the number was ‘too high’ and that you might face a down round.</p>\n<p>You know what I’ve never heard of being done? A founder CEO says, after a round, ‘these VCs went completely crazy bidding against each other. We raised $20m at a $100m valuation, and realistically it should have been less than half of that. We made damn sure the terms were airtight, so we can safety do a down round if needed, and we are setting aside the extra money so we don’t go too big or spend too much, and we’re setting your options deals accordingly.’</p>\n<p>This also makes good trading sense. Most startups have high failure risk at each step, so if you survive you should be worth more. But if you’re the ‘super hot’ startup, in a great spot, the chance of (unrecoverable) failure in the short term could be quite low. If you do great, you’ll gain tons of value. So if you do only okay, it seems perfectly fine to say the expected value is modestly down from before.</p>\n<p>There is <a href=\"https://x.com/adcock_brett/status/1827544081112953333\">the danger that you overspend</a>, grow too big, your burn rate skyrockets, your focus is lost and so on, if you’re not careful. So… don’t do that? I know, easier said than done, but not as hard as they make it sound.</p>\n<p>Convincing founders they should give up 10% of their company so that the round isn’t technically ‘down’ is one of the great cons of history. One can also call it an illegal conspiracy in restraint of trade.</p>\n\n\n<h4 class=\"wp-block-heading\">Avoiding Having A Market At All</h4>\n\n\n<p>Europe in general and Germany in particular have long been doing a natural experiment to see how annoying and expensive you can make startups before you kill them entirely. <a href=\"https://x.com/alexfmac/status/1862501489169531321\">The answer is quite a lot.</a></p>\n<blockquote><p>Nathan Benaich: 12 hours and counting &#8211; notary reads every single word of Series A docs in Germany out loud in front of founders. In person. Guys, we have GDP to grow here. Pure prehistoric madness.</p>\n<p>Paul Graham: We can use this practice as a canary in the coal mine to measure whether Germany is serious about startups. As long as it persists, they&#8217;re not.</p>\n<p>Ian Hogarth: The most significant cost of the Germany notary system is how much friction it introduces for small investors ie angel investors. Always created a higher hurdle for me to angel invest in German start-ups/or introduce angel investors.</p>\n<p><a href=\"https://x.com/HZoete/status/1862446348185788463\">Henry de Zoete</a>: 100% &#8211; same for me. It’s not worth the hassle for angel investors</p>\n<p>Alex MacDonald: I once had to physically go to the German consulate in London in order to get a document ‘apostilled’ to complete an angel investment.</p>\n<p>Never invested in another German company after that. <img alt=\"🫡\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1fae1.png\" style=\"height: 1em;\" /></p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Eventually Be Hustling</h4>\n\n\n<p><a href=\"https://x.com/tlbtlbtlb/status/1899289713196069178\">A fun story about correlation and causation.</a></p>\n<blockquote><p>Trevor Blackwell: How to be a top VC with one simple trick:</p>\n<p>Auren Hoffman: one of the firms we invested in recently raised their Series A. To start the process, the company sent emails to many VCs. stats on raise:</p>\n<p>* The top branded partners at the top branded firms: almost all responded to the email within 4 hours. All wanted to set up a meeting within a day.</p>\n<p>* The top branded partners at the mid-tier firms: usually needed to receive 2 emails to set up a mtg. Mostly requested mtgs within 4 days of 2nd email.</p>\n<p>* The low-tier firms: had the lowest response rate. Many times they wanted to set up a mtg 2-3 weeks out. They all missed seeing the deal.</p>\n<p>I&#8217;m surprised that the top-tier firms are more responsive than the low-tier firms but kinda makes sense. Always be hustling.</p></blockquote>\n<p>I do think responding quickly is the best play whenever possible. But consider that the firms might be responding more optimally than you might think.</p>\n<p>Say you’re at a low-tier firm. If you take the meeting tomorrow, and they give you that meeting, and you love it, and it closes next week, guess what?</p>\n<p>You still probably didn’t make the round, because the startup has better options and turns down your money. In a different world you’d be able to compete on price, but that’s not how this works, so you lose. Good day, sir.</p>\n<p>By scheduling two weeks out, you’re saving everyone time &#8211; that’s the point at which the round is likely actually available and so the meeting is worthwhile.</p>\n<p>That’s not to discount that hustle and fast response also make a difference, but in general if you see a contrast this stark there’s an actually good reason for it.</p>\n<p>Whereas if you are a top firm, your entire job is to quickly find the best offers like this, and lock them down before the mid-tier firms or ideally even your top-tier competitors can do an evaluation and try to box you out. You have to hustle.</p>\n\n\n<h4 class=\"wp-block-heading\">Without Selection Venture Capital Loses Money</h4>\n\n\n<p>The question is why anyone puts their money in, it’s obvious why you would want to do the job with other people’s money:</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1919075790278312315\">Sam Altman asks a good question</a>: this is much less important than tweeting about agi, but it is nevertheless amazing to me that the entire venture industry can (in aggregate) lose money for so long and keep getting funded.</p>\n<p>I am very curious why LPs do it.</p>\n<p>(obviously if you can fund the top funds you should!)</p></blockquote>\n<p>My hunch is that a lot of this is people not understanding adverse selection. They don’t get how much those top funds are cherry picking the best deals, and how much this leaves everyone else in VC at a severe disadvantage. And more of that is thinking that oh, I’m smarter or I’ve found the smart one, we will make it work, or people simply not realizing that ‘non-elite’ VCs on net lose. Or simply wanting to be part of the action.</p>\n<p>Another explanation is that this is not accounting for the potential future elite premiums you might be able to collect. So you invest now at an economic loss, to try and gain a reputation later that would let you extract rents.</p>\n<p>Part of the story is almost surely that those involved don’t believe or understand that the industry overall loses money.</p>\n<p>And part of the story has to be that investors want in on the action, it is a status marker, it is fun, it provides inside information and connections and so on.</p>\n\n\n<h4 class=\"wp-block-heading\">Finding Your Startup Idea</h4>\n\n\n<p>How to come up with your next great startup idea, according to YC?</p>\n<p>It starts with not demanding too great a startup idea? <a href=\"https://x.com/benln/status/1827006563669651487\">There’s a list</a> and <a href=\"https://www.youtube.com/watch?v=Th8JoIan4dg\">also a video</a>.</p>\n<blockquote><p>Jared Friedman, YC Partner: How to Get Startup Ideas</p>\n<p>Common mistakes:</p>\n<ol>\n<li>Waiting for a &#8220;brilliant&#8221; idea</li>\n<li>Jumping into the first idea without critical thought</li>\n<li>Starting with a solution instead of a problem</li>\n<li>Believing startup ideas are hard to find</li>\n</ol>\n</blockquote>\n<p>I agree with the first two. You shouldn’t ‘wait’ for a brilliant idea, but neither should you settle for one that is not great. It’s more that the great ideas often won’t ‘feel brilliant.’</p>\n<p>The third is more interesting. I half buy it. Certainly ‘solution in search of a problem’ is an issue, but problems are a dime a dozen even more than startup ideas. Good solutions are not, and can be the relatively scarce resource.</p>\n<p>The theory here, as I understand it, is that the way to get to a solution that solves a problem people will pay to solve is to solve a problem. YC especially preaches to look for a solution to your own problems, a ‘fine I will solve this myself just for me’ idea. That can of course still not be a market fit at all (see MetaMed), but you have a shot.</p>\n<p>Whereas if you have a solution in search of a problem, you’ll invent some story of why your solution is useful, but you won’t have product-market fit. I buy that this is a common trap, and plausibly one of the key things that went wrong at MetaMed.</p>\n<p>If you do have a solution in search of a problem, it is definitely worth doing a search for problems that it solves, so long as if you don’t find a good one you then give up.</p>\n<p>The fourth is another ‘yes and no,’ finding any idea at all is easy, finding the best ones is hard, and is especially hard if you are not someone with lots of relevant connections and experience.</p>\n<blockquote><p>Evaluate your idea on four criteria, take the average of the scores:</p>\n<p>1. Potential market size</p>\n<p>2. Founder/market fit</p>\n<p>3. Certainty of solving a big problem</p>\n<p>4. Having a new, important insight</p></blockquote>\n<p>This seems like one of those ‘these things should not be equal weight’ situations, even if they are the top four criteria. At minimum the average should be more like… the product? These are all failure points, not success points.</p>\n<blockquote><p>Positive signs for good ideas:</p>\n<ol>\n<li>Making something you personally want</li>\n<li>Recently became possible due to changes</li>\n<li>Successful similar companies exist</li>\n</ol>\n</blockquote>\n<p>As usual there is the conflict, if it wasn’t possible before how do similar companies exist? So you need to get the details right on what those mean.</p>\n<p>I’ve grown more skeptical of ‘only possible recently’ as being too important. Certainly it helps that ‘without AI from this year this wouldn’t work’ but also… people don’t do things. Ideas just sit there. Yes, most good Magic: the Gathering decks involve something you couldn’t do until very recently, but also there was a Pro Tour where Trix (which went on to completely dominate the same format) was legal and no one had it.</p>\n<blockquote><p>Generating ideas organically</p>\n<ol>\n<li>Learn to notice good ideas</li>\n<li>Become an expert in a valuable field</li>\n<li>Work at the forefront of an industry or at a startup</li>\n</ol>\n</blockquote>\n<p>The first two feel like ‘marginal’ advice. As in, true on the margin, but not overall.</p>\n<blockquote><p>Seven recipes for generating ideas (in order of effectiveness):</p>\n<ol>\n<li>Start with your team&#8217;s unique strengths</li>\n<li>Think of things you wish someone would build for you</li>\n<li>Consider long-term passions (with caution)</li>\n<li>Look for recent changes enabling new possibilities</li>\n<li>Find new variants of recent successful companies</li>\n<li>Crowdsource ideas by talking to people</li>\n<li>Look for broken industries to disrupt</li>\n</ol>\n</blockquote>\n<p>Sure, that all makes sense.</p>\n<blockquote><p>Best practices:</p>\n<p>Allow ideas to morph over time</p>\n<p>Start with a problem, not a solution</p>\n<p>Think critically about ideas for a few weeks</p>\n<p>Be open to ideas with existing competitors</p></blockquote>\n<p>Standard stuff here. Mostly, yeah, I agree.</p>\n\n\n<h4 class=\"wp-block-heading\">Some Ideas And Builders Are Bad</h4>\n\n\n<p><a href=\"https://x.com/antoniogm/status/1831148681489526956\">A culture that cannot criticize itself cannot fix its mistakes</a>.</p>\n<blockquote><p>Antonio Garcia Martinez: One of the Great Necessary Delusions of Tech is:</p>\n<p>You can&#8217;t make fun of anyone who&#8217;s actually doing or building.</p>\n<p>Even though you know it&#8217;s dumb or a grift.</p>\n<p>It&#8217;s like a stock market with no short-selling: Feels more noble, but really, it&#8217;s just bad for price discovery.</p>\n<p>Thought while reading one of those &#8220;we&#8217;re shutting down&#8221; threads where something that seemed dumb from day one is buried and eulogized like a juvenile cancer patient, while every reply-guy mourns appropriately.</p>\n<p>Sure, I&#8217;d rather live in this world than a cynical one&#8211;it&#8217;s net good, to be clear&#8211;but heavens to Betsy is it all a bit much at times.</p>\n<p>Camilo Acosta: As founders, we have the privilege and duty to call these people out &#8212; and should, because it benefits the ecosystem overall when it is done. When it doesn&#8217;t happen it sets back the founder community (see: Theranos).</p></blockquote>\n<p>If Silicon Valley is to take its rightful place as a true part of Nate Silver’s The River, or simply it wants to make good decisions, this requires a desire to understand the world and be accurate. Short selling needs to exist, at minimum rhetorically. Instead, they have largely hooked their wagon to a combination of enforced optimism, consensus zeightgeisting and collaborative vibe warfare. They think this is good for them, and that tells you a lot about who they are and what to expect from them and how to evaluate their claims.</p>\n\n\n<h4 class=\"wp-block-heading\">Whatever Sucks A Lot For You Will Suck A Lot For You</h4>\n\n\n<p><a href=\"https://x.com/atroyn/status/1822684549186506760\">So much this</a>:</p>\n<blockquote><p>Anton: startups illustrate something like Amdahl’s Law for suffering &#8211; if you are say, top 10% in being able to bear e.g working 14 hour days for months or years, 90% of your actual suffering in building a company is going to come from the places where you aren’t as resilient.</p>\n<p>If you love writing code but hate answering email, 90% of the reason building a company will suck for you is the email. if you love talking to users and can do it all day, but hate operational minutia, most of your suffering will come from the minutia.</p></blockquote>\n<p>A startup does not offer you the luxury of choosing which things to do versus not do. You have to do all of it. Which means you are doing whichever part you think sucks.</p>\n<p>A lot of what you are being paid for it the willingness and ability to do that.</p>\n\n\n<h4 class=\"wp-block-heading\">Stay Away From Ayahuasca</h4>\n\n\n<blockquote><p>Ashlee Vance: VC the other day told me, &#8220;We&#8217;ve lost several really good founders to ayahuasca. They came back and just didn&#8217;t care about much anymore.&#8221;</p>\n<p><a href=\"https://x.com/Austen/status/1838078134215991535\">Austen Allred</a>: Of the Silicon Valley founders I know who went on some of the psychedelic self-discovery trips, almost 100% quit their jobs as CEO within a year. Could be random anecdotes, but be careful with that stuff.</p>\n<p>[Sample size is 8. Of which he thinks 4 are happier.]</p></blockquote>\n<p>A huge percentage of the time that I hear about someone trying Ayahuasca, it results in them royally screwing up their life, sometimes irrevocably. This is true for public stories and also for private stories. Even when that doesn’t happen, the experiences seem to usually have been pretty miserable, without much positive change afterwards.</p>\n<p>By all accounts this is a no-good-very-bad drug. Avoid.</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/09/03/startup-roundup-3/",
            "publishedAt": "2025-09-03",
            "source": "TheZvi",
            "summary": "Startup Roundups (#1, #2) look like they’re settling in as an annual tradition. I’ve been catching up on queued roundups this week as the family was on vacation. I am back now but the weekly may be pushed to Friday &#8230; <a href=\"https://thezvi.wordpress.com/2025/09/03/startup-roundup-3/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Startup Roundup #3"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3137/",
            "publishedAt": "2025-09-03",
            "source": "XKCD",
            "summary": "<img alt=\"Another group of mathematicians is working to put an upper bound on the number, although everyone keeps begging them to stop.\" src=\"https://imgs.xkcd.com/comics/cursed_number.png\" title=\"Another group of mathematicians is working to put an upper bound on the number, although everyone keeps begging them to stop.\" />",
            "title": "Cursed Number"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/claude-code-via-acp",
            "publishedAt": "2025-09-03",
            "source": "Zed Blog",
            "summary": "You asked, and here it is. Use Claude Code in public beta directly in Zed, built on the new Agent Client Protocol.",
            "title": "Claude Code: Now in Beta in Zed"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-09-03"
}