{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Nearly a quarter of seventeen-year-old boys in America have an ADHD diagnosis. That's crazy. But worse than the diagnosis is that the majority of them end up on amphetamines, like Adderall or Ritalin. These drugs allow especially teenage boys (diagnosed at 2-3x the rate of girls) to do what their mind would otherwise resist: Study subjects they find boring for long stretches of time. Hurray?<br /><br /></div><div>Except, it doesn't even work. Because taking Adderall or Ritalin doesn't actually help you <em>learn</em> more, it merely makes trying tolerable. The kids might <em>feel</em> like the drugs are helping, but the test scores say they're not. It's <a href=\"https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\">Dunning-Kruger</a> — the phenomenon where low-competence individuals overestimate their abilities — in a pill.<br /><br /></div><div>Furthermore, even this perceived improvement is short-term. The sudden \"miraculous\" ability to sit still and focus on boring school work wanes in less than a year on the drugs. In three years, pill poppers are doing no better than those who didn't take amphetamines at all.</div><div><br />These are all facts presented in a blockbuster story in New York Time Magazine entitled <a href=\"https://www.nytimes.com/2025/04/13/magazine/adhd-medication-treatment-research.html\">Have We Been Thinking About A.D.H.D. All Wrong?</a>, which unpacks all the latest research on ADHD. It's depressing reading.</div><div><br />Not least because the definition of ADHD is so subjective and&nbsp; situational. The NYTM piece is full of anecdotes from kids with an ADHD diagnosis whose symptoms disappeared when they stopped pursuing a school path out of step with their temperament. And just look at these ADHD markers <a href=\"http://cdc.gov/adhd/diagnosis/index.html\">from the DSM-5</a>:<br /><br /></div><blockquote><strong>Inattention</strong><br />Difficulty staying focused on tasks or play.<br />Frequently losing things needed for tasks (e.g., toys, school supplies).<br />Easily distracted by unrelated stimuli.<br />Forgetting daily activities or instructions.<br />Trouble organizing tasks or completing schoolwork.<br />Avoiding or disliking tasks requiring sustained mental effort.<br /><br /><strong>Hyperactivity</strong><br />Fidgeting, squirming, or inability to stay seated.<br />Running or climbing in inappropriate situations.<br />Excessive talking or inability to play quietly.<br />Acting as if “driven by a motor,” always on the go.<br /><br /><strong>Impulsivity</strong><br />Blurting out answers before questions are completed.<br />Trouble waiting for their turn.<br />Interrupting others’ conversations or games.</blockquote><div><br />The majority of these so-called symptoms are what I'd classify as \"normal boyhood\". I certainly could have checked off a bunch of them, and you only need six over six months for an official ADHD diagnosis. No wonder a quarter of those seventeen year-old boys in America qualify!</div><div><br />Borrowing from Erich Fromm’s <a href=\"https://www.amazon.com/Sane-Society-Erich-Fromm/dp/0805014020\">The Sane Society</a>, I think we're looking at a pathology of normalcy, where healthy boys are defined as those who can sit still, focus on studies, and suppress kinetic energy. Boys with low intensity and low energy. What a screwy ideal to chase for all.</div><div><br />This is all downstream from an obsession with getting as many kids through as much safety-obsessed schooling as possible. While the world still needs electricians, carpenters, welders, soldiers, and a million other occupations that exist outside the narrow educational ideal of today.</div><div><br />Now I'm sure there is a small number of really difficult cases where even the short-term break from severe symptoms that amphetamines can provide is welcome. The NYTM piece quotes the doctor that did one of the most consequential studies on ADHD as thinking that's around 3% — a world apart from the quarter of seventeen-year-olds discussed above.</div><div><br />But as ever, there is no free lunch in medicine. Long-term use of amphetamines acts as a growth inhibitor, resulting in kids up to an inch shorter than they otherwise would have been. On top of the awful downs that often follow amphetamine highs. And the loss of interest, humor, and spirit that frequently comes with the treatment too.<br /><br /></div><div>This is all eerily similar to what happened in America when a bad study from the 1990s convinced a generation of doctors that opioids actually weren't addictive. By the time they realized the damage, they'd set in motion an overdose and addiction cascade that's presently killing over a 100,000 Americans a year. The book <a href=\"https://www.amazon.com/dp/B08ND91K6G\">Empire of Pain</a> chronicles that tragedy well.&nbsp;<br /><br /></div><div>Or how about the surge in puberty-blocker prescriptions, which has now been arrested in the UK, following the <a href=\"https://webarchive.nationalarchives.gov.uk/ukgwa/20250310143933/https://cass.independent-review.uk/home/publications/final-report/\">Cass Review</a>, as well as Finland, Norway, Sweden, France, and elsewhere.<br /><br /></div><div>Doctors are supposed to first do no harm, but they're as liable to be swept up in bad paradigms, social contagions, and ideological echo chambers as the rest of us. And this insane over-diagnosis of ADHD fits that liability to a T.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/normal-boyhood-is-adhd-a9593488",
            "publishedAt": "2025-04-15",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Nearly a quarter of seventeen-year-old boys in America have an ADHD diagnosis. That's crazy. But worse than the diagnosis is that the majority of them end up on amphetamines, like Adderall or Ritalin. These drugs allow especially teenage boys (diagnosed at 2-3x the rate of girls) to do what their mind would otherwise resist: Study subjects they find boring for long stretches of time. Hurray?<br /><br /></div><div>Except, it doesn't even work. Because taking Adderall or Ritalin doesn't actually help you <em>learn</em> more, it merely makes trying tolerable. The kids might <em>feel</em> like the drugs are helping, but the test scores say they're not. It's <a href=\"https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\">Dunning-Kruger</a> — the phenomenon where low-competence individuals overestimate their abilities — in a pill.<br /><br /></div><div>Furthermore, even this perceived improvement is short-term. The sudden \"miraculous\" ability to sit still and focus on boring school work wanes in less than a year on the drugs. In three years, pill poppers are doing no better than those who didn't take amphetamines at all.</div><div><br />These are all facts presented in a blockbuster story in New York Time Magazine entitled <a href=\"https://www.nytimes.com/2025/04/13/magazine/adhd-medication-treatment-research.html\">Have We Been Thinking About A.D.H.D. All Wrong?</a>, which unpacks all the latest research on ADHD.",
            "title": "Normal boyhood is ADHD"
        },
        {
            "content": [
                "<p><em>(original post: <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of\">Come On, Obviously The Purpose Of A System Is Not What It Does</a>)</em></p><p>&#8230;</p><p>Thanks to everyone who commented on this controversial post.</p><p>Many people argued that the phrase had some valuable insight, but disagreed on what it was. The most popular meaning was something like &#8220;if a system consistently fails at its stated purpose, but people don&#8217;t change it, consider that the stated purpose is less important than some actual, hidden purpose, at which it is succeeding&#8221;. </p><p>I agree you should consider this, but I still object to the original phrase, for several reasons.</p><p><strong>First</strong>, although I agree you should <em>consider</em> it, the original phrase too strongly asserts that this is the only possible explanation. If there are three possible perspectives:</p><ul><li><p><em><strong>Naive</strong></em><strong>:</strong> A failing system is always pursuing its stated purpose as best it can. There could never possibly be any hidden motives going on.</p></li><li><p><em><strong>Paranoid</strong></em><strong>: </strong>A failing system is always caused by the people at the top deliberately wanting it to fail. Without these traitors, you could always accomplish everything perfectly with no tradeoffs.</p></li><li><p><em><strong>Balanced</strong></em><strong>: </strong>Systems can fail for many reasons. Sometimes it&#8217;s just a hard problem with tradeoffs. Sometimes it&#8217;s been perverted from its original goal by special interests. Sometimes it&#8217;s some third thing. Usually it&#8217;s a combination of all of these. You can&#8217;t know for sure until you look at it closely.</p></li></ul><p>&#8230;then I think the people who use the phrase want to imagine that they&#8217;re pushing people from Naive to Balanced. But I think the last person to hold the Naive perspective died sometime in the 1980s, and in real life POSIWID is mostly used to push people from the Balanced to the Paranoid perspective without actually looking at the system involved or arguing the case.</p><p><strong>And second</strong>, the explanation above is just the most popular of about a half-dozen different exegeses that commenters offered. So if you do want to communicate the thing I suggested above - which, reminder, is:</p><blockquote><p>If a system consistently fails at its stated purpose, but people don&#8217;t change it, consider that the stated purpose is less important than some actual, hidden purpose, at which it is succeeding</p></blockquote><p>&#8230;I think you should just say that, instead of the confusing version that half of your audience will misinterpret, and which incorrectly implies that this always happens.</p><p>When people insist on the confusing and inappropriately-strong version, I start to suspect that the confusingness is a feature, letting them smuggle in connotations that people would otherwise correctly challenge.</p><p>Hopefully this will become clearer as I answer your comments one by one, starting with:</p><div><hr /></div><p><strong>Charles Lehman</strong> <strong><a href=\"https://x.com/CharlesFLehman/status/1910694210182787184\">writes (X)</a>:</strong></p><blockquote><p>The actually useful insight from POSIWID is the negative corollary: there is \"no point in claiming that the purpose of a system is to do what it constantly fails to do.\"</p></blockquote><p>This was the original, less-catchy form, but it seems exactly the same to me, and equally wrong. </p><p>For example, Iran&#8217;s intelligence agency consistently fails to prevent Israel from infiltrating and attacking their nuclear program. But it&#8217;s very useful to claim that their purpose is to prevent this! If we both try to predict the behavior of Iranian intelligence, and I&#8217;m allowed to use the hypothesis &#8220;their purpose is preventing Israeli infiltration&#8221;, and you&#8217;re not allowed to use that hypothesis, I will consistently outpredict you. For example, I&#8217;ll be expecting them to interview security staff to see which ones are Israeli spies, try to intercept Israeli communications, and do other espionage activities, and you&#8217;ll still be stuck wondering whether they might take up gardening or ballet dancing.</p><p>The clear, natural language expression of this useful hypothesis is &#8220;the purpose of Iran&#8217;s intelligence forces is to prevent Israeli infiltration, but they usually fail&#8221;. This clear, natural language expression is great and tells you everything that you need to know. POSIWID (or its inverse) adds nothing except an attempt to ban this excellent and communicative expressive technology, in favor of some other vague meaning of &#8220;purpose&#8221; which can&#8217;t hang together and which nobody can really explain.</p><p><strong>Ersatz <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107852806\">writes</a>:</strong> </p><blockquote><p>&#8220;I thought the meaning was more something like &#8220;the system took these side effects into account and still considered that what it was doing was net positive in expectation, so the side effects are as much part of the system's purpose as the &#8216;positive&#8217; outcomes&#8221;.</p></blockquote><p>This is just diluting the word &#8220;purpose&#8221; into incoherence.</p><p>I think it&#8217;s useful linguistic technology to be able to say &#8220;The New York bus system both transports people from place to place, and emits lots of carbon dioxide. Its purpose is the transportation, and the carbon dioxide is an unfortunate side effect&#8221;.</p><p>If the goal of POSIWID is to insist that no, the transportation and the CO2 emissions are equally purposeful, or that we&#8217;re not allowed to talk about that question, then it sabotages our ability to communicate clearly, for no apparent gain.</p><p>Consider the New York carbon dioxide system, a hypothetical government department dedicated to emitting as much carbon dioxide as possible (why? to own the libs, of course!) Sometimes people drive motorcycles along its vast network of CO2 pipes, allowing them to travel from place to place. Is this exactly the same as the New York bus system? No? Why not? A natural answer would be &#8220;Because the bus system is aimed at transportation, but emits some CO2 as a minor side effect, and the CO2 system is aimed at emission, but facilitates transport as a minor side effect.&#8221;</p><p>If your objection is going to be that instead of considering purpose, you should restrict yourself to saying that one transports more people than it emits CO2, and the other emits more CO2 than it helps transport people, you&#8217;ve now legislated that we must list exactly how many people the New York bus system transports, and how much carbon dioxide it emits, and how many ants it crushes, etc, every time we talk about it. But most people who talk about the bus system don&#8217;t know these statistics, and don&#8217;t have to. It&#8217;s sufficient (and linguistically convenient) to say &#8220;Its purpose is transportation, not CO2 emission or ant-crushing.</p><p><strong>Andrew Pearson <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107852806\">writes</a>: </strong></p><blockquote><p>The steelman of the phrase, which <em>might</em> be what Stafford Beer had in mind when he coined the phrase, is that in large complex organisations it's very hard for individual workers to see a link between what they do and the stated purpose of the organisation - people just get on and do what they're told, and orient themselves more towards \"doing what they're already doing, just more effectively\" than towards \"fulfilling the stated purpose of the organisation\".</p></blockquote><p>I don&#8217;t think this is a great steelman. True, the average employee&#8217;s actions don&#8217;t obviously connect to the organization&#8217;s stated purpose. But the average employee&#8217;s actions also don&#8217;t obviously connect to what the organization does.</p><p>If the stated purpose of the US military is to protect America, and what it does is bomb Middle Eastern weddings, both of those are equally remote from the day-to-day life of some low-level employee who just counts the number of screws in a warehouse.</p><p><strong>Aashish Reddy <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107853542\">writes</a>:</strong></p><blockquote><p>I think POSIWID is best applied to bureaucracies or large structures where the reason bad outcomes occur is not because of difficult battles with reality (like government or hospitals or the Ukrainian military), but because of the way incentives are set up in the system.</p><p>If someone said, &#8220;the purpose of the Civil Service is to drive through new, innovative ways of delivering rapid change!&#8221;, that would clearly be absurd. <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107853542\">That may be their goal, or how they see themselves</a>; but the purpose of the system is not defined by either of those things. If it was, they wouldn&#8217;t incentivise caution and slowness. Whether that&#8217;s good or not, the purpose of the Civil Service is best approximated by what it does!</p></blockquote><p>I want to pay more attention to the word &#8220;goal&#8221; in the second sentence of the second paragraph:</p><blockquote><p> &#8220;[Driving innovative change] may be their <strong>goal</strong>, or how they see themselves.&#8221;</p></blockquote><p>It sounds like Aashish think it&#8217;s useful to use the word &#8220;goal&#8221; to discuss what a system is trying to do, separately from what it does or doesn&#8217;t accomplish. I agree! I just think &#8220;purpose&#8221; is a synonym for goal.</p><p>If you use POSIWID, you have to posit some kind of weird new ontology where &#8220;purpose&#8221; means the opposite of &#8220;goal&#8221;. If you don&#8217;t use POSIWID, you can just keep the words &#8220;purpose&#8221; and &#8220;goal&#8221; having their regular everyday meaning, and describe this state of affairs with phrases like &#8220;The goal/purpose of the Civil Service is to deliver rapid change, but due to perverse incentives, its actual effect is to prevent change.&#8221;</p><p><strong>Kay <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107853788\">writes</a>:</strong></p><blockquote><p>For example, the US policing and criminal justice system and prisons seem to continually over imprisons people in general, and especially people of colour. These systems seem not to be changed, while they ostensibly truly could be. So to me this seems that the system may be working \"to purpose\" for the actors who want it to work that way.</p></blockquote><p>This is interesting because Kay is using a left-wing example: &#8220;The criminal justice system imprisons too many people of color, so its purpose is to oppress black people&#8221;. </p><p>But one of the tweets in my original post was close to its right-wing opposite: &#8220;The criminal justice system consistently lets criminals off with a slap on the wrist, so its purpose is to get people raped and murdered.&#8221;</p><p>As long as people are thinking in these terms, they&#8217;re going to be prey for whichever conspiracy theory best suits their pre-existing prejudices. I think both of these are worse than the Balanced View version:</p><blockquote><p>Some people care a lot about keeping people safe from crime, but other people care a lot about the human rights of suspects and convicts. The incarceration rate is a balance between these two forces, with some lesser contribution from sinister forces like private prison owners who want to increase incarceration to line their pockets.</p></blockquote><p>This has the advantage of being obviously true (there are pro-tough-on-crime activist groups and pro-soft-on-crime activist groups, they both do effective activism for their chosen cause, and the exact incarceration rate depends on which ones are in the ascendant and have the ear of politicians), and not being a conspiracy theory that forces you to believe that the government is a monolithic entity that really wants people to be raped and murdered.</p><p><strong>NegatingSilence <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107853513\">writes</a>:</strong></p><blockquote><p>Come on, obviously \"The Purpose of a System is What it Does\" is meant to draw your attention to the incentives in cases where something different is happening than is supposed to be happening.</p><p>My government purposefully raised housing prices for the benefit of people who own assets. They talk about \"trying\" to make things more affordable, but somehow they only succeeded in raising the cost by 500% in nominal terms. What a curious result.</p></blockquote><p>I don&#8217;t know what country this person is in. But in <em>my</em> country, housing prices are high because of a combination of all of the following: </p><ol><li><p>Citizens want to preserve &#8220;neighborhood character&#8221;: they currently live in a low-density low-crime low-traffic pretty suburb, they want it to remain a low-density low-crime low-traffic pretty suburb, and they worry that building new homes threatens that status.</p></li><li><p>Environmentalists want to preserve natural environments, so they make it illegal to build houses on unoccupied land.</p></li><li><p>Leftists want to prevent gentrification, so they thwart any new housing that rich people might move into.</p></li><li><p>Economically illiterate people think that market-rate housing somehow makes all other housing less affordable, or have some sense that anything which is good for &#8220;greedy&#8221; developers must be bad for the average person, so they&#8217;re against market-rate housing.</p></li><li><p>Investors bid up the price of houses for complicated non-market reasons (e.g. Chinese people looking for assets to store wealth outside of China), then don&#8217;t rent them out.</p></li><li><p>Homeowners want to preserve or increase the value of their houses.</p></li></ol><p>Of these, I think 6 is one of the less important ones - if this were the dominating factor, people would support upzoning, since it usually raises the value of properties in the upzone (if developers can build skyscrapers on your land, then your land value goes up relative to the profitability of skyscrapers). But part of the problem is that people don&#8217;t support upzoning. So 6 can&#8217;t be the dominating factor.</p><p>Without POSIWID, people could think about all of these possibilities and come to their own conclusions. POSIWID tries to ban thinking about 1-5 by fiat, insisting that 6 is the only possible explanation and anyone considering the others is naive. I think this makes it a bad heuristic.</p><p>But there are two more concerning things about how Negating is using POSIWID.</p><p>First, he&#8217;s picking out one particularly salient thing the system does (raise house prices) and claim that&#8217;s &#8220;the&#8221; purpose. He could equally well pick any of the other results - preserve neighborhood character, protect the environment, help Chinese people escape currency controls. Like I said in the original post, in practice POSIWID serves as justification for paranoia - whatever effect you like least, whatever possibility would be most sinister - that&#8217;s the one that the system is intentionally aiming for.</p><p>Second, he&#8217;s saying it&#8217;s the purpose of &#8220;the&#8221; system. <em>Which</em> system? I bet whatever government he&#8217;s talking about has some organization called the Affordable Housing Bureau, or whatever. And I bet that the Affordable Housing Bureau really does make housing slightly more affordable, relative to the counterfactual where it doesn&#8217;t exist. It&#8217;s just that lots of other government, market, and social forces conspire to make it much less affordable. If Negating were to claim &#8220;The purpose of the Affordable Housing Bureau is to make housing less affordable&#8221;, this would be false even if the overall picture (the government is deliberately raising real estate prices) were true.</p><p><strong>Brad <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107853994\">writes</a>: </strong></p><blockquote><p>I have to toss in Pournelle's Iron Law. The purpose of a system - when it is first established - may be dramatically different from the purpose it assumes after a few years.</p><p>Consider: You establish a system to solve a problem. That could be homelessness, or asylum, or drug abuse, or any of a number of other things. This system employs people, who then have an automatic interest - not in solving the problem - but in prolonging it, even in making it worse. After all, without the problem, the organization would not need to exist.</p></blockquote><p><strong>And hwold <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107856437\">writes</a>:</strong></p><blockquote><p>I see it used as \"if you have a complex system/bureaucracy to solve X, then the incentives inside it is for X to get worse, and incentives will not have 0 influence on outcomes\" For example : <a href=\"https://x.com/Devon_Eriksen_/status/1906042672499864034\">https://x.com/Devon_Eriksen_/status/1906042672499864034</a></p></blockquote><p>I think this sounds profound on first glance, and it&#8217;s probably true in some cases. But it&#8217;s not nearly true enough to be an Iron Law. Try to think about it in specific Near Mode cases:</p><p>If you eliminated police, would crime go down, because the police have an incentive to preserve crime?</p><p>If you eliminated the fire department, would fires go down, because the fire department has an incentive to preserve fire?</p><p>If you eliminated doctors, would cancer deaths go down, because doctors have an incentive to preserve cancer deaths?</p><p>If you eliminated the FDA, would dangerous drug side effects go down, because the FDA has an incentive to preserve dangerous drug side effects?</p><p>If you eliminated the Federal Reserve, would bank runs go down, because the Federal Reserve has an incentive to preserve bank runs?</p><p>Brad&#8217;s original comment mentions homelessness and drug abuse, but I know some drug abuse doctors, and they&#8217;re (mostly) good people who do their best in a tough situation. Drug abuse doesn&#8217;t continue because drug abuse doctors are secretly ensuring it continues to help their bottom line. Drug abuse continues because fentanyl is really, really addictive.</p><p>Even good conspiracy theories don&#8217;t work like this. Was there a conspiracy among pain pill manufacturers to addict people? Yeah, kinda, although I think the degree to which this caused the opioid crisis is pretty overblown. But the pain pill manufacturers weren&#8217;t a system dedicated to preventing addiction. They did their job (reduce pain) fine, then ran an unrelated evil conspiracy on the side!</p><p><strong>Breb <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107854428\">writes</a>: </strong></p><blockquote><p>This way of thinking may result from taking a strategy for predicting the motives of individuals, and using it to predict the motives of organisations. \"Cui bono?\" works when you're considering a single action carried out by a single person at a single moment in time, but it doesn't really work when you're considering the behaviour of hundreds of people who are incentivised to somewhat-but-not-perfectly cooperate over a long period to somewhat-but-not-perfectly implement a goal that was established by someone who somewhat-but-not-perfectly understands that that goal is just an instrument to attain a larger, more complex goal set by somebody else.</p></blockquote><p>I&#8217;m against this for individuals too!</p><p>There are a million self-help gurus who try to convince you that that if you procrastinate - let&#8217;s say you always do term papers the night before and get terrible grades and it&#8217;s threatening your ability to complete college - then it must be because this secretly benefits you in some way. Maybe your overly-strict father wants you to complete college, and you&#8217;re deliberately trying to fail as a secret act of rebellion against him hidden even from yourself. Although something like this might sometimes be true, more often a clearer understanding of the circuitry involved (in this case, <a href=\"https://picoeconomics.org/PDFarticles/Breakdown_Will.pdf\">hyperbolic discounting</a>) saves you from these labyrinths and lets you think about things straightforwardly again.</p><p><strong>Tom J <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of\">writes</a>:</strong></p><blockquote><p>In the original Stafford Beer sense, the slogan POSIWID means that you can't tell from outside the system whether any given behaviour was *intended* or not. For the purposes of objective analysis, you have to treat your system as a black box that *does* whatever it's observed to do, as opposed to what people *claim* the point of the system is.</p></blockquote><p>This may be true in cybernetics. Or it may be an interesting methodological commitment, in the same way that the behaviorists&#8217; &#8220;assume there is no such thing as human interiority&#8221; was an interesting methodological commitment. But I don&#8217;t think it&#8217;s common or valuable in normal-life analysis of social systems.</p><p>When Biden bans NVIDIA from sending advanced chips to China, black box analysis would have to be ambivalent between explanations like:</p><ol><li><p>Biden personally hates Jensen Huang and wants his company to suffer</p></li><li><p>Biden thinks NVIDIA produces bad chips and wants to save China from buying inferior products.</p></li><li><p>Biden wants to incentivize China to manufacture their own chips.</p></li><li><p>Biden wants to slow down Chinese AI.</p></li><li><p>Biden wants to slow down Chinese cryptocurrency mining.</p></li><li><p>Biden is angry at China over something else (the Uighurs?) and wants to punish them.</p></li><li><p>Biden supports Xi&#8217;s campaign to prevent Chinese people from getting addicted to video games, and wants to keep video-game-enabling GPUs out of the country.</p></li></ol><p>&#8230;and design experiments to distinguish between these, or wait for more chip sanctions to see how they pan out.</p><p>But in real life, we can be very sure some of these (like 2 and 7) weren&#8217;t intended, and others (like 4) were. Why? Some combination of trusting Biden&#8217;s stated goals, psychoanalyzing Biden&#8217;s plausible goals, checking who lobbied Biden to do this, and reading enough international relations journals to get a sense of what policymakers are thinking about.</p><p>I think it&#8217;s fine to do black box systems analysis, just like it&#8217;s fine to do behaviorism. But we should view these as methodological commitments for a specific group, rather than good strategies for normal people.</p><p><strong>Jared Peterson (<a href=\"https://jtpeterson.substack.com/\">blog</a>) writes:</strong></p><blockquote><p>This originally struck me as rather silly and as an obvious misinterpretation of an idea that has nothing to do with human intentions...then I read the comments and saw many people claiming exactly that!</p><p>Donella Meadows is an important figure in the field of Systems Thinking, and says by definition (whether human designed or not), systems have a purpose.</p><p>\"A system&#8217;s function or purpose is not necessarily spoken, written, or expressed explicitly, except through the operation of the system. The best way to deduce the system&#8217;s purpose is to watch for a while to see how the system behaves. Purposes are deduced from behavior, not from rhetoric or stated goals&#8221;</p><p>One way to think about this is that Meadows would be OK talking about Molochs purpose as something coherent. Is changing the climate the purpose of modern capitalism? In one sense, no. But simultaneously, it is perfectly coherent to talk about the system as having that exact purpose because the system seems to work towards that goal. Even if you push against the system, the system seems to adapt and continue with that goal anyways. There is something almost intelligent about systems where they seem to work towards goals that no one ever intended.</p><p>But the phrase isn't about human goals at all!</p></blockquote><p>Oh! I agree this makes sense if you need to talk about the &#8220;purpose&#8221; of an un-designed system with no humans in it.</p><p><strong>Moonshadow <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107858633\">writes</a>: </strong></p><blockquote><p>This sentiment is grasping towards the same sort of place as your \"Meditations on Moloch\" essay.</p><p>No-one involved in the system wants what the system actually ends up doing. But whatever their individual intents, /the system as a whole/, if allowed to grow naturally, inevitably ends up doing what Moloch wants.</p><p>Of course the purpose we intended for the system isn't really that, any more than Moloch really exists. But you can't begin the meta level fight - of designing the system's high level organisational structures and incentives to try to reduce this effect, instead of letting it emerge organically like it always does - unless you first admit the problem.</p></blockquote><p>I agree this is a useful thing to talk about, I just don&#8217;t think &#8220;purpose&#8221; is the right word for it. I&#8217;m not even sure &#8220;system&#8221; is the right word for it. </p><p>A good example of Moloch would be two countries having a nuclear arms race. But how is this POSIWID? The purpose of the . . . system of two countries . . . is to . . . have a nuclear arms race? This is pretty different from how I usually hear it used.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6929f8eb-51df-403a-8666-268f9f1f034f_529x185.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Tweet: &quot;We *have* a world government, it's just that it makes decisions by threatening itself with nukes.&quot; - Steven Kaas\" class=\"sizing-normal\" height=\"185\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6929f8eb-51df-403a-8666-268f9f1f034f_529x185.png\" title=\"Tweet: &quot;We *have* a world government, it's just that it makes decisions by threatening itself with nukes.&quot; - Steven Kaas\" width=\"529\" /><div></div></div></a><figcaption class=\"image-caption\">But here is a dissenting voice.</figcaption></figure></div><p><strong>Ajb <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107859117\">writes</a>: </strong></p><blockquote><p>POSIWID was not originally an antagonistic political snark. It's perfectly sensible to notice that a system may be fulfilling other purposes than it does officially, and this is not incompatible with it operating in good faith. You can think of it as a bit like Chesterton's fence:</p><p>* to reform a system you should understand what purposes it fulfills, not just what it is officially supposed to do</p><p>* These additonal or alternative purposes may in fact be desirable ones that you should avoid breaking.</p><p>Cybernetics (where the phrase originated) drew a lot of inspiration from biology, and there obviously nothing has an 'official purpose' at all. But it nevertheless has organisation and is functional.</p></blockquote><p><strong>Rob <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107879319\">writes</a>:</strong></p><blockquote><p>The problem with quoting aphorisms like this is that it misses the context - specifically the context of a management consultant (viz. Stafford Beer) who spends his entire life being told about systems his clients have put in place, with some stated purpose in mind. Those systems do not achieve their stated purposes, but can be continually defended against change by re-stating the purpose - this shouldn't work, but in practice it often does, because most people aren't great at decoupling intent from outcome. \"The purpose of a system is what it does\" is a good rhetorical counter, because it acknowledges that, in practice, any continuation of a system with known outcomes is a tacit acceptance of those outcomes as the system's real purpose. You don't get to claim some other \"real\" purpose once you know what the outcomes are.</p><p>My interpretation has always been in the spirit of this tweet: <a href=\"https://x.com/primawesome/status/1178671690261286918?lang=en\">https://x.com/primawesome/status/1178671690261286918?lang=en</a></p><p>&gt; My neighbor told me coyotes keep eating his outdoor cats so I asked how many cats he has and he said he just goes to the shelter and gets a new cat afterwards so I said it sounds like he&#8217;s just feeding shelter cats to coyotes and then his daughter started crying.</p></blockquote><p>I agree this makes more sense in the context of some supposed person claiming that &#8220;the system has good intentions&#8221; means they should never have to change the system. I don&#8217;t think I really see this failure mode. </p><p>I bet a lot of you are going to yell at me and say that, I don&#8217;t know, homelessness or something is like this. But defenders of the current homelessness system never say you can&#8217;t change it <em>because</em> it had good intentions when it started. I predict they would say that their own group is doing good work, and it&#8217;s everyone else who needs to change. Or that the current system works a little and just needs to be funded more. Or that the current system is better than nothing, and your proposed attempt to &#8220;change&#8221; it is secretly a plan to gut it and leave homeless people without help. </p><p>I definitely don&#8217;t think they&#8217;d say &#8220;Yes, your proposed change would improve the system, but you&#8217;re not allowed to make it because the people who designed the current system had good intentions&#8221;.</p><p><strong>Leah Libresco Sargeant <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107885555\">writes</a>:</strong></p><blockquote><p>I think the Catholic principle of double effect is helpful here. This often comes up in the case of eg delivering a baby pre-viability because the mom has an infection that will progress to sepsis and death if she and the baby aren&#8217;t separated.</p><p>The three criteria are:</p><ul><li><p>the nature of the act is itself good, or at least morally neutral;</p></li><li><p>the agent intends the good effect and does not intend the bad effect, either as a means to the good or as an end in itself;</p></li><li><p>the good effect outweighs the bad effect in circumstances sufficiently grave to justify causing the bad effect and the agent exercises due diligence to minimize the harm</p></li></ul><p>And I think it&#8217;s the second that&#8217;s most relevant to POSIWID. If the system could switch to doing the good without the bad, would it happily make the switch?</p><p>For the cancer hospital: yes!</p><p>For NEPA: I think not.</p></blockquote><p>This is an interesting test, thanks. My only concern is that &#8220;if the system could switch&#8221; is kind of meaningless. When we ask whether the purpose of a charity is to help the poor, or just to give high salaries to its CEO, the test urges us to ask &#8220;If it could switch to helping the poor just as much without paying its CEO anything, would it do that?&#8221; What if the answer is &#8220;the board, low-level staff, and donors would support this, but the CEO wouldn&#8217;t,&#8221; and the charity&#8217;s actions come from compromises negotiated among these groups? What is the purpose of the charity then?</p><p><strong>TimG <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107859891\">writes</a>:</strong></p><blockquote><p>I've seen reports (don't know how true) that NGOs in San Fran get paid a lot of money to solve homelessness. But after billions spent, homelessness is worse.</p><p>I thought this saying was a kinda reference to that sort of thing: the NGOs are there to collect money by virtue of the fact that there are homeless. Which is not what they are purported to do.</p></blockquote><p>My understanding of the situation is that there are many groups. </p><p>Some are traditional anti-homelessness groups that try to build homeless shelters or something.</p><p>Others are homeless-rights-advocacy groups that try to prevent the police from doing things which they think violate homeless people&#8217;s rights, like forcing them to go to shelters.</p><p>It&#8217;s true that these two purposes are at odds, and that this conflict prolongs homelessness in San Francisco.</p><p>But I think that thinking of this as a &#8220;system&#8221; whose &#8220;purpose&#8221; is to preserve homelessness (because systems actually act in ways contradictory to their goals) makes you less able to understand the dynamics, not more!</p><p>The build-shelter groups are mostly building shelters! The fight-against-shelters groups are mostly fighting against shelters! Both of them are doing what they claimed to do, and it&#8217;s all canceling out. The more you are tempted to think of [the set of both these groups] as a single &#8220;system&#8221; fulfilling a single &#8220;purpose&#8221;, the more confused you&#8217;re making yourself.</p><p><strong>Brett <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107860079\">writes</a>: </strong></p><blockquote><p>I've always thought of the phrase as an argument against the \"no true Scotsman\" fallacy when it's used in an organisational setting. When there are significant failings of an organisation, the response (within the organisation) can sometimes be: \"there are some bad apples working against the purpose of our system: our system is not supposed to do this and the failings are due to individuals and not the system itself\". POSIWID then is applicable: you can't claim a system \"isn't supposed to\" do something, if it's repeatedly doing it on a large enough scale.</p></blockquote><p>I don&#8217;t think this works.</p><p>Often failures <em>are</em> because of incompetent individuals. For example, one reason that UK intelligence agencies did such a bad job fighting Communism in the &#8216;40s and &#8216;50s was that lots of their staff, including some leaders, were Soviet spies. When those people were replaced, results improved! And there are plenty of stories of companies that turn around once a few bad executives get fired and replaced (eg Apple after Jobs came back).</p><p>So why would we want a phrase saying that the failure of systems is never because of incompetent individuals?</p><p><strong>David Henry (<a href=\"https://davidahenry.substack.com/\">blog</a>) <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107867285\">writes</a>:</strong></p><blockquote><p>It makes the most sense if you don't take it as having anything to do with intentions.</p><p>The truth at which it gestures is \"This system can be relied upon to consistently produce this outcome, just as if it were designed to do so.\"</p><p>The point is to suggest that the \"unintended side effects\" are a direct result of the \"rules\" of the system, intentionally so or not, and therefore you can't ignore them as one-off incidents, or hope a minor patch will fix it. The system needs to be abolished, or else given a complete overhaul.</p><p>Obviously the ambiguous phrasing also allows you to assign insanely hostile and nonsensical motives to the outgroup. I would like to think this was not intention of the people who came up with the phrase, but whether it is or not, it can be relied upon to consistently produce that outcome.</p></blockquote><p>I agree this is one of many possible meanings it could have which there are much better ways to phrase.</p><p><strong>Joost de Wit <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of/comment/107860422\">writes</a>:</strong></p><blockquote><p>I&#8217;d say the hospital is precisely designed to cure 66% of people because it operates within constraints (financial, #doctors, approved meds). A &#8220;system&#8221; designed to cure let&#8217;s say 99% of people would look wholly different.</p></blockquote><p>I have occasionally been a low-level representative in hospital administration meetings. I&#8217;m trying to to think of what suggestions I could given to &#8220;redesign&#8221; the hospital to cure 99% of people. &#8220;Hey, guys, have you considered having more money?&#8221; I guarantee the hospital has considered this. The reason they don&#8217;t have more money is that insurance companies won&#8217;t pay more for care and donors won&#8217;t donate more.</p><p>Maybe you could bring it up a level, to the US health care system as a whole? But insofar as anyone is in charge here (maybe the Secretary of Health and Human Services), I guarantee that person has also considered getting more money. The reason they don&#8217;t have more money is that Congress and the President set their budget and balance it off against their other priorities.</p><p>Maybe the system is America as a whole? In this case yeah, you could imagine an America redesigned completely around cancer care, where there are sky-high taxes and all the money goes to cancer hospitals, so much so that bridges collapse and the military can&#8217;t defend the country anymore because we&#8217;re spending all the money on hospitals. But what does it mean to have a &#8220;systems analysis&#8221; principle which is incapable of accurately analyzing any system smaller than the whole country?</p><p>Also, shouldn&#8217;t we expect a good theory to yield true predictions? My theory is that cancer hospitals want to cure as many patients as possible (given other constraints). If I recommended them a new policy that would increase their cure rate, they might worry about cost or hassle - but if it were low-cost and low-hassle, they&#8217;d eventually implement it. But if you recommended a new policy that brought them closer to 66% (&#8220;We&#8217;re on track to rise to 70% next year, but if we get Dr. Smith to relapse back into alcoholism, we can go back to 66%!&#8221;) they would call you insane and fire you immediately and definitely not agree. </p><p>Since &#8220;make cure rates as high as possible&#8221; accurately predicts the hospital&#8217;s behavior, but &#8220;keep cure rates at exactly 66%&#8221; doesn&#8217;t, why would you describe the second one as the &#8220;purpose&#8221;? What use is it to accuse them of having a &#8220;purpose&#8221; which they will never take any action to achieve?</p><p>But also, what are even we doing here? In real life, nobody says things like &#8220;the purpose of a cancer hospital is to keep cure rates at 66%&#8221;. Why are people defending this inane statement so hard? This reminds me of the old atheism-religion debates, where some atheist would bring up an awkwardly-phrased Bible statement, and the religious people would contort themselves to say that nooooooo, it&#8217;s totally true that the world was created in seven days, as long as you define day to mean &#8220;any time period of an indeterminate length&#8221;. But at least their motives make sense to me; lots of other things depend on whether Bible verses are true or false. POSIWID was first coined in 2001. Why should people contort themselves to defend this extremely poorly-phrased thing?</p><p>In this comment thread, people have claimed that the <em>real</em> meaning of POSIWID is:</p><ul><li><p>Chesterton&#8217;s Fence</p></li><li><p>Moloch</p></li><li><p>Alienation of labor</p></li><li><p>Pournelle&#8217;s Iron Law of Bureaucracy</p></li><li><p>People follow incentive gradients</p></li><li><p>If nothing is changed, things will stay the same</p></li><li><p>If a system keeps going despite side effects, it&#8217;s okay with those side effects</p></li><li><p>If a system has side effects, those side effects are secretly the whole point</p></li><li><p>It&#8217;s about machines and was never intended to apply to social systems</p></li></ul><p>These are pretty different things! So I continue to think that, if you like one of them, you should consider the possibility that this phrase isn&#8217;t a clear way to communicate the thing you like.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://x.com/slatestarcodex/status/1911072565491339604\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Tweet: &quot;Thanks to everyone who chimed in with criticism of my recent POSIWID post. If I understand you all correctly, you think that Stafford Beer had good intentions when he invented the phrase, and that's more important than how it gets misused in real life. Enlightening!&quot; - Scott Alexander\" class=\"sizing-normal\" height=\"185\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2d36712c-764f-430b-aafa-a520a06bcbcf_521x185.png\" title=\"Tweet: &quot;Thanks to everyone who chimed in with criticism of my recent POSIWID post. If I understand you all correctly, you think that Stafford Beer had good intentions when he invented the phrase, and that's more important than how it gets misused in real life. Enlightening!&quot; - Scott Alexander\" width=\"521\" /><div></div></div></a></figure></div><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/highlights-from-the-comments-on-posiwid",
            "publishedAt": "2025-04-15",
            "source": "SlateStarCodex",
            "summary": "<p><em>(original post: <a href=\"https://www.astralcodexten.com/p/come-on-obviously-the-purpose-of\">Come On, Obviously The Purpose Of A System Is Not What It Does</a>)</em></p><p>&#8230;</p><p>Thanks to everyone who commented on this controversial post.</p><p>Many people argued that the phrase had some valuable insight, but disagreed on what it was. The most popular meaning was something like &#8220;if a system consistently fails at its stated purpose, but people don&#8217;t change it, consider that the stated purpose is less important than some actual, hidden purpose, at which it is succeeding&#8221;. </p><p>I agree you should consider this, but I still object to the original phrase, for several reasons.</p><p><strong>First</strong>, although I agree you should <em>consider</em> it, the original phrase too strongly asserts that this is the only possible explanation. If there are three possible perspectives:</p><ul><li><p><em><strong>Naive</strong></em><strong>:</strong> A failing system is always pursuing its stated purpose as best it can. There could never possibly be any hidden motives going on.</p></li><li><p><em><strong>Paranoid</strong></em><strong>: </strong>A failing system is always caused by the people at the top deliberately wanting it to fail. Without these traitors, you could always accomplish everything perfectly with no tradeoffs.</p></li><li><p><em><strong>Balanced</strong></em><strong>: </strong>Systems can fail for many reasons. Sometimes it&#8217;s just a hard problem with tradeoffs. Sometimes it&#8217;s been perverted from its original goal by special interests. Sometimes it&#8217;s",
            "title": "Highlights From The Comments On POSIWID"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-04-15"
}