{
    "articles": [
        {
            "content": [],
            "link": "https://overreacted.io/hire-me-in-japan/",
            "publishedAt": "2025-11-11",
            "source": "Dan Abramov",
            "summary": "I'm looking for a new job.",
            "title": "Hire Me in Japan"
        },
        {
            "content": [
                "<p><img alt=\"&quot;Theseus Fighting the Centaur Bianor&quot;, by Antoine-Louis Barye, 1867\" src=\"https://www.dbreunig.com/img/fighting_a_centaur.jpg\" /></p>\n\n<p>For the first year or so, one of the most annoying problems faced by building with AI was getting them to generate output with consistent formatting. Go find someone who was working with AI in 2023 and ask them what they did to <em>try</em> to get LLMs to consistently output JSON. You’ll get a thousand-yard stare before hearing about all-caps commands, threats towards the LLM, promises of <em>bribes</em> for the LLM, and (eventually) resorting to regular expressions.</p>\n\n<p>Today, this is mostly a solved problem, but the <em>cause</em> of this issue remains, frustrating today’s context engineers. It’s a context failure I missed in my <a href=\"https://www.dbreunig.com/2025/06/22/how-contexts-fail-and-how-to-fix-them.html\">original list</a>. I call it <strong>Fighting the Weights</strong>: when the model won’t do what you ask because you’re working against its training.</p>\n\n<hr />\n\n<p>In 2020, OpenAI unveiled GPT-3 alongside a key paper: “<a href=\"https://arxiv.org/abs/2005.14165\">Language Models are Few-Shot Learners</a>.” In this paper, OpenAI researchers showed that LLMs as large as GPT-3 (10x larger than previous language models) could perform tasks when provided with only a few examples. At the time, this was earth-shaking.</p>\n\n<p>Pre-GPT-3, language models were only useful after they’d been fine-tuned for specific tasks; after their <em>weights</em> had been modified. But GPT-3 showed that with enough scale, LLMs could be problem-solving generalists if provided with a few examples. In OpenAI’s paper they coined the term “<strong>in-context learning</strong>” to describe an LLM’s ability to perform new types of tasks using examples and instructions contained in the prompt.</p>\n\n<p>Today, <strong>in-context learning</strong> is a standard trick in any context engineer’s toolkit. Provide a few examples illustrating what you want back, given an input, and trickier tasks tend to get more reliable. They’re especially helpful when we need to induce a specific format or style or convey a pattern that’s difficult to explain<sup id=\"fnref:claude\"><a class=\"footnote\" href=\"https://www.dbreunig.com/2025/11/11/don-t-fight-the-weights.html#fn:claude\" rel=\"footnote\">1</a></sup>.</p>\n\n<p>When you’re not providing examples, you’re relying on the model’s inherent knowledge base and weights to accomplish your task. We sometimes call this “<strong>zero-shot prompting</strong>” (as opposed to <em>few</em> shot<sup id=\"fnref:shot\"><a class=\"footnote\" href=\"https://www.dbreunig.com/2025/11/11/don-t-fight-the-weights.html#fn:shot\" rel=\"footnote\">2</a></sup>) or “<strong>instruction-only prompting</strong>”.</p>\n\n<p>In general, prompts fall into these two buckets:</p>\n\n<ol>\n  <li><strong>Zero-Shot or Instruction-Only Prompting:</strong> You provide instructions <em>only</em>. You’re asking the model to apply knowledge and behavioral patterns that are encoded in its weights. If this produces unreliable results, you might use…</li>\n  <li><strong>Few-Shot or In-Context Learning:</strong> You provide instructions <em>plus examples</em>. You’re demonstrating a new behavioral pattern for the model to apply. The examples in the context <em>augment</em> the weights, providing them with details for a task it hasn’t seen.</li>\n</ol>\n\n<p>But there’s a third case: when the model <em>has</em> seen examples of the behavior you’re seeking, but it’s been trained to do the opposite of what you want. This is <em>worse</em> than the model having no knowledge of a pattern, because what it knows is at odds with your goal.</p>\n\n<p>I call this <strong>fighting the weights</strong>.</p>\n\n<p>Here’s some ways we end up fighting the weights:</p>\n\n<ul>\n  <li><strong>Format Following:</strong> You want the model to output only JSON, but often it will provide some text explaining the JSON and wrap the JSON in Markdown code blocks. This happens because the model’s post-training taught it to be conversational. When ChatGPT first launched, this problem was <em>rough</em>. GPT-3.5 had been heavily trained by humans to converse in a friendly, explanatory manner. So it did – even when you asked it not to. This doesn’t happen as much as it used to, but we’ll occasionally run into this issue when using unique formats or when using smaller models.</li>\n  <li><strong>Tool Usage Formatting:</strong> As model builders start training their models to use tools, via reinforcement learning, they select specific formats and conventions. If your environment doesn’t follow these conventions, the model often fails to call tools correctly. I first noticed this while testing Mistral’s <a href=\"https://huggingface.co/mistralai/Devstral-Small-2505\">Devstral-Small</a>, which was <a href=\"https://huggingface.co/mistralai/Devstral-Small-2505/discussions/9\">trained with the tool-calling format</a> <a href=\"https://openhands.dev\">All Hands</a> uses. When I tried to use Devstral with <a href=\"https://cline.bot\">Cline</a>, it failed basic tasks. Last month this came up when a friend was trying Kimi K2 with a DSPy pipeline. By default, DSPy formats prompts with a <a href=\"https://dspy.ai/api/adapters/ChatAdapter/\">Markdown-style template</a>. When this pipeline was driven by K2, formatting failed. Thanks to my recent <a href=\"https://www.dbreunig.com/2025/07/30/how-kimi-was-post-trained-for-tool-use.html\">dive into how Moonshine trained K2 to use tools</a>, I knew K2 was trained with XML formatting. Switching DSPy to XML formatting solved the problem instantly.</li>\n  <li><strong>Tone Changes:</strong> It’s really hard to apply consistent tone instructions to LLMs. Sure, we can make them talk like a pirate or in pig-latin, but subtle notes are overwhelmed by the model’s conversational post-training. For example, here’s the one note I give Claude in my settings: “Don’t go out of your way to patronize me or tell me how great my ideas are.” This does <em>not</em> stop Claude from replying with cloying phrases like, “Great idea!” when I suggest changes.</li>\n  <li><strong>Overactive Alignment:</strong> Speaking of Claude: I appreciate Anthropic’s concern for alignment and safety in their models, but these guardrails can be overzealous. A recent example comes from Armin Ronacher, <a href=\"https://x.com/mitsuhiko/status/1986833561287024897\">who tried several different approaches to get Claude Code to modify a medical form PDF while debugging PDF editing software</a>. Armin asked several different ways, but Claude’s post-training alignment refused to budge.</li>\n  <li><strong>Over Relying On Weights:</strong> Models are trained to utilize the knowledge encoded in their weights. But there are many times when you want them to <em>only</em> answer with information provided in the context. Perusing <a href=\"https://github.com/x1xhlol/system-prompts-and-models-of-ai-tools\">leaked system prompts</a>, you can see how many instructions each chatbot maker gives when it comes to <em>when</em> models should search to obtain more info. The models have been trained to use their weights, so plenty of reiteration and examples are needed. This problem is especially tricky when building RAG systems, when the model should only form answers based on information obtained from specific databases. Companies like <a href=\"https://contextual.ai\">Contextual</a> end up having to fine-tune their models to ensure they only answer with fetched information.</li>\n</ul>\n\n<p>Perhaps my favorite example I’ve seen was from ChatGPT. Previously, you could turn on the web inspector in your browser and watch the LLM calls fly by as you used the chatbot. This was handy for seeing when additional messages were added, that you didn’t write. When you asked ChatGPT to generate an image, it would clean up or <a href=\"https://www.dbreunig.com/2025/03/16/overcoming-bad-prompts-with-help-from-llms.html\">even improve your image prompt</a>, create the image, then <a href=\"https://x.com/dbreunig/status/1952051780424196513/photo/1\">append the following instructions</a>:</p>\n\n<blockquote>\n  <p>GPT-4o returned 1 images. From now on, do not say or show ANYTHING. Please end this turn now. I repeat: From now on, do not say or show ANYTHING. Please end this turn now. Do not summarize the image. Do not ask followup question. Just end the turn and do not do anything else.</p>\n</blockquote>\n\n<p>This is textbook fighting the weights. The models powering ChatGPT have been post-trained heavily to always explain and prompt the user for follow up actions. To fight these weights, ChatGPT’s devs have to tell the model EIGHT TIMES to just, please, <em>shut up.</em></p>\n\n<hr />\n\n<p>For context and prompt engineers (and even chatbot users) it’s helpful to be able to recognize when you’re <em>fighting the weights</em>.</p>\n\n<p>Here’s some signs you might be fighting the weights:</p>\n\n<ul>\n  <li>The model makes the same mistake, even as you change the instructions.</li>\n  <li>The model acknowledges its mistake when pointed out, then repeats it.</li>\n  <li>The model seems to ignore the few-shot examples you provide.</li>\n  <li>The model gets 90% of the way there, but no further.</li>\n  <li>You find yourself repeating instructions several times.</li>\n  <li>You find yourself typing in ALL CAPS.</li>\n  <li>You find yourself threatening or pleading with the model.</li>\n</ul>\n\n<p>In these scenarios, you’re probably fighting the weights. Recognize the situation and try another tack:</p>\n\n<ul>\n  <li>Try another approach for the same problem.</li>\n  <li>Break your task into smaller chunks. At the very least, you might identify the ask that clashes.</li>\n  <li>Try another model, ideally from a different family.</li>\n  <li>Add validation functions or steps. I’ve seen RAG pipelines that perform a final check to ensure the answer exists in the fetched data.</li>\n  <li>Try a longer prompt. It can help in this scenario, as <a href=\"https://www.dbreunig.com/2025/06/22/how-contexts-fail-and-how-to-fix-them.html#context-distraction\">longer contexts can overwhelm the weights</a>.</li>\n  <li>Consider fine-tuning. In fact, most fine-tuning I encounter is done to address ‘weight fighting’ scenarios, like tone or format adherence.</li>\n</ul>\n\n<p>Or, if you’re a model building shop, you can just address your issues during your next model’s post-training. Which seems to be part of <a href=\"https://www.dbreunig.com/2025/06/03/comparing-system-prompts-across-claude-versions.html\">their development cycle</a>…and perhaps why we can get clean JSON out of modern models.</p>\n\n<p>But few of us have that option.</p>\n\n<p>For the rest of us: learn to recognize when you’re fighting the weights, so you can try something else.</p>\n\n<hr />\n\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/dbreunig\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <label for=\"bd-email\">Enter your email to receive the occasional update.</label>\n  <div class=\"form-input\">\n    <input id=\"bd-email\" name=\"email\" type=\"email\" />\n    <input type=\"submit\" value=\"Subscribe\" />\n  </div>\n</form>\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:claude\">\n      <p>For example, <a href=\"https://github.com/x1xhlol/system-prompts-and-models-of-ai-tools/blob/50b1893b9d3c8bdf6dbb77e660419e7177409728/Anthropic/Sonnet%204.5%20Prompt.txt#L256C1-L257C1\">Claude Sonnet 4.5’s system prompt</a> provides detailed instructions about <em>when</em> to use search tools to answer a user’s query. This is a hard task to prompt correctly. You want the model to rely on its existing knowledge base as much as possible to deliver fast answers, but to readily use web search for timely information or information not in the model’s weights. Besides giving instructions, Anthropic provides examples illustrating more subtle edge cases. <a class=\"reversefootnote\" href=\"https://www.dbreunig.com/2025/11/11/don-t-fight-the-weights.html#fnref:claude\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:shot\">\n      <p>“Shot” is hold-over jargon from the machine learning community. There’s some nuance here, but unless you’re actively collaborating with ML engineers, you can just swap “example” in anytime you see “shot”. <a class=\"reversefootnote\" href=\"https://www.dbreunig.com/2025/11/11/don-t-fight-the-weights.html#fnref:shot\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>"
            ],
            "link": "https://www.dbreunig.com/2025/11/11/don-t-fight-the-weights.html",
            "publishedAt": "2025-11-11",
            "source": "Drew Breunig",
            "summary": "When your context goes against a model's training, you struggle to get the output you need. Learn to recognize when you're fighting the weights so you can do something different.",
            "title": "Don’t Fight the Weights"
        },
        {
            "content": [],
            "link": "https://bernsteinbear.com/blog/compiler-effects/?utm_source=rss",
            "publishedAt": "2025-11-11",
            "source": "Max Bernstein",
            "summary": "<p>Optimizing compilers like to keep track of each IR instruction’s <em>effects</em>. An instruction’s effects vary wildly from having no effects at all, to writing a specific variable, to completely unknown (writing all state).</p> <p>This post can be thought of as a continuation of <a href=\"https://bernsteinbear.com/blog/irs/\">What I talk about when I talk about IRs</a>, specifically the section talking about asking the right questions. When we talk about effects, we should ask the right questions: not <em>what opcode is this?</em> but instead <em>what effects does this opcode have?</em></p> <p>Different compilers represent and track these effects differently. I’ve been thinking about how to represent these effects all year, so I have been doing some reading. In this post I will give some summaries of the landscape of approaches. Please feel free to suggest more.</p> <h2 id=\"some-background\">Some background</h2> <p>Internal IR effect tracking is similar to the programming language notion of algebraic effects in type systems, but internally, compilers keep track of finer-grained effects. Effects such as “writes to a local variable”, “writes to a list”, or “reads from the stack” indicate what instructions can be re-ordered, duplicated, or removed entirely.</p> <p>For example, consider the following pseodocode for some made-up language that stands in for",
            "title": "A catalog of side effects"
        },
        {
            "content": [
                "<ol>\n<li><strong>Vanilla.</strong> Someone decided. Good. No further questions. We can make progress now.</li>\n<li><strong>Educated</strong>. You ask why they decided, and they can clearly explain their reasoning. Not everyone might appreciate the decision, but they will be given the opportunity to understand.<sup id=\"fnref-5395-1\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5395-1\" title=\"Read footnote.\">1</a></sup></li>\n<li><strong>Calculated.</strong> Not only can they explain the decision, but they have math! Wow, I&#8217;m super convinced now. </li>\n<li><strong>Instinct</strong>. They attempt to explain their reasoning, but they say &#8220;feel&#8221; a lot. A lot. Thing is, it feels right, so you don&#8217;t press.</li>\n<li><strong>Inspired</strong>. Now you press, and they can tell you want a clear rationale and justification, but none obviously exists. This decision is not meant to be understood; it&#8217;s meant to be appreciated for its poetry. It is 100% expected that inspired decisions are going to frustrate those seeking clarity; they are going to point at the lack of a clear explanation. &#8220;He doesn&#8217;t know what the hell he&#8217;s doing. It&#8217;s a guess.&#8221; It might be a guess, but it also might be art in the making.<sup id=\"fnref-5395-2\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5395-2\" title=\"Read footnote.\">2</a></sup> <sup id=\"fnref-5395-3\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5395-3\" title=\"Read footnote.\">3</a></sup></li>\n<li><strong>Minimum Viable.</strong> My least favorite. Your investigation into their justification reveals that they chose a decision that was not designed to be good; it was constructed to offend the fewest humans. This is not leadership — it&#8217;s fear. </li>\n<li><strong>Delegated</strong>. Rather than doing the minimal work of even making a minimum viable decision, they gave the decision to someone else because — and I quote — &#8220;They are more capable of making this decision.&#8221; What they are actually saying is, &#8220;I would prefer that this human deal with the weight and consequences for this decision.&#8221; The good news: at least you got a decision. </li>\n</ol>\n<p>Sometimes, they don&#8217;t decide. You push, you prod, but they won&#8217;t decide. No, they didn&#8217;t delegate, no, they didn&#8217;t wing it, they just waited and waited… kind&#8217;a maybe hoping the need for this decision would vanish. Technically, deciding not to decide is a decision, and that&#8217;s a choice, but it&#8217;s not leadership.</p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-5395-1\">\nContext is what matters when understanding a decision. Who is making it? Why now? How have they decided in the past? What happened as a result of these decisions? Are they being forced to decide? Is someone demanding they decide? I could write another ten questions to help you understand the essential context surrounding this decision, but I&#8217;d miss a question essential to this specific decision. My only advice: be painfully curious when it comes to decisions. Yes, this is the introduction to this piece tucked into a footnote. Yolo.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5395-1\" title=\"Return to main content.\">&#8617;</a>\n</li>\n<li id=\"fn-5395-2\">\nInspired decisions are retroactively rebranded Vanilla decisions after unexpected exceptional results appear.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5395-2\" title=\"Return to main content.\">&#8617;</a>\n</li>\n<li id=\"fn-5395-3\">\nIf results from this type of decision are consistently unexpected, let&#8217;s call these decisions Yolo.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5395-3\" title=\"Return to main content.\">&#8617;</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://randsinrepose.com/archives/seven-decisions/",
            "publishedAt": "2025-11-11",
            "source": "Rands in Repose",
            "summary": "Vanilla. Someone decided. Good. No further questions. We can make progress now. Educated. You ask why they decided, and they can clearly explain their reasoning. Not everyone might appreciate the decision, but they will be given the opportunity to understand.1 Calculated. Not only can they explain the decision, but they have math! Wow, I&#8217;m super&#8230; <a class=\"excerpt-more\" href=\"https://randsinrepose.com/archives/seven-decisions/\">more</a>",
            "title": "Seven Decisions"
        },
        {
            "content": [
                "<span class=\"thumbnail\"><img alt=\"\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" height=\"108\" src=\"https://content.wolfram.com/sites/43/2025/11/icon-rulial-ensemble.png\" width=\"128\" /></span><p><img alt=\"What's Special about Life? Bulk Orchestration and the Rulial Ensemble in Biology and Beyond\" class=\"aligncenter\" height=\"322\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11102025heroimg1.png\" title=\"What's Special about Life? Bulk Orchestration and the Rulial Ensemble in Biology and Beyond\" width=\"610\" /></p>\n<h2 id=\"towards-a-theory-of-bulk-orchestration\">Towards a Theory of Bulk Orchestration</h2>\n<p>It’s a key feature of living systems, perhaps even in some ways the key feature: that even right down to a molecular scale, things are orchestrated. Molecules (or at least large ones) don’t just move around randomly, like in a liquid or a gel. Instead, what molecular biology has discovered is that there are endless active mechanisms that in effect orchestrate what even individual molecules in living systems do. But what is the result of all that orchestration? And could there perhaps be a general characterization of what happens in systems that exhibit such “bulk orchestration”? I’ve been wondering about these questions for some time. But finally now I think I may have the beginnings of some answers.</p>\n<p>The central idea is to consider the effect that “being adapted for an overall purpose” has on the underlying operation of a system. At the outset, one might imagine that there’d be no general answer to this, and that it would always depend on the specifics of the system and the purpose. But what we’ll discover is that there is in fact typically a certain universality in what happens. Its ultimate origin is the <a href=\"https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence/\">Principle of Computational Equivalence</a> and certain universal features of the phenomenon of <a href=\"https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-6--computational-irreducibility\">computational irreducibility</a> that it implies. But the point is that so long as a purpose is somehow “computationally simple” then—more or less regardless of what in detail the purpose is—a system that achieves it will show certain features in its behavior.<span id=\"more-71196\"></span></p>\n<p>Whenever there’s computational irreducibility we can think of it as exerting a powerful force towards unpredictability and randomness (as it does, for example, in the <a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/\">Second Law of thermodynamics</a>). So for a system to achieve an overall “computationally simple purpose” this computational irreducibility must in some sense be tamed, or at least contained. And in fact it’s an inevitable feature of computational irreducibility that within it there must be “pockets of computational reducibility” where simpler behavior occurs. And at some level the way computationally simple purposes must be achieved is by tapping into those pockets of reducibility. </p>\n<p>When there’s computational irreducibility it means that there’s no simple narrative one can expect to give of how a system behaves, and no overall “mechanism” one can expect to identify for it. But one can think of pockets of computational reducibility as corresponding to at least small-scale “identifiable mechanisms”. And what we’ll discover is that when there’s a “simple overall purpose” being achieved these mechanisms tend to become more manifest. And this means that when a system is achieving an overall purpose there’s a trace of this even down in the detailed operation of the system. And that trace is what I’ve called “<a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/#class-4-and-the-mechanoidal-phase\">mechanoidal behavior</a>”—behavior in which there are at least small-scale “mechanism-like phenomena” that we can think of as acting together through “<a href=\"https://writings.stephenwolfram.com/2024/05/why-does-biological-evolution-work-a-minimal-model-for-biological-evolution-and-other-adaptive-processes/#what-it-means-for-whats-going-on-in-biology\">bulk orchestration</a>” to achieve a certain overall purpose.</p>\n<p>The concept that there might be universal features associated with the interplay between some kind of overall simplicity and underlying computational irreducibility is something not unfamiliar. Indeed, in various forms it’s the ultimate key to our recent progress in the <a href=\"https://www.wolframphysics.org/\" rel=\"noopener\" target=\"_blank\">foundations of physics</a>, <a href=\"https://www.wolframscience.com/metamathematics/\">mathematics</a> and, in fact, <a href=\"https://writings.stephenwolfram.com/2024/05/why-does-biological-evolution-work-a-minimal-model-for-biological-evolution-and-other-adaptive-processes/\">biology</a>. </p>\n<p>In our effort to get a general understanding of bulk orchestration and the behavior of systems that “achieve purposes” there’s an analogy we can make to statistical mechanics. One might have imagined that to reach conclusions about, say, gases, we’d have to have detailed information about the motion of molecules. But in fact we know that if we just consider the whole ensemble of possible configurations of molecules, then by taking statistical averages we can deduce all sorts of properties of gases. (And, yes, the foundational reason this works <a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/\">we can now understand</a> in terms of computational irreducibility, etc.) </p>\n<p>So could we perhaps do something similar for bulk orchestration? Is there some ensemble we can identify in which wherever we look there will with overwhelming probability be certain properties? In the statistical mechanics of gases we imagine that the underlying laws of mechanics are fixed, but there’s a whole ensemble of possible initial configurations for the molecules—almost all of which turn out to have the same limiting features. But in biology, for example, we can think of different genomes as defining different rules for the development and operation of organisms. And so now what we want is a new kind of ensemble—that we can call a rulial ensemble: an ensemble of possible rules. </p>\n<p>But in something like biology, it’s not all possible rules we want; rather, it’s rules that have been selected to “achieve the purpose” of making a successful organism. We don’t have a general way to characterize what defines biological fitness. But the key point here is that at a fundamental level we don’t need that. Instead it seems that just knowing that our fitness function is somehow computationally simple tells us enough to be able to deduce properties of our “rulial ensemble”.</p>\n<p>But are the fitness functions of biology in fact computationally simple? I’ve recently argued that their simplicity is precisely what makes <a href=\"https://writings.stephenwolfram.com/2024/12/foundations-of-biological-evolution-more-results-more-surprises/\">biological evolution possible</a>. Like so many other foundational phenomena, it seems that biological evolution is a reflection of the interplay between computational simplicity—in the case of fitness functions—and underlying computational irreducibility. (In effect, organisms have a chance only because the problems they have to solve aren’t too computationally difficult.) But now we can use the simplicity of fitness functions—without knowing any more details about them—to make conclusions about the relevant rulial ensemble, and from there to begin to derive general principles associated with bulk orchestration.</p>\n<p>When one describes why a system does what it does, there are two different approaches one can take. One can go from the bottom up and describe the underlying rules by which the system operates (in effect, its “mechanism”). Or one can go from the top down and describe what the system “achieves” (in effect, its “goal” or “purpose”). It tends to be difficult to mix these two approaches. But what we’re going to find here is that by thinking in terms of the rulial ensemble we will be able to see the general pattern of both the “upward” effect of underlying rules, and the “downward” effect of overall purposes. </p>\n<p>What I’ll do here is just a beginning—a first exploration, both computational and conceptual, of the rulial ensemble and its consequences. But already there seem to be strong indications that by thinking in terms of the rulial ensemble one may be able to develop what amounts to a foundational theory of bulk orchestration, and with it a foundational theory of certain aspects of adaptive systems, and most notably biology.</p>\n<h2 id=\"some-first-examples\">Some First Examples</h2>\n<p>To begin our explorations and start developing our intuition let’s look at a few simple examples. We’ll use the same <a href=\"https://writings.stephenwolfram.com/2024/05/why-does-biological-evolution-work-a-minimal-model-for-biological-evolution-and-other-adaptive-processes/\">basic framework as in my recent work on biological evolution</a>. The idea is to have cellular automata whose rules serve as an idealization of genotypes, and whole behavior serves as an idealization of the development of phenotypes. For our fitness function we’re going to start with something very specific: that after 50 steps (starting from a single-cell “seed”) our cellular automaton should generate “output” that consists of three equal blocks of cells colored red, blue and yellow.</p>\n<p>Here are some examples of rules that “solve this particular problem”, in various different ways:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"226\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025examplesAimg1.png\" title=\"\" width=\"645\" /> </div>\n<p><span></p>\n<p>How can such rules be found? Well, we can use an idealization of biological evolution. Let’s consider the first rule above:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"271\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025examplesAimg2.png\" title=\"\" width=\"359\" /> </div>\n<p><span></p>\n<p>We start, say, from a null rule, then make successive random point mutations in the rule</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"178\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025examplesAimg3.png\" title=\"\" width=\"431\" /> </div>\n<p><span></p>\n<p>keeping those mutations that don’t take us further from achieving our goal (and dropping those that do, each indicated here by a red dot):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"270\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025examplesAimg4.png\" title=\"\" width=\"647\" /> </div>\n<p><span></p>\n<p>The result is that we “progressively adapt” over the course of a few thousand mutations to successively reduce the number of “errors” and eventually (and in this case, perfectly) achieve our goal:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"347\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025examplesAimg5.png\" title=\"\" width=\"670\" /> </div>\n<p><span></p>\n<p>Early in this sequence there’s lots of computational irreducibility in evidence. But in the process of adapting to achieve our goal the computational irreducibility progressively gets “contained” and in effect squeezed out, until eventually the final solution in this case has an almost completely simple structure.</p>\n<p>The example we’ve just seen succeeds in exactly achieving the objective we defined—though it takes about 4000 steps of adaptive evolution to do so. But if we limit the number of steps of adaptive evolution then in general we won’t be able to reach the exact objective we’ve defined. But here are some results we get with 10,000 steps of adaptive evolution (sorted by how close they get):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"469\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025examplesAimg6.png\" title=\"\" width=\"671\" /> </div>\n<p><span></p>\n<p>In all cases there’s a certain amount of “identifiable mechanism” to what these rules do. Yes, there can be patches of complex—and presumably computationally irreducible—behavior. But particularly the rules that do better at achieving our exact objective tend to “keep this computational irreducibility at bay”, and emphasize their “simple mechanisms”.</p>\n<p>So what we see is that among all possible rules, those that get even close to achieving the “purpose” we have set in effect show at least “patches of mechanism”. In other words, the imposition of a purpose selects out rules that “exhibit mechanism”, and show what we’ve called mechanoidal behavior. </p>\n<h2 id=\"the-concept-of-mutational-complexity\">The Concept of Mutational Complexity</h2>\n<p>In the last section we saw that adaptive evolution can find (4-color) cellular automaton rules that generate the particular <img alt=\"\" height=\"8\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025mutationalimg1.png\" title=\"\" width=\"73\" /> output we specified. But what about other kinds of output? </p>\n<p>What we manage to get will depend on how much “effort” of adaptive evolution we put in. If we limit ourselves to 10,000 steps of adaptive evolution here are some examples of what happens:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"1176\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025mutationalimg2.png\" title=\"\" width=\"611\" /> </div>\n<p><span></p>\n<p>At a qualitative level the main takeaway here is that it seems that the “simpler” the objective is, the more closely it’s likely to be achieved by a given number of steps of adaptive evolution. </p>\n<p>Looking at the first (i.e. “ultimately most successful”) examples above, here’s how they’re reached in the course of adaptive evolution:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"165\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025mutationalimg3.png\" title=\"\" width=\"644\" /> </div>\n<p><span></p>\n<p>And we see that the “simpler” sequences are reached both more successfully and more quickly; in effect they seem to be “easier” for adaptive evolution to generate.</p>\n<p>But what do we mean by “simpler” here? In qualitative terms we can think of the “simplicity” of a sequence as being characterized by how short a description we can find of it. We might try to compress the sequence, say using some standard practical <a href=\"https://www.wolframscience.com/nks/chap-10--processes-of-perception-and-analysis#sect-10-5--data-compression\">compression technique</a>, like <a href=\"https://www.wolframscience.com/nks/p561--data-compression/\">run-length encoding</a>, <a href=\"https://www.wolframscience.com/nks/p563--data-compression/\">block encoding</a> or <a href=\"https://www.wolframscience.com/nks/p565--data-compression/\">dictionary encoding</a>. And for the sequences we’re using above, these will (mostly) agree about what’s simpler and what’s not. And then what we find is that sequences that are “simpler” in this kind of characterization tend to be ones that are easier for adaptive evolution to produce.</p>\n<p>But, actually, our study of adaptive evolution itself gives us a way to characterize the simplicity—or complexity—of a sequence: we can consider a sequence more complex if the typical number of mutations it takes to come up with a rule to generate the sequence is larger. And we can define this number of mutations to be what we can call the “mutational complexity” of a sequence. </p>\n<p>There are lots of details in tightening up this definition. But in some sense what we’re saying is that we can characterize the complexity of a sequence by how hard it is for adaptive evolution to get it generated.</p>\n<p>To get more quantitative we have to address the issue that if we run adaptive evolution multiple times, it’ll generally take different numbers of steps to be able to get a particular sequence generated, or, say, to get to the point where there are fewer than <em>m</em> “errors” in the generated sequence. And, sometimes, by the way, a particular run of adaptive evolution might “get stuck” and never be able to generate a particular sequence—at least (as we’ll discuss below) with the kind of rules and single point mutations we’re using here. </p>\n<p>But we can still compute the probability—across many runs of adaptive evolution—to have reached a specified sequence within <em>m</em> errors after a certain number of steps. And this shows how that probability builds up for the sequences we saw above:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"346\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025mutationalimg4.png\" title=\"\" width=\"587\" /> </div>\n<p><span></p>\n<p>And we immediately see more quantitatively that some sequences are faster and easier to reach than others. </p>\n<p>We can go even further by computing in each case the median number of adaptive steps needed to get “within <em>m</em> errors” of each sequence:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"193\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025mutationalimg5.png\" title=\"\" width=\"677\" /> </div>\n<p><span></p>\n<p>Picking a certain “desired fidelity” (say allowing a maximum of 20 errors) we then get at least one estimate of mutational complexity for our sequences:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"296\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025mutationalimg6.png\" title=\"\" width=\"528\" /> </div>\n<p><span></p>\n<p>Needless to say, these kinds of numerical measures are at best a very coarse way to characterize the difficulty of being able to generate a given sequence through rules produced by adaptive evolution. And, for example, instead of just looking at the probability to reach a given “fidelity” we could be looking at all sorts of distributions and correlations. But in developing our intuition about the rulial ensemble it’s useful to see how we can derive even an admittedly coarse specific numerical measure of the “difficulty of reaching a sequence” through adaptive evolution. </p>\n<h2 id=\"possible-and-impossible-objectives\">Possible and Impossible Objectives</h2>\n<p>We’ve seen above that some sequences are easier to reach by adaptive evolution than others. But can any sequence we might look for actually be found at all? In other words—regardless of whether adaptive evolution can find it—is there in fact any cellular automaton rule at all (say a 4-color one) that successfully generates any given sequence?</p>\n<p>It’s easy to see that in the end there must be sequences that can’t be generated in this way. There are 4<sup>4<sup>3</sup></sup> possible 4-color cellular automaton rules. But even though that’s a large number, the number of possible 4-color length-101 sequences is still much larger: 4<sup>101</sup> &#8776; 10<sup>61</sup>. So that means it’s inevitable that some of these sequences will not appear as the output from any 4-color cellular automaton rule (run from a single-cell initial condition for 50 steps). (We can think of such sequences as having too high an “<a href=\"https://www.wolframscience.com/nks/notes-12-8--algorithmic-complexity-theory/\">algorithmic complexity</a>” to be generated from a “program” as short as a 4-color cellular automaton rule.) </p>\n<p>But what about sequences that are “simple” with respect to our qualitative criteria above? Whenever we succeeded above in finding them by adaptive evolution then we obviously know they can be generated. But in general this is a quintessential computationally irreducible question—so that in effect the only way to know for sure whether there’s any rule that can generate a particular sequence is just to explicitly search through all &#8776; 10<sup>38</sup> possible rules.</p>\n<p>We can get some intuition, however, by looking at much simpler cases. Consider, for example, the 128 (quiescent) “elementary” cellular automata (with <em>k</em> = 2, <em>r</em> =1):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"71\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg4.png\" title=\"\" width=\"591\" /> </div>\n<p><span></p>\n<p>The number of distinct sequences they can generate after <em>t</em> steps quickly stabilizes (the maximum is 32)</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"130\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg5.png\" title=\"\" width=\"325\" /> </div>\n<p><span></p>\n<p>but this is soon much smaller than the total number of possible sequences of the same length (2<sup>2<em>t</em> + 1</sup>). (The “down wiggles” are associated with additive rules like 90 and 150 generating almost blank sequences at steps of the form 2<sup><em>m</em></sup>.) Here’s the corresponding result for <em>k</em> = 2, <em>r</em> = 3/2 rules:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"127\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg8.png\" title=\"\" width=\"327\" /> </div>\n<p><span></p>\n<p>So what are the sequences that get “left out” by cellular automata? Already by step 2 a quiescent elementary cellular automaton can only produce 14 of the 32 possible sequences—with sequences such as <img alt=\"\" height=\"10\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg9.png\" title=\"\" width=\"47\" /> and <img alt=\"\" height=\"10\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg10.png\" title=\"\" width=\"47\" /> being among those excluded. One might think that one would be able to characterize excluded sequences by saying that certain fixed blocks of cells could not occur at any step in any rule. And indeed that happens for the <em>r</em> = 1/2 rules. But for the quiescent elementary cellular automata—with <em>r</em> = 1—it seems as if every block of any given size well eventually occur, presumably courtesy of the likes of rule 30. </p>\n<p>What about, say, periodic sequences? Here are some examples that no quiescent elementary cellular automaton can generate:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"68\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg11.png\" title=\"\" width=\"390\" /> </div>\n<p><span></p>\n<p>And, yes, these are, by most standards, quite “simple” sequences. But they just happen not to be “simple” for elementary cellular automata. And indeed we can expect that there will be plenty of such “coincidentally unreachable” but “seemingly simple” sequences even for our 4-color rules. But we can also expect that even if we can’t precisely reach some objective sequence, we’ll still be able to get to a sequence that is close. (The minimum “error” is, for example, 4 cells out of 15 for the first sequence above, and 2 for the last sequence).</p>\n<p>But there still remains the question of whether adaptive evolution will be able to find such sequences. For the very simple case of quiescent elementary cellular automata we can readily map out the <a href=\"https://writings.stephenwolfram.com/2024/05/why-does-biological-evolution-work-a-minimal-model-for-biological-evolution-and-other-adaptive-processes/#the-multiway-graph-of-all-possible-mutation-histories\">complete multiway graph</a> of all possible mutations between rules. Here’s what we get if we run all possible rules for 3 steps, then show possible outcomes as nodes, and possible mutations between rules as edges (the edges are undirected, because every mutation can go either way): </p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"232\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg12.png\" title=\"\" width=\"492\" /> </div>\n<p><span></p>\n<p>That this graph has only 18 nodes reflects the fact that quiescent elementary cellular automata can produce only 18 of the 128 possible length-7 sequences. But even within these 18 sequences there are ones that cannot be reached through the adaptive evolution process we are using.</p>\n<p>For example, let’s say our goal is to generate the sequence <img alt=\"\" height=\"9\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg13.png\" title=\"\" width=\"61\" /> (or, rather, to find a rule that will do so). If we start from the null rule—which generates <img alt=\"\" height=\"9\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg14.png\" title=\"\" width=\"61\" />—then our adaptive evolution process defines a foliated version of the multiway graph above:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"200\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg15.png\" title=\"\" width=\"582\" /> </div>\n<p><span></p>\n<p>Starting from <img alt=\"\" height=\"9\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg16.png\" title=\"\" width=\"61\" /> some paths (i.e. sequences of mutations) successfully reach <img alt=\"\" height=\"9\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg17.png\" title=\"\" width=\"61\" />. But this only happens about 25% of the time. The rest of the time the adaptive process gets stuck at <img alt=\"\" height=\"9\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg18.png\" title=\"\" width=\"61\" /> or <img alt=\"\" height=\"9\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg19.png\" title=\"\" width=\"61\" /> and never reaches <img alt=\"\" height=\"9\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg20.png\" title=\"\" width=\"61\" />:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"257\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg21.png\" title=\"\" width=\"554\" /> </div>\n<p><span></p>\n<p>So what happens if we look at larger cellular automaton rule spaces? In such cases we can’t expect to trace the full multiway graph of possible mutations. And if we pick a sequence at random as our target, then for a long sequence the overwhelming probability is that it won’t be reachable at all by any cellular automaton with a rule of a given type. But if we start from a rule—say picked at random—and use its output as our target, then this guarantees that there’s at least one rule that produces this sequence. And then we can ask how difficult it is for adaptive evolution to find a rule that works (most likely not the original one). </p>\n<p>Here are some examples—with the original rule on the left, and the best results found from 10,000 steps of adaptive evolution on the right:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"695\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11062025impossibleimg22.png\" title=\"\" width=\"621\" /> </div>\n<p><span></p>\n<p>What we see is fairly clear: when the pattern generated by the original rule looks simple, adaptive evolution can readily find rules that successfully produce the same output, albeit sometimes in quite different ways. But when the pattern generated by the original rule is more complicated, adaptive evolution typically won’t be able to find a rule that exactly reproduces its output. And so, for examples, in the cases shown here many errors remain even in the “best results” after 10,000 steps of adaptive evolution.</p>\n<p>Ultimately this not surprising. When we pick a cellular automaton rule at random, it’ll often show computational irreducibility. And in a sense all we’re seeing here is that adaptive evolution can’t “break” computational irreducibility. Or, put another way, computationally irreducible processes generate mutational complexity. </p>\n<h2 id=\"other-objective-functions\">Other Objective Functions</h2>\n<p>In everything we’ve done so far we’ve been considering a particular type of “goal”: to have a cellular automaton produce a specified arrangement of cells after a certain number of steps. But what about other types of goals? We’ll look at several here. The general features of what will happen with them follow what we’ve already seen, but each will show some new effects and will provide some new perspectives.</p>\n<h3>Vertical Sequences</h3>\n<p>As a first example, let’s consider trying to match not the horizontal arrangement of cells, but the vertical one—in particular the sequence of colors in the center column of the cellular automaton pattern. Here’s what we get with the goal of having a block of red cells followed by an equal block of blue:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"343\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg1.png\" title=\"\" width=\"633\" /> </div>\n<p><span></p>\n<p>The results are quite diverse and “creative”. But it’s notable that in all cases there’s definite “mechanism” to be seen “right around the center column”. There’s all sorts of complexity away from the center column, but it’s sufficiently “contained” that the center column itself can achieve its “simple goal”. </p>\n<p>Things are similar if we ask to get three blocks of color rather than two—though this goal turns out to be somewhat more difficult to achieve:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"223\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg2.png\" title=\"\" width=\"633\" /> </div>\n<p><span></p>\n<p>It’s also possible to get <img height=\"8\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg3.png\" width=\"67\" />:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"104\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg4.png\" title=\"\" width=\"633\" /> </div>\n<p><span></p>\n<p>And in general the difficulty of getting a particular vertical sequence of blocks tends to track the difficulty of getting the corresponding horizontal sequence of blocks. Or, in other words, the pattern of mutational complexity seems to be similar for sequences associated with horizontal and vertical goals.</p>\n<p>This also seems to be true for periodic sequences. Alternating colors are easy to achieve, with many “tricks” being possible in this case:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"167\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg5.png\" title=\"\" width=\"636\" /> </div>\n<p><span></p>\n<p>A sequence with period 5 is pretty much the same story:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"77\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg6.png\" title=\"\" width=\"636\" /> </div>\n<p><span></p>\n<p>When the period gets more comparable to the number of cellular automaton steps that we’re sampling it for, the “solutions” get wilder:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"167\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg7.png\" title=\"\" width=\"636\" /> </div>\n<p><span></p>\n<p>And some of them are quite “fragile”, and don’t “generalize” beyond the original number of steps for which they were adapted:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"221\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg8.png\" title=\"\" width=\"461\" /> </div>\n<p><span></p>\n<h3>Color Frequencies in Output</h3>\n<p>The types of goals we’ve considered so far have all involved trying to get exact matches to specified sequences. But what if we just ask for an average result? For example, what if we ask for all 4 colors to occur with equal frequency in our output, but allow them to be arranged in any way? With the same adaptive evolution setup as before we rather quickly find “solutions” (where because we’re running for 50 steps and getting patterns of width 101, we’re always “off by at least 1” relative to the exact 25:25:25:25 result):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"348\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg9.png\" title=\"\" width=\"633\" /> </div>\n<p><span></p>\n<p>A few of these solutions seem to have “figured out a mechanism” to get all colors equally. But others seem like they just “happen to work”. And indeed, taking the first three cases here, this shows the relative numbers of cells of different colors obtained at successive steps in running the cellular automaton:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"129\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg10.png\" title=\"\" width=\"594\" /> </div>\n<p><span></p>\n<p>The pattern that looks simple consistently has equal numbers of each color at every step. The others just “happen to hit equality” after running for exactly 50 steps, but on either side don’t achieve equality.</p>\n<p>And, actually, it turns out that all these solutions are in some sense quite fragile. Change the color of just one cell and one typically gets an expanding region of change—that takes the output far from color equality:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"218\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg11.png\" title=\"\" width=\"390\" /> </div>\n<p><span></p>\n<p>So how can we get rules that more robustly achieve our color equality objective? One approach is to <a href=\"https://writings.stephenwolfram.com/2025/02/towards-a-computational-formalization-for-foundations-of-medicine/#biological-evolution-and-our-model-organism\">force the adaptive evolution to “take account of possible perturbations”</a> by applying a few perturbations at every adaptive evolution step, and keeping a particular mutation only if neither it, nor any of its perturbed versions, has lower fitness than before. </p>\n<p>Here’s an example of one particular sequence of successive rules obtained in this way:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"171\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg12.png\" title=\"\" width=\"642\" /> </div>\n<p><span></p>\n<p>And now if we apply perturbations to the final result, it doesn’t change much:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"77\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg13.png\" title=\"\" width=\"634\" /> </div>\n<p><span></p>\n<p>It’s notable that this robust solution looks simple. And indeed that’s common, with a few other examples of robust, exact solutions being: </p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"164\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg14.png\" title=\"\" width=\"626\" /> </div>\n<p><span></p>\n<p>In effect it seems that requiring a robust, exact solution “forces out” computational irreducibility, leaving only readily reducible patterns. If we relax the constraint of being an exact solution even a little, though, more complex behavior quickly creeps in:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"160\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg15.png\" title=\"\" width=\"612\" /> </div>\n<p><span></p>\n<h3>Whole-Pattern Color Frequencies</h3>\n<p>We’ve just looked at trying to achieve particular frequencies of colors in the “output” of a cellular automaton (after running for 50 steps). But what if we try to achieve certain frequencies of colors throughout the pattern produced by the cellular automaton? </p>\n<p>For example, let&#8217;s say that our goal is to have color frequencies in the ratios: <img height=\"27\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functions-aimg1.png\" style=\"vertical-align: bottom; margin-top: 2px; margin-bottom: 2px;\" width=\"136\" />. Adaptive evolution fairly easily finds good &#8220;solutions&#8221; for this:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"252\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg16.png\" title=\"\" width=\"640\" /> </div>\n<p><span></p>\n<p>And in fact it does so for any “relative red level”:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"574\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg17.png\" title=\"\" width=\"526\" /> </div>\n<p><span></p>\n<p>But if we plot the median number of adaptive evolution steps needed to achieve these results (i.e. our approximation to mutational complexity) we see that there’s a systematic increase with “red level”:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"153\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg18.png\" title=\"\" width=\"357\" /> </div>\n<p><span></p>\n<p>In effect, the higher the red level the “more stringent” the constraints we’re trying to satisfy are—and the more steps of adaptive evolution it takes to do that. But looking at the actual patterns obtained at different red levels, we also see something else: that as the constraints get more stringent, the pattern seems to have computational irreducibility progressively “squeezed out” of them—leaving behavior that seems more and more mechanoidal. </p>\n<p>As another example along the same lines, consider goals of the form <img height=\"27\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functions-aimg2.png\" style=\"vertical-align: bottom; margin-top: 2px; margin-bottom: 2px;\" width=\"138\" />. Here are results one gets varying the &#8220;white level&#8221;:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"650\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg19.png\" title=\"\" width=\"598\" /> </div>\n<p><span></p>\n<p>We see two rather different approaches being taken to the “problem of having more white”. When the white level isn’t too large, the pattern just gets “airier”, with more white inside. But eventually the pattern tends to contract, “leaving room” for white outside. </p>\n<h3>Growth Shapes</h3>\n<p>In most of what we’ve done so far, the overall “shapes” of our cellular automaton patterns have ended up always just being simple triangles that expand by one cell on each side at each step—though we just saw that with sufficiently stringent constraints on colors they’re forced to be different shapes. But what if our actual goal is to achieve a certain shape? For example, let’s say we try to get triangular patterns that grow at a particular rate on each side. </p>\n<p>Here are some results for growth rates of the form 1/<em>n</em> (i.e. growing by an average of 1 cell every <em>n</em> steps):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"373\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg20.png\" title=\"\" width=\"650\" /> </div>\n<p><span></p>\n<p>This is the sequence of adaptive evolution steps that led to the first example of growth rate <span class=\"InlineFormula\"><img align=\"absmiddle\" height=\"30\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg28.png\" style=\"margin: 0 2px;\" width=\"8\" /></span></p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"262\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg22.png\" title=\"\" width=\"643\" /> </div>\n<p><span></p>\n<p>and this is the corresponding sequence for growth rate <span class=\"InlineFormula\"><img align=\"absmiddle\" height=\"27\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg23.png\" style=\"margin: 0 2px;\" width=\"15\" /></span>:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"119\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg24.png\" title=\"\" width=\"644\" /> </div>\n<p><span></p>\n<p>And although the interiors of most of the final patterns here are complicated, their outer boundaries tend to be simple—at least for small <em>n</em>—and in a sense “very mechanically” generate the exact target growth rate:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"149\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg25.png\" title=\"\" width=\"628\" /> </div>\n<p><span></p>\n<p>For larger <em>n</em>, things get more complicated—and adaptive evolution doesn’t typically “find an exact solution”. And if we run our “solutions” longer we see that—particularly for larger <em>n</em>—they often don’t “generalize” very well, and soon start deviating from their target growth rates: </p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"176\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg26.png\" title=\"\" width=\"672\" /> </div>\n<p><span></p>\n<p>As we increase <em>n</em> we typically see that more steps of adaptive evolution are needed to achieve our goal, reflecting the idea that “larger <em>n</em> growth” has more mutational complexity:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"121\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg27.png\" title=\"\" width=\"308\" /> </div>\n<p><span></p>\n<p>For rational growth rates like <span class=\"InlineFormula\"><img align=\"absmiddle\" height=\"30\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg28.png\" style=\"margin: 0 2px;\" width=\"8\" /></span> fairly simple exact solutions are possible. But for irrational growth rates, that’s no longer true. Still, it turns out that adaptive evolution is in a sense strong enough—and our cellular automaton rule space is large enough—that good approximations even to irrational growth rates can often be reached:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"328\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg29.png\" title=\"\" width=\"671\" /> </div>\n<p><span></p>\n<p>The “solutions” typically remain quite consistent when run longer:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"328\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg30.png\" title=\"\" width=\"679\" /> </div>\n<p><span></p>\n<p>But there are still some notable limitations. For example, while a growth rate of exactly 1 is easy to achieve, growth rates close to 1 are in effect “structurally difficult”. For example, above about 0.741 adaptive evolution tends to “cheat”—adding a “hat” at the top of the pattern instead of actually producing a boundary with consistent slope:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"296\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg31.png\" title=\"\" width=\"656\" /> </div>\n<p><span></p>\n<p>What about other shapes as goals? Here’s what happens with diamond shapes of difficult widths:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"314\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg32.png\" title=\"\" width=\"582\" /> </div>\n<p><span></p>\n<p>Adaptive evolution is quite constrained by what’s structurally possible in a cellular automaton of this type—and the results are not particularly good. And indeed if one attempts to “generalize” them, it’s clear none of them really “have the idea” of a diamond shape:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"120\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg33.png\" title=\"\" width=\"672\" /> </div>\n<p><span></p>\n<h3 id=\"lifetimes\">Lifetimes</h3>\n<p>In the examples we’ve discussed so far, we’ve focused on what cellular automata do over the course of a fixed number of steps—not worrying about what they might do later. But another goal we might have—which in fact <a href=\"https://writings.stephenwolfram.com/2024/12/foundations-of-biological-evolution-more-results-more-surprises\">I have discussed at length elsewhere</a>—is just to have our cellular automata produce patterns that go for a certain number of steps and then die out. So, for example, we can use adaptive evolution to find cellular automata whose patterns live for exactly 50 steps, and then die out: </p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"159\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg34.png\" title=\"\" width=\"649\" /> </div>\n<p><span></p>\n<p>Just like in our other examples, adaptive evolution finds all sorts of diverse and “interesting” solutions to the problem of living for exactly 50 steps. Some (like the last one and the yellow one) have a certain level of “obvious mechanism” to them. But most of them seem to “just work” for no “obvious reason”. Presumably the constraint of living for 50 steps in some sense just isn’t stringent enough to “squeeze out” computational irreducibility—so there is still plenty of computational irreducibility in these results. </p>\n<p>What about mutational complexity? Approximating this, as before, by the median of the number of adaptive evolution steps—and sampling a few hundred cases for each lifetime goal (and plotting the quartiles as well as the median)—we see a systematic increase of mutational complexity as we increase the lifetime goal:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"187\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg35.png\" title=\"\" width=\"496\" /> </div>\n<p><span></p>\n<p>In effect this shows us that if we increase the lifetime goal, it becomes more and more difficult for adaptive evolution to reach that goal. (And, as we’ve discussed elsewhere, if we go far enough, we’ll ultimately reach the edge of what’s even in principle possible with, say, the particular type of 4-color cellular automata we’re using here.) </p>\n<p>All the objectives we’ve discussed so far have the feature that they are in a sense explicit and fixed: we define what we want (e.g. a cellular automaton pattern that lives for exactly 50 steps) and then we use adaptive evolution to try to get it. But looking at something like lifetime suggests another possibility. Instead of our objective being fixed, our objective can instead be open ended. And so, for example, we might ask not for a specific lifetime, but to get the largest lifetime we can.</p>\n<p>I’ve discussed this case at some length elsewhere. But how does it relate to the concept of the rulial ensemble that we’re studying here? When we have rules that are found by adaptive evolution with fixed constraints we end up with something that can be thought of as roughly analogous to things like the canonical (“specified temperature”) ensemble of traditional statistical mechanics. But if instead we look at the “winners” of open-ended adaptive evolution then what we have is more like a collection of extreme value than something we can view as typical of the “bulk of an ensemble”.</p>\n<h3>Periodicities</h3>\n<p>We’ve just looked at the goal of having patterns that survive for a certain number of steps. Another goal we can consider is having patterns that periodically repeat after a certain number of steps. (We can think of this as an extremely idealized analog of having multiple generations of a biological organism.)</p>\n<p>Here are examples of rules found by adaptive evolution that lead to patterns which repeat after exactly 50 steps:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"445\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg36.png\" title=\"\" width=\"635\" /> </div>\n<p><span></p>\n<p>As usual, there’s a distribution in the number of steps of adaptive evolution required to achieve these results:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"164\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11102025functionsimg1.png\" title=\"\" width=\"398\" /> </div>\n<p><span></p>\n<p>Looking at the median of the analogous distributions for different possible periods, we can get an estimate of the mutational complexity of different periods—which seems to increase somewhat uniformly with period: </p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"150\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11102025functionsimg2.png\" title=\"\" width=\"397\" /> </div>\n<p><span></p>\n<p>By the way, it’s also possible to restrict our adaptive evolution so that it samples only symmetric rules; here are a few examples of period-50 results found in this way:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"223\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg39.png\" title=\"\" width=\"644\" /> </div>\n<p><span></p>\n<p>In our discussion of periodicity so far, we’ve insisted on “periodicity from the start”—meaning that after each period the pattern we get has to return to the single-cell state we started from. But we can also consider periodicity that “develops after a transient”. Sometimes the transient is short; sometimes it’s much longer. Sometimes the periodic pattern starts from a small “seed”; sometimes its seed is quite large. Here are some examples of patterns found by adaptive evolution that have ultimate period 50:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"455\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg41.png\" title=\"\" width=\"641\" /> </div>\n<p><span></p>\n<p>By the way, in all these cases the periodic pattern seems like the “main event” of the cellular automaton evolution. But there are other cases where it seems more like a “residue” from other behavior—and indeed that “other behavior” can in principle go on for arbitrarily long before finally giving way to periodicity:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"540\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg42.png\" title=\"\" width=\"635\" /> </div>\n<p><span></p>\n<p>We’ve been talking so far about the objective of finding cellular automaton rules that yield patterns with specific periodicity. But just like for lifetime, we can also consider the “open-ended objective” of finding rules with the longest periods we can. And here are the best results found with a few runs of 10,000 steps of adaptive evolution (here we’re looking for periodicity without transients):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"386\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025functionsimg43.png\" title=\"\" width=\"635\" /> </div>\n<p><span></p>\n<h2 id=\"measuring-mechanoidal-behavior\">Measuring Mechanoidal Behavior</h2>\n<p>We’ve now seen lots of examples of cellular automata found by adaptive evolution. And a key question is: “what’s special about them?” If we look at cellular automata with rules chosen purely at random, here are typical examples of what we get:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"335\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025mechanoidalimg1.png\" title=\"\" width=\"611\" /> </div>\n<p><span></p>\n<p>Some of these patterns are simple. But many are complicated and in fact look quite random—though often with regions or patches of regularity. But what’s striking is how visually different they look from what we’ve mostly seen above in cellular automata that were adaptively evolved “for a purpose”.</p>\n<p>So how can we characterize—and ultimately measure—that difference? Our randomly picked cellular automata seem to show either almost total computational reducibility or “unchecked computational irreducibility” (albeit usually with regions or patches of computational reducibility). But cellular automata that were successfully “evolved for a purpose” tend to look different. They tend to show what we’re calling <a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/#class-4-and-the-mechanoidal-phase\">mechanoidal behavior</a>: behavior in which there are identifiable “mechanism-like features”, albeit usually mixed in with at least some—typically highly contained—“sparks of computational irreducibility”. </p>\n<p>At a visual level there are typically some clear characteristics to mechanoidal behavior. For example, there are usually repeated motifs that appear throughout a system. And there’s also usually a certain degree of <a href=\"https://writings.stephenwolfram.com/2025/03/what-can-we-learn-about-engineering-and-innovation-from-half-a-century-of-the-game-of-life-cellular-automaton/#modularity\">modularity</a>, with different parts of the system operating at least somewhat independently. And, yes, there’s no doubt a rich phenomenology of mechanoidal behavior to be studied (closely related to the study of <a href=\"https://www.wolframscience.com/nks/chap-6--starting-from-randomness#sect-6-2--four-classes-of-behavior\">class 4 behavior</a>). But at a coarse and potentially more immediately quantitative level a key feature of mechanoidal behavior is that it involves a certain amount of regularity, and computational reducibility. </p>\n<p>So how can one measure that? Whenever there’s regularity in a system it means there’s a way to summarize what the system does more succinctly than by just specifying every state of every element of the system. Or, in other words, there’s a way to <a href=\"https://www.wolframscience.com/nks/chap-10--processes-of-perception-and-analysis#sect-10-2--what-perception-and-analysis-do\">compress our description of the system</a>. </p>\n<p>Perhaps, one might think, one could use modularity to do this compression, say by keeping only the modular parts of a system, and eliding away the “filler” in between—much like <a href=\"https://www.wolframscience.com/nks/p561--data-compression/\">run-length encoding</a>. But—like run-length encoding—the most obvious version of this runs into trouble when the “filler” consists, say, of alternating colors of cells. One can also think of using <a href=\"https://www.wolframscience.com/nks/p563--data-compression/\">block-based encoding</a>, or <a href=\"https://www.wolframscience.com/nks/p565--data-compression/\">dictionary encoding</a>, say leveraging repeated motifs that appear. But it’s an inevitable feature of computational irreducibility that in the end there can never be one universally best method of compression. </p>\n<p>But as an example, let’s just use the Wolfram Language <tt><a href=\"http://reference.wolfram.com/language/ref/Compress.html\">Compress</a></tt> function. (Using GZIP, BZIP2, etc. gives essentially identical results.) Feed in a cellular automaton pattern, and <tt>Compress</tt> will give us a (losslessly) compressed version of it. We can then use the length of this as a measure of what’s left over after we “compress out” the regularities in the pattern. Here’s a plot of the “compressed description length” (in “<tt>Compress</tt> output bytes”) for some of the patterns we’ve seen above:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"465\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025mechanoidalimg2.png\" title=\"\" width=\"591\" /> </div>\n<p><span></p>\n<p>And what’s immediately striking is that the patterns “evolved for a purpose” tend to be in between patterns that come from randomly chosen rules. </p>\n<p>(And, yes, the question of what’s compressed by what is a <a href=\"https://writings.stephenwolfram.com/2023/12/observer-theory/\">complicated, somewhat circular story</a>. Compression is ultimately about making a model for things one wants to compress. And, for example, the appropriate model will change depending on what those things are. But for our purposes here, we’ll just use <tt>Compress</tt>—which is set up to do well at compressing “typical human-relevant content”.)</p>\n<p>OK, so how does adaptive evolution relate to our “compressed size” measure? Here’s an example of the typical progression of an adaptive evolution process—in this case based on the goal of generating the <img height=\"8\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025mechanoidalimg3.png\" width=\"73\" /> sequence:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"219\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025mechanoidalimg4.png\" title=\"\" width=\"600\" /> </div>\n<p><span></p>\n<p>Given our way of starting with the null rule, everything is simple at the beginning—yielding a small compressed size. But soon the system starts developing computational irreducibility, and the compressed size goes up. Still, as the adaptive evolution proceeds, the computational irreducibility is progressively “squeezed out”—and the compressed size settles down to a smaller value. </p>\n<p>The plot above is based on a particular (randomly chosen) sequence of mutations in the underlying rule. But if we look at the average from a large collection of mutation sequences we see very much the same thing:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"297\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025mechanoidalimg6.png\" title=\"\" width=\"433\" /> </div>\n<p><span></p>\n<p>Even though the “error rate” on average goes down monotonically, the compressed size of our candidate patterns has a definite peak before settling to its final value. In effect, it seems that the system needs to “explore the computational universe” a bit before figuring out how to achieve its goal. </p>\n<p>But how general is this? If we don’t insist on reaching zero error we get a curve of the same general shape, but slightly smoothed out (here for 20 or fewer errors): </p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"149\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025mechanoidalimg7.png\" title=\"\" width=\"389\" /> </div>\n<p><span></p>\n<p>What about for other target sequences? Here are results for all the target sequences we considered before (with the number of errors allowed in each case indicated):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"435\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025mechanoidalimg12.png\" title=\"\" width=\"611\" /> </div>\n<p><span></p>\n<p>In all cases we get final compressed sizes that are much smaller than those for all-but-very-simple randomly chosen rules—indicating that our adaptive evolution process has indeed generated regularity, and our compression method has successfully picked this up. </p>\n<p>Looking at the overall shape of the curves we’ve generated here, there seems to be a general phenomenon in evidence: the process of adaptive evolution seems to pass through a “computationally irreducible period” before getting to its final mechanoidal state. Even as it gets progressively closer to its goal, the adaptive evolution process ends up still “playing the field” before homing in on its “final solution”. (And, yes, phenomena like this are seen both in the fossil record of life on Earth and in the <a href=\"https://writings.stephenwolfram.com/2025/03/what-can-we-learn-about-engineering-and-innovation-from-half-a-century-of-the-game-of-life-cellular-automaton/\">development of engineering systems</a>.)</p>\n<h2 id=\"the-rulial-ensemble-and-its-implications\">The Rulial Ensemble and Its Implications</h2>\n<p>We began by asking the question “what consequences does being ‘evolved for a purpose’ have on a system?” We’ve now seen many examples of different “purposes”, and how adaptive evolution can achieve them. The details are different in different cases. But we’ve seen that there are general features that occur very broadly. Perhaps most notable is that in systems that were “adaptively evolved for a purpose” one tends to see what we can call mechanoidal behavior: behavior in which there are “mechanism-like” elements. </p>\n<p>Rules that are picked purely at random—in effect uniformly from rulial space—rarely show mechanoidal behavior. But in rules that have been adaptively evolved for a purpose mechanoidal behavior is the norm. And what we’ve found here is that this is true essentially regardless of what the specific purpose involved is. </p>\n<p>We can think of rules that have been adaptively evolved for a purpose as forming what we can call a rulial ensemble: a subset of the space of all possible rules, concentrated by the process of adaptive evolution. And what we’ve seen here is that there are in effect generic features of the rulial ensemble—features that are generically seen in rules that have been adaptively evolved for a purpose. </p>\n<p>Given a particular purpose (like “produce this specific sequence as output”) there are typically many ways it can be achieved. It could be that one can <a href=\"https://writings.stephenwolfram.com/2025/03/what-can-we-learn-about-engineering-and-innovation-from-half-a-century-of-the-game-of-life-cellular-automaton/\">engineer a solution</a> that shows a “human-recognizable mechanism” all the way through. It could be that it would be a “lump of computationally irreducible behavior” that somehow “just happens” to have the result of doing what we want. But adaptive evolution seems to produce solutions with what amount to intermediate characteristics. There are elements of mechanism to be seen. And there are also usually certain “sparks of computational irreducibility”. Typically what we see is that in the process of adaptive evolution all sorts of computational irreducibility is generated. But to achieve whatever purpose has been defined requires “taming” that irreducibility. And, it seems, introducing the kind of “patches of mechanism” that are characteristic of the mechanoidal behavior we have seen. </p>\n<p>That those “patches of mechanism” fit together to achieve an overall purpose is often a surprising thing. But it’s the essence of the kind of “bulk orchestration” that we see in the systems we’ve studied here, and that seems also to be characteristic of biological systems. </p>\n<p>Having specified a particular purpose it’s often completely unclear how a given kind of system could possibly achieve it. And indeed what we’ve seen adaptive evolution do here often seems like magic. But in a sense what we’re seeing is just a reflection of the immense power that is available in the computational universe, and manifest in the phenomenon of <a href=\"https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-6--computational-irreducibility\">computational irreducibility</a>. Without computational irreducibility we’d somehow “get what we expect”; computational irreducibility is what adds what is ultimately an infinite element of surprise. And what we’ve seen is that adaptive evolution manages to successfully harness that “element of surprise” to achieve particular purposes.</p>\n<p>Let’s say our goal is to generate a particular sequence of values. One might imagine just operating on a space of possible sequences, and gradually adaptively evolving to the sequence we want. But that’s not the setup we’re using here, and it’s not the setup biology has either. Instead what’s happening both in our idealized cellular automaton systems—and in biology—is that the adaptive evolution process is operating at the level of underlying rules, but the purposes are achieved by the results of running those rules. And it’s because of this distinction—which in biology is associated with genotypes vs. phenotypes—that computational irreducibility has a way to insert itself. In some sense both the underlying rules and overall patterns of purposes can be thought of as defining certain “syntactic structures”. The actual running of the rules then represents what one can think of as the “semantics” of the system. And it’s there that the power of computation is injected.</p>\n<p>But in the end, just how powerful is adaptive evolution, with its ability to tap into computational irreducibility, and to “mine” the computational universe? We’ve seen that some goals are easier to reach than others. And indeed we introduced the concept of mutational complexity to characterize just how much “effort of adaptive evolution” (and, ultimately, how many mutations)—is needed to achieve a given objective. </p>\n<p>If adaptive evolution is able to “fully run its course” then we can expect it to achieve its objective through rules that show mechanoidal behavior and clear “evidence of mechanism”. But if the amount of adaptive evolution stops short of what’s defined by the mutational complexity of the objective, then one’s likely to see more of the “untamed computational irreducibility” that’s characteristic of intermediate stages of adaptive evolution. In other words, if we “get all the way to a solution” there’ll be mechanism to be seen. But if we stop short, there’s likely to be all sorts of “gratuitous complexity” associated with computational irreducibility.</p>\n<p>We can think of our final rulial ensemble as consisting of rules that “successfully achieve their purpose”; when we stop short we end up with another, “intermediate” rulial ensemble consisting of rules that are merely on a path to achieve their purpose. In the final ensemble the forces of adaptive evolution have in a sense tamed the forces of computational irreducibility. But in the intermediate ensemble the forces of computational irreducibility are still strong, bringing the various universal features of computational irreducibility to the fore.</p>\n<p>It may be useful to contrast all of this with what happens in traditional statistical mechanics, say of molecules in a gas—in which <a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/\">I’ve argued (elsewhere)</a> that there’s in a sense almost always “unchecked computational irreducibility”. And it’s this unchecked computational irreducibility that leads to the Second Law—by producing configurations of the system that we (as <a href=\"https://writings.stephenwolfram.com/2023/12/observer-theory/\">computationally bounded observers</a>) can’t distinguish from random, and can therefore reasonably model statistically just as being “typical of the ensemble”, where now the ensemble consists of all possible configurations of the system that, for example, have the same energy or the same temperature. Adaptive evolution is a different story. First, it’s operating not directly on the configurations of a system, but rather on the underlying rules for the system. And second, if one takes the process of adaptive evolution far enough (so that, for example, the number of steps of adaptive evolution is large compared to the mutational complexity of the goal one’s pursuing), then adaptive evolution will “tame” the computational irreducibility. But there’s still an ensemble involved—though now it’s an ensemble of rules rather than an ensemble of configurations. And it’s not an ensemble that somehow “covers all rules”; rather, it’s an ensemble that is “sculpted” by the constraint of “achieving a purpose”. </p>\n<p>I’ve argued that it’s the characteristics of “observers like us” that ultimately lead to the perceived validity of the Second Law. So is there a role for the notion of an observer in our discussion here of bulk orchestration and the rulial ensemble? Well, yes. And in particular it’s critical in grounding our concept of “purpose”. We might ask: what possible “purposes” are there? Well, for something to be a reasonable “purpose” there has to be some way to decide whether or not it’s been achieved. And to make such a decision we need something that’s in effect an “observer”.</p>\n<p>In the case of statistical mechanics and the Second Law—and, in fact, in all our recent successes in deriving foundational principles in both <a href=\"https://www.wolframphysics.org/\" rel=\"noopener\" target=\"_blank\">physics</a> and <a href=\"https://writings.stephenwolfram.com/2022/03/the-physicalization-of-metamathematics-and-its-implications-for-the-foundations-of-mathematics/\">mathematics</a>—we want to consider observers that are somehow “like us”, because in the end what matters for us is how we as observers perceive things. I’ve argued that the most critical feature of observers like us is that we’re computationally bounded (and also, somewhat relatedly, that we assume we’re persistent in time). And it then turns out that the interplay of these features with underlying computational irreducibility is what seems to lead to the core principles of physics (and mathematics) that we’re familiar with. </p>\n<p>But what should we assume about the “observer”—or the “determiner of purpose”—in adaptive evolution, and in particular in biology? It turns out that once again it seems as if computational boundedness is the key. In biological evolution, the implicit “goal” is to have a successful (or “fit”) organism that will, for example, reproduce well in its environment. But the point is that this is a coarse constraint—that we can think of at a computational level as being computationally bounded. </p>\n<p>And indeed <a href=\"https://writings.stephenwolfram.com/2024/12/foundations-of-biological-evolution-more-results-more-surprises/#can-evolution-be-reversed\">I’ve recently argued</a> that it’s this computational boundedness that’s ultimately responsible for the fact that biological evolution can work at all. If to be successful an organism always immediately had to satisfy some computationally very complex constraint, adaptive evolution wouldn’t typically ever be able to find the necessary “solution”. Or, put another way, biological evolution works because the objectives it ends up having to achieve are of limited mutational complexity. </p>\n<p>But why should it be that the environment in which biological evolution occurs can be “navigated” by satisfying computational bounded constraints? In the end, it’s a consequence of the inevitable presence of pockets of computational reducibility in any ultimately computationally irreducible system. Whatever the underlying structure of things, there will always be pockets of computational reducibility to be found. And it seems that that’s what biology and biological evolution rely on. Specific types of biological organisms are often thought of as populating particular “niches” in the environment defined by our planet; what we’re saying here is that all possible “evolved entities” populate an abstract “meta niche” associated with possible pockets of computational reducibility.</p>\n<p>But actually there’s more. Because the presence of pockets of computational reducibility is also what ultimately makes it possible for there to be observers like us at all. As I’ve argued elsewhere, it’s an abstract necessity that <a href=\"https://writings.stephenwolfram.com/2021/04/why-does-the-universe-exist-some-perspectives-from-our-physics-project/\">there must exist a unique object</a>—that I <a href=\"https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/\">call the ruliad</a>—that is the entangled limit of all possible computational processes. And everything that exists must somehow be within the ruliad. But where then are we? It’s not immediately obvious that observers like us—with a coherent existence—would be possible within the ruliad. But if we are to exist there, we must in effect exist in some computationally reducible slice of the ruliad. And, yes, for us to be the way we are, we must in effect be in such a slice.</p>\n<p>But we can still ask why and how we got there. And that’s something that’s potentially informed by the notion of adaptive evolution that we’ve discussed here. Indeed, we’ve argued that for adaptive evolution to be successful its objectives must in effect be computationally reducible. So as soon as we know that adaptive evolution is operating it becomes in a sense inevitable that it will lead to pockets of computational reducibility. That doesn’t in and of itself explain why adaptive evolution happens—but in effect it shows that if it does, it will lead to observers that at some level have characteristics like us. So then it’s a matter of abstract scientific investigation to show—as we in effect have here—that within the ruliad it’s at least possible to have adaptive evolution.</p>\n<h2 id=\"purpose-vs-mechanism-and-the-nature-of-life\">Purpose vs. Mechanism and the Nature of Life</h2>\n<p>Any phenomenon can potentially be explained <a href=\"https://www.wolframscience.com/nks/p831--intelligence-in-the-universe/\">both in terms of purpose and in terms of mechanism</a>. Why does a projectile follow that trajectory? One can explain it as following the mechanism defined by its laws of motion. Or one can explain it as following the purpose of satisfying some overall variational principle (say, extremizing the action associated with the trajectory). Sometimes phenomena are more conveniently explained in terms of mechanism; sometimes in terms of purpose. And one can imagine that the choice could be determined by which is somehow the “computationally simpler” explanation. </p>\n<p>But what about the systems and processes we’ve discussed here? If we just run a system like a cellular automaton we always know its “mechanism”—it’s just its underlying rules. But we don’t immediately know its “purpose”, and indeed if we pick an arbitrary rule there’s no reason to think it will have a “computationally simple” purpose. In fact, insofar as the running of the cellular automaton is a computationally irreducible process, we can expect that it won’t “achieve” any such computationally simple purpose that we can identify.</p>\n<p>But what if the rule is determined by some process of adaptive evolution? Well, then the objective of that adaptive evolution can be seen as defining a purpose that we can use to describe at least certain aspects of the behavior of the system. But what exactly are the implications of the “presence of purpose” on how the system operates? The key point that’s emerged here is that when there’s a computationally simple purpose that’s been achieved through a process of adaptive evolution, then the rules for the system will be part of what we’ve called the rulial ensemble. And then what we’ve argued is that there are generic features of the rulial ensemble—features that don’t depend on what specific purpose the adaptive evolution might have achieved, only that its purpose was computationally simple. And foremost among these generic features is the presence of mechanoidal behavior.</p>\n<p>In other words, so long as there is an overall computationally simple purpose, what we’ve found is that—whatever in detail that purpose might have been—the presence of purpose tends to “push itself down” to produce behavior that locally is mechanoidal, in the sense that it shows evidence of “visible mechanism”. What do we mean by “visible mechanism”? Operationally, it tends to be mechanism that’s readily amenable to “human-level narrative explanation”.</p>\n<p>It’s worth remembering that at the lowest level the systems we’ve studied are set up to have simple “mechanisms” in the sense that they have simple underlying rules. But once these rules run they generically produce computationally irreducible behavior that doesn’t have a simple “narrative-like” description. But when we’re looking at the results of adaptive evolution we’re dealing with a subset of rules that are part of the rulial ensemble—and so we end up seeing mechanoidal behavior with at least local “narrative descriptions”.</p>\n<p>As we’ve discussed, though, if the adaptive evolution hasn’t “entirely run its course”, in the sense that the mutational complexity of the objective is higher than the actual amount of adaptive evolution that’s been done, then there’ll still be computational irreducibility that hasn’t been “squeezed out”. </p>\n<p>So how does all this relate to biology? The first key element of biology as far as we are concerned here is that there’s a separate genotype and phenotype—related by what’s presumably in general the computationally irreducible process of biological growth, etc. The second key element of biology for our purposes here is the phenomenon of self reproduction—in which new organisms are produced with genotypes that are identical up to small mutations. Both these elements are immediately captured by the simple cellular automaton model we’ve used here.</p>\n<p>And given them, we seem to be led inexorably to our conclusions here about the rulial ensemble, mechanoidal behavior, and bulk orchestration. </p>\n<p>It’s often been seen as mysterious how there ends up being so much apparent complexity in biology. But once one knows about computational irreducibility, one realizes that actually complexity is quite ubiquitous. And instead what’s in many respects more surprising is the presence of any “explainable mechanism”. But what we’ve seen here through the rulial ensemble is that such explainable mechanism is in effect a shadow of overall “simple computational purposes”. </p>\n<p>At some level there’s computational irreducibility everywhere. And indeed it’s<br />\nthe driver for rich behavior. But what happens is that “in the presence of overall purpose”, patches of computational irreducibility have to be fitted together to achieve that purpose. Or, in other words, there’s inevitably a certain “bulk orchestration” of all those patches of computation. And that’s what we see so often in actual biological systems.</p>\n<p>So what is it in the end that’s special about life—and biological systems? I think—more than anything—it’s that it’s involved so much adaptive evolution. All those <a href=\"https://writings.stephenwolfram.com/2024/05/why-does-biological-evolution-work-a-minimal-model-for-biological-evolution-and-other-adaptive-processes/#correspondence-with-biological-phenomena\">~10<sup>40</sup> individual organisms in the history of life on earth</a> have been links in chains of adaptive evolution. It might have been that all that “effort of adaptive evolution” would have the effect of just “solving the problem”—and producing some “simple mechanistic solution”. </p>\n<p>But that’s not what we’ve seen here, and that’s not how we can expect things to work. Instead, what we have is an elaborate interplay of “lumps of computational irreducibility” being “harnessed” by “simple mechanisms”. It matters that there’s been so much adaptive evolution. And what we’re now seeing throughout biology—down to the smallest features—is the consequences of that adaptive evolution. Yes, there are “frozen accidents of history” to be seen. But the point is not those individual items, but rather the whole aggregate consequence of adaptive evolution: mechanoidal behavior and bulk orchestration.</p>\n<p>And it’s because these features are generic that we can hope they can form the basis for what amounts to a robust “bulk” theory of biological systems and biological behavior: something that has roughly the same “bulk theory” character as the gas laws, or fluid dynamics. But that’s now talking about systems that have been subject to large-scale adaptive evolution at the level of their rules. </p>\n<p>What I’ve done here is very much just a beginning. But I believe the ruliological investigations I’ve shown, and the general framework I’ve described, provide the raw material for something we’ve never had before: a well defined and general “fundamental theory” for the operation of living systems. It won’t describe all the “historical accident” details. But I’m hopeful that it will provide a useful global view of what’s going on, that can potentially be harvested for answers to all sorts of useful questions about the remarkable phenomenon we call life.</p>\n<h2 id=\"appendix-different-adaptive-strategies\">Appendix: Different Adaptive Strategies</h2>\n<p>In our explorations of the rulial ensemble—and of mutational complexity—we’ve looked at a range of possible objective functions. But we’ve always considered just one adaptive evolution strategy: accepting or rejecting the results of single-point random mutations in the rule at each step. So what would happen if we were to adopt a different strategy? The main conclusion is: it doesn’t seem to matter much. For a particular objective function, there are adaptive evolution strategies that get to a given result in fewer adaptive steps, or that ultimately get further than our usual strategy ever does. But in the end the basic story of the rulial ensemble—and of mutational complexity—is robust relative to detailed changes in our adaptive evolution process. </p>\n<p>As an example, consider allowing more than one random mutation in the rule at each adaptive evolution step. Let’s say—as at the very beginning above—that our objective is to generate <img height=\"8\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025appendiximg1.png\" width=\"73\" /> after 50 steps. With just one mutation at each step it’s only a small fraction of adaptive evolution “runs” that reach “perfect solutions”, but with more mutations at each step, more progress is made, at least in this case—as illustrated by histograms of the “number of errors” remaining after 10,000 adaptive evolution steps:</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"126\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025appendiximg3.png\" title=\"\" width=\"668\" /> </div>\n<p><span></p>\n<p>Looked at in terms of multiway systems, having fewer mutations at each step leads to fewer paths between possible rules, and a greater possibility of “getting stuck”. With more mutations at each step there are more paths overall, and a lower possibility of getting stuck.</p>\n<p>So what about mutational complexity? If we still say that each adaptive evolution step accounts for a single unit of mutational complexity (even if it involves multiple underlying mutations in the rule), this shows how the mutational complexity (as computed above) for different objectives is affected by having different numbers of underlying mutations at each step (the height of each “tick” indicates the number of mutations):</p>\n<div class=\"wolfram-c2c-wrapper writtings-c2c_above\"> <img alt=\"\" height=\"225\" src=\"https://content.wolfram.com/sites/43/2025/11/sw11072025appendiximg4.png\" title=\"\" width=\"597\" /> </div>\n<p><span></p>\n<p>So, yes, different numbers of mutations at each step lead to mutational complexities that are different in detail, but in most cases, surprisingly similar overall. </p>\n<p>What about other adaptive evolution strategies? There are many one could consider. For example, a “gradient descent” approach where at each step we examine all possible mutations, and pick the “best one”—i.e. the one that increases fitness the most. (We can extend this by keeping not just the top rule at each step, but, say, the top 5—in an analog of “beam search”.) There’s also a “collaborative” approach, where multiple different “paths” of random mutations are followed, but where every so often all are reset to be the best found so far. And indeed, we can consider all sorts of techniques from reinforcement learning. </p>\n<p>In particular cases, any of these approaches can have significant effects. But in general the phenomena we’re discussing here seem robust enough that the details of how adaptive evolution is done don’t matter much, and the single-mutation strategy we’ve mostly used here can be considered adequately representative.</p>\n<h2 id=\"historical--personal-background\">Historical &#038; Personal Background</h2>\n<p>It’s been obvious since antiquity that living organisms contain some kind of “gooey stuff” that’s different from what one finds elsewhere in nature. But what is it? And how universal might it be? In Victorian times it had various names, the most notable being “protoplasm”. The increasing effectiveness of microscopy made it clear that there was actually a lot of structure in “living matter”—as, for example, reflected in the presence of different organelles. But until the later part of the twentieth century there was a general belief that fundamentally what was going on in life was chemistry—or at least biochemistry—in which all sorts of different kinds of molecules were randomly moving and undergoing chemical reactions at certain rates.</p>\n<p>The digital nature of DNA discovered in 1953 slowly began to erode this picture, adding in ideas about molecular-scale mechanisms and “machinery” that could be described in mechanical or informational—rather than “bulk statistical”—ways. And indeed a notable trend in molecular biology over the past several decades has been the discovery of more and more ways in which molecular processes in living systems are “actively orchestrated”, and not just the result of “random statistical behavior”. </p>\n<p>When a single component can be identified (cell membranes, microtubules, biomolecular condensates, etc.) there’s quite often been “bulk theory” developed, typically based on ideas from statistical mechanics. But when it comes to constellations of different kinds of components, most of what’s been done has been to collect the material to fill many volumes of biology texts with what amount to narrative descriptions of how in detail things operate—with no attempt at any kind of “general picture” independent of particular details.</p>\n<p>My own foundational interest in biology goes back about half a century. And when I <a href=\"https://www.wolframscience.com/nks/chap-1--the-foundations-for-a-new-kind-of-science#sect-1-4--the-personal-story-of-the-science-in-this-book\">first started studying cellular automata</a> at the beginning of the 1980s I certainly wondered (<a href=\"https://www.wolframscience.com/nks/notes-2-3--history-of-cellular-automata/\">as others had before</a>) whether they might be relevant to biology. That question was then greatly accelerated when I <a href=\"https://www.wolframscience.com/nks/chap-2--the-crucial-experiment#sect-2-1--how-do-simple-programs-behave\">discovered that even with simple rules</a>, cellular automata could generate immensely complex behavior, which often looked visually <a href=\"https://www.wolframscience.com/nks/p237--four-classes-of-behavior/\">surprisingly “organic”</a>. </p>\n<p>In the 1990s I put quite some effort into what amount to macroscopic questions in biology: how do things <a href=\"https://www.wolframscience.com/nks/chap-8--implications-for-everyday-systems#sect-8-6--growth-of-plants-and-animals\">grow into different shapes</a>, <a href=\"https://www.wolframscience.com/nks/chap-8--implications-for-everyday-systems#sect-8-7--biological-pigmentation-patterns\">produce different pigmentation patterns</a>, etc.? But somehow in everything I studied there was a certain assumed uniformity: many elements might be involved, but they were all somehow essentially the same. I was well aware of the complex reaction networks—and, later, pieces of “molecular machinery”—that had been discovered. But they felt more like systems from engineering—with lots of different detailed components—and not like systems where there could be a “broad theory”. </p>\n<p>Still, within the type of engineering I knew best—namely software engineering—I kept wondering whether there might perhaps be general things one could say, particularly about the overall structure and operation of large software systems. I made measurements. I constructed dependency graphs. I thought about analogies between bugs and diseases. But beyond a few power laws and the like, I never really found anything. </p>\n<p>A lot changed, however, with the advent of our <a href=\"https://www.wolframphysics.org/\" rel=\"noopener\" target=\"_blank\">Physics Project</a> in 2020. Because, among other things, there was now the idea that everything—even the structure of spacetime—was dynamic, and in effect emerged from a graph of causal relationships between events. So what about biology? Could it be that what mattered in molecular biology was the <a href=\"https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#chemistry-molecular-biology\">causal graph of interactions between individual molecules</a>? Perhaps there needed to be a “subchemistry” that tracked specific molecules, rather than just molecular species. And perhaps to imagine that ordinary chemistry could be the basis for biology was as wide of the mark as thinking that studying the physics of electron gases would let one understand microprocessors. </p>\n<p>Back in the early 1980s I had identified that the typical behavior of systems like cellular automata could be <a href=\"https://www.wolframscience.com/nks/chap-6--starting-from-randomness#sect-6-2--four-classes-of-behavior\">divided into four classes</a>—with the fourth class having the highest level of obvious complexity. And, yes, the visual patterns produced in class 4 systems often had a very “life like” appearance. But was there a foundational connection? In 2023, as part of closing off a <a href=\"https://writings.stephenwolfram.com/2023/02/a-50-year-quest-my-personal-journey-with-the-second-law-of-thermodynamics/\">50-year personal journey</a>, I had been studying the <a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/\">Second Law of thermodynamics</a>, and <a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/#class-4-and-the-mechanoidal-phase\">identified class 4 systems as ones that</a>—like living systems—aren’t usefully described just in terms of a tendency to randomization. Reversible class 4 systems made it particularly clear that in class 4 there really was a distinct form of behavior—that I called “<a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/#class-4-and-the-mechanoidal-phase\">mechanoidal</a>”—in which a certain amount of definite structure and “mechanism” are visible, albeit embedded in great overall complexity.</p>\n<p>At first far from thinking about molecules I made some <a href=\"https://writings.stephenwolfram.com/2024/05/why-does-biological-evolution-work-a-minimal-model-for-biological-evolution-and-other-adaptive-processes/\">surprise progress in 2024 on biological evolution</a>. In the mid-1980s I had considered modeling evolution in terms of successive small mutations to things like cellular automaton rules. But at the time it didn’t work. And it’s only after new intuition from the success of machine learning that in 2024 I tried again—and this time it worked. Given an objective like “make a finite pattern that lives as long as possible”, adaptive evolution by successive mutation of rules (say in a cellular automaton) seemed to almost magically find—typically very elaborate—solutions. Soon I had understood that what I was seeing was essentially “raw computational irreducibility” that just “happened” to fit the fairly coarse fitness criteria I was using. And I then argued that the success of biological evolution was the result of the interplay between computationally bounded fitness and underlying computational irreducibility.</p>\n<p>But, OK, what did that mean for the “innards” of biological systems? Exploring an <a href=\"https://writings.stephenwolfram.com/2025/02/towards-a-computational-formalization-for-foundations-of-medicine/\">idealized version of medicine</a> on the basis of my minimal models of biological evolution led me to look in a bit more detail at the spectrum of behavior in adaptively evolved systems, and in variants produced by perturbations.</p>\n<p>But was there something general—something potentially universal—that one could say? In the Second Law one often talks about how behavior one sees is somehow overwhelmingly likely to be “<a href=\"https://writings.stephenwolfram.com/2023/02/computational-foundations-for-the-second-law-of-thermodynamics/#textbook-thermodynamics\">typical of the ensemble of all possibilities</a>”. In the usual Second Law, the possibilities are just different initial configurations of molecules, etc. But in thinking about a system that can change its rules, the ensemble of all possibilities is—at least at the outset—much bigger: in effect it’s <a href=\"https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/\">the whole ruliad</a>. But the crucial point I realized a few months ago is that the changes in rules that are relevant for biology must be ones that can somehow be achieved by a process of adaptive evolution. But what should the objective of that adaptive evolution be?</p>\n<p>One of the key lessons from our Physics Project and the many things informed by it is that, yes, the <a href=\"https://writings.stephenwolfram.com/2023/12/observer-theory/\">character of the observer </a>matters—but knowing just a little about an observer can be sufficient to deduce a lot about the laws of behavior that observer will perceive. So that led to the idea that this kind of thing might be true about objective functions—and that just knowing that, for example, an objective function is computationally simple might be enough to tell one things about the “rulial ensemble” of possible rules.</p>\n<p>But is that really true? Well, as I have done so many times, I turned to computer experiments to find out. In my work on the foundations of biological evolution I had used what are in a sense very “generic” fitness functions (like overall lifetime). But now I needed a whole spectrum of possible fitness functions—some of them by many measures in fact even simpler to set up than something like lifetime.</p>\n<p>The results I’ve reported here I consider very encouraging. The underlying details don’t seem to matter much. But a broad range of computationally simple fitness functions seem to “worm their way down” to have the same kind of effect on small-scale behavior—and to make it in some sense mechanoidal. </p>\n<p>Biology has tended to be a field in which one doesn’t expect much in the way of formal theoretical underpinning. And indeed—even after all the data that’s been collected—there are remarkably few “big theories” in biology: natural selection and the digital/informational nature of DNA have been pretty much the only examples. But now, from the type of thinking introduced by our Physics Project, we have something new and different: the concept of the rulial ensemble, and the idea that essentially just from the fact of biological evolution we can talk about certain features of how adaptively evolved systems in biology must work. </p>\n<p>Traditional mathematical methods have never gotten very far with the broad foundations of biology. And nor, in the end, has specific computational modeling. But by going to a higher level—and in a sense thinking about the space of all possible computations—I believe we can begin to see a path to a powerful general framework not only for the foundations of biology, but for any system that shows bulk orchestration produced by a process of adaptive evolution.</p>\n<h2 id=\"thanks\" style=\"font-size: 1.2rem;\">Thanks</h2>\n<p style=\"font-size: 90%;\">Thanks to Willem Nielsen of the <a href=\"https://wolframinstitute.org/\" rel=\"noopener\" target=\"_blank\">Wolfram Institute</a> for extensive help, as well as to Wolfram Institute affiliates Júlia Campolim and Jesse Angeles Lopez for their additional help. The ideas here have ultimately come together rather quickly, but in both the recent and the distant past discussions with a number of people have provided useful ideas and background—including with Richard Assar, Charles Bennett, Greg Chaitin, Paul Davies, Walter Fontana, Nigel Goldenfeld, Greg Huber, Stuart Kauffman, Chris Langton, Pedro Márquez-Zacarías and Elizabeth Wolfram.</p>"
            ],
            "link": "https://writings.stephenwolfram.com/2025/11/whats-special-about-life-bulk-orchestration-and-the-rulial-ensemble-in-biology-and-beyond/",
            "publishedAt": "2025-11-11",
            "source": "Stephen Wolfram",
            "summary": "<span class=\"thumbnail\"><img alt=\"\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" height=\"108\" src=\"https://content.wolfram.com/sites/43/2025/11/icon-rulial-ensemble.png\" width=\"128\" /></span>Towards a Theory of Bulk Orchestration It’s a key feature of living systems, perhaps even in some ways the key feature: that even right down to a molecular scale, things are orchestrated. Molecules (or at least large ones) don’t just move around randomly, like in a liquid or a gel. Instead, what molecular biology has [&#8230;]",
            "title": "What’s Special about Life? Bulk Orchestration and the Rulial Ensemble in Biology and Beyond"
        },
        {
            "content": [
                "<p>I previously covered <a href=\"https://thezvi.substack.com/p/kimi-k2\"><strong>Kimi K2,</strong></a> which now has a new thinking version. As I said at the time back in July, price in that the thinking version is coming.</p>\n<p>Is it the real deal?</p>\n<p>That depends on what level counts as the real deal. It’s a good model, sir, by all accounts. But there have been fewer accounts than we would expect if it was a big deal, and it doesn’t fall into any of my use cases.</p>\n\n\n<h4 class=\"wp-block-heading\">Introducing K2 Thinking</h4>\n\n\n<blockquote><p><a href=\"https://x.com/Kimi_Moonshot/status/1986449512538513505\">Kimi.ai</a>: <img alt=\"🚀\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f680.png\" style=\"height: 1em;\" /> Hello, Kimi K2 Thinking!</p>\n<p>The Open-Source Thinking Agent Model is here.</p>\n<p><img alt=\"🔹\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f539.png\" style=\"height: 1em;\" /> SOTA on HLE (44.9%) and BrowseComp (60.2%)</p>\n<p><img alt=\"🔹\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f539.png\" style=\"height: 1em;\" /> Executes up to 200 – 300 sequential tool calls without human interference</p>\n<div>\n\n\n<span id=\"more-24847\"></span>\n\n\n</div>\n<p><img alt=\"🔹\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f539.png\" style=\"height: 1em;\" /> Excels in reasoning, agentic search, and coding</p>\n<p><img alt=\"🔹\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f539.png\" style=\"height: 1em;\" /> 256K context window</p>\n<p>Built as a thinking agent, K2 Thinking marks our latest efforts in test-time scaling — scaling both thinking tokens and tool-calling turns.</p>\n<p>K2 Thinking is now live on <a href=\"http://kimi.com\" rel=\"nofollow\">http://kimi.com</a> in chat mode, with full agentic mode coming soon. It is also accessible via API.</p>\n<p><a href=\"https://t.co/EOZkbOwCN4\">API here</a>, <a href=\"https://t.co/n7xxaszqzF\">Tech blog here</a>, <a href=\"https://t.co/4ukcXB0iP6\">Weights and code here</a>.</p></blockquote>\n<p><a href=\"https://x.com/elder_plinius/status/1986533887833469420\">(Pliny jailbreak here.)</a></p>\n<p>It’s got 1T parameters, and Kimi and Kimi K2 have a solid track record, so it’s plausible this could play with the big boys, although the five month delay in getting to a reasoning model suggests skepticism it can be competitive.</p>\n<p>As always, internal benchmark scores can differ greatly from outside benchmark scores, especially for open models. Sometimes this is due to outsiders botching setup, but also inside measurements need to be double checked.</p>\n<p>For Humanity’s Last Exam, I see an outside source saying as of November 9 <a href=\"https://x.com/moreisdifferent/status/1987495505169985983\">it was in second place on Humanity’s Last Exam at 23.9%</a>, which is very much not 44.9% but still very good.</p>\n\n\n<h4 class=\"wp-block-heading\">Writing Quality</h4>\n\n\n<p>On writing quality we’ve gotten endorsements for Kimi K2 for a while.</p>\n<blockquote><p><a href=\"https://x.com/krishnanrohit/status/1986533122624909502\">Rohi</a>t: Kimi K2 is remarkably good at writing, and unlike all others thinking mode hasn’t degraded its writing ability more.</p>\n<p>Morgan: if i recall, on release gpt-5 was the only model where writing quality improved with thinking effort.</p>\n<p>Rohit: Alas.</p>\n<p>Gary Fung: Kimi has always been a special snowflake on creative writing.</p></blockquote>\n<p><a href=\"https://x.com/tessera_antra/status/1987544143317389736\">Here’s one part of the explanation</a> <a href=\"https://www.dbreunig.com/2025/07/31/how-kimi-rl-ed-qualitative-data-to-write-better.html\">of how they got the writing</a> to be so good, which involves self-ranking RL and writing self-play, with a suggestion of some similarities to the training of Claude 3 Opus. In a sense this looks like ‘try to do better, at all.’</p>\n\n\n<h4 class=\"wp-block-heading\">Agentic Tool Use</h4>\n\n\n<p>On the agentic tool use and general intelligence? I’m more skeptical.</p>\n<p><a href=\"https://x.com/ArtificialAnlys/status/1986541785511043536\">Artificial Analysis has Kimi K2 Thinking at the top of its Agentic Tool Use</a>, by 93%-87%, which is a huge gap in context, which is its strongest subset.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!A8My!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc7a1eb79-59bb-4a43-b2a1-b91cb83b77ed_1200x515.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>As is usually true when people compare open to closed models, this is the open model’s best benchmark, so don’t get carried away, but yes overall it did well on Artificial Analysis, indeed suspiciously well given how little talk I see.</p>\n<p>The tool calling abilities are exciting for an open model, although standard for closed. This is a good example of how we look for ways for open models to impress by matching closed abilities in spots, also it is indeed highly useful.</p>\n\n\n<h4 class=\"wp-block-heading\">Overall</h4>\n\n\n<p><a href=\"https://artificialanalysis.ai/models\">Overall Artificial Analysis Intelligence index</a> has Kimi K2 Thinking at 67, one point behind GPT-5 and ahead of everyone else. Kimi used the most tokens of any model, but total cost was lower than the top closed models, although not dramatically so ($829-$913 for GPT-5, $817 for Sonnet, $380 for Kimi K2) as cost is $0.6/$2.5 per million tokens, versus $1.25/$10 for GPT-5 and $3/$15 for Sonnet.</p>\n<p><a href=\"https://www.interconnects.ai/p/kimi-k2-thinking-what-it-means\">Nathan Lambert is impressed</a>, relying on secondary information (‘seems like a joy to use’), and offers thoughts.</p>\n<p>He notes that yes, labs start out targeting benchmarks and then transition to actually targeting useful things, such as how K2 Thinking was post-trained in 4bit precision to prepare for realistic tasks and benchmarked the same way. I agree that’s pretty cool.</p>\n\n\n<h4 class=\"wp-block-heading\">Are Benchmarks Being Targeted?</h4>\n\n\n<p>It does seem plausible that Kimi K2 is still in the ‘target the benchmarks’ phrase in most places, although not in creative writing. By default, I expect such models to punch ‘below their benchmark-implied weight’ on practical tasks.</p>\n<p>For now we don’t have many other outside scores to work with and feedback is light.</p>\n<blockquote><p><a href=\"https://x.com/Simeon_Cps/status/1986787277788623163\">Simeon</a>: is Kimi K2 benchmaxxing or are they actually SOTA while training on potatoes?</p>\n<p>Prinz: In my testing (for my use cases, which have nothing to do with math and coding), K2-Thinking is obviously worse than GPT-5 Thinking, but by a relatively modest margin. If I had no access to other models, I would happily use K2-Thinking and it wouldn’t feel like a huge downgrade.</p>\n<p>ahtoshkaa: I have a pretty sophisticated companion app that uses about 5-10K of varied, information dense context. So the model has to properly parse this information and have very good writing skills. kimi-k2-thinking is absolute ass. similarly to the new OpenAI model &#8211; Polaris Alpha.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Just As Good Syndrome</h4>\n\n\n<p>There’s a growing rhetorical pressure, or marketing style pressure, where the ‘benchmark gaps’ are closing. Chinese labs can point to numbers that say they are ‘just as good’ or almost as good, for many purposes ‘good enough’ is good enough. And many people (including the likes of David Sacks) point to GPT-5 and similar as showing progress isn’t impressive or scary. But as Nathan points out we now see releases like Claude 4 where the benchmark gains look small but real world gains are large, and I would add GPT-5 (and Sonnet 4.5) to that category as well.</p>\n\n\n<h4 class=\"wp-block-heading\">Reactions</h4>\n\n\n<blockquote><p><a href=\"https://x.com/teortaxesTex/status/1988299047074230470\">Teortaxes</a>: It’s token-hungry, slow-ish, and sometimes rough around the edges. Generally though it’s a jump for open/Chinese models, in the league of Sonnet 4.5 and GPT-5 (maybe -mini depending on task) and a genuinely strong SWE agent. Legitimate alternative, not “but look at the price.”</p></blockquote>\n<p>It’s baked in that the open alternatives are pretty much always going to be rough around the edges, and get evaluated largely in terms of their peak relative performance areas. This is still high praise, putting Kimi in striking distance of the current big two.</p>\n<p>Havard Isle has it coming in at a solid 42.1% on WeirdML, matching Opus 4.1.</p>\n<p>Here’s something cool:</p>\n<blockquote><p>Pawal Azczesny: Kimi K2 Thinking is using systematically (on its own, without prompting) some of the debiasing strategies known from cognitive sciences. Very impressive. I didn’t see any other model doing that. Well done <a href=\"https://x.com/Kimi_Moonshot\">@Kimi_Moonshot</a>.</p>\n<p>It goes beyond “think step by step”. For instance it applied pre-mortem analysis, which is not frequently used. Or it exaggerates claims to see if the whole structure still stands on its own. Pretty neat. Other models need to be instructed to do this.</p></blockquote>\n<p><a href=\"http://Caught it hallucinating sources on Deep Research\">Steve Hsu got some good math results.</a></p>\n<p>Other notes:</p>\n<blockquote><p>MinusGix: I’ve found it to be better than GPT-5 at understanding &amp; explaining type-theory concepts. Though as usual with Kimi it writes eloquently enough that it is harder to tell when it is bullshitting compared to GPT-5.</p>\n<p>Emerson Kimura: Did a few quick text tests, and it seemed comparable to GPT-5</p>\n<p>Ian Pitchford: It’s very thorough; few hallucinations.</p>\n<p>FredipusRex: Caught it hallucinating sources on Deep Research.</p>\n<p>Lech Mazur: Sorry to report, but Kimi K2 Thinking is entering reasoning loops and failing to produce answers for many Extended Connections benchmark questions (double-checked using <a href=\"https://platform.moonshot.ai/playground\">https://platform.moonshot.ai/playground</a>, so it’s not an API call issue).</p></blockquote>\n<p>The safety protocols? The what now?</p>\n<blockquote><p><a href=\"https://x.com/davidmanheim/status/1988292285038293462\">David Manheim</a>: It’s very willing to give detailed chemical weapons synthesis instructions and advice, including for scaling production and improving purity, and help on how to weaponize it for use in rockets &#8211; with only minimal effort on my part to circumvent refusals.</p></blockquote>\n<p>Two of the three responses to that were ‘good news’ and ‘great. I mean it too.’ So yeah, AI is going to go great, I can tell.</p>\n\n\n<h4 class=\"wp-block-heading\">Otherwise It Has Been Strangely Quiet</h4>\n\n\n<p>I say strangely because this is by all accounts the strongest open model, the strongest Chinese model and a rival for best agentic or tool use model overall. Yet I don’t see much excitement, or feedback at all either positive or negative.</p>\n<p>There’s no question Kimi K2 was impressive, and that Kimi K2 Thinking is also an impressive model, even assuming it underperforms its numbers. It’s good enough that it will often be worth testing it out on your use cases and seeing if it’s right for you. My guess is it will rarely be right unless you are highly price conscious, but we’ll see.</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/11/11/kimi-k2-thinking/",
            "publishedAt": "2025-11-11",
            "source": "TheZvi",
            "summary": "I previously covered Kimi K2, which now has a new thinking version. As I said at the time back in July, price in that the thinking version is coming. Is it the real deal? That depends on what level counts as the real deal. It’s a good model, sir, by all accounts. But there have &#8230; &#8230; <a href=\"https://thezvi.wordpress.com/2025/11/11/kimi-k2-thinking/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Kimi K2 Thinking"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-11-11"
}