{
    "articles": [
        {
            "content": [],
            "link": "https://bernsteinbear.com/blog/walking-around/?utm_source=rss",
            "publishedAt": "2025-09-23",
            "source": "Max Bernstein",
            "summary": "<p>Walking around outside is good for you.<sup>[<a href=\"https://en.wikipedia.org/wiki/Wikipedia:Citation_needed\"><i>citation needed</i></a>]</sup> A nice amble through the trees can quiet inner turbulence and make complex engineering problems disappear.</p> <p>Vicki Boykis wrote a post, <a href=\"https://vickiboykis.com/2025/09/09/walking-around-the-app/\">Walking around the app</a>, about a more proverbial stroll. In it, she talks about constantly using your production application’s interface to make sure the whole thing is cohesively designed with few rough edges.</p> <p>She also talks about walking around other parts of the <em>implementation</em> of the application, fixing inconsistencies, complex machinery, and broken builds. Kind of like picking up someone else’s trash on your hike.</p> <p>That’s awesome and universally good advice for pretty much every software project. It got me thinking about how I walk around the compiler.</p> <h2 id=\"what-does-your-output-look-like\">What does your output look like?</h2> <p>There’s a certain class of software project that transforms data—compression libraries, compilers, search engines—for which there’s another layer of “walking around” you can do. You have the code, yes, but you also have <em>non-trivial output</em>.</p> <!-- TODO pick another term --> <p>By non-trivial, I mean an output that scales along some quality axis instead of something semi-regular like a JSON response. For compression, it’s size. For compilers, it’s generated code.</p> <p>You probably already have",
            "title": "Walking around the compiler"
        },
        {
            "content": [],
            "link": "https://qntm.org/jsoncount",
            "publishedAt": "2025-09-23",
            "source": "QNTM",
            "summary": "<b><a href=\"https://qntm.org/jsoncount\">Code</a> »</b> A valid JSON string is a finite series of characters, each character chosen from an alphabet of 1,114,112 possible characters, which additionally conforms to the simple grammar described at json.org. We number the characters in hexadecimal from 0x0000 to 0x10FFFF inclusive. These characters originate in Unicode, but aside from serving as a basic lookup table - character 0x0020 is a space, for example, and \"x\" is 0x0078 - Unicode itself is not actually massively important to this question. The JSON grammar doesn't say anything about the use or misuse of reserved Unicode characters, the proper matching of surrogate pairs or anything like that. This makes our job a lot easier, though it's still complex enough to be entertaining. The various possible binary encodings of a Unicode string, such as UTF-8, are also not considered here. String length will be measured in characters, not in bytes. Again, this makes the job a lot easier. There are 1114112N possible strings of length N ≥...",
            "title": "How many valid JSON strings are there?"
        },
        {
            "content": [
                "<p>Previously I shared <a href=\"https://thezvi.substack.com/p/reactions-to-if-anyone-builds-it\"><strong>various reactions to</strong></a> <a href=\"https://www.amazon.com/Anyone-Builds-Everyone-Dies-Superhuman/dp/0316595640/ref=tmm_hrd_swatch_0\">If Anyone Builds It Everyone Dies</a>, <a href=\"https://thezvi.substack.com/p/book-review-if-anyone-builds-it-everyone?r=67wny\">along with my own highly positive review</a>.</p>\n<p>Reactions continued to pour in, including several impactful ones. There’s more.</p>\n<p>Any further reactions will have a higher bar, and be included in weekly posts unless one is very high quality and raises important new arguments.</p>\n\n\n<h4 class=\"wp-block-heading\">Sales Look Good</h4>\n\n\n<p><a href=\"https://x.com/Mihonarium/status/1969826404716937551\">IABIED gets to #8 in Apple Books nonfiction</a>, #2 in UK. <a href=\"https://www.amazon.com/Anyone-Builds-Everyone-Dies-Superhuman/dp/0316595640/ref=sr_1_1?crid=M065SL0YL1UF&amp;dib=eyJ2IjoiMSJ9.j4Y5GR3ujo6kKNb3u4icO9qYBSJbcNRm3jMNEQ6VAKiL36tyBKrBMw-Vfl-_akHbsQzohNeWzLAh2wAdzth3FoaV8RcY7MbG_zcG8AXAKhW1w0tMwcwoOKIhfIeGemfupFZxLdMfqKMDVroCBnNvxg.AKodAIu4UEviv9K1813l5rQW3ferYLSFs7XYVghc6TQ&amp;dib_tag=se&amp;keywords=if+anyone+builds+it+everyone+dies&amp;qid=1758542437&amp;sprefix=if+anyone%2Caps%2C551&amp;sr=8-1\">It has 4.8 on Amazon</a> and 4.3 on Goodreads. <a href=\"https://www.nytimes.com/books/best-sellers/2025/09/28/hardcover-nonfiction/\">The New York Times bestseller list</a> lags by two weeks so we don’t know the results there yet but it is expected to make it.</p>\n<div>\n\n\n<span id=\"more-24739\"></span>\n\n\n</div>\n\n\n<h4 class=\"wp-block-heading\">Positive Reactions</h4>\n\n\n<p><a href=\"https://davekasten.substack.com/p/book-non-review-if-anyone-builds\">David Karsten suggests you read the book</a>, while noting he is biased. He reminds us that, like any other book, most conversations you have about the book will be with people who did not read the book.</p>\n<blockquote><p><a href=\"https://x.com/davidmanheim/status/1968674560900767818\">David Manheim</a>: “An invaluable primer on one side of the critical and underappreciated current debate between those dedicated to building this new technology, and those who have long warned against it. If you haven&#8217;t already bought the book, you really should.”</p></blockquote>\n<p><a href=\"https://www.theargumentmag.com/p/if-someone-builds-it-will-everyone\">Kelsey Piper offers a (gated) review of IABIED</a>, noting that the correct focus is on whether the title’s claim is true.</p>\n<p><a href=\"https://www.lesswrong.com/posts/btHmC88KCZdzimBCM/steve2152-s-shortform?commentId=vzWgcoP3isSBQbDbe\">Steven Byrnes reviews the book</a>, says he agrees with ~90% of it, disagreeing with some of the reasoning steps but emphasizes that the conclusions are overdetermined.</p>\n<p><a href=\"https://x.com/michael_nielsen/status/1969446128803594320\">Michael Nielsen gives the book five stars</a> on Goodreads and recommends it, as it offers a large and important set of largely correct arguments, with the caveat that there he sees significant holes in the central argument. His actual top objection is that even if we do manage to get a controlled and compliant ASI, that is still extremely destabilizing at best and fatal at worst. I agree with him this is not a minor quibble, and I worry about that scenario a lot whereas the book’s authors seem to consider it a happy problem they’d love to have. If anything it makes the book’s objections to ‘building it’ even stronger. He notes he does not have a good solution.</p>\n<p>Romy Mireo thought the book was great for those thinking the problem through, <a href=\"https://x.com/RomyMireo/status/1970295601146536034\">but would have preferred the book offer a more streamlined way for a regular person to help</a>, in a Beware Trivial Inconveniences kind of way. The book <a href=\"https://t.co/lRUzy0MHam\">attempts to provide this in its online resources</a>.</p>\n<p><a href=\"https://substack.com/inbox/post/174034727?triedRedirect=true\">Nomads Vagabonds (in effect) endorses the first 2 parts of the book</a>, but strongly opposes the policy asks in part 3 as unreasonable asks, demanding that if you are alarmed you need to make compromises to ‘help you win,’ if you think the apocalypse is coming you only propose things inside the Overton Window, that ‘even a 1% reduction in risk is worth pursuing.’</p>\n<p>That only makes sense if and only if solutions inside the Overton Window substantially improve your chances or outlook, and thus the opportunity outweighs the opportunity cost. The reason (as Nomads quotes) Ezra Klein says Democrats should compromise on various issues if facing what they see as a crisis, is this greatly raises the value of ‘win the election with a compromise candidate’ relative to losing. There’s tons of value to protect even if you give up ground on some issues.</p>\n<p>Whereas the perspective of Yudkowsky and Soares is that measures ‘within the Overton Window’ matter very little in terms of prospective outcomes. So you’d much rather take a chance on convincing people to do what would actually work. It’s a math problem, including the possibility that busting the Overton Window helps the world achieve other actions you aren’t yourself advocating for.</p>\n<p>The central metaphor Nomads uses is protecting against dragons, where the watchman insists upon only very strong measures and rejects cheaper ones entirely. Well, that depends on if the cheaper solutions actually protect you from dragons.</p>\n<p>If you believe &#8211; as I do! &#8211; that lesser changes can make a bigger difference, then you should say so, and try to achieve those lesser changes while also noting you would support the larger ask. If you believe &#8211; as the authors do &#8211; that the lesser changes can’t make much difference, then you say that instead.</p>\n<p>I would also note that yes, there are indeed many central historical examples of asking for things outside the Overton Window being the ultimately successful approach to creating massive social change. This ranges from the very good (such as abolishing slavery) to the very bad (such as imposing Communism or Fascism).</p>\n\n\n<h4 class=\"wp-block-heading\">Guarded Positive Reactions</h4>\n\n\n<p>People disagree on a lot on whether the book is well or poorly written, in various ways, at various different points in the book. <a href=\"https://x.com/binarybits/status/1969370114236490075\">Kelsey Piper thinks the writing in the first half is weak, the second half is stronger</a>, whereas Timothy Lee (a skeptic of the book’s central arguments) thought the book was surprisingly well-written and the first few chapters were its favorites.</p>\n<p><a href=\"https://peterwildeford.substack.com/p/if-we-build-ai-superintelligence\">Peter Wildeford goes over the book’s central claims</a>, finding them overconfident and warning about the downsides and costs of shutting AI development down. He’s a lot ‘less doomy’ than the book on many fronts. I’d consider this his central takeaway:</p>\n<blockquote><p>Peter Wildeford: Personally, I’m very optimistic about AGI/ASI and the future we can create with it, but if you&#8217;re not at least a little ‘doomer’ about this, you’re not getting it. You need profound optimism to build a future, but also a healthy dose of paranoia to make sure we survive it. I’m worried we haven’t built enough of this paranoia yet, and while Yudkowsky’s and Soares’s book is very depressing, I find it to be a much-needed missing piece.</p></blockquote>\n<p>This seems like a reasonable take.</p>\n<p><a href=\"https://www.lesswrong.com/posts/RDG2dbg6cLNyo6MYT/thane-ruthenis-s-shortform?commentId=YqkSshygyQ4vdP2sk\">Than Ruthenis finds the book weaker than he’d hoped</a>, he finds section 3 strong but the first two weak. Darren McKee finds it a decent book, <a href=\"https://www.lesswrong.com/posts/viLu9uFcMFtJHgRRm/iabied-review-an-unfortunate-miss\">but is sad it was not better written and did not address some issues, and thus does not see it as an excellent book</a>.</p>\n<p><a href=\"https://www.lesswrong.com/posts/P4xeb3jnFAYDdEEXs/i-enjoyed-most-of-iabied\">Buck is a strong fan of the first two sections</a> and liked the book far more than he expected, calling them the best available explanation of the basic AI misalignment risk case for a general audience. He caveats that the book does not address counterarguments Buck thinks are critical, and that he would tell people to skip section 3. Buck’s caveats come down to expecting important changes between the world today and the world where ASI is developed, that potentially change whether everyone would probably die. I don’t see him say what he expects these differences to be? And the book does hold out the potential for us to change course, and indeed find such changes, it simply says this won’t happen soon or by default, which seems probably correct to me.</p>\n\n\n<h4 class=\"wp-block-heading\">Nostream Argues For Lower Confidence</h4>\n\n\n<p><a href=\"https://nostream.substack.com/p/contra-yudkowsky-on-ai-doom-a-response\">Nostream addresses the book’s arguments</a>, agreeing that existential risk is present but making several arguments that the probability is much lower, they estimate 10%-20%, with the claim that if you buy any of the ‘things are different than the book says’ arguments, that would be sufficient to lower your risk estimate. This feels like a form of the conjunction fallacy fallacy, where there is a particular dangerous chain and thus breaking the chain at any point breaks a lot of the danger and returns us to things probably being fine.</p>\n<p>The post focuses on the threat model of ‘an AI turns on humanity per se’ treating that as load bearing, which it isn’t, and treats the ‘alignment’ of current models as meaningful in ways I think are clearly wrong, and in general tries to draw too many conclusions from the nature of current LLMs. I consider all the arguments here, in the forms expressed, not new and well-answered by the book’s underlying arguments, although not always in a form as easy to pick up on as one might hope in the book text alone (book is non-technical and length-limited, and people understandably have cached thoughts and anchor on examples).</p>\n<p>So overall I wished the post was better and made stronger arguments, including stronger forms of its arguments, but this is the right approach to take of laying out specific arguments and objections, including laying out up front that their own view includes unacceptably high levels of existential risk and also dystopia risk or catastrophic risk short of that. If I believed what Nostream believed I’d be in favor of not building the damn thing for a while, if there was a way to not build it for a while.</p>\n\n\n<h4 class=\"wp-block-heading\">Gary Marcus Reviews The Book</h4>\n\n\n<p><a href=\"https://www.the-tls.com/science-technology/technology/if-anyone-builds-it-everyone-dies-eliezer-yudkowsky-nate-soares-book-review-gary-marcus\">Gary Marcus offered his (gated) review</a>, which he kindly pointed out I had missed in Wednesday’s roundup. He calls the book deeply flawed, but with much that is instructive and worth heeding.</p>\n<p>Despite the review’s flaws and incorporation of several common misunderstandings, this was quite a good review, because Gary Marcus focuses on what is important, and his reaction to the book is similar to mine to his review. He notices that his disagreements with the book, while important and frustrating, should not be allowed to interfere with the central premise, which is the important thing to consider.</p>\n<p>He starts off with this list of key points where he agrees with the authors:</p>\n<blockquote>\n<ol>\n<li>Rogue AI is a possibility that we should not ignore. We don’t know for sure what future AI will do and we cannot rule out the possibility that it will go rogue.</li>\n<li>We currently have no solution to the “alignment problem” of making sure that machines behave in human-compatible ways.</li>\n<li>Figuring out solutions to the alignment problem is really, really important.</li>\n<li>Figuring out a solution to the alignment problem is really, really hard.</li>\n<li>Superintelligence might come relatively soon, and it could be dangerous.</li>\n<li>Superintelligence could be more consequential than any other trend.</li>\n<li>Governments should be more concerned.</li>\n<li>The short-term benefits of AI (eg in terms of economics and productivity) may not be worth the long-term risks.</li>\n</ol>\n<p>Noteworthy, none of this means that the title of the book — <em>If Anyone Builds It, Everyone Dies</em> — literally means <em>everyone dies</em>. Things are worrying, but not nearly as worrying as the authors would have you believe.</p>\n<p>It is, however, important to understand that Yudkowsky and Soares are not kidding about the title</p></blockquote>\n<p>Gary Marcus does a good job here of laying out the part of the argument that should be uncontroversial. I think all seven points are clearly true as stated.</p>\n<blockquote><p>Gary Marcus: Specifically, the central argument of the book is as follows:<br />\n<strong>Premise 1.</strong> Superintelligence will inevitably come — and when it does, it will inevitably be smarter than us.<br />\n<strong>Premise 2.</strong> Any AI that is smarter than any human will inevitably seek to eliminate all humans.<br />\n<strong>Premise 3.</strong> There is nothing that humans can do to stop this threat, aside from not building superintelligence in the first place.</p>\n<p>The good news [is that the second and third] premisses are not nearly as firm as the authors would have it.</p></blockquote>\n<p>I’d importantly quibble here, my version of the book’s argument would be, most importantly on the second premise although it’s good to be precise everywhere:</p>\n<blockquote>\n<ol>\n<li>Superintelligence is a real possibility that could happen soon.</li>\n<li>If built with anything like current techniques, any sufficiently superintelligent AI will effectively maximize some goal and seek to rearrange the atoms to that end, in ways unlikely to result in the continued existence of humans.</li>\n<li>Once such a superintelligent AI is built, if we messed up, it will be too late to stop this from happening. So for now we have to not build such an AI.</li>\n</ol>\n</blockquote>\n<p>He mostly agrees with the first premise and has a conservative but reasonable estimation of how soon it might arrive.</p>\n<p>For premise two, the quibble matters because Gary’s argument focuses on whether the AI will have malice, pointing out existing AIs have not shown malice. Whereas the book does not see this as requiring the AI to have malice, nor does it expect malice. It expects merely indifference, or simply a more important priority, the same way humans destroy many things we are indifferent to, or that we actively like but are in the way. For any given specified optimization target, given sufficient optimization power, the chance the best solution involves humans is very low. This has not been an issue with past AIs because they lacked sufficient optimization power, so such solutions were not viable.</p>\n<p>This is a very common misinterpretation, both of the authors and the underlying problems. The classic form of the explanation is ‘The AI does not love you, the AI does not hate you, but you are composed of atoms it can use for something else.’</p>\n<p>His objection to the third premise is that in a conflict, the ASI’s victory over humans seems possible but not inevitable. He brings a standard form of this objection, including quoting Moltke’s famous ‘no plan survives contact with the enemy’ and modeling this as the AI getting to make some sort of attack, which might not work, after which we can fight back. I’ve covered this style of objection many times, comprising a substantial percentage of words written in weekly updates, and am very confident it is wrong. The book also addresses it at length.</p>\n<p>I will simply note that in context, even if on this point you disagree with me and the book, and agree with Gary Marcus, it does not change the conclusion, so long as you agree (as Marcus does) that such an ASI has a large chance of winning. That seems sufficient to say ‘well then we definitely should not build it.’ Similarly, while I disagree with his assumption we would unite and suddenly act ruthlessly once we knew the ASI was against us, I don’t see the need to argue that point.</p>\n<p>Marcus does not care for the story in Part 2, or the way the authors use colloquial language to describe the AI in that story.</p>\n<p>I’d highlight another common misunderstanding, which is important enough that the response bears repeating:</p>\n<blockquote><p>Gary Marcus: A separate error is statistical. Over and again, the authors describe scenarios that multiply out improbabilities: AIs decide to build biological weapons; they blackmail everyone in their way; everyone accepts that blackmail; the AIs do all this somehow undetected by the authorities; and so on. But when you string together a bunch of improbabilities, you wind up with really long odds.</p></blockquote>\n<p>The authors are very much not doing this. This is not ‘steps in the chain’ where the only danger is that the AI succeeds at every step, whereas if it ever fails we are safe. They bend over backwards, in many places, to describe how the AI uses forking paths, gaming out and attempting different actions, having backup options, planning for many moves not succeeding and so on.</p>\n<p>The scenario also does not presuppose that no one realizes or suspects, in broad terms, what is happening. They are careful to say this is one way things might play out, and any given particular story you tell must necessarily involve a lot of distinct things happening.</p>\n<p>If you think that at the first sign of trouble all the server farms get turned off? I do not believe you are paying enough attention to the world in 2025. Sorry, no, not even if there wasn’t an active AI effort to prevent this, or an AI predicting what actions would cause what reactions, and choosing the path that is most likely to work, which is one of the many benefits of superintelligence.</p>\n<p>Several people have pointed out that the actual absurdity is that the AI in the story has to work hard and use the virus to justify it taking over. In the real world, we will probably put it in charge ourselves, without the AI even having to push us to do so. But in order to be more convincing, the story makes the AI’s life harder here and in many other places than it actually would be.</p>\n<p>Gary Marcus closes with discussion of alternative solutions to building AIs that he wished the book explored more, including alternatives to LLMs. I’d say that this was beyond the scope of the book, and that ‘stop everyone from racing ahead with LLMs’ would be a likely necessary first step before we can pursue such avenues in earnest. Thus I won’t go into details here, other than to note that ‘axioms such as ‘avoid causing harm to humans’’ are known to not work, which was indeed consistently the entire point of Asimov’s robot novels and other stories, where he explores some but not all of the reasons why this is the case.</p>\n<p>Again, I very much appreciated this review, which focused on what actually matters and clearly is stating what Marcus actually believes. More like this, please.</p>\n\n\n<h4 class=\"wp-block-heading\">John Pressman Agrees With Most Claims But Pushes Back On Big Picture</h4>\n\n\n<p><a href=\"https://minihf.com/posts/2025-09-18-jdp-reviews-iabied/\">John Pressman agrees with most of the book’s individual statements</a> and choices on how to present arguments, but disagrees with the thesis and many editorial and rhetorical choices. Ultimately his verdict is that the book is ‘okay.’ He states up top as ‘obvious’ many ‘huge if true’ statements about the world that I do not think are correct and definitely are not obvious. There’s also a lot of personal animus going on here, has been for years. I see two central objections to the book from Pressman:</p>\n<ol>\n<li>If you use parables then You Are Not Serious People, as in ‘Bluntly: A real urgent threat that demands attention does not begin with Once Upon a Time.’\n<ol>\n<li>Which he agrees is a style issue.</li>\n<li>There are trade-offs here. It is hard for someone like Pressman to appreciate the challenges in engaging with average people who know nothing about these issues or facing off the various stupid objections those people have (that John mostly agrees are deeply stupid).</li>\n</ol>\n</li>\n<li>He thinks the alignment problems involved are much easier than Yudkowsky and Soares believe, including that we have ‘solved the human values loading problem,’ although he agrees that we are still very much on track to fail bigly.\n<ol>\n<li>I think (both here and elsewhere where he goes into more detail) he both greatly overstates his case and also deliberately presents the case in a hostile and esoteric manner. That makes engagement unnecessarily difficult.</li>\n<li>I also think there’s important real things here and in related clusters of arguments, and my point estimate of difficulty is lower than the book’s, largely for reasons that are related to what Pressman is attempting to say.</li>\n<li>As Pressman points out, even if he’s fully right, it looks pretty grim anyway.</li>\n</ol>\n</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Meta Level Reactions Pushing Back On Pushback</h4>\n\n\n<p>Aella (to be fair a biased source here) offers a kind of meta-review.</p>\n<blockquote><p><a href=\"https://x.com/Aella_Girl/status/1969952022288887818\">Aella</a>: man writes book to warn the public about asteroid heading towards earth. his fellow scientists publish thinkpieces with stuff like &#8216;well his book wasn&#8217;t very good. I&#8217;m not arguing about the trajectory but he never addresses my objection that the asteroid is actually 20% slower&#8217;</p>\n<p>I think I&#8217;d feel a lot better if more reviews started with &#8220;first off, I am also very worried about the asteroid and am glad someone is trying to get this to the public. I recognize I, a niche enthusiast, am not the target of this book, which is the general public and policy makers. Regardless of how well I think the book accomplishes its mission, it&#8217;s important we all band together and take this very seriously. That being said, here&#8217;s my thoughts/criticisms/etc.</p></blockquote>\n<p><a href=\"https://x.com/Raemon777/status/1969331985232400735\">Raymond Arnold responds to various complaints about the book</a>, especially:</p>\n<ol>\n<li>Claims the book is exaggerating. It isn’t.\n<ol>\n<li>There is even an advertising campaign whose slogan is ‘we wish we were exaggerating,’ and I verify they do wish this.</li>\n<li>It is highly reasonable to describe the claims as overstated or false, indeed in some places I agree with you. But as Kelsey says, focus on: What is true?</li>\n</ol>\n</li>\n<li>Claims the authors are overconfident, including claims this is bad for credibility.\n<ol>\n<li>I agree that the authors are indeed overconfident. I hope I’ve made that clear.</li>\n<li>However I think these are reasonable mistakes in context, that the epistemic standards here are much higher than those of most critics, and also that people should say what they believe, and that the book is careful not to rely upon this overconfidence in its arguments.</li>\n<li>Fears about credibility or respectability, I believe, motivate many attacks on the book. I would urge everyone attacking the book for this reason (beyond noting the specific worry) to stop and take a long, hard look in the mirror.</li>\n</ol>\n</li>\n<li>Complaints that it sucks that ‘extreme’ or eye-catching claims will be more visible. Whereas claims one thinks are more true are less visible and discussed.\n<ol>\n<li>Yeah, sorry, world works the way it does.</li>\n<li>The eye-catching claims open up the discussion, where you can then make clear you disagree with the full claim but endorse a related other claim.</li>\n<li>As Raymond says, this is a good thing to do, if you think the book is wrong about something write and say why and about how you think about it.</li>\n</ol>\n</li>\n</ol>\n<p>He provides extensive responses to the arguments and complaints he has seen, using his own framings, <a href=\"https://x.com/Raemon777/status/1969331985232400735\">in the extended thread</a>.</p>\n<p>Then he fleshes out his full thoughts in a longer LessWrong post, <a href=\"https://www.lesswrong.com/posts/voEAJ9nFBAqau8pNN/the-title-is-reasonable\">The Title Is Reasonable</a>, that lays out these questions at length. It also contains some good comment discussion, <a href=\"https://www.lesswrong.com/posts/voEAJ9nFBAqau8pNN/the-title-is-reasonable?commentId=hfMfey9waritrCm5L\">including by Nate Soares</a>.</p>\n<p>I agree with him that it is a reasonable strategy to have those who make big asks outside the Overton Window because they believe those asks are necessary, and also those who make more modest asks because they feel those are valuable and achievable. I also agree with him that this is a classic often successful strategy.</p>\n<p>Yes, people will try to tar all opposition with the most extreme view and extreme ask. You see it all the time in anything political, and there are plenty of people doing this already. But it is not obvious this works, and in any case it is priced in. One can always find such a target, or simply lie about one or make one up. And indeed, this is the path a16z and other similar bad faith actors have chosen time and again.</p>\n<blockquote><p><a href=\"https://x.com/JimDMiller/status/1970135822209781909\">James Miller</a>: I&#8217;m an academic who has written a lot of journalistic articles. If Anyone Builds It has a writing style designed for the general public, not LessWrong, and that is a good thing and a source of complaints against the book.</p></blockquote>\n<p><a href=\"https://x.com/davidmanheim/status/1969700692911587786\">David Manheim notes that the book is non-technical</a> by design and does not attempt to bring readers up to speed on the last decade of literature. As David notes, the book reflects on the new information but is not in any position to cover or discuss all of that in detail.</p>\n<p><a href=\"https://x.com/dschwarz26/status/1969839896673358250\">Dan Schwartz offers arguments for using evolution-based analogies for deep learning</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">Clara Collier Writes Disappointing Review In Which She Is Disappointed</h4>\n\n\n<p><a href=\"https://asteriskmag.com/issues/11/iabied\">Clara Collier of Asterisk notes that She Is Not The Target for the book</a> so it is hard to evaluate its effectiveness on its intended audience, but she is disappointed in what she calls the authors failures to update.</p>\n<p>I would turn this back at Clara here, and say she seems to have failed to update her priors on what the authors are saying. I found her response very disappointing.</p>\n<p>I don’t agree with <a href=\"https://x.com/robbensinger/status/1969438601693053114\">Rob Bensinger’s view that this was one of the lowest-quality reviews</a>. It’s more that it was the most disappointing given the usual quality and epistemic standards of the source. The worst reviews were, as one would expect, from sources that are reliably terrible in similar spots, but that is easy to shrug off.</p>\n<ol>\n<li>The book very explicitly does not depend on the foom, there only being one AI, or other elements she says it depends on. Indeed in the book’s example story the AI does not foom. It feels like arguing with a phantom.\n<ol>\n<li><a href=\"https://www.lesswrong.com/posts/JWH63Aed3TA2cTFMt/contra-collier-on-iabied#FOOM\">Also see Max Harms responding on this here</a>, where he lays out the foom is not a ‘key plank’ in the MIRI story of why AI is dangerous.</li>\n<li>He also points out that there being multiple similarly powerful AIs by default makes the situation more dangerous rather than less dangerous, including in AI 2027, because it reduces margin for error and ability to invest in safety. If you’ve done a tabletop exercise based on AI 2027, this becomes even clearer.</li>\n</ol>\n</li>\n<li>Her first charge is that a lot of AI safety people disagree with the MIRI perspective on the problem, so the subtext of the book is that the authors must think all those other people are idiots. This seems like a mix of an argument for epistemic modesty, or a claim that Yudkowsky and Soares haven’t considered these other opinions properly, and are disrespecting those who hold them? I would push back strongly on all of that.</li>\n<li>She raises the objection that the book has an extreme ask that ‘distracts’ from other asks, a term also used by MacAskill. Yes, the book asks for an extreme thing that I don’t endorse, but that’s what they think is necessary, so they should say so.</li>\n<li>She asks why the book doesn’t spend more time explaining why an intelligence explosion is likely to occur. The answer is the book is explicitly arguing a conditional, what happens if it does occur, and acknowledges that it may or may not occur, or occur on any given time frame. She also raises the ‘but progress has been continuous which argues against an intelligent explosion’ argument, except continuous progress does not argue against a future explosion. Extend curves.</li>\n<li>She objects that the authors reach the same conclusions about LLMs that they previously reached about other AI systems. Yes, they do. But, she says, these things are different. Yes, they are, but not in ways that change the answer, and the book (and supplementary material, and their other writings) explain why they believe this. Reasonable people can disagree. I don’t think, from reading Clara’s objections along these lines, that she understands the central arguments being made by the authors (over the last 20 years) on these points.</li>\n<li>She says if progress will be ‘slow and continuous’ we will have more than one shot on the goal. For sufficiently generous definitions of slow and continuous this might be true, but there has been a lot of confusion about ‘slow’ versus ‘fast.’ Current observed levels of ‘slow’ are still remarkably fast, and effectively mean we only get one shot, although we are getting tons of very salient and clear warning shots and signs before we take that one shot. Of course, we’re ignoring the signs.</li>\n<li>She objections that ‘a future full of flourishing people is not the best, most efficient way to fulfill strange alien purposes’ is stated as a priori obvious. But it is very much a priori obvious, I will bite this bullet and die on this hill.</li>\n</ol>\n<p>There are additional places one can quibble, another good response <a href=\"https://www.lesswrong.com/posts/JWH63Aed3TA2cTFMt/contra-collier-on-iabied\">is the full post from Max Harms</a>, which includes many additional substantive criticisms. <a href=\"https://x.com/robbensinger/status/1969181977073893791\">One key additional clarification is that the book is not claiming that what we will fail</a> to learn a lot about AI from studying current AI, only that this ‘a lot’ will be nothing like sufficient. It can be difficult to reconcile ‘we will learn a lot of useful things’ with ‘we will predictably learn nothing like enough of the necessary things.’</p>\n<p><a href=\"https://www.lesswrong.com/posts/JWH63Aed3TA2cTFMt/contra-collier-on-iabied?commentId=ndvkPbyRMhEJD9NMx\">Clara responded in the comments</a>, and stands by the claim that the book’s claims require a major discontinuity in capabilities, and that gradualism would imply multiple meaningfully distinct shots on goal.</p>\n<p><a href=\"https://x.com/JeffLadish/status/1968827334418645373\">Jeffrey Ladish also has a good response to some of Collier’s claims</a>, which he finishes like this:</p>\n<blockquote><p>Jeffrey Ladish: I do think you&#8217;re nearby to a criticism that I would make about Eliezer&#8217;s views / potential failures to update: Which is the idea that the gap between a village idiot and Einstein is small and we&#8217;ll blow through it quite fast. I think this was an understandable view at the time and has turned out to be quite wrong. And an implication of this is that we might be able to use agents that are not yet strongly superhuman to help us with interpretability / alignment research / other useful stuff to help us survive.</p>\n<p>Anyway, I appreciate you publishing your thoughts here, but I wanted to comment because I didn&#8217;t feel like you passed the authors ITT, and that surprised me.</p>\n<p>Peter Wildeford: I agree that the focus on FOOM in this review felt like a large distraction and missed the point of the book.</p></blockquote>\n<p>The fact that we meaningfully do get a meaningful amount of time with AIs one could think of as between village idiots and Einsteins is indeed a major source of hope, although I understand why Soares and Yudkowsky do not see as much hope here, and that would be a good place to poke. The gap argument was still more correct than incorrect, in the sense that we will likely only get a period of years in that window rather than decades, and most people are making various forms of the opposite mistake and not understanding that above-Einstein levels of intelligence are Coming Soon. But years or even months can do a lot for you if you use them well.</p>\n\n\n<h4 class=\"wp-block-heading\">Will MacAskill Offers Disappointing Arguments</h4>\n\n\n<p><a href=\"https://x.com/willmacaskill/status/1968759901620146427\">Will MacAskill offers a negative review</a>, criticizing the arguments and especially parallels to evolution as quite bad, although he praises the book for plainly saying what its authors actually believe, and for laying out ways in which the tech we saw was surprising, and for the quality of the analogies.</p>\n<p>I found Will’s quite disappointing but unsurprising. Here are my responses:</p>\n<ol>\n<li>The ones about evolution parallels seem robustly answered by the book and also repeatedly elsewhere by many.</li>\n<li>Will claims the book is relying on a discontinuity of capability. It isn’t. They are very clear that it isn’t. The example story containing a very mild form of [X] does not mean one’s argument relies on [X], although it seems impossible for there not to be some amount of jumps in capability, and we have indeed seen such jumps.</li>\n<li>The ones about ‘types of misalignment’ seems at best deeply confused, I think he’s saying humans will stay in control because AIs will be risk averse, so they’ll be happy to settle for a salary rather than take over and thus make this overwhelmingly pitiful deal with us? Whereas the fact that imperfect alignment is indeed catastrophic misalignment in the context of a superhuman AI is the entire thesis of the book, covered extensively, in ways Will doesn’t engage with here?\n<ol>\n<li>Intuition pump that might help: Are humans risk averse?</li>\n</ol>\n</li>\n<li>Criticism of the proposal as unlikely to happen. Well, not with that attitude. If one thinks that this is what it takes, one should say so. If not, not.</li>\n<li>Criticism of the proposal as unnecessary or even unhelpful, and ‘distracting’ from other things we could do. Standard arguments here. Not much to say, other than to note that the piecemail ban proposals he suggests don’t technically work.</li>\n<li>Criticism of the use of fiction and parables ‘as a distraction.’ Okie dokie.</li>\n<li>Claim that the authors should have updated more in light of developments in ML. This is a reasonable argument one can make, but people who (including Clair and also Tyler below) that the book’s arguments are ‘outdated’ are simply incorrect. The arguments and authors do take such information into account, and have updated in some ways, but do not believe the new developments change the central arguments or likely future ultimate path. And they explain why. You are encouraged to disagree with their reasoning if you find it wanting.</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Zack Robinson Raises Alarm About Anthropic’s Long Term Benefit Trust</h4>\n\n\n<p><a href=\"https://x.com/Zach_y_robinson/status/1968810665973530781\">Zack Robinson of Anthropic’s Long Term Benefit Trust has a quite poor</a> Twitter thread attacking the book, following the MacAskill style principle of attacking those whose tactics and messages are not cooperating with the EA-brand-approved messages designed to seek movement growth, respectability and power and donations, which in my culture we call a strategy of instrumental convergence.</p>\n<p>The particular arguments in the thread are quite bad and mischaracterize the book. He says the book presents doom as a foregone conclusion, which is not how contingent predictions work. He uses pure modesty and respectability arguments for ‘accepting uncertainty’ in order to ‘leave room for AI’s transformative benefits,’ which is simply a non-sequitur. He warns this ‘blinds us to other series risks,’ the ‘your cause of us all not dying is a distraction from the real risks’ argument, which again simply is not true, there is no conflict here. <a href=\"https://x.com/Zach_y_robinson/status/1968810786018705846\">His statement in this linked Tweet about the policy debate being only a binary false choice is itself clearly false, and he must know this</a>.</p>\n<p>The whole thing is in what reads as workshopped corporate speak.</p>\n<p>The responses to the thread are very on point, and Rob Benginger in particular pulls this very important point of emphasis:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Pakl!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc3791121-41b5-4b6f-8a40-74dc7b9ac870_1042x351.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://www.lesswrong.com/posts/tmWMuY5HCSNXXZ9oq/buck-s-shortform?commentId=5Zo9vifvjFp9yGJEZ\">Like Buck and those who responded to expressions their disappointment</a>, I find this thread unbecoming of someone on the LTBT and as long as he remains there I can no longer consider him a meaningful voice for existential risk worries there, which substantially lowers my estimate of Anthropic’s likely behaviors.</p>\n<p>I join several respondents in questioning whether Zack has read the book, a question he did not respond to. One can even ask if he has logically parsed its title.</p>\n<p>Similarly, given he is the CEO of the Center for Effective Altruism, I must adjust there, as well, especially as this is part of a pattern of similar strategies.</p>\n<p>I think this line is telling in multiple ways:</p>\n<blockquote><p>Zack Robinson: I grew up participating in debate, so I know the importance of confidence. But there are two types: epistemic (based on evidence) and social (based on delivery). Despite being expressed in self-assured language, the evidence for imminent existential risk is far from airtight.</p></blockquote>\n<ol>\n<li>Zack is debating in this thread, as in trying to make his position win and get ahead via his arguments, rather than trying to improve our epistemics.</li>\n<li>Contrary to the literal text, Zack is looking at the social implications of appearing confident, and disapproving, rather than primarily challenging the epistemics. Indeed, the only arguments he makes against confidence here are from modesty:\n<ol>\n<li>Argument from consequences: Thinking confidently causes you to get dismissed (maybe) or to ignore other risks (no) and whatnot.</li>\n<li>Argument from consensus: Others believe the risk is lower. Okie dokie. Noted.</li>\n</ol>\n</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Others Going After The Book</h4>\n\n\n<p>Tyler Cowen does not offer a review directly, <a href=\"https://marginalrevolution.com/marginalrevolution/2025/09/saturday-assorted-links-528.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=saturday-assorted-links-528\">instead in an assorted links post strategically linking in a dismissive (of the book that he does not name) fashion to curated negative reviews and comments</a>, including MacAskill and Collier above.</p>\n<p>As you would expect, many others not named in this post are trotting out all the usual Obvious Nonsense arguments about why superintelligence would definitely turn out fine for the humans, such as that ASIs would <a href=\"https://x.com/davidmanheim/status/1970059893890498732\">‘freely choose to love humans</a>.’ Do not be distracted by noise.</p>\n\n\n<h4 class=\"wp-block-heading\">This Is Real Life</h4>\n\n\n<blockquote><p><a href=\"https://x.com/peterwildeford/status/1969827214603518254\">Peter Wildeford</a>: They made the movie but in real life.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!f7sq!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff7a710fa-b1c0-4a42-8236-a515ee75e7fd_1200x595.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Simeon: To be fair on the image they&#8217;re not laughing etc.</p>\n<p>Jacques: tbf, he did not ask, &#8220;but what does this mean for jobs?&#8221;</p>\n<p>Will: You know it&#8217;s getting real when Yud has conceded the issue of hats.</p></blockquote>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/09/23/more-reactions-to-if-anyone-builds-it-everyone-dies/",
            "publishedAt": "2025-09-23",
            "source": "TheZvi",
            "summary": "Previously I shared various reactions to If Anyone Builds It Everyone Dies, along with my own highly positive review. Reactions continued to pour in, including several impactful ones. There’s more. Any further reactions will have a higher bar, and be &#8230; <a href=\"https://thezvi.wordpress.com/2025/09/23/more-reactions-to-if-anyone-builds-it-everyone-dies/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "More Reactions to If Anyone Builds It, Everyone Dies"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/vibe-coding-in-practice",
            "publishedAt": "2025-09-23",
            "source": "Zed Blog",
            "summary": "Manuel Odendahl demonstrates 'vibe coding' - using AI models in parallel without scrutinizing output code.",
            "title": "Vibe Coding in Practice"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-09-23"
}