{
    "articles": [
        {
            "content": [
                "<p><a href=\"https://ai-2027.com/\">AI 2027</a> forecasts that AGI could plausibly arrive as early as 2027. I recently spent some time looking at both the <a href=\"https://ai-2027.com/research/timelines-forecast\">timelines forecast</a> and some critiques [<a href=\"https://thezvi.wordpress.com/2025/04/08/ai-2027-responses/\">1</a>, <a href=\"https://secondthoughts.ai/p/ai-2027\">2</a>, <a href=\"https://titotal.substack.com/p/a-deep-critique-of-ai-2027s-bad-timeline\">3</a>].</p>\n\n<p>Initially, I was interested in technical issues. What’s the best super-exponential curve? How much probability should it have? But I found myself drawn to a more basic question. Namely, how much value is the math really contributing?</p>\n\n<p>This provides an excuse for a general rant. Say you want to forecast something. It could be when your hair will go gray or if Taiwan will be self-governing in 2050. Whatever. Here’s one way to do it:</p>\n\n<ol>\n  <li>Think hard.</li>\n  <li>Make up some numbers.</li>\n</ol>\n\n<p>Don’t laugh—that’s the classic method. Alternatively, you could use math:</p>\n\n<ol>\n  <li>Think hard.</li>\n  <li>Make up a formal model / math / simulation.</li>\n  <li>Make up some numbers.</li>\n  <li>Plug those numbers into the formal model.</li>\n</ol>\n\n<p>People are often skeptical of intuition-based forecasts because, “Those are just some numbers you made up.” Math-based forecasts are hard to argue with. But that’s not because they lack made-up numbers. It’s because the meaning of those numbers is mediated by a bunch of math.</p>\n\n<p>So which is better, intuition or math? In what situations?</p>\n\n<p>Here, I’ll look at that question and how it applies to AI 2027. Then I’ll build a new AI forecast using my personal favorite method of “plot the data and scribble a bunch of curves on top of it”. Then I’ll show you a little tool to make your own artisanal scribble-based AI forecast.</p>\n\n<h2 id=\"two-kinds-of-forecasts\">Two kinds of forecasts</h2>\n\n<p>To get a sense of the big picture, let’s look at two different forecasting problems.</p>\n\n<p>First, here’s a forecast (based on the <a href=\"https://www.ipcc.ch/report/ar6/syr/downloads/report/IPCC_AR6_SYR_FullVolume.pdf\">IPCC 2023 report</a>) for Earth’s temperature. There are two curves, corresponding to different assumptions about future greenhouse gas emissions.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/scribbles/ipcc_big.svg\" /></p>\n\n<p>Those curves look unassuming. But there are a lot of moving parts behind them. These kinds of forecasts model atmospheric pressure, humidity, clouds, sea currents, sea surface temperature, soil moisture, vegetation, snow and ice cover, surface albedo, population growth, economic growth, energy, and land use. They also model the interactions between all those things.</p>\n\n<p>That’s hard. But we basically understand how all of it works, and we’ve spent a ludicrous amount of effort carefully building the models. If you want to forecast global surface temperature change, this is how I’d suggest you do it. Your brain can’t compete, because it can’t grind through all those interactions like a computer can.</p>\n\n<p>OK, but here’s something else I’d really like to forecast: Where is this blue line going to go?</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/scribbles/nukes.svg\" /></p>\n\n<p>You <em>could</em> forecast this using a “mechanistic model” like with climate above. To do that, you’d want to model the probability Iran develops a nuclear weapon and what Saudi Arabia / Turkey / Egypt might do in response. And you’d want to do the same thing for Poland / South Korea / Japan and their neighbors. You’d also want to model future changes in demographics, technology, politics, technology, economics, military conflicts, etc.</p>\n\n<p>In <em>principle</em>, that would be the best method. As with climate, there are too many plausible futures for your tiny brain to work through. But building that model would be very hard, because it basically requires you to model the whole world. And if there’s an error anywhere, it could have serious consequences.</p>\n\n<p>In practice, I’d put more trust in intuition. A talented human (or <a href=\"https://dynomight.net/predictions/\">AI</a>?) forecaster would probably take an <a href=\"https://en.wikipedia.org/wiki/Reference_class_forecasting\">outside view</a> like, “Over the last 80 years, the number of countries has gone up by 9, so in 2105, it might be around 18.” Then, they’d consider adjusting for things like, “Will other countries might learn from the example of North Korea?” or “Will chemical enrichment methods become practical?”</p>\n\n<p>Intuition can’t churn through possible futures the way a simulation can. But if you don’t <em>have</em> a reliable simulator, maybe that’s OK.</p>\n\n<p>Broadly speaking, math/simulation-based forecasts shine when the phenomena you’re interested in has two properties.</p>\n\n<ol>\n  <li>It evolves according to some well-understood rule-set.</li>\n  <li>The <em>behavior</em> of the ruleset is relatively complex.</li>\n</ol>\n\n<p>The first is important because if you don’t have a good model for the ruleset (or at least your <em>uncertainty</em> about the ruleset), how will you build a reliable simulator? The second is important because if the behavior is simple, why do you even need a simulator?</p>\n\n<p>The ideal thing to forecast with math is something like <a href=\"https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life\">Conway’s game of life</a>. Simple known rules, huge emergent complexity. The worst thing to forecast with math is something like the probability that Jesus Christ returns next year. You could make up some math for that, but what would be the point?</p>\n\n<h2 id=\"the-ai-2027-forecast\">The AI 2027 forecast</h2>\n\n<p>This post is (ostensibly) about AI 2027. So how does their forecast work? They actually have several forecasts, but here I’ll focus on the <a href=\"https://ai-2027.com/research/timelines-forecast#method-1-time-horizon-extension\">Time horizon extension</a> model.</p>\n\n<p>That forecast builds on a <a href=\"https://arxiv.org/pdf/2503.14499\">recent METR report</a>. They took a set of AIs released over the past 6 years, and had them attempt a set of tasks of varying difficulty. They had humans perform those same tasks. Each AI was rated according to the human task length that it could successfully finish 50% of the time.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/scribbles/figure1.svg\" /></p>\n\n<p>The AI 2027 team figured that if an AI could successfully complete long-enough tasks of this type, then the AI would be capable of itself carrying AI research, and AGI would not be far away. Quantitatively, they suggest that the necessary task length is probably somewhere between 1 month and 10 years. They also suggest you’d need a success rate of 80% (rather than 50% in the above figure).</p>\n\n<p>So, very roughly speaking, the forecast is based on predicting how long it will take these dots to get up to one of the horizontal lines:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/scribbles/curves.svg\" /></p>\n\n<details>\n  \n(It's a bit more complicated than that, but that's the core idea.)\n\n\n  <p>Technical notes:</p>\n\n  <ul>\n    <li>The AI 2027 team raises the success rate to 80%, rather than 50% in the original figure from the METR report. That’s why the dots in the above figure are a bit lower.</li>\n    <li>I made the above graph using the <a href=\"https://github.com/titotal1993/AI2027critique/blob/main/AI2027polished.ipynb\">data</a> that <a href=\"https://titotal.substack.com/p/a-deep-critique-of-ai-2027s-bad-timeline\">titotal</a> extracted from the AI 2027 figures.</li>\n    <li>The AI 2027 forecast creates a <em>distribution</em> over the threshold that needs to be reached rather than considering fixed thresholds.</li>\n    <li>The AI 2027 forecast also adds an adjustment based on the theory that companies have internal models that are better than they release externally. They also add another adjustment on the theory that public-facing models are using limited compute to save money. In effect, these add a bit of vertical lift to all the points.</li>\n  </ul>\n\n</details>\n\n<p>I think this framing is great. Instead of an abstract discussion about the arrival of AGI, suddenly we’re talking about how quickly a particular set of real measurements will increase. You can argue if “80% success at a 1-year task horizon” really means AGI is imminent. But that’s kind of the point—no matter what you think about broader issues, surely we’d all like to know how fast those dots are going to go up.</p>\n\n<p>So how fast will they go up? You could imagine building a mechanistic model or simulation. To do that, you’d probably want to model things like:</p>\n\n<ul>\n  <li>How quickly is the data + compute + money being put into AI increasing?</li>\n  <li>How quickly is compute getting cheaper?</li>\n  <li>How quickly is algorithmic progress happening?</li>\n  <li>How does data + compute + algorithmic progress translate into improvements on the METR metrics?</li>\n  <li>How long will those trends hold? How do all those things interact with each other? How do they interact with AI progress itself.</li>\n</ul>\n\n<p>In principle, that makes a lot of sense. Some people predict a future where compute keeps getting cheaper <a href=\"https://ourworldindata.org/grapher/gpu-price-performance\">pretty slowly</a> and we run out of data and new algorithmic ideas and loss functions stop translating to real-world performance and investment drops off and everything slows down. Other people predict a future where GPUs accelerate and we keep finding better algorithms and AI grows the economy so quickly that AI investment increases forever and we spiral into a singularity. In between those extremes are many other scenarios. A formal model could churn through all of them much better than a human brain.</p>\n\n<p>But the AI 2027 forecast is not like that. It doesn’t have separate variables for compute / money / algorithmic progress. It (basically) just models the best METR score per year.</p>\n\n<p>That’s not <em>bad</em>, exactly. But I must admit that I don’t quite see the point of a formal mathematical model in this case. It’s (basically) just forecasting how quickly a single variable goes up on a graph. The model doesn’t reflect any firm knowledge about subtle behavior other than that the curve will probably go up.</p>\n\n<p>In a way, I think this makes the AI 2027 forecast seem <em>weaker</em> than it actually is. Math is hard. There are lots of technicalities to argue with. But their broader point doesn’t need math. Say you accept their premise that 80% success on tasks that take humans 1 year means that AGI is imminent. Then you should believe AGI is around the corner <em>unless those dots slow down</em>. An argument that their math is flawed doesn’t imply that the dots are going to stop going up.</p>\n\n<h2 id=\"scribble-based-forecasting\">Scribble-based forecasting</h2>\n\n<p>So, what’s going to happen with those dots? The ultimate outside view is probably to not think at all and just draw a straight line. When I do that, I get something like this:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/scribbles/curves_with_lines.svg\" /></p>\n\n<p>I guess that’s not terrible. But personally, I feel like it’s plausible that the recent acceleration continues. I also think it’s plausible that in a couple of years we stop spending ever-larger sums on training AI models and things slow down. And for a <em>forecast</em>, I want probabilities.</p>\n\n<p>So I took the above dots and I scribbled 50 different curves on top, corresponding to what I felt were 50 plausible futures:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/scribbles/50lines.png\" /></p>\n\n<p>Then I treated those lines as a probability distribution over possible futures. For each of the 1 month, 1 year, and 10 year task-horizon thresholds, I calculated what percentage of the lines had crossed over that threshold by a given year.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/scribbles/cdf.png\" /></p>\n\n<p>Or, here’s a summary as a table:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Threshold</th>\n      <th>10th Percentile</th>\n      <th>50th Percentile</th>\n      <th>90th Percentile</th>\n      <th>% Reached  <br />by 2050</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>1 month</td>\n      <td>2028.7</td>\n      <td>2032.3</td>\n      <td>2039.3</td>\n      <td>94%</td>\n    </tr>\n    <tr>\n      <td>1 year</td>\n      <td>2029.5</td>\n      <td>2034.8</td>\n      <td>2041.4</td>\n      <td>88%</td>\n    </tr>\n    <tr>\n      <td>10 year</td>\n      <td>2029.2</td>\n      <td>2037.7</td>\n      <td>2045.0</td>\n      <td>54%</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>My scribbles may or may not be good. But I think the <em>exercise</em> of drawing the scribbles is great, because it forces you to be completely explicit about what you’re predicting.</p>\n\n<p>I recommend it. In fact, I recommend it so strongly that I’ve created a little tool that you can use to <a href=\"https://dynomight.net/img/scribbles/tool.html\">do your own scribbling</a>. It will automatically generate a plot and table like you see above. You can import or export your scribbles in CSV format. (Mine are <a href=\"https://dynomight.net/img/scribbles/50lines.csv\">here</a> if you want to use them as a starting point.)</p>\n\n<p>Here’s a little video:</p>\n\n<video controls=\"\">\n  <source src=\"https://dynomight.net/img/scribbles/cast.mp4\" type=\"video/mp4\" />\n</video>\n\n<p>While scribbling, you may reflect on the fact that the tool you’re using is 100% AI-generated.</p>"
            ],
            "link": "https://dynomight.net/scribbles/",
            "publishedAt": "2025-06-30",
            "source": "Dynomight",
            "summary": "<p><a href=\"https://ai-2027.com/\">AI 2027</a> forecasts that AGI could plausibly arrive as early as 2027. I recently spent some time looking at both the <a href=\"https://ai-2027.com/research/timelines-forecast\">timelines forecast</a> and some critiques [<a href=\"https://thezvi.wordpress.com/2025/04/08/ai-2027-responses/\">1</a>, <a href=\"https://secondthoughts.ai/p/ai-2027\">2</a>, <a href=\"https://titotal.substack.com/p/a-deep-critique-of-ai-2027s-bad-timeline\">3</a>].</p> <p>Initially, I was interested in technical issues. What’s the best super-exponential curve? How much probability should it have? But I found myself drawn to a more basic question. Namely, how much value is the math really contributing?</p> <p>This provides an excuse for a general rant. Say you want to forecast something. It could be when your hair will go gray or if Taiwan will be self-governing in 2050. Whatever. Here’s one way to do it:</p> <ol> <li>Think hard.</li> <li>Make up some numbers.</li> </ol> <p>Don’t laugh—that’s the classic method. Alternatively, you could use math:</p> <ol> <li>Think hard.</li> <li>Make up a formal model / math / simulation.</li> <li>Make up some numbers.</li> <li>Plug those numbers into the formal model.</li> </ol> <p>People are often skeptical of intuition-based forecasts because, “Those are just some numbers you made up.” Math-based forecasts are hard to argue with. But that’s not because they lack made-up numbers. It’s because the meaning of those numbers is mediated by a bunch of math.</p> <p>So which is better,",
            "title": "Scribble-based forecasting and AI 2027"
        },
        {
            "content": [
                "<p>Stephen Skolnick is a gut microbiome expert blogging at <a href=\"https://stephenskolnick.substack.com/p/schizophrenia\">Eat Shit And Prosper</a>. His <strong><a href=\"https://stephenskolnick.substack.com/p/schizophrenia\">most recent post</a></strong> argues that contra the psychiatric consensus, schizophrenia isn&#8217;t genetic at all - it&#8217;s caused by a gut microbe. He argues:</p><ol><li><p>Scientists think schizophrenia is genetic because it obviously runs in families</p></li><li><p>But the twin concordance rates are pretty low - if your identical twin has schizophrenia, there&#8217;s only about a 30%-40% chance that you get it too. Is that really what we would expect from a genetic disease?</p></li><li><p>Also, scientists have looked for schizophrenia genes, and can only find about 1-2% as many as they were expecting.</p></li><li><p>So maybe we should ask how a disease can run in families without being genetic. Gut microbiota provide an answer: most people &#8220;catch&#8221; their gut microbiome from their parents.</p></li><li><p>Studies find that schizophrenics have very high levels of a gut bacterium called <em>Ruminococcus gnavus</em>.</p></li><li><p>This bacterium secretes psychoactive chemicals. Constant exposure to these chemicals might be the cause of schizophrenia.</p></li></ol><p>I disagree with all of this. Going in order:</p><p><strong>1: Scientists think schizophrenia is genetic because it obviously runs in families</strong></p><p>This is not why scientists think schizophrenia is genetic, but we&#8217;ll get back to this later.</p><p><strong>2: But the twin concordance rates are pretty low - if your identical twin has schizophrenia, there&#8217;s only about a 30%-40% chance that you get it too. Is that really what we would expect from a mostly genetic disease?</strong></p><p>This is exactly the concordance rate you should expect from a polygenic condition where 80% of the variance is explained by genes. I discuss this example in <a href=\"https://www.astralcodexten.com/p/some-unintuitive-properties-of-polygenic\">Some Unintuitive Properties Of Polygenic Disorders</a> and run a discount simulation that assumes an 80% genetic disorder with 1% prevalence and finds a concordance rate consistent with observed values. <a href=\"https://genepi.qimr.edu.au/staff/nick_pdf/Classics/1970_Smith_AHG_Dorret.pdf\">Here</a> is a paper that does the full formal simulation and finds the same.</p><p><strong>3: Also, scientists have looked for schizophrenia genes, and can only find about 1-2% as many as they were expecting.</strong></p><p>This is the &#8220;missing heritability&#8221; problem, common to all polygenic traits. See my <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than\">Missing Heritability: Much More Than You Wanted To Know</a>. The leading explanation is that our current genetic screening methods aren&#8217;t good enough to pick up rare variants; an alternative explanation proffered by some geneticists is that there are lots of invisible gene x environment interactions. </p><p>In either case, schizophrenia doesn&#8217;t have much more &#8220;missing heritability&#8221; than anything else, and it would be surprising if every single trait - from height to educational attainment - was determined by gut microbes. </p><p><strong>4: So maybe we should ask how a disease can run in families without being genetic. Gut microbiota provide an answer: most people &#8220;catch&#8221; their gut microbiome from their parents.</strong></p><p>This doesn&#8217;t work.</p><p>Going back to the first claim: scientists don&#8217;t think schizophrenia is genetic <em>just</em> because it runs in families. They think it&#8217;s genetic because they&#8217;ve done twin studies and find that identical twins share a schizophrenia diagnosis more often than fraternal twins. Skolnick describes microbiological inheritance as:</p><blockquote><p>See, many of the bacteria in your gut right now are strains that you picked up from your parents, back when you were still crawling around on the ground and putting everything in your mouth, picking your nose and eating it, and so on. If you think you didn&#8217;t do this as a kid, ask your parents. They remember. Those bacteria have stayed with you most of your life, eating the food you eat, reproducing faster than you can shit them out. If you have kids, you will pass those same heirloom strains on to them. Heritable. Biological. But not genetic.</p></blockquote><p>This doesn&#8217;t describe a process which could be expected to differ between identical and fraternal twins!</p><p>Skolnick could add an epicycle: maybe identical twins have more similar microbiomes because their identical genes caused identical gastrointestinal ecologies. But then schizophrenia is determined by genes again (albeit indirectly) and it should show up as genetic in GWASes (ie they should pick up the genes for having a certain type of gastrointestinal ecology suitable to schizophrenia-causing bacteria, and identify them as schizophrenia genes). There might be some complexities around gene x environment interactions, but it wouldn&#8217;t look like the simple pattern of missing heritability that Skolnick uses as his star evidence that schizophrenia is &#8220;not genetic&#8221;.</p><p>This is just one example of how microbiological inheritance doesn&#8217;t exactly track genetic inheritance - and whenever we see a difference, schizophrenia tracks the genetic rather than the environmental pattern. So for example, <a href=\"https://www.nature.com/articles/s41598-018-37298-9\">spouses have more similar microbiomes than siblings</a>, but schizophrenia doesn&#8217;t transfer from spouse to spouse. Adoptive children presumably crawl on the ground and put things in their mouth just as much as biological children, but there is no adoptive-parent-to-adoptive-child schizophrenia correlation (and if Skolnick tries to get around this by saying the bacteria are transferred during the birthing process, I&#8217;ll answer that schizophrenia is often inherited through the paternal line). </p><p>Finally, <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC7151748/\">this study</a> finds that family environment only explains 13% of variation between individuals&#8217; microbiomes during adulthood - and remember that family tendency for schizophrenia can persist across two or more generations. </p><p><strong>5: Studies find that schizophrenics have very high levels of a gut bacterium called </strong><em><strong>Ruminococcus gnavus.</strong></em><strong> </strong></p><p>The study that Skolnick cites to establish this is Vasileva, Yang, and Baker, <a href=\"https://jamanetwork.com/journals/jamapsychiatry/fullarticle/2814638\">Association Of The Gut Microbiome With Treatment Resistance In Schizophrenia</a>.</p><p>All the schizophrenics investigated in VYB were on antipsychotic medication. Previous studies have <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0165178124001999\">already shown </a>that antipsychotic medication disrupts the gut microbiome. VYB couldn&#8217;t investigate whether the disruptions were caused by medication in their own sample, because they had no unmedicated controls, but they checked whether more medication = more disruption, and it did. They concluded that the most likely cause of the microbiome disruption was the medication:</p><blockquote><p>The findings indicate that individuals with treatment-resistant schizophrenia have significantly different microbiome composition compared to control individuals without psychiatric diagnoses and individuals with treatment-responsive schizophrenia, <strong>which is most likely driven by clozapine.</strong></p></blockquote><p>Even though this is right in the abstract and torpedoes Skolnick&#8217;s theory that the increased microbe population causes the schizophrenia, he doesn&#8217;t mention any of this in his post!</p><p>If some other study finds unusual gut microbiota even in untreated schizophrenia, will this support Skolnick&#8217;s theory? Not really. Schizophrenics differ from the general population on a wide variety of health outcomes - for example, they die about 15 - 20 years earlier, often <a href=\"https://www.ahajournals.org/doi/10.1161/JAHA.121.021444\">of heart problems</a>. Why? Probably some combination of medication side effects, poor health decisions, and <em>maybe</em> a direct effect of the disease itself - the same neurodevelopmental issues that affect cognition also affecting some autonomic process that regulates the heart. In any case, there are many reasons to expect schizophrenics&#8217; guts to be abnormal, and <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC4437570/\">plenty of evidence</a> that this is in fact true. </p><p>(also, during residency, I met a schizophrenic patient who, whenever he wasn&#8217;t restrained, would eat as much glass as he could until he got internal bleeding and had to go to the emergency room. I don&#8217;t know what kind of microbiome disruption this causes, but I bet there aren&#8217;t many non-schizophrenics who have it.)</p><p><a href=\"https://quadram.ac.uk/blogs/gut-microbiome-meet-ruminococcus-gnavus/\">This page</a> says that <em>R. gnavus</em> is also increased in inflammatory bowel disease, irritable bowel syndrome, colon cancer, skin allergies, liver disease, etc, but that \"association with diseases does not necessarily mean that <em>R. gnavus</em> is a cause of these diseases, it may just indicate that these conditions may be more favourable to <em>R. gnavus</em> expansion in the gut compared to other bacteria.\"</p><p><strong>6: This bacterium secretes psychoactive chemicals. Constant exposure to these chemicals might be the cause of schizophrenia.</strong></p><p>Schizophrenia doesn&#8217;t resemble exposure to psychoactive chemicals. </p><p>Just to give one example, schizophrenics are normal (or only slightly weird) until around age 18-30, then become psychotic over the course of a few months. According to the consensus theory of schizophrenia, this is because schizophrenia <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9870034/\">is a neurodevelopmental disorder that interferes with adolescent synaptic pruning</a>. How does a microbiological theory explain this progression?</p><p>In fact, it doesn&#8217;t really make sense to posit a single cause for schizophrenia at all. For example, we know that <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC2632220/\">children infected with rubella virus </a><em><a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC2632220/\">in utero</a></em> have 20x the usual schizophrenia risk. But we also know that many schizophrenics had no prenatal exposure to rubella or anything else. Other risk factors include urban environment, winter birth, prenatal stress, and maybe cat exposure (<a href=\"https://pubmed.ncbi.nlm.nih.gov/38041862/\">really!</a>) To me, these - combined with genetics - make the most sense in the context of schizophrenia being a failure (for any reason or combination of reasons) in a complicated neurodevelopmental cascade we still don&#8217;t fully understand. </p><p>People have been looking for magic bullet explanations of schizophrenia for a hundred years. It&#8217;s time to admit there aren&#8217;t any. Or if there are, they&#8217;ll have to do better than this.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/contra-skolnick-on-schizophrenia",
            "publishedAt": "2025-06-30",
            "source": "SlateStarCodex",
            "summary": "<p>Stephen Skolnick is a gut microbiome expert blogging at <a href=\"https://stephenskolnick.substack.com/p/schizophrenia\">Eat Shit And Prosper</a>. His <strong><a href=\"https://stephenskolnick.substack.com/p/schizophrenia\">most recent post</a></strong> argues that contra the psychiatric consensus, schizophrenia isn&#8217;t genetic at all - it&#8217;s caused by a gut microbe. He argues:</p><ol><li><p>Scientists think schizophrenia is genetic because it obviously runs in families</p></li><li><p>But the twin concordance rates are pretty low - if your identical twin has schizophrenia, there&#8217;s only about a 30%-40% chance that you get it too. Is that really what we would expect from a genetic disease?</p></li><li><p>Also, scientists have looked for schizophrenia genes, and can only find about 1-2% as many as they were expecting.</p></li><li><p>So maybe we should ask how a disease can run in families without being genetic. Gut microbiota provide an answer: most people &#8220;catch&#8221; their gut microbiome from their parents.</p></li><li><p>Studies find that schizophrenics have very high levels of a gut bacterium called <em>Ruminococcus gnavus</em>.</p></li><li><p>This bacterium secretes psychoactive chemicals. Constant exposure to these chemicals might be the cause of schizophrenia.</p></li></ol><p>I disagree with all of this. Going in order:</p><p><strong>1: Scientists think schizophrenia is genetic because it obviously runs in families</strong></p><p>This is not why scientists think schizophrenia is genetic, but we&#8217;ll get back to this later.</p><p><strong>2: But the twin concordance rates are",
            "title": "Contra Skolnick On Schizophrenia Microbes"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Good comments on the Alpha School review:</p><ul><li><p> Michael Pershan <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129834848\">challenges the &#8220;Bloom&#8217;s Two Sigma&#8221; claim</a>. </p></li><li><p>Alpha School experiences from Redditors, mostly negative (<a href=\"https://www.reddit.com/r/Austin/comments/17feoeu/a_school_with_no_teachers_alpha_private_school_in/\">1</a>, <a href=\"https://www.reddit.com/r/Austin/comments/1hbahyt/private_school_comparison_alpha_versus_magellan/\">2</a>, beware stereotypical Redditors who hate everything they can associate with &#8220;tech bros&#8221; but there&#8217;s some signal to be found in the noise). </p></li><li><p>Alpha School experiences from ACX commenters, mostly positive (<a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129859549\">1</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129927188\">2</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129956858\">3</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129964486\">4</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129969701\">5</a>)</p></li><li><p>Some good comments from Pamela Hobart and Matt Bateman, who work at Alpha School, CTRL+F their names for more.</p></li><li><p><a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129844186\">Lots of people agree</a> that it&#8217;s easy for any home school and many private/charter schools to teach the whole curriculum in two hours. Shouldn&#8217;t this be a bigger deal? Also, how come nobody has tried creating a school that actually only takes each kid for two hours a day and <em>costs</em> one-quarter as much?</p></li><li><p>Is it selection bias? An employee <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/130323449\">says they admit everyone</a> (&#8230;who can pay the $40K tuition!) But <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/130223373\">an Alpha parent claims that</a> &#8220;85% of the low SES students from the Brownsville Campus that started at the school in 2022 are no longer there and its not due to lack of motivation or ability&#8221; (more details deeper in the thread, but I still don&#8217;t feel like I get a good explanation what happened to them). I think the strongest argument is that they seem to do better than other elite private schools, so even assuming an equal level of selection bias they still look good.</p></li><li><p><a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/130095965\">Phil H</a>: &#8220;From where I'm standing, it's very much like Americans are kind of reinventing China but with less tears.&#8221; (see also <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/130630479\">MKBA</a>)</p></li></ul><p><strong>2: </strong>A reader is looking to speak with people who have FDA regulatory experience (regulatory affairs, quality assurance, etc.) for a project. They are building a tool to help life science labs generate compliant documentation for submissions like INDs or 510(k)s, and want to get feedback from experts on the real-world pain points of regulatory work. If you have this background and are open to a brief chat, please contact at ankit@clioapp.ai</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-388",
            "publishedAt": "2025-06-30",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Good comments on the Alpha School review:</p><ul><li><p> Michael Pershan <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129834848\">challenges the &#8220;Bloom&#8217;s Two Sigma&#8221; claim</a>. </p></li><li><p>Alpha School experiences from Redditors, mostly negative (<a href=\"https://www.reddit.com/r/Austin/comments/17feoeu/a_school_with_no_teachers_alpha_private_school_in/\">1</a>, <a href=\"https://www.reddit.com/r/Austin/comments/1hbahyt/private_school_comparison_alpha_versus_magellan/\">2</a>, beware stereotypical Redditors who hate everything they can associate with &#8220;tech bros&#8221; but there&#8217;s some signal to be found in the noise). </p></li><li><p>Alpha School experiences from ACX commenters, mostly positive (<a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129859549\">1</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129927188\">2</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129956858\">3</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129964486\">4</a>, <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129969701\">5</a>)</p></li><li><p>Some good comments from Pamela Hobart and Matt Bateman, who work at Alpha School, CTRL+F their names for more.</p></li><li><p><a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/129844186\">Lots of people agree</a> that it&#8217;s easy for any home school and many private/charter schools to teach the whole curriculum in two hours. Shouldn&#8217;t this be a bigger deal? Also, how come nobody has tried creating a school that actually only takes each kid for two hours a day and <em>costs</em> one-quarter as much?</p></li><li><p>Is it selection bias? An employee <a href=\"https://www.astralcodexten.com/p/your-review-alpha-school/comment/130323449\">says they admit everyone</a> (&#8230;who can",
            "title": "Open Thread 388"
        },
        {
            "content": [
                "<p>A few years ago I was introduced to the idea of <a href=\"https://containers.dev/\">Development containers</a> by a former coworker. I was deep into the Nix koolaid at the time, so I thought they were kinda superfluous and ultimately not worth looking into. After having run a <a href=\"https://github.com/TecharoHQ/anubis\">fairly popular open source project</a> for a while, I've come to realize that setting up a development environment for it is actually a fair bit harder than it seems. I want to make it easy to contribute to the project, and one of the best ways I can do that is by lowering the skill floor for contribution.</p>\n        <p>As such, I'm starting to experiment with development containers across my projects. I wrote this article from inside a development container on my Macbook. If you want to play around with my development environment Techaro's package builder yeet, you can <a href=\"https://github.com/TecharoHQ/yeet\">clone its repo from GitHub</a> and activate the development container. You will get a known working configuration that you can use to build new and exciting things.</p>\n        <p>Notably, these development containers also allow you to use <a href=\"https://github.com/features/codespaces\">GitHub Codespaces</a> to contribute. This means you don't even need to have a machine that's able to run Linux containers. You can contribute from any machine that can run GitHub Codespaces.</p>\n        <p>This is still an experiment, and here are the criteria I'm using to determine if this will be a success or not:</p>\n        <ol>\n        <li>Can people that don't really understand much about the stack behind projects clone a repo and get the software to build or run?</li>\n        <li>Does this help lower the skill floor to make it easier to contribute to those projects?</li>\n        <li>Will this finally get Anubis' integration tests to run consistently across OSes?</li>\n        </ol>\n        <p>The main reason I was inspired to try this out was after I heard a YouTuber describe what AI assisted code editing felt like for new developers: it feels like being a senior developer where you just have things flow out of your hands and you're able to make new and exciting things. I think the Techaro way of giving people that kind of experience to someone would be letting you get the development environment of a senior developer, akin to what it feels like to use an expert mechanic's garage to fix your car. When you clone the repos I'm testing with, you get a version of the configuration that I use, modulo the parts that don't make the most sense for running inside containers.</p>\n        <p>I'm super excited to see how this turns out. Maybe it'll be a good thing, maybe it won't. Only one way to know for sure!</p>"
            ],
            "link": "https://xeiaso.net/notes/2025/devcontainers/",
            "publishedAt": "2025-06-30",
            "source": "Xe Iaso",
            "summary": "<p>A few years ago I was introduced to the idea of <a href=\"https://containers.dev/\">Development containers</a> by a former coworker. I was deep into the Nix koolaid at the time, so I thought they were kinda superfluous and ultimately not worth looking into. After having run a <a href=\"https://github.com/TecharoHQ/anubis\">fairly popular open source project</a> for a while, I've come to realize that setting up a development environment for it is actually a fair bit harder than it seems. I want to make it easy to contribute to the project, and one of the best ways I can do that is by lowering the skill floor for contribution.</p> <p>As such, I'm starting to experiment with development containers across my projects. I wrote this article from inside a development container on my Macbook. If you want to play around with my development environment Techaro's package builder yeet, you can <a href=\"https://github.com/TecharoHQ/yeet\">clone its repo from GitHub</a> and activate the development container. You will get a known working configuration that you can use to build new and exciting things.</p> <p>Notably, these development containers also allow you to use <a href=\"https://github.com/features/codespaces\">GitHub Codespaces</a> to contribute. This means you don't even need to have a machine that's able to run",
            "title": "Experimenting with Development containers"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3109/",
            "publishedAt": "2025-06-30",
            "source": "XKCD",
            "summary": "<img alt=\"It's important for devices to have internet connectivity so the manufacturer can patch remote exploits.\" src=\"https://imgs.xkcd.com/comics/dehumidifier.png\" title=\"It's important for devices to have internet connectivity so the manufacturer can patch remote exploits.\" />",
            "title": "Dehumidifier"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-30"
}