{
    "articles": [
        {
            "content": [
                "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd6d4cd84-9f3f-43fd-b321-60fcf0f428af_845x1080.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1080\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd6d4cd84-9f3f-43fd-b321-60fcf0f428af_845x1080.jpeg\" width=\"845\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Heartless (1980), Dorothea Tanning</h6><p></p><p><strong>Dear Polly,</strong></p><p><strong>These seven years since I met my husband have been an absolute turbulent disaster, and now in the past few months everything seems to finally be crashing down around us. I loved him the moment I met him. He was (and still is) a beautiful artistic dreamer, stubborn and brave and impulsive and creative and wild&#8230;</strong></p>\n      <p>\n          <a href=\"https://www.ask-polly.com/p/our-beautiful-life-in-the-wilderness\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.ask-polly.com/p/our-beautiful-life-in-the-wilderness",
            "publishedAt": "2025-03-12",
            "source": "Ask Polly",
            "summary": "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd6d4cd84-9f3f-43fd-b321-60fcf0f428af_845x1080.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1080\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd6d4cd84-9f3f-43fd-b321-60fcf0f428af_845x1080.jpeg\" width=\"845\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Heartless (1980), Dorothea Tanning</h6><p></p><p><strong>Dear Polly,</strong></p><p><strong>These seven years since I met my husband have been an absolute turbulent disaster, and now in the past few months everything seems to finally be crashing down around us. I loved him the moment I met him. He was (and still is) a beautiful artistic dreamer, stubborn and brave and impulsive and creative and wild&#8230;</strong></p> <p> <a href=\"https://www.ask-polly.com/p/our-beautiful-life-in-the-wilderness\"> Read more </a> </p>",
            "title": "'Our Beautiful Life in the Wilderness is Over. How Can I Do This to My Kids?'"
        },
        {
            "content": [
                "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffd7c5104-bc19-4467-954b-f987719e5e6e_5751x3834.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"971\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffd7c5104-bc19-4467-954b-f987719e5e6e_5751x3834.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Photo credit: Barbora Simkova, Simkova Studios</h6><p></p><p>What happens when you discover your marriage is a lie? In her new book <em><a href=\"https://bookshop.org/p/books/sucker-punch-scaachi-koul/21356854?gad_source=1&amp;gclid=CjwKCAiArKW-BhAzEiwAZhWsIEmQGHIC7bRkEtXxdtuTHTGJV13drg1gndckROtjTtxQl4G5nAvj4BoCL0AQAvD_BwE\">Sucker Punch</a></em>,<em> </em>Scaachi Koul traces her descent into hell with stunning clarity, wit, and unvarnished rage. Koul is one of the funniest writers of her generation in my not-so-humble opinion, and <em>Sucker Punch</em> impressed me more than anything she&#8217;s written so far. Being brutally honest with yourself while writing a memoir is excruciating work, but Koul boldly dissects her previous delusions, lays bare the aggressive but loving contours of her upbringing, and even interrogates the overly optimistic gloss of her first memoir, <em>One Day We&#8217;ll All Be Dead and None of This Will Matter</em>. I admired the bravery of <em>Sucker Punch</em> so much that I wanted to ask Koul how the hell she managed to pull it off. I figured she&#8217;d bring a lot of humility and raw emotion to the table, and boy, was I right! </p><p></p><p><strong>I&#8217;m in awe of how plainly and clearly you express exactly who you are and how you feel in this book, yet you also have a great sense of humor about yourself. Finding all of that together in one writer is so rare. I&#8217;m repeatedly struck with this sense of awe, like, WHAT DOES SHE DO EVERY DAY TO MAKE THIS POSSIBLE? And that&#8217;s my very earnest first question: How do you keep yourself in the kind of swaggery yet optimistic state where you can write this way?</strong></p><p>I guess I feel like I don't have a choice. Sadness and despair are so easy to access, I can do it anytime. After my ex and I broke up, I was genuinely worried I wouldn't be funny again, and that I wouldn't be able to write again. The stress took away my ability to read and my sentences were coming out so disjointed that my boss at the time put me on leave; my first drafts looked like they had been written in hieroglyphics. I was so angry. I felt like I had been robbed. It just felt like the only thing I was good at &#8212; and ultimately, the only thing I was able to carry out of my marriage &#8212; was the ability to tell a story that had at least one joke in it.</p><p>Marriage was a decision I made because so many people told me I would get something out of it: security, love, comfort, reassurance, a teammate. That's just not what I was getting out of it. All I had was the story. All I had was the joke.</p><p></p><p><strong>You describe feeling no connection to one of the stories in your first book upon rereading. Was your intention with </strong><em><strong>Sucker Punch</strong></em><strong> to dive in and do something more courageous or more messy?</strong></p><p>I know it's not the answer anyone on my publishing team wants to hear (sorry) but I never tell people to read my first book. I know it still has value and I do love that people still talk about it and think about it, but the story I believed about my life back then just rings false to me now. This is, I know, actually good news: I want old work to feel old, otherwise that means I'm stagnant. But my divorce did prompt a secondary look at how I used to frame things, the way I hid from myself.</p><p>And divorce IS messy! I felt like mine was spilling into the street no matter what I did, I felt exposed all the time. Once I got over my fear of it, it got easier to tell the truth and to be uglier. Like, we die at the end of this, and I'm worried about seeming morose? About looking like a loser? Whatever, man!</p><p>I sold <em>Sucker Punch</em> seven years ago. Back then, I conceived of it as an essay collection about the futility and utility of conflict (which I do still believe in, but maybe in a different way). I had just gotten engaged and had a completely different &#8212; but still impractically rigid &#8212; sense of myself and my life. By the time I was actually able to write something, my whole world view had shifted, and so whatever perspective I had while writing <em>One Day We'll All Be Dead</em> had mutated into something foreign even to me.</p><p></p><p><strong>How many times during the writing of </strong><em><strong>Sucker Punch</strong></em><strong> did you want to quit writing? Did you call people and say things like &#8220;I hate this book, it sucks&#8221; like I do every few weeks when I&#8217;m working on a book, or did you keep the faith without tormenting yourself in this way?</strong></p><p>Oh, I tried to quit every forty five seconds. If you look through my texts for the words \"this book is bad\" you will get hundreds and hundreds of results, me telling everyone I know \"I think this book is bad.\" I told my friends and my editors and my parents and strangers. I could not stop telling people how much it sucked.</p><p>But I was lucky in a few ways, namely that my Knopf Canada editor Kiara Kent is also one of my closest friends, so she was a witness to both my marriage falling apart and to the writing I was trying to do before and after the divorce. While my ex and I were still together, I had attempted to write my little conflict book, but every draft I sent her fell flat. She found beautiful and loquacious ways to tell me \"not quite,\" and then I would go back to the draft and try again. The writing never got better while I was married, and I was never going to be able to write that book &#8212;or any book &#8212; so long as I stayed with him. For years, Kiara told me in a thousand ways through my worthless drafts what I needed to do. When I left him, she was one of my first calls. A few months later, I sent her another version of the first essay from <em>Sucker Punch</em>, and it was the first time since selling the proposal that she told me the work was actually good. I believed her every time she told me it was rotten so I had to believe her when she told me when I got it right. (I am still asking her if she thinks it sucks; she reassures me it does not.)</p><p></p><p><strong>It does not! But it makes sense that the surge of honesty that came from leaving the marriage led to better writing. You mention the loneliness of your life when you moved to NYC for the first time. I answer a lot of letters about the specific terrors of getting through your 20s and early 30s. What fears guided you at that time, and what would you do differently if you could go back and do it again? (Also do you still live in NYC or did you return to Canada?)</strong></p><p>I'm still in New York. After my divorce I moved to another neighborhood in Brooklyn and restarted, again. Six years in and I'm finally starting to feel comfortable here. What scared me most in my 20s now feels so puerile to me: I was preoccupied with my reputation. I wanted to seem sane and well-adjusted and clever and untouchable. My ego got in the way of taking social risks, of seeming like a try-hard, of admitting to ambition or heartbreak or grief or desire. I was so mean to my parents, I can't even believe it now. Of course I was lonely: I could never really ask for what I wanted. God, I was so <em>mean</em>, mostly to myself. That's my only regret, so far: I got married for a good reason, I loved someone and wanted it to be meaningful, I saved myself from it. But I wish I had been kinder, to me and everyone around me. It wouldn't have changed anything, but maybe it would have made it a bit easier.</p><p></p><p><strong>Are you better at asking for what you want now? What did you do to get to a place where you started to recognize yourself as a person with rights and feelings that deserved to be respected? Why do you think so many of us struggle just to honor our own needs when we&#8217;re young?</strong></p><p>No, unfortunately this remains unusually hard for me, but I have gotten very good at identifying what other people want and bullying them into actually asking for it. Closed mouths don't get fed, but like most women and women of color in particular, I've been socialized into thinking that a desire is unseemly, that's it's too much, that it makes me greedy.</p><p>But I do think about it a lot. I struggle with even <em>having</em> needs; I still sometimes like to dream about having none, like an anesthetized orb. I think, maybe, to honor our own needs is to acknowledge how hopelessly out of control we are, and how much we need other people. To recognize the things we need &#8212; or, at least, that I needed &#8212; means speaking out loud how interconnected we are, how much we rely on each other, how much we actually want from each other and how deep our disappointments go.</p><p></p><p><strong>Ow, that last part! I definitely struggle with that. And I often write about how trying to seem better than you really are prevents you from feeling better about yourself, because as long as you&#8217;re focused on seeming, you&#8217;re never living in reality or reckoning with what&#8217;s here. How has your life changed in positive ways since you started to let go of seeming and decided to serve your feelings and show your flawed self to the world instead?</strong></p><p>Oh, let me tell you about giving up the performance: what a fucking gift that is. Your whole life opens up to you when you just lean into your failure. I spent so many years trying to prove to myself and other people that my marriage was a good one; it was exhausting and time-consuming. Not having to keep that up gave me so many hours in the day. I remember feeling really lost for the first few weeks that I didn't have this narrative to maintain. I kept thinking, <em>oh, this is how other people can have hobbies.</em></p><p>Then, when I lost my job and my mom got cancer, I felt even more confronted with how arbitrary things actually are. The cancer really threw me for a loop &#8212; no one in my family has ever had cancer and my mom wasn't really a high risk patient. It was this catastrophic reminder of how thin the membrane is between here and wherever else we go. Like, we die after all of this guaranteed, and I'm wasting my time on <em>do people think I'm a loser because I'm single</em>? Jesus Christ!</p><p></p><p><strong>Less than a year into your marriage, you discovered that your husband had been cheating on you for five years. I couldn&#8217;t believe what I was reading when I got to that part of the book. How do you process a betrayal that enormous? Do you have any advice for others who are struggling with anger and shame in the wake of being cheated on?</strong></p><p>I found out about the affair right before our first wedding anniversary, but I also found out right before the pandemic. It all felt brutalizing, but maybe worse was that I was surprised: I didn't see it coming, and it felt like someone punched me in the back of the head while I was turning away. Worse was that I then had to process my feelings about it while we were in the same space: I was new to America, to New York, and then the lockdowns started and my green card was pending, so there was no way for me to go back home to see my mom (she was stuck in India at the time, making things even worse) or my friends (who had small kids and couldn't risk infection). I think I just chose to turn off the switch that allows me to experience life. I didn't know I could dissociate so successfully until then, and I was so sure that the affair was actually my fault which felt too unbearable to face. Eventually, I grew grateful that he cheated on me, that it was such a long-standing affair, and that I knew so much about it. Sometimes I'm not sure I would have gathered myself up to leave, even if it took me a few more years to do it.</p><p>I don't think cheating is a moral failing that a couple can't get past. People make mistakes and sex is a complicated thing. What hurt me about the affair was actually that I felt like my husband couldn't see me clearly. My version of myself and his version of me were so different, and I couldn't wrap my head around this very basic and fundamental miscommunication. But I also felt like he didn't want to get to know me or correct his vision. It was lonely in there.</p><p>What I wish I had been able to do right after finding out was to hit pause on my life. I needed to take a week off from work, to leave the apartment we shared together, to turn my phone off and think about what I wanted and what I was getting. I couldn't do that, obviously, but sometimes I wonder if that week of quiet contemplation would have sped up the next few years of my doomed marriage. Maybe not. It's a fun thought exercise to think of what I could have done with that time instead. The point is that I needed to remember that, <em>actually</em>, I can see myself perfectly clearly even if someone else can't. Once I recognized that, I left.</p><p></p><blockquote><p><em>The closer I get to defining my grief and my desires, the less angry I feel.</em></p></blockquote><p></p><p><strong>You have a newsletter that&#8217;s just a list of things you hate. Did you start it in part as a way to indirectly grapple with anger from your divorce? Are you someone who holds grudges? Because, sadly, I am! What, if anything, makes grudges less painful? What have you learned about expressing anger and also letting go of it?</strong></p><p>The newsletter started when I was detaching myself from Twitter. My brain still works in 140 characters, regrettably, so I wanted somewhere to put these sentence-sized thoughts. I don't think I'm actually a very big grudge-holder! If I've forgiven someone, I generally can and will move beyond it. But I do hold people accountable &#8212;more now in my 30s than in my 20s, certainly &#8212; which sometimes takes the sheen of grudge-holding. But I think it's good to remember when and how you've been harmed, not in order to become hardened, but to recognize patterns in yourself and in others so you learn your lesson. What I do love to do, however, is exit. Nothing and no one will make me stick around for an unpleasant time.</p><p>Everything used to make me mad. I was sometimes reactive, but mostly it was an internal battle. I was angry at disloyalty and condescension and failed process and infrastructure. I was always getting my feelings hurt and pretending I wasn't. The closer I get to defining my grief and my desires, the less angry I feel. This is, to me, very annoying: I like my anger, it protects me and vice versa. But it does make it hard to get near me, and it did help poison my marriage in the long term, and it keeps me very lonely.</p><p>Originally, my book was supposed to be an essay collection about conflict. I still see so much value in expressing rage, especially when it's for someone else. I'm happy to have my rage be borrowed or aimed with precision, like I'm a fire hose (except instead of water it's... more fire). But I'm also very quick to relinquish the fight these days. Colleague being snippy? <em>Well, will you look at the time. </em>New friend unable to hear a boundary? <em>See ya later, creep!</em> Man spends a date talking about his ex-girlfriend? <em>I mean, I'll fuck him, but I won't be sweet about it. </em>Divorce helped me clue in that, in every arena of my life, I can bail. I don't have to do this, whatever THIS is! I have a few requirements in the world: I have to pay my rent, I have to be nice to my friends, I have to call my mom, and I have to fight fascism.</p><p>But everything else? Every argument with a man who doesn't see my worth? Every inch of anger I gather over being disrespected professionally? Carrying shame from relationship to relationship, none of which was my shame to begin with? Fuck that. I'll waste my time on it when I'm dead, which at this rate could be any minute now.</p><div><hr /></div><p><em>You can <a href=\"https://bookshop.org/p/books/sucker-punch-scaachi-koul/21356854?gad_source=1&amp;gclid=CjwKCAiArKW-BhAzEiwAZhWsIEmQGHIC7bRkEtXxdtuTHTGJV13drg1gndckROtjTtxQl4G5nAvj4BoCL0AQAvD_BwE\">buy Sucker Punch </a>right now (recommend!) or go see Koul discuss her book in Toronto, Brooklyn, Portland, or Los Angeles and <a href=\"https://scaachi.substack.com/p/the-sucker-punch-tour\">buy a signed copy in person</a>. Send advice letters about cheating, divorce, or anything else to askpolly@protonmail.com. Ask Polly publishes 1-2x a week for paid subscribers so:</em></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.ask-polly.com/subscribe\"><span>Subscribe now</span></a></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.ask-polly.com/p/cheat-sheet-scaachi-koul-talks-betrayal?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share\"><span>Share</span></a></p>"
            ],
            "link": "https://www.ask-polly.com/p/cheat-sheet-scaachi-koul-talks-betrayal",
            "publishedAt": "2025-03-10",
            "source": "Ask Polly",
            "summary": "The author of Sucker Punch reflects on the trauma of trying to write a book as her marriage splintered into a million sharp pieces.",
            "title": "Cheat Sheet: Scaachi Koul Talks Betrayal"
        },
        {
            "content": [
                "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d727a38-bdc9-4eff-a55c-b017599b65ca_750x1031.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1031\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d727a38-bdc9-4eff-a55c-b017599b65ca_750x1031.jpeg\" width=\"750\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Untitled (1960), Dorothea Tanning</h6><p></p><p><em>A reader suggested this column in the comments from Tuesday&#8217;s dispatch (&#8220;<a href=\"https://www.ask-polly.com/p/people-always-think-im-insulting\">People Always Think I&#8217;m Insulting Them When I&#8217;m Just Having a Laugh</a>&#8221;). This one originally ran on The Awl in August of 2013. It feels fitting that the two should be such a study in contrasts: You do you vs. Time to change everything.</em></p><p><em>Although the sub&#8230;</em></p>\n      <p>\n          <a href=\"https://www.ask-polly.com/p/im-a-drunk-and-no-one-likes-me\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.ask-polly.com/p/im-a-drunk-and-no-one-likes-me",
            "publishedAt": "2025-03-07",
            "source": "Ask Polly",
            "summary": "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d727a38-bdc9-4eff-a55c-b017599b65ca_750x1031.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1031\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d727a38-bdc9-4eff-a55c-b017599b65ca_750x1031.jpeg\" width=\"750\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Untitled (1960), Dorothea Tanning</h6><p></p><p><em>A reader suggested this column in the comments from Tuesday&#8217;s dispatch (&#8220;<a href=\"https://www.ask-polly.com/p/people-always-think-im-insulting\">People Always Think I&#8217;m Insulting Them When I&#8217;m Just Having a Laugh</a>&#8221;). This one originally ran on The Awl in August of 2013. It feels fitting that the two should be such a study in contrasts: You do you vs. Time to change everything.</em></p><p><em>Although the sub&#8230;</em></p> <p> <a href=\"https://www.ask-polly.com/p/im-a-drunk-and-no-one-likes-me\"> Read more </a> </p>",
            "title": "'I'm a Drunk and No One Likes Me!'"
        },
        {
            "content": [
                "<img alt=\"Let&apos;s Talk About The American Dream\" src=\"https://blog.codinghorror.com/content/images/2025/03/rebuildingamericandream25-page_v.2.jpg\" /><p>A few months ago I wrote about what it means to&#xa0;<a href=\"https://blog.codinghorror.com/stay-gold-america/\" rel=\"noreferrer\"><strong>stay gold</strong></a> &#x2014; to hold on to the best parts of ourselves, our communities, and the American Dream itself. But staying gold isn&#x2019;t passive. It takes work. It takes action. It takes hard conversations that ask us to confront where we&#x2019;ve been, where we are, and who we want to be.</p><p>That&#x2019;s why I&#x2019;m incredibly honored to be joining <a href=\"https://en.wikipedia.org/wiki/Alexander_Vindman\" rel=\"noreferrer\"><strong>Alexander Vindman</strong></a> in giving a talk at the historic <a href=\"https://en.wikipedia.org/wiki/Cooper_Union\" rel=\"noreferrer\">Cooper Union Great Hall</a> 14 days from now. I greatly admire the way Colonel Vindman was willing to put everything on the line to defend the ideals of democracy and the American Dream.</p><p>The American Dream is, at its core, the promise that hard work, fairness, and opportunity can lead to a better future. But in 2025, that promise feels like a question: <strong>How can we build on our dream so that it works for everyone?</strong></p><p>Alexander and I will explore this in our joint talk through the lens of democracy, community, and economic mobility. We come from very different backgrounds, but we strongly share the belief that everyone&apos;s American Dream is worth fighting for.</p><p>Alexander Vindman has lived many lifetimes of standing up for what&apos;s right. He was born in the Soviet Union and immigrated to the U.S. as a child, growing up in Brooklyn before enlisting in the U.S. Army. Over the next 21 years, he served with distinction, earning a Purple Heart for injuries sustained in Iraq and eventually rising to Director of European Affairs for the National Security Council. When asked to choose between looking the other way or upholding the values he swore to protect, he chose correctly. That decision cost him his career but never his integrity. I have a lot to learn about what civic duty truly means from Alex.</p><p>I build things on the Internet, like <a href=\"https://stackoverflow.com/\" rel=\"noreferrer\">Stack Overflow</a> and <a href=\"https://discourse.org/\" rel=\"noreferrer\">Discourse</a>. I write on the internet, on this blog. I&apos;ve spent years thinking about how people interact online, how communities work (or don&apos;t), and how we create digital spaces that encourage fairness, participation, and constructive discourse. Spaces that result in artifacts for the common good, like local parks, where everyone can enjoy them together. Whether you&apos;re running a country or running a forum, the same rules seem to apply: people need clear expectations, fair systems, strong boundaries, and a shared sense of purpose. </p><p>This is the part of <a href=\"https://blog.codinghorror.com/stay-gold-america/\" rel=\"noreferrer\">Stay Gold</a> I couldn&apos;t tell you about, not yet, because I was working so hard to figure it out. How do you make long-term structural change that creates opportunity for everyone? It is an incredibly complex problem. But if we focus our efforts in a particular area, I believe we can change a lot of things in this country. Maybe not everything, but something foundational to the next part of our history as a country: <strong>how to move beyond individual generosity and toward systems that create security, dignity, and possibility for all</strong>.</p><p>I can&apos;t promise easy answers, but what I can promise is an honest, unfiltered conversation about how we move forward, with specifics. Colonel Vindman brings the perspective of someone who embodied American ideals, and I bring the experience of building self-governing digital communities that scale, which turned out to be far more relevant to the future of democracy than I ever would have dreamed possible.</p><p>Imagine what we can do if Alex and I work together. Imagine what we could do if we <em>all worked together</em>.</p><p>This event was streamed in real time via the <a href=\"https://www.youtube.com/playlist?list=PL-WfLn9ekLD9_-nL0zIyneXNKvii8r0MW\" rel=\"noreferrer\">Cooper Union Great Hall YouTube channel</a>:</p><figure class=\"kg-card kg-embed-card\"></figure>"
            ],
            "link": "https://blog.codinghorror.com/lets-talk-about-the-american-dream/",
            "publishedAt": "2025-03-06",
            "source": "Coding Horror",
            "summary": "<p>A few months ago I wrote about what it means to&#xa0;<a href=\"https://blog.codinghorror.com/stay-gold-america/\" rel=\"noreferrer\"><strong>stay gold</strong></a> &#x2014; to hold on to the best parts of ourselves, our communities, and the American Dream itself. But staying gold isn&#x2019;t passive. It takes work. It takes action. It takes hard conversations that ask</p>",
            "title": "Let's Talk About The American Dream"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Denmark is technically and officially still a Christian nation. Lutheranism is written into <a href=\"http://www.grundloven.dk/\">the constitution</a>. The government has a ministry for the church. Most Danes pay 1% of their earnings directly to fund the State religion. But God is as dead here as anywhere in the Western world. Less than 2% attend church service on a weekly basis. So one way to fill the void is through climate panic and piety.<br /><br /></div><div>I mean, these days, you can scarcely stroll past stores in the swankier parts of Copenhagen without being met by an endless parade of ads carrying incantations towards sustainability, conservation, and recycling. It's everywhere.</div><div><br />Hilariously, sometimes this even includes recommending that customers don’t buy the product. I went to a pita place for lunch the other day. The menu had a meat shawarma option, and alongside it was a plea not to order it too often because it’d be better for the planet if you picked the falafel instead.</div><div><br />But the hysteria peaks with the trash situation. It’s now common for garbage rooms across Copenhagen to feature seven or more bins for sorting disposals. Despite <a href=\"https://www.terex.com/zenrobotics\">trash-sorting robots</a> being able to do this job far better than humans in most cases, you see Danes dutifully sorting and subdividing their waste with a pious obligation worthy of the new climate deity.<br /><br /></div><div>Yet it’s not even the sorting that gets me — it’s the washing. You can’t put plastic containers with food residue into the recycling bucket, so you have to rinse them first. This leads to the grotesque daily ritual of washing trash (and wasting water galore in the process!).<br /><br /></div><div>Plus, most people in Copenhagen live in small apartments, and all that separated trash has to be stored separately until the daily pilgrimage to the trash room. So it piles up all over the place.<br /><br /></div><div>This is exactly what Nietzsche meant by “God is dead” — his warning that we’d need to fill the void with another centering orientation toward the world. And clearly, climatism is stepping up as a suitable alternative for the Danes. It’s got guilt, repentance, and plenty of rituals to spare. Oh, and its <a href=\"https://x.com/BjornLomborg\">heretics</a> too.<br /><br /></div><div>Look, I'd like a clean planet as much as the next sentient being. I'm not crying any tears over the fact that gas-powered cars are quickly disappearing from the inner-city of Copenhagen. I love biking! I wish we'd get a move on with nuclear for consistent, green energy. But washing or sorting my trash when a robot could do a better job just to feel like \"I'm doing my part\"? No.</div><div><br />It’s like those damn paper straws that crumble halfway through your smoothie. The point of it all seems to be self-inflicted, symbolic suffering — solely to remind you of your good standing with the sacred lord of recycling, refuting the plastic devil.<br /><br />And worse, these small, meaningless acts of pious climate service end up working as catholic indulgences. We buy a good conscience washing trash so we don't have to feel guilty <a href=\"https://airport-world.com/records-tumble-as-copenhagen-airport-enjoys-busiest-ever-month/\">setting new records flying for fun</a>.<br /><br /></div><div>I’m not religious, but I’m starting to think it’d be nicer to spend a Sunday morning in the presence of the Almighty than to keep washing trash as pagan replacement therapy.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/we-wash-our-trash-to-repent-for-killing-god-d1c823bd",
            "publishedAt": "2025-03-12",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Denmark is technically and officially still a Christian nation. Lutheranism is written into <a href=\"http://www.grundloven.dk/\">the constitution</a>. The government has a ministry for the church. Most Danes pay 1% of their earnings directly to fund the State religion. But God is as dead here as anywhere in the Western world. Less than 2% attend church service on a weekly basis. So one way to fill the void is through climate panic and piety.<br /><br /></div><div>I mean, these days, you can scarcely stroll past stores in the swankier parts of Copenhagen without being met by an endless parade of ads carrying incantations towards sustainability, conservation, and recycling. It's everywhere.</div><div><br />Hilariously, sometimes this even includes recommending that customers don’t buy the product. I went to a pita place for lunch the other day. The menu had a meat shawarma option, and alongside it was a plea not to order it too often because it’d be better for the planet if you picked the falafel instead.</div><div><br />But the hysteria peaks with the trash situation. It’s now common for garbage rooms across Copenhagen to feature seven or more bins for sorting disposals. Despite <a href=\"https://www.terex.com/zenrobotics\">trash-sorting robots</a> being able to do this job far",
            "title": "We wash our trash to repent for killing God"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>In a fit of frustration, I wrote the first version of <a href=\"https://kamal-deploy.org/\">Kamal</a> in six weeks at <a href=\"https://world.hey.com/dhh/introducing-kamal-9330a267\">the start of 2023</a>. <a href=\"https://world.hey.com/dhh/why-we-re-leaving-the-cloud-654b47e0\">Our plan to get out of the cloud</a> was getting bogged down in <a href=\"https://world.hey.com/dhh/the-only-thing-worse-than-cloud-pricing-is-the-enterprisey-alternatives-854e98f3\">enterprisey pricing</a> and Kubernetes complexity. And I refused to accept that running our own hardware had to be that expensive or that convoluted. So I got busy building a cheap and simple alternative.&nbsp;<br /><br /></div><div>Now, just two years later, Kamal is deploying every single application in our entire heritage fleet, and everything in active development. Finalizing a perfectly uniform mode of deployment for every web app we've built over the past two decades and still maintain.</div><div><br />See, we have this obsession at <a href=\"https://37signals.com\">37signals</a>: That the modern build-boost-discard cycle of internet applications is a <a href=\"https://killedbygoogle.com/\">scourge</a>. That users ought to be able to trust that when they adopt a system like <a href=\"https://basecamp.com\">Basecamp</a> or <a href=\"https://hey.com\">HEY</a>, they don't have to fear eviction from the next executive re-org. We call this obsession <a href=\"https://world.hey.com/dhh/until-the-end-of-the-internet-439ccfce\">Until The End Of The Internet</a>.<br /><br /></div><div>That obsession isn't free, but it's worth it. It means we're still operating the very first version of Basecamp for thousands of paying customers. That's the OG code base from 2003! Which hasn't seen any updates since 2010, beyond security patches, bug fixes, and performance improvements. But we're still operating it, and, along with every other app in our heritage collection, deploying it with Kamal.<br /><br /></div><div>That just makes me smile, knowing that we have customers who adopted Basecamp in 2004, and are still able to use the same system some twenty years later. In the meantime, we've relaunched and dramatically improved Basecamp many times since. But for customers happy with what they have, there's no forced migration to the latest version.<br /><br /></div><div>I very much had all of this in mind when designing Kamal. That's one of the reasons I really love Docker. It allows you to encapsulate an entire system, with all of its dependencies, and run it until the end of time. Kind of how modern gaming emulators can run the original ROM of Pac-Man or Pong to perfection and eternity.<br /><br /></div><div>Kamal seeks to be but a simple wrapper and workflow around this wondrous simplicity. <a href=\"https://www.youtube.com/watch?v=iqXjGiQ_D-A&amp;t=1289s\">Complexity is but a bridge</a> — and a fragile one at that. To build something durable, you have to make it simple.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/our-switch-to-kamal-is-complete-8e0de22e",
            "publishedAt": "2025-03-12",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>In a fit of frustration, I wrote the first version of <a href=\"https://kamal-deploy.org/\">Kamal</a> in six weeks at <a href=\"https://world.hey.com/dhh/introducing-kamal-9330a267\">the start of 2023</a>. <a href=\"https://world.hey.com/dhh/why-we-re-leaving-the-cloud-654b47e0\">Our plan to get out of the cloud</a> was getting bogged down in <a href=\"https://world.hey.com/dhh/the-only-thing-worse-than-cloud-pricing-is-the-enterprisey-alternatives-854e98f3\">enterprisey pricing</a> and Kubernetes complexity. And I refused to accept that running our own hardware had to be that expensive or that convoluted. So I got busy building a cheap and simple alternative.&nbsp;<br /><br /></div><div>Now, just two years later, Kamal is deploying every single application in our entire heritage fleet, and everything in active development. Finalizing a perfectly uniform mode of deployment for every web app we've built over the past two decades and still maintain.</div><div><br />See, we have this obsession at <a href=\"https://37signals.com\">37signals</a>: That the modern build-boost-discard cycle of internet applications is a <a href=\"https://killedbygoogle.com/\">scourge</a>. That users ought to be able to trust that when they adopt a system like <a href=\"https://basecamp.com\">Basecamp</a> or <a href=\"https://hey.com\">HEY</a>, they don't have to fear eviction from the next executive re-org. We call this obsession <a href=\"https://world.hey.com/dhh/until-the-end-of-the-internet-439ccfce\">Until The End Of The Internet</a>.<br /><br /></div><div>That obsession isn't free, but it's worth it. It means we're still operating the very first version of Basecamp for thousands of",
            "title": "Our switch to Kamal is complete"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Denmark has been reaping <a href=\"https://www.irishtimes.com/world/europe/2024/05/29/how-denmarks-social-democrats-stole-far-right-thunder-on-migration/\">lots of</a> <a href=\"https://www.nytimes.com/2025/02/24/magazine/denmark-immigration-policy-progressives.html\">delayed accolades</a> from its relatively <a href=\"https://www.infomigrants.net/en/post/62576/denmark-unprecedented-measures-to-signal-to-migrants-they-are-not-welcome\">strict immigration policy</a> lately. <a href=\"https://www.thelocal.dk/20230426/we-are-10-15-years-behind-swedish-pm-praises-strict-danish-immigration\">The Swedes</a> and the Germans in particular are now eager to take inspiration from The Danish Model, given <a href=\"https://www.dw.com/en/aschaffenburg-what-we-know-about-the-deadly-knife-attack/a-71402933\">their</a> <a href=\"https://www.gisreportsonline.com/r/sweden-immigrants-crisis/\">predicaments</a>. The very same countries that until recently condemned the lack of <a href=\"https://www.theguardian.com/world/article/2024/aug/19/sweden-negative-net-immigration-figure-record-low-asylum-application-global-displacement\">open-arms/open-border policies</a> they would champion as <a href=\"https://www.nytimes.com/2018/09/03/world/europe/sweden-election-populism.html\">Moral Superpowers</a>.&nbsp;<br /><br /></div><div>But even in Denmark, thirty years after the public opposition to mass immigration started getting real political representation, the consequences of culturally-incompatible descendants from <a href=\"https://migrant-integration.ec.europa.eu/news/denmark-new-statistics-category-migrants-muslim-countries_en\">MENAPT</a> continue to stress the high-trust societal model.<br /><br /></div><div>Here are just three major cases that's been covered in the Danish media in 2025 alone:<br /><br /></div><ol><li>Danish public schools are <a href=\"https://www.berlingske.dk/indland/vold-og-trusler-er-blevet-hverdag-i-folkeskoler-naesten-2000-bortvisninger\">increasingly struggling with violence and threats</a> against students and teachers, primarily from descendants of MENAPT immigrants. In schools with 30% or more immigrants, <a href=\"https://www.berlingske.dk/indland/paa-skoler-i-koebenhavn-med-mange-ikkevestlige-elever-oplever-flere\">violence is twice as prevalent</a>. This is causing a flight to private schools from parents who can afford it (including <a href=\"https://www.berlingske.dk/indland/han-er-far-til-tre-og-har-droppet-forraaet-folkeskole-til-fordel-for\">some Syrians!</a>). Some teachers are <a href=\"https://www.berlingske.dk/indland/hun-blev-truet-af-elever-indtil-hun-sagde-op-det-var-koranen-der-styrede\">quitting the profession</a> as a result, saying \"the Quran run the class room\".</li><li>Danish women are <a href=\"https://mim.dk/nyheder/pressemeddelelser-om-ligestilling/2025/marts/ministeren-for-ligestilling-vil-skabe-mere-tryghed-for-kvinder-i-nattelivet\">increasingly feeling unsafe</a> in the nightlife. The mayor of the country's third largest city, Odense, says <a href=\"https://www.bt.dk/politik/borgmester-med-klar-opfordring-til-unge-kvinder-gaa-en-stor-bue-udenom-disse\">he knows why</a>: \"It's groups of young men with an immigrant background that's causing it. We might as well be honest about that.\" But unfortunately, the only suggestion he had to deal with the problem was that \"when [the women] meet these groups... they should take a big detour around them\".</li><li>A soccer club from the infamous ghetto area of Vollsmose <a href=\"https://politiken.dk/sport/art10111167/Hyggeseriebold-endte-i-vold-og-trusler.-Nu-er-sagen-havnet-p%C3%A5-kulturministerens-bord\">got national attention</a> because every other team in their league refused to play them. Due to the team's long history of violent assaults and death threats against opposing teams and referees. Bizarrely leading to the situation were <a href=\"https://www.berlingske.dk/indland/flere-fodboldhold-naegter-at-spille-mod-vollsmose-klub-vil-hellere-lade\">the team got to the top of its division</a> because they'd \"win\" every forfeited match.</li></ol><div><br />Problems of this sort have existed in Denmark for well over thirty years. So in a way, none of this should be surprising. But it actually is. Because it shows that <a href=\"https://x.com/jonatanpallesen/status/1899379119286108620\">long-term assimilation just isn't happening</a> at a scale to tackle these problems. In fact, data shows the opposite: <a href=\"https://integrationsbarometer.dk/tal-og-analyser/filer-tal-og-analyser/arkiv/NotatvedrrendekriminalitetenblandtMENAPT.pdf\">Descendants of MENAPT immigrants are more likely to be violent and troublesome than their parents</a>.</div><div><br />That's an explosive point because it blows up the thesis that time will solve these problems. Showing instead that it actually just makes it worse. And then what?<br /><br /></div><div>This is particularly pertinent in the analysis of Sweden. After the \"far right\" party of the Swedish Democrats got into government, the <a href=\"https://www.lemonde.fr/en/international/article/2025/01/17/sweden-s-all-out-tightening-of-migration-policy_6737114_4.html\">new immigrant arrivals have plummeted</a>. But unfortunately, the net share of immigrants is still increasing, in part because of family reunifications, and thus <a href=\"https://x.com/jonatanpallesen/status/1879929506393444842\">the problems</a> continue.</div><div><br />Meaning even if European countries \"close the borders\", they're still condemned to deal with the damning effects of maladjusted MENAPT immigrant descendants for decades to come. If the intervention stops there.</div><div><br />There are no easy answers here. Obviously, if you're in a hole, you should stop digging. And Sweden has done just that. But just because you aren't compounding the problem doesn't mean you've found a way out. Denmark proves to be both a positive example of minimizing the digging while also a cautionary tale that the hole is still there.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/closing-the-borders-alone-won-t-fix-the-problems-aca49088",
            "publishedAt": "2025-03-11",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Denmark has been reaping <a href=\"https://www.irishtimes.com/world/europe/2024/05/29/how-denmarks-social-democrats-stole-far-right-thunder-on-migration/\">lots of</a> <a href=\"https://www.nytimes.com/2025/02/24/magazine/denmark-immigration-policy-progressives.html\">delayed accolades</a> from its relatively <a href=\"https://www.infomigrants.net/en/post/62576/denmark-unprecedented-measures-to-signal-to-migrants-they-are-not-welcome\">strict immigration policy</a> lately. <a href=\"https://www.thelocal.dk/20230426/we-are-10-15-years-behind-swedish-pm-praises-strict-danish-immigration\">The Swedes</a> and the Germans in particular are now eager to take inspiration from The Danish Model, given <a href=\"https://www.dw.com/en/aschaffenburg-what-we-know-about-the-deadly-knife-attack/a-71402933\">their</a> <a href=\"https://www.gisreportsonline.com/r/sweden-immigrants-crisis/\">predicaments</a>. The very same countries that until recently condemned the lack of <a href=\"https://www.theguardian.com/world/article/2024/aug/19/sweden-negative-net-immigration-figure-record-low-asylum-application-global-displacement\">open-arms/open-border policies</a> they would champion as <a href=\"https://www.nytimes.com/2018/09/03/world/europe/sweden-election-populism.html\">Moral Superpowers</a>.&nbsp;<br /><br /></div><div>But even in Denmark, thirty years after the public opposition to mass immigration started getting real political representation, the consequences of culturally-incompatible descendants from <a href=\"https://migrant-integration.ec.europa.eu/news/denmark-new-statistics-category-migrants-muslim-countries_en\">MENAPT</a> continue to stress the high-trust societal model.<br /><br /></div><div>Here are just three major cases that's been covered in the Danish media in 2025 alone:<br /><br /></div><ol><li>Danish public schools are <a href=\"https://www.berlingske.dk/indland/vold-og-trusler-er-blevet-hverdag-i-folkeskoler-naesten-2000-bortvisninger\">increasingly struggling with violence and threats</a> against students and teachers, primarily from descendants of MENAPT immigrants. In schools with 30% or more immigrants, <a href=\"https://www.berlingske.dk/indland/paa-skoler-i-koebenhavn-med-mange-ikkevestlige-elever-oplever-flere\">violence is twice as prevalent</a>. This is causing a flight to private schools from parents who can afford it (including <a href=\"https://www.berlingske.dk/indland/han-er-far-til-tre-og-har-droppet-forraaet-folkeskole-til-fordel-for\">some Syrians!</a>). Some teachers are <a href=\"https://www.berlingske.dk/indland/hun-blev-truet-af-elever-indtil-hun-sagde-op-det-var-koranen-der-styrede\">quitting the profession</a> as a result, saying \"the Quran run the class room\".</li><li>Danish women are <a href=\"https://mim.dk/nyheder/pressemeddelelser-om-ligestilling/2025/marts/ministeren-for-ligestilling-vil-skabe-mere-tryghed-for-kvinder-i-nattelivet\">increasingly feeling unsafe</a> in the nightlife. The mayor of the country's third",
            "title": "Closing the borders alone won't fix the problems"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>When the iPhone first appeared in 2007, Microsoft was sitting pretty with their mobile strategy. They'd been early to the market with Windows CE, they were fast-following the iPod with their Zune. They also had the dominant operating system, the dominant office package, and control of the enterprise. The future on mobile must have looked so bright!<br /><br /></div><div>But of course now, we know it wasn't. <a href=\"https://www.youtube.com/watch?v=eywi0h_Y5_U\">Steve Ballmer infamously dismissed the iPhone with a chuckle</a>, as he believed all of Microsoft's past glory would guarantee them mobile victory. He wasn't worried at all. He clearly should have been!</div><div><br />After reliving that Ballmer moment, it's uncanny to watch <a href=\"https://www.youtube.com/watch?v=GdYa6VpZ27E\">this CNBC interview</a> from one year ago with Johny Srouji and John Ternus from Apple on their AI strategy. <a href=\"https://x.com/ostynhyss/status/1898172397536071746\">Ternus even repeats the chuckle!!</a> Exuding the same delusional confidence that lost Ballmer's Microsoft any serious part in the mobile game.&nbsp;<br /><br /></div><div>But somehow, <a href=\"https://www.bloomberg.com/news/articles/2025-03-07/apple-confirms-delay-of-ai-infused-personalized-siri-assistant?utm_source=website&amp;utm_medium=share&amp;utm_campaign=copy&amp;embedded-checkout=true\">Apple's problems with AI</a> seem even more dire. Because there's apparently no one steering the ship. Apple has been promising customers <a href=\"https://x.com/iupdate/status/1898102090846925068\">a bag of vaporware</a> since last fall, and they're nowhere close to being able to deliver on the shiny concept demos. The ones that were going to make Apple Intelligence worthy of its name, and not just <a href=\"https://x.com/SnazzyLabs/status/1867050732521918961\">terrible image generation</a> that is years behind the state of the art.<br /><br /></div><div>Nobody at Apple seems able or courageous enough to face the music: Apple Intelligence sucks. Siri sucks. None of the vaporware is anywhere close to happening. Yet as late as last week, you have <a href=\"https://x.com/tim_cook/status/1897325061104918961\">Cook promoting the new MacBook Air with \"Apple Intelligence\"</a>. Yikes.<br /><br /></div><div>This is partly down to the org chart. <a href=\"https://www.apple.com/leadership/john-giannandrea/\">John Giannandrea</a> is Apple's VP of ML/AI, and he reports directly to Tim Cook. He's been in the seat since 2018. But Cook evidently does not have the product savvy to be able to tell bullshit from benefit, so he keeps giving Giannandrea more rope. Now the fella has hung Apple's reputation on vaporware, promised all iPhone 16 customers something magical that just won't happen, and even spec-bumped all their devices with more RAM for nothing but diminished margins. Ouch.<br /><br /></div><div>This is what regression to the mean looks like. This is what fiefdom management looks like. This is what having a company run by a logistics guy looks like. Apple needs <a href=\"https://world.hey.com/dhh/apple-is-in-its-ballmer-era-339b0713\">a leadership reboot</a>, stat. That asterisk is a stain. <br /><br />  <figure class=\"attachment attachment--preview attachment--lightboxable attachment--png\">\n      <a href=\"https://world.hey.com/dhh/df2c98ca/blobs/BAh7BkkiC19yYWlscwY6BkVUewdJIglkYXRhBjsAVGwrBx6NZnlJIghwdXIGOwBUSSIMYmxvYl9pZAY7AEY=--08739ca901051a97904ed0bbf9d2df6fed374cdf/apple-id-asterisk.png?disposition=attachment\" title=\"Download apple-id-asterisk.png\">\n        <img alt=\"apple-id-asterisk.png\" src=\"https://world.hey.com/dhh/df2c98ca/representations/BAh7BkkiC19yYWlscwY6BkVUewdJIglkYXRhBjsAVGwrBx6NZnlJIghwdXIGOwBUSSIMYmxvYl9pZAY7AEY=--08739ca901051a97904ed0bbf9d2df6fed374cdf/BAh7BkkiC19yYWlscwY6BkVUewdJIglkYXRhBjsAVHsKOgtmb3JtYXRJIghwbmcGOwBUOhRyZXNpemVfdG9fbGltaXRbB2kCgAdpAgAFOgxxdWFsaXR5aUs6C2xvYWRlcnsGOglwYWdlMDoNY29hbGVzY2VUSSIIcHVyBjsAVEkiDnZhcmlhdGlvbgY7AEY=--9290cf66642bdf8e9d3be172e7df870aa5d30b92/apple-id-asterisk.png\" />\n</a>\n  </figure></div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/apple-does-ai-as-microsoft-did-mobile-df2c98ca",
            "publishedAt": "2025-03-10",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>When the iPhone first appeared in 2007, Microsoft was sitting pretty with their mobile strategy. They'd been early to the market with Windows CE, they were fast-following the iPod with their Zune. They also had the dominant operating system, the dominant office package, and control of the enterprise. The future on mobile must have looked so bright!<br /><br /></div><div>But of course now, we know it wasn't. <a href=\"https://www.youtube.com/watch?v=eywi0h_Y5_U\">Steve Ballmer infamously dismissed the iPhone with a chuckle</a>, as he believed all of Microsoft's past glory would guarantee them mobile victory. He wasn't worried at all. He clearly should have been!</div><div><br />After reliving that Ballmer moment, it's uncanny to watch <a href=\"https://www.youtube.com/watch?v=GdYa6VpZ27E\">this CNBC interview</a> from one year ago with Johny Srouji and John Ternus from Apple on their AI strategy. <a href=\"https://x.com/ostynhyss/status/1898172397536071746\">Ternus even repeats the chuckle!!</a> Exuding the same delusional confidence that lost Ballmer's Microsoft any serious part in the mobile game.&nbsp;<br /><br /></div><div>But somehow, <a href=\"https://www.bloomberg.com/news/articles/2025-03-07/apple-confirms-delay-of-ai-infused-personalized-siri-assistant?utm_source=website&amp;utm_medium=share&amp;utm_campaign=copy&amp;embedded-checkout=true\">Apple's problems with AI</a> seem even more dire. Because there's apparently no one steering the ship. Apple has been promising customers <a href=\"https://x.com/iupdate/status/1898102090846925068\">a bag of vaporware</a> since last fall, and they're nowhere close to being able to deliver on the shiny concept demos. The",
            "title": "Apple does AI as Microsoft did mobile"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Bean counters have a bad rep for a reason. And it’s not because paying attention to the numbers is inherently unreasonable. It’s because weighing everything exclusively by its quantifiable properties is an impoverished way to view business (and the world!).<br /><br /></div><div>Nobody presents this caricature better than the MBA types who think you can manage a business entirely in the abstract realm of \"products,\" \"markets,\" \"resources,\" and \"deliverables.\" To hell with that. The death of all that makes for a breakout product or service happens when the generic lingo of management theory takes over.<br /><br /></div><div>This is why founder-led operations often keep an edge. Because when there’s someone at the top who actually gives a damn about cars, watches, bags, software, or whatever the hell the company makes, it shows up in a million value judgments that can’t be quantified neatly on a spreadsheet.<br /><br /></div><div>Now, I love a beautiful spreadsheet that shows expanding margins, healthy profits, and customer growth as much as any business owner. But much of the time, those figures are derivatives of doing all the stuff that you can’t compute and that won’t quantify.<br /><br /></div><div>But this isn’t just about running a better business by betting on unquantifiable elements that you can’t prove but still believe matter. It’s also about the fact that doing so is simply more fun! It’s more congruent. It’s vibe management.<br /><br /></div><div>And no business owner should ever apologize for having fun, following their instincts, or trusting that the numbers will eventually show that doing the right thing, the beautiful thing, the poetic thing is going to pay off somehow. In this life or the next.<br /><br /></div><div>Of course, you’ve got to get the basics right. Make more than you spend. Don’t get out over your skis. But once there’s a bit of margin, you owe it to yourself to lean on that cushion and lead the business primarily on the basis of good vibes and a long vision.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/beans-and-vibes-in-even-measure-8eff819c",
            "publishedAt": "2025-03-06",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Bean counters have a bad rep for a reason. And it’s not because paying attention to the numbers is inherently unreasonable. It’s because weighing everything exclusively by its quantifiable properties is an impoverished way to view business (and the world!).<br /><br /></div><div>Nobody presents this caricature better than the MBA types who think you can manage a business entirely in the abstract realm of \"products,\" \"markets,\" \"resources,\" and \"deliverables.\" To hell with that. The death of all that makes for a breakout product or service happens when the generic lingo of management theory takes over.<br /><br /></div><div>This is why founder-led operations often keep an edge. Because when there’s someone at the top who actually gives a damn about cars, watches, bags, software, or whatever the hell the company makes, it shows up in a million value judgments that can’t be quantified neatly on a spreadsheet.<br /><br /></div><div>Now, I love a beautiful spreadsheet that shows expanding margins, healthy profits, and customer growth as much as any business owner. But much of the time, those figures are derivatives of doing all the stuff that you can’t compute and that won’t quantify.<br /><br /></div><div>But this isn’t just about running a better business",
            "title": "Beans and vibes in even measure"
        },
        {
            "content": [
                "<p>The internet <em>loves</em> <a href=\"https://en.wikipedia.org/wiki/Theanine\">theanine</a>. This is an amino acid analog that’s naturally found in tea, but now sold as a nutritional supplement for anxiety or mood or memory.</p>\n\n<p><em>Many</em> people try theanine and report <a href=\"https://old.reddit.com/r/Supplements/comments/15kpfl9/ltheanine_wow/\"><em>wow</em></a> or <a href=\"https://old.reddit.com/r/Supplements/comments/1ekbrgl/anyone_have_good_experiences_with_ltheanine/lgke7ys/\"><em>great for ADHD</em></a> or <a href=\"https://old.reddit.com/r/Nootropics/comments/o7smk5/l_theanine_cured_my_social_anxiety_im_blown_away/\"><em>cured my (social) anxiety</em></a> or <a href=\"https://old.reddit.com/r/Supplements/comments/1ethltn/ltheanine_is_changing_my_life/\"><em>changing my life</em></a>. And it’s not just the <a href=\"https://old.reddit.com/r/nootropics/\">placebo enthusiast</a> community. This <a href=\"https://news.ycombinator.com/item?id=41765607\">hacker news thread</a> is full of positive reports, and <a href=\"https://gwern.net/nootropic/nootropics#defaults\">gwern</a> uses it regularly.</p>\n\n<p>But does it really work?</p>\n\n<p>Biologically speaking, it’s plausible. Theanine is structurally related to the neurotransmitter <a href=\"https://en.wikipedia.org/wiki/Glutamate_(neurotransmitter)\">glutamate</a> (theanine = C₇H₁₄N₂O₃, glutamate = C₅H₈NO₄-). For some reason, everyone is obsessed with stupid flashy dopamine and serotonin, and no one cares about glutamate. But it’s the most common neurotransmitter and theanine is both metabolized into glutamate and seems to itself have various <a href=\"https://en.wikipedia.org/wiki/Theanine#In_vitro\">complicated</a> effects on glutamate receptors.</p>\n\n<p>Of course, there are lots of supplements that <em>could</em> act on the brain, but are useless when taken orally. That’s because your brain is isolated from your circulatory system by a <a href=\"https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier\">thin layer of cells</a> that are extremely picky about what they let through. But it appears that theanine <a href=\"https://doi.org/10.1271/bbb.63.615\"><em>can</em></a> get through these cells and into the brain.</p>\n\n<p>So that sounds good. But do these low-level effects actually lead to changes in mood in real humans? When I looked into the academic research, I was surprised by how weak it was. Personally, on <a href=\"https://dynomight.net/aspartame/#the-european-food-safety-authority-efsa\">these kinds of issues</a>, I find the European Food Safety Authority to be the single most trustworthy scientific body. They did an <a href=\"https://www.efsa.europa.eu/en/efsajournal/pub/2238\">assessment</a> in 2011 and found:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Claim</th>\n      <th>Result</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Improvement of cognitive function</td>\n      <td>cause and effect relationship has not been established</td>\n    </tr>\n    <tr>\n      <td>Alleviation of psychological stress</td>\n      <td>cause and effect relationship has not been established</td>\n    </tr>\n    <tr>\n      <td>Maintenance of normal sleep</td>\n      <td>cause and effect relationship has not been established</td>\n    </tr>\n    <tr>\n      <td>Reduction of menstrual discomfort</td>\n      <td>cause and effect relationship has not been established</td>\n    </tr>\n  </tbody>\n</table>\n\n<p><a href=\"https://examine.com/supplements/theanine/\">Examine</a> is an independent website that’s respected for summarizing the scientific literature on health and supplements. They looked into if theanine helped with various things, like alertness, anxiety, and attention. In all cases found <em>low quality evidence</em> for <em>near zero effect</em>.</p>\n\n<p>A <a href=\"https://doi.org/10.1007/s11130-019-00771-5\">2020 review</a> of eight randomized double-blind placebo controlled trials found that theanine <em>might</em> help with stress and anxiety. While this review seems generally good, I found it to be insufficiently paranoid. One study they review found that theanine worked better than <a href=\"https://en.wikipedia.org/wiki/Alprazolam\">alprazolam</a> (xanax) for acute anxiety. The correct response would be, “That’s <em>impossible</em>, and the fact that normal scientific practices could lead to such a conclusion casts doubt on everything.” But the review sort of takes it at value and moves on.</p>\n\n<p>After 2020, the only major trial I could find was <a href=\"https://doi.org/10.1089/jmf.2020.4803\">this 2021 study</a> that took 52 healthy older Japanese people and gave them theanine (or placebo) for 12 weeks. They tested for improvements in a million different measures of cognitive functioning and mostly found nothing.</p>\n\n<h2 id=\"why-i-did-this\">Why I did this</h2>\n\n<p>I’ve long found that tea makes me much less nervous than coffee, even with equal caffeine. Many people have suggested theanine as the explanation, but I’m skeptical. Most tea only has ~5 mg of theanine per cup, while when people supplement, they take 100-400 mg. Apparently grassy shade-grown Japanese teas are particularly high in theanine. And I <em>do</em> find those teas particularly calming. But they still only manage ~25 mg per cup. (Maybe it’s because tea is better than coffee?)</p>\n\n<p>Still, I’ve supplemented theanine on and off for more than 10 years, and it seems helpful. So after seeing the weak scientific evidence, I thought: Why not do a self-experiment?</p>\n\n<p>Theanine seems ideal because it’s a supplement with short term effects. So you can test it against placebo. (Try that with meditation.) And you can build up a large sample using a single human body without waiting weeks for it to build up in the body before each measurement.</p>\n\n<p>Everyone agrees theanine is <a href=\"https://www.fda.gov/media/182086/download\">safe</a>. It’s biologically plausible. While academic studies haven’t proven a benefit, they haven’t <em>disproven</em> one either. Given the vast <em>anecdotal</em> evidence, I saw a chance to stick it to the stodgy scientific establishment, to show the power of internet people and give the first rigorous evidence that theanine really works. Stockholm, prepare thyself.</p>\n\n<h2 id=\"what-i-did\">What I did</h2>\n\n<p>First, I needed placebos. This was super annoying. The obvious way to create them would be to buy some empty capsules and fill some with theanine and others with some inert substance. But that doesn’t sound fun. Isn’t the whole idea of modernity that we’re supposed to replace labor with capital?</p>\n\n<p>So I went searching for a pair of capsules I could buy off the shelf, subject to the following constraints:</p>\n\n<ol>\n  <li>Capsule A contains 200 mg of theanine.</li>\n  <li>Capsule B contains something with minimal acute effects on anxiety, stress, memory, concentration, etc.</li>\n  <li>Capsule B contains something I don’t mind putting into my body.</li>\n  <li>Both capsules are exactly the same size and weight.</li>\n  <li>Both capsules are almost but not <em>quite</em> the same color.</li>\n  <li>Both capsules are made by some company with a history of making at least a modest effort to sell supplements that contain what they say they contain, and that don’t have terrifying levels of heavy metals.</li>\n  <li>The capsules themselves aren’t made from the <a href=\"https://en.wikipedia.org/wiki/Gelatin\">skin and bones and connective tissues of dead animals</a> (personal preference).</li>\n</ol>\n\n<p>After a ludicrous amount of searching, I found that NOW® sells these veggie capsules:</p>\n\n<p><strong>Capsule A:</strong> 200 mg L-Theanine</p>\n\n<p><strong>Capsule B:</strong> 25 mcg (1,000 IU) Vitamin D</p>\n\n<p>These are exactly the same size, exactly the same weight, exactly the same texture, and <em>very</em> close in color. They’re so close in color that under warm lighting, they’re indistinguishable. But under cold/blue lighting, the vitamin D capsules are <em>slightly</em> more yellow. Vitamin D might have some effects on mood, but no one seems to claim that they’re <em>acute</em>, that you’d feel them within an hour.</p>\n\n<p>For dosing, I decided to take a capsule whenever I was feeling stressed or anxious. Some people worry this invalidates the results. Not so! I’m still choosing randomly, and this better reflects how people use theanine in practice.</p>\n\n<p>Theanine is often recommended for reducing anxiety from caffeine. While I didn’t explicitly take caffeine as part of this experiment, I had almost always taken some anyway.</p>\n\n<p>Statistically, it would have been best to randomize so I had a 50% chance of taking theanine and a 50% chance of taking vitamin D. But I decided that would be annoying, since I was taking these capsules when stressed. So I decided to randomize so I got theanine ⅔ of the time and vitamin D ⅓ of the time.</p>\n\n<p>Randomization was very easy: I took two theanine capsules and one vitamin D capsule and put them into a little cup. I then closed my eyes, shook the cup around a bit and took one. I then covered the cup with a card.</p>\n\n<p><img alt=\"capsules\" src=\"https://dynomight.net/img/theanine/capsules.jpg\" /></p>\n\n<p>This picture shows one vitamin D capsule (top) and two theanine capsules.</p>\n\n<p>For each trial, I recorded my subjective starting stress level on a scale of 1-5, then set an alarm for an hour, which is <a href=\"https://doi.org/10.3945/jn.112.166371\">enough</a> to reach near-peak concentrations in the blood. After the alarm sounded (or occasionally later, if I missed it) I recorded the end time, my end stress level, and my percentage prediction that what I’d taken was actually theanine. Then, and only then, I looked into the cup. If the two remaining pills were different colors, I’d taken theanine. If not, it was vitamin D.</p>\n\n<p>After ~14 months, I got frustrated by how slowly data was coming in. This was the first time in my life I’ve had <em>too</em> much chill. At that point, I decided to start taking the capsules once or twice a day, even if I wasn’t stressed. I’ll show the transition point in the graphs below.</p>\n\n<p>Ultimately, I collected 94 data points, which look like this:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Date</th>\n      <th>Start time</th>\n      <th>Start stres</th>\n      <th>End time</th>\n      <th>End stress</th>\n      <th>Prediction</th>\n      <th>Result</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Nov 18, 2023</td>\n      <td>9:38 AM</td>\n      <td>3.5</td>\n      <td>10:45 AM</td>\n      <td>2.2</td>\n      <td>80%</td>\n      <td>T</td>\n    </tr>\n    <tr>\n      <td>Nov 19, 2023</td>\n      <td>9:40 AM</td>\n      <td>2.8</td>\n      <td>10:41 AM</td>\n      <td>2.9</td>\n      <td>75%</td>\n      <td>T</td>\n    </tr>\n    <tr>\n      <td>⋮</td>\n      <td>⋮</td>\n      <td>⋮</td>\n      <td>⋮</td>\n      <td>⋮</td>\n      <td>⋮</td>\n      <td>⋮</td>\n    </tr>\n    <tr>\n      <td>Feb 28, 2025</td>\n      <td>4:58 PM</td>\n      <td>2.1</td>\n      <td>5:58 PM</td>\n      <td>1.8</td>\n      <td>75%</td>\n      <td>D</td>\n    </tr>\n    <tr>\n      <td>Mar 3, 2025</td>\n      <td>6:12 PM</td>\n      <td>2.1</td>\n      <td>7:12 PM</td>\n      <td>2.0</td>\n      <td>61%</td>\n      <td>T</td>\n    </tr>\n  </tbody>\n</table>\n\n<h2 id=\"what-are-the-results\">What are the results?</h2>\n\n<p>Bad.</p>\n\n<p>Here are the raw stress levels. Each line line shows one trial, with the start marked with a tiny horizontal bar. Note the clear change when I started dosing daily:</p>\n\n<p><a href=\"https://dynomight.net/img/theanine/stress.pdf\"><img alt=\"\" src=\"https://dynomight.net/img/theanine/stress.svg\" /></a></p>\n\n<p>Alternatively, here’s the <em>difference</em> in stress (end - start) as a function of time. If “Δ Stress” is negative, that means stress went down.</p>\n\n<p><a href=\"https://dynomight.net/img/theanine/diff.pdf\"><img alt=\"\" src=\"https://dynomight.net/img/theanine/diff.svg\" /></a></p>\n\n<p>Here are the start and end stress levels for each trial, ignoring time. The dotted line shows equal stress levels, so anything below that line means stress went down:</p>\n\n<p><a href=\"https://dynomight.net/img/theanine/stress_beforeafter.pdf\"><img alt=\"\" src=\"https://dynomight.net/img/theanine/stress_beforeafter.svg\" /></a></p>\n\n<p>Finally, here are the probabilities I gave that each capsule was in fact theanine.</p>\n\n<p><a href=\"https://dynomight.net/img/theanine/probs.pdf\"><img alt=\"\" src=\"https://dynomight.net/img/theanine/probs.svg\" /></a></p>\n\n<h2 id=\"thoughts\">Thoughts</h2>\n\n<p>Ooof.</p>\n\n<p>My stress level <em>did</em> usually go down, at least provided I was stressed at the start. But it went down regardless of if I took theanine or not. And I was <em>terrible</em> at guessing what I’d taken.</p>\n\n<p>Why did my stress decrease when I took vitamin D? Maybe it’s the placebo effect. But I suspect it’s mostly reversion to the mean: If you mark down the times in your life when you’re most stressed, on average you’ll be less stressed an hour later. You can see some evidence for this in that stress tended to decrease more when it started at a higher level.</p>\n\n<p>So, eyeballing the above figures, theanine doesn’t appear to do anything. (We can argue about statistics below.) Why? I think these are the possibilities:</p>\n\n<ol>\n  <li>Theanine works, but I got fake theanine.</li>\n  <li>Theanine works, but vitamin D works equally well.</li>\n  <li>Theanine works, but I was unlucky.</li>\n  <li>Theanine works, but I’m disembodied and unable to report my internal states.</li>\n  <li>Theanine works on some people, but not me.</li>\n  <li>Theanine doesn’t work.</li>\n</ol>\n\n<p>It’s hard to disprove the idea that theanine works. But I tell you this: I expected it to work. And I <em>really</em> tried. For almost 100 trials over 16 months, I paid attention to what I was feeling and tried to detect <em>any</em> sign that I’d taken theanine, even if it wasn’t a change in stress. I could detect nothing. Even after months of failure, I’d often feel confident that <em>this</em> time I could tell, only to be proven wrong.</p>\n\n<p>So, cards on the table, here are my <a href=\"https://dynomight.net/bayes/\">made-up probabilities</a> for each of the possible explanations:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Explanation</th>\n      <th>belief</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Fake theanine</td>\n      <td>3%</td>\n    </tr>\n    <tr>\n      <td>D equally good</td>\n      <td>1%</td>\n    </tr>\n    <tr>\n      <td>Unlucky</td>\n      <td>6%</td>\n    </tr>\n    <tr>\n      <td>Disembodied</td>\n      <td>15%</td>\n    </tr>\n    <tr>\n      <td>Not on me</td>\n      <td>20%</td>\n    </tr>\n    <tr>\n      <td>Doesn’t work</td>\n      <td>55%</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Should I have been surprised by these results? Well, the scientific literature on theanine hasn’t found much of an effect. And the only other <em>good</em> self-experiment on theanine I’ve found is by <a href=\"https://niplav.site/nootropics#LTheanine\">Niplav</a>, who found it did slightly worse than chance and declared it a “hard pass”.</p>\n\n<p>What about other blinded self-experiments with other substances? They’re surprisingly scarce, but here’s what I could find:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>author</th>\n      <th>substance</th>\n      <th>result</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Niplav</td>\n      <td><a href=\"https://niplav.site/nootropics.html#Caffeine\">caffeine</a></td>\n      <td>positive</td>\n    </tr>\n    <tr>\n      <td>Gwern</td>\n      <td><a href=\"https://gwern.net/nootropic/nootropics#adderall-blind-testing\">amphetamines</a></td>\n      <td>positive</td>\n    </tr>\n    <tr>\n      <td>Gwern</td>\n      <td><a href=\"https://gwern.net/nootropic/nootropics#lithium\">lithium</a></td>\n      <td>no effect</td>\n    </tr>\n    <tr>\n      <td>Gwern</td>\n      <td><a href=\"https://gwern.net/nootropic/nootropics#lsd-microdosing\">LSD microdose</a></td>\n      <td>no effect</td>\n    </tr>\n    <tr>\n      <td>Gwern</td>\n      <td><a href=\"https://gwern.net/zeo/zma\">ZMA</a></td>\n      <td>inconclusive</td>\n    </tr>\n    <tr>\n      <td>Slatestarcodex</td>\n      <td><a href=\"https://slatestarcodex.com/2020/02/17/sleep-support-an-individual-randomized-controlled-trial/\">sleep support</a></td>\n      <td>no effect</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Stimulants work! But for everything else…</p>\n\n<p>I particularly encourage you to read the sleep support post. He was confident it worked, he’d recommended it to lots of friends, but it totally failed when put to the test.</p>\n\n<p>I’ve seen <em>many</em> other self-experiments (including for theanine), but they’re non-blinded and I’d be doing you a disservice if I linked to them. People often mention that <em>hypothetically</em> this means the results aren’t scientific, but treat it like a small niggling technicality. It’s not.</p>\n\n<p>So I propose a new rule: Blind trial or GTFO.</p>\n\n<p>I know many people reading this probably use and like theanine. Maybe it works for you! But given the weak academic results, and given the fact that I actually did a blinded experiment, I think you now have the burden of proof. Doing this kind of test isn’t hard. If you’re sure theanine (or anything else) works, prove it.</p>\n\n<h2 id=\"appendix-ok-fine-lets-argue-about-statistics\">Appendix: OK fine let’s argue about statistics</h2>\n\n<p>Do you demand p-values? Are you outraged I just plotted the data and then started talking about it qualitatively?</p>\n\n<p>I think faith in statistics follows a U-shaped curve. By default, people don’t trust them. If you learn a <em>little</em> statistics, they seem great. (Particularly if you’re part of a community that’s formed a little cult around one set of statistical practices and convinced each other that they’re more reliable than they are.) But if you learn a <em>lot</em> of statistics, then you realize all the assumptions that are needed and all the ways things can go wrong and you become very paranoid.</p>\n\n<p>If you want p-values, I’ll give you p-values. But first let me point out a problem.</p>\n\n<p>While I was blinded during each trial, I saw the theanine/D result when I wrote it down. Over time I couldn’t help but notice that my stress dropped even when I took vitamin D, and that I was terrible at predicting what I’d taken. So while this experiment is randomized and blinded, the data isn’t <em>independent</em> or <em>identically distributed</em>. If I did this again, I’d make sure I couldn’t see any outcomes until the end, perhaps by making 100 numbered envelopes, putting three capsules in each, and only looking at what was left at the end.</p>\n\n<p>But if you want to compute p-values anyway, OK! Here are the basic numbers for the trials when I took theanine:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Variable</th>\n      <th>Substance</th>\n      <th>Mean</th>\n      <th>95% C.I.</th>\n      <th>p</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>start stress</td>\n      <td>theanine</td>\n      <td>2.480</td>\n      <td>(2.361, 2.599)</td>\n      <td> </td>\n    </tr>\n    <tr>\n      <td>end stress</td>\n      <td>theanine</td>\n      <td>2.181</td>\n      <td>(2.104, 2.258)</td>\n      <td> </td>\n    </tr>\n    <tr>\n      <td>Δ stress</td>\n      <td>theanine</td>\n      <td>-0.299</td>\n      <td>(-0.392, -0.205)</td>\n      <td>2.00×10⁻⁸</td>\n    </tr>\n    <tr>\n      <td>Predicted T</td>\n      <td>theanine</td>\n      <td>68.4%</td>\n      <td>(66.2%, 70.5%)</td>\n      <td> </td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Stress went down, p &lt; .0000001. But here are the the numbers for vitamin D:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Variable</th>\n      <th>Substance</th>\n      <th>Mean</th>\n      <th>95% C.I.</th>\n      <th>p</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>start stress</td>\n      <td>vitamin D</td>\n      <td>2.350</td>\n      <td>(2.173, 2.526)</td>\n      <td> </td>\n    </tr>\n    <tr>\n      <td>end stress</td>\n      <td>vitamin D</td>\n      <td>2.025</td>\n      <td>(1.936, 2.114)</td>\n      <td> </td>\n    </tr>\n    <tr>\n      <td>Δ stress</td>\n      <td>vitamin D</td>\n      <td>-0.325</td>\n      <td>(-0.453, -0.197)</td>\n      <td>2.44×10⁻⁵</td>\n    </tr>\n    <tr>\n      <td>Predicted T</td>\n      <td>vitamin D</td>\n      <td>72.9%</td>\n      <td>(69.7%, 76.1%)</td>\n      <td> </td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Stress <em>also</em> went down.</p>\n\n<p>Finally, here’s the difference between theanine and vitamin D, computed with a <a href=\"https://www.statsmodels.org/stable/generated/statsmodels.stats.weightstats.CompareMeans.ttest_ind.html#statsmodels.stats.weightstats.CompareMeans.ttest_ind\">two-sided t-test with unequal variance</a>:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Variable</th>\n      <th>Substance</th>\n      <th>Mean</th>\n      <th>95% C.I.</th>\n      <th>p</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>start stress</td>\n      <td>theanine - D</td>\n      <td>0.130</td>\n      <td>(-0.095, 0.354)</td>\n      <td>0.254</td>\n    </tr>\n    <tr>\n      <td>end stress</td>\n      <td>theanine - D</td>\n      <td>0.156</td>\n      <td>(0.0165, 0.296)</td>\n      <td>0.029</td>\n    </tr>\n    <tr>\n      <td>Δ stress</td>\n      <td>theanine - D</td>\n      <td>-0.026</td>\n      <td>(-0.201, 0.148)</td>\n      <td>0.764</td>\n    </tr>\n    <tr>\n      <td>Predicted T</td>\n      <td>theanine - D</td>\n      <td>-4.5%</td>\n      <td>(-8.5%, -0.5%)</td>\n      <td>0.029</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Technically, I did find two significant results. But the second row says that end stress was slightly <em>higher</em> with theanine than with vitamin D, and the last row says that I gave slightly <em>higher</em> probabilities that I’d taken theanine when I’d actually taken vitamin D.</p>\n\n<p>Of course, I don’t think this means I’ve proven theanine is harmful. I just think this confirms my general paranoia. To a first approximation, if it ain’t visible in the raw data, I ain’t going.</p>\n\n<p><img alt=\"just look at the data\" src=\"https://dynomight.net/img/theanine/stats.png\" /></p>\n\n<p>Speaking of raw data, you can download mine <a href=\"https://dynomight.net/img/theanine/data.csv\">here</a>.</p>"
            ],
            "link": "https://dynomight.net/theanine/",
            "publishedAt": "2025-03-06",
            "source": "Dynomight",
            "summary": "<p>The internet <em>loves</em> <a href=\"https://en.wikipedia.org/wiki/Theanine\">theanine</a>. This is an amino acid analog that’s naturally found in tea, but now sold as a nutritional supplement for anxiety or mood or memory.</p> <p><em>Many</em> people try theanine and report <a href=\"https://old.reddit.com/r/Supplements/comments/15kpfl9/ltheanine_wow/\"><em>wow</em></a> or <a href=\"https://old.reddit.com/r/Supplements/comments/1ekbrgl/anyone_have_good_experiences_with_ltheanine/lgke7ys/\"><em>great for ADHD</em></a> or <a href=\"https://old.reddit.com/r/Nootropics/comments/o7smk5/l_theanine_cured_my_social_anxiety_im_blown_away/\"><em>cured my (social) anxiety</em></a> or <a href=\"https://old.reddit.com/r/Supplements/comments/1ethltn/ltheanine_is_changing_my_life/\"><em>changing my life</em></a>. And it’s not just the <a href=\"https://old.reddit.com/r/nootropics/\">placebo enthusiast</a> community. This <a href=\"https://news.ycombinator.com/item?id=41765607\">hacker news thread</a> is full of positive reports, and <a href=\"https://gwern.net/nootropic/nootropics#defaults\">gwern</a> uses it regularly.</p> <p>But does it really work?</p> <p>Biologically speaking, it’s plausible. Theanine is structurally related to the neurotransmitter <a href=\"https://en.wikipedia.org/wiki/Glutamate_(neurotransmitter)\">glutamate</a> (theanine = C₇H₁₄N₂O₃, glutamate = C₅H₈NO₄-). For some reason, everyone is obsessed with stupid flashy dopamine and serotonin, and no one cares about glutamate. But it’s the most common neurotransmitter and theanine is both metabolized into glutamate and seems to itself have various <a href=\"https://en.wikipedia.org/wiki/Theanine#In_vitro\">complicated</a> effects on glutamate receptors.</p> <p>Of course, there are lots of supplements that <em>could</em> act on the brain, but are useless when taken orally. That’s because your brain is isolated from your circulatory system by a <a href=\"https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier\">thin layer of cells</a> that are extremely picky about what they let through. But it appears that theanine <a href=\"https://doi.org/10.1271/bbb.63.615\"><em>can</em></a> get through these",
            "title": "My 16-month theanine self-experiment"
        },
        {
            "content": [
                "<p>Influential AI researcher <a href=\"https://karpathy.ai/\">Andrej Karpathy</a> wrote two years ago that &#8220;the hottest new programming language is English,&#8221; a topic he expanded on last month with the idea of &#8220;<a href=\"https://x.com/karpathy/status/1886192184808149383\">vibecoding</a>&#8221; a practice where you just ask an AI to create something for you, giving it feedback as it goes. I think the implications of this approach are much wider than coding, but I wanted to start by doing some vibecoding myself.</p><p>I decided to give it a try using Anthropic&#8217;s new <a href=\"https://docs.anthropic.com/en/docs/agents-and-tools/claude-code/overview\">Claude Code</a> agent, which gives the Claude Sonnet 3.7 LLM the ability to manipulate files on your computer and use the internet. Actually, I needed AI help before I could even use Claude Code. I can only code in a few very specific programming languages (mostly used in statistics) and have no experience at all with Linux machines. Yet Claude Code only runs in Linux. Fortunately, Claude told me how to handle my problems, so after some vibetroubleshooting (seriously, if you haven&#8217;t used AI for technical support, you should) I was able to set up Claude Code.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0747e7e7-eccb-4595-bbc7-11050d5da82b_2786x1181.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"181.37087912087912\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0747e7e7-eccb-4595-bbc7-11050d5da82b_2786x1181.png\" width=\"428\" /><div></div></div></a></figure></div><p>Time to vibecode. The very first thing I typed into Claude Code was: &#8220;<em>make a 3D game where I can place buildings of various designs and then drive through the town i create.</em>&#8221; That was it, grammar and spelling issues included. I got a working application (Claude helpfully launched it in my browser for me) about four minutes later, with no further input from me. You can see the results in the video below.</p><p>It was pretty neat, but a little boring, so I wrote: <em>hmmm its all a little boring (also sometimes the larger buildings don't place properly). Maybe I control a firetruck and I need to put out fires in buildings? We could add traffic and stuff.</em></p><p>A couple minutes later, it made my car into a fire truck, added traffic, and made it so houses burst into flame. Now we were getting somewhere, but there were still things to fix. I gave Claude feedback: <em>looking better, but the firetruck changes appearance when moving (wheels suddenly appear) and there is no issue with traffic or any challenge, also fires don't spread and everything looks very 1980s, make it all so much better.</em></p><p>After seeing the results, I gave it a fourth, and final, command as a series of three questions: <em>can i reset the board? can you make the buildings look more real? can you add in a rival helicopter that is trying to extinguish fires before me? </em>You can see the results of all four prompts in the video below. It is a working, if blocky, game, but one that includes day and night cycles, light reflections, missions, and a computer-controlled rival, all created using the hottest of all programming languages - English.</p><div class=\"native-video-embed\"></div><p>Actually, I am leaving one thing out. Between the third and fourth prompts, something went wrong and the game just wouldn't work. As someone with no programming skills in JavaScript or whatever the game was written in, I had no idea how to fix it. The result was a sequence of back-and-forth discussions with the AI where I would tell it errors and it would work to solve them. After twenty minutes, everything was working again, better than ever. In the end, the game cost around $5 in Claude API fees to make&#8230; and $8 more to get around the bug, which turned out to be a pretty simple problem.  Prices will likely fall quickly but the lesson is useful: as amazing as it is (I made a working game by asking!), vibecoding is most useful when you actually have some knowledge and don't have to rely on the AI alone. A better programmer might have immediately recognized that the issue was related to asset loading or event handling. And this was a small project, I am less confident of my ability to work with AI to handle a large codebase or complex project, where even more human intervention would be required.</p><p>This underscores how vibecoding isn't about eliminating expertise but redistributing it - from writing every line of code to knowing enough about systems to guide, troubleshoot, and evaluate. The challenge becomes identifying what \"minimum viable knowledge\" is necessary to effectively collaborate with AI on various projects. </p><h1>Vibeworking with expertise</h1><p>Expertise clearly still matters in a world of creating things with words. After all, you have to know what you want to create; be able to judge whether the results are good or bad; and give appropriate feedback. As I wrote in my <a href=\"https://a.co/d/cXHRBnv\">book</a>, with current AIs, you can often achieve the best results by working as a co-intelligence with AI systems which continue to have a \"jagged frontier\" of abilities.</p><p>But applying expertise need not involve a lot of work. Take for example, my recent experience with <a href=\"https://manus.im/app\">Manus</a>, a new AI agent out of China. It basically uses Claude (and possibly other LLMs as well) but gives the AI access to a wide range of tools, including the ability to do web research, code, create documents and websites and more. It is the most capable general-purpose agent I have seen so far, <a href=\"https://www.oneusefulthing.org/p/the-end-of-search-the-beginning-of\">but like other general agents</a>, it still makes errors and mistakes. Despite that, it can accomplish some pretty impressive things.</p><p>For example, here is a small portion of what it did when I asked it to &#8220;<em>create an interactive course on elevator pitching using the best academic advice.</em>&#8221; You can see the system set up a checklist of tasks and then go through them, doing web research before building the pages (this is sped up, the actual process unfolds autonomously, but over tens of minutes or even hours).</p><div class=\"native-video-embed\"></div><p>As someone who teaches entrepreneurship, I would say that the output it created was surface-level impressive - it was an entire course that covered much of the basics of pitching, and without obvious errors! Yet, I also could instantly see that it was too text heavy and did not include opportunities for knowledge checks or interactive exercises. I gave the AI a second prompt: &#8220;<em>add interactive experiences directly into course material and links to high quality videos.</em>&#8221; Even though this was the bare minimum feedback, it was enough to improve the course considerably, as you can see below. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb2a829fe-0e6c-4339-8fe2-b138f8df2936_5113x1524.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1524\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb2a829fe-0e6c-4339-8fe2-b138f8df2936_5113x1524.png\" width=\"5113\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">On the left you can see the overall class structure it created, when I clicked on the first lesson it took you to an overall module guide, and then each module was built out with videos, text, and interactive quizzes.</figcaption></figure></div><p>If I were going to deploy the course, I would push the AI further and curate the results much more, but it is impressive to see how far you can get with just a little guidance. But there are other modes of vibework as well. While course creation demonstrates AI's ability to handle casual structured creative work with minimal guidance, research represents a more complex challenge requiring deeper expertise integration.</p><h1>Deep Vibeworking</h1><p>It is at the cutting edge of expertise where AI gets to be most interesting to use. Unfortunately for anyone writing about this sort of work, they are also the use cases that are hardest to explain, but I can give you one example.</p><p>I have a large, anonymized set of data about crowdfunding efforts that I collected nearly a decade ago, but never got a chance to use for any research purposes. The data is very complex - a huge Excel file, a codebook (that explains what the various parts of the Excel file mean), and a data dictionary (that details each entry in the Excel file). Working on the data involved frequent cross-referencing through these files and is especially tedious if you haven&#8217;t been working with the data in a long time. I was curious how far I could get in writing a new research paper using this old data with the help of AI.</p><p>I started by getting an OpenAI Deep Research report on the latest literature on how organizations could impact crowdfunding. I was able to check the report over based on my knowledge. I knew that it would not include all the latest articles (Deep Research cannot access paid academic content), but its conclusions were solid and would be useful to the AI when considering what topics might be worth exploring. So, I pasted in the report and the three files into the secure version of ChatGPT provided by my university and worked with multiple models to generate hypotheses. The AI suggested multiple potential directions, but I needed to filter them based on what would actually contribute meaningfully to the field&#8212;a judgment call requiring years of experience with the relevant research.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb023515e-763d-4ea9-8411-2860a881bd9d_3586x1802.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"732\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb023515e-763d-4ea9-8411-2860a881bd9d_3586x1802.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Then I worked back and forth with the models to test the hypothesis and confirm that our findings were correct. The AI handled the complexity of the data analysis and made a lot of suggestions, while I offered overall guidance and direction about what to do next. At several points, the AI proposed statistically valid approaches that I, with my knowledge of the data, knew would not be appropriate. Together, we worked through the hypothesis to generate fairly robust findings.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcc1f3f44-00f0-4dfc-a465-d60397660c45_4584x2492.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"792\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcc1f3f44-00f0-4dfc-a465-d60397660c45_4584x2492.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Then I gave all of the previous output to o1-pro and asked it to write a paper, offering a few suggestions along the way. It is far from a blockbuster, but it would make a solid contribution to the state of knowledge (after a bit more checking of the results, as AI still makes errors). More interestingly, it took less than an hour to create, as compared to weeks of thinking, planning, writing, coding and iteration. Even if I had to spend an hour checking the work, it would still result in massive time savings.</p><p>I never had to write a line of code, but only because I knew enough to check the results and confirm that everything made sense. I worked in plain English, shaving dozens of hours of work that I could not have done anywhere near as quickly without the AI&#8230; but there were many places where the AI did not yet have the &#8220;instincts&#8221; to solve problems properly. The AI is far from being able to work alone, humans still provide both vibe and work in the world of vibework.</p><h1>Work is changing</h1><p>Work is changing, and we're only beginning to understand how. What's clear from these experiments is that the relationship between human expertise and AI capabilities isn't fixed. Sometimes I found myself acting as a creative director, other times as a troubleshooter, and yet other times as a domain expert validating results. It was my complex expertise (or lack thereof) that determined the quality of the output.</p><p>The current moment feels transitional. These tools aren't yet reliable enough to work completely autonomously, but they're capable enough to dramatically amplify what we can accomplish. The $8 debugging session for my game reminds me that the gaps in AI capabilities still matter, and knowing where those gaps are becomes its own form of expertise. Perhaps most intriguing is how quickly this landscape is changing. The research paper that took me an hour with AI assistance would have been impossible at this speed just eighteen months ago. </p><p>Rather than reaching definitive conclusions about how AI will transform work, I find myself collecting observations about a moving target. What seems consistent is that, for now, the greatest value comes not from surrendering control entirely to AI or clinging to entirely human workflows, but from finding the right points of collaboration for each specific task&#8212;a skill we're all still learning.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe51b1702-4f72-4433-a0ed-7f8eb16962a1_1376x864.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"234.8372093023256\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe51b1702-4f72-4433-a0ed-7f8eb16962a1_1376x864.png\" width=\"374\" /><div></div></div></a></figure></div><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/subscribe\"><span>Subscribe now</span></a></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/p/speaking-things-into-existence?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share\"><span>Share</span></a></p><p></p>"
            ],
            "link": "https://www.oneusefulthing.org/p/speaking-things-into-existence",
            "publishedAt": "2025-03-11",
            "source": "Ethan Mollick",
            "summary": "<p>Influential AI researcher <a href=\"https://karpathy.ai/\">Andrej Karpathy</a> wrote two years ago that &#8220;the hottest new programming language is English,&#8221; a topic he expanded on last month with the idea of &#8220;<a href=\"https://x.com/karpathy/status/1886192184808149383\">vibecoding</a>&#8221; a practice where you just ask an AI to create something for you, giving it feedback as it goes. I think the implications of this approach are much wider than coding, but I wanted to start by doing some vibecoding myself.</p><p>I decided to give it a try using Anthropic&#8217;s new <a href=\"https://docs.anthropic.com/en/docs/agents-and-tools/claude-code/overview\">Claude Code</a> agent, which gives the Claude Sonnet 3.7 LLM the ability to manipulate files on your computer and use the internet. Actually, I needed AI help before I could even use Claude Code. I can only code in a few very specific programming languages (mostly used in statistics) and have no experience at all with Linux machines. Yet Claude Code only runs in Linux. Fortunately, Claude told me how to handle my problems, so after some vibetroubleshooting (seriously, if you haven&#8217;t used AI for technical support, you should) I was able to set up Claude Code.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0747e7e7-eccb-4595-bbc7-11050d5da82b_2786x1181.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"181.37087912087912\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0747e7e7-eccb-4595-bbc7-11050d5da82b_2786x1181.png\" width=\"428\" /><div></div></div></a></figure></div><p>Time to vibecode. The very first thing I",
            "title": "Speaking things into existence"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-03-08_c6f1c75c9b2f_hung-with-some-cool-cats-at-ma/",
            "publishedAt": "2025-03-09",
            "source": "Harper Reed",
            "summary": "<p>Hung with some cool cats at Marz.</p> <p>We gotta get edmar to get some big ass altecs in there.</p> <figure> <img alt=\"image_1.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-03-08_c6f1c75c9b2f_hung-with-some-cool-cats-at-ma/image_1.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_2.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-03-08_c6f1c75c9b2f_hung-with-some-cool-cats-at-ma/image_2.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #186"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-03-08_9e7cddb3c38c_was-gregs-to-hang-with-my-frie/",
            "publishedAt": "2025-03-09",
            "source": "Harper Reed",
            "summary": "<p>Was Greg’s to hang with my friend Nick the other night</p> <figure> <img alt=\"image_1.jpg\" height=\"1196\" src=\"https://harper.blog/notes/2025-03-08_9e7cddb3c38c_was-gregs-to-hang-with-my-frie/image_1.jpg\" width=\"1799\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #184"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-03-08_9e7cddb3c38c_was-great-to-hang-with-my-frie/",
            "publishedAt": "2025-03-09",
            "source": "Harper Reed",
            "summary": "<p>Was great to hang with my friend Nick the other night</p> <figure> <img alt=\"image_1.jpg\" height=\"1196\" src=\"https://harper.blog/notes/2025-03-08_9e7cddb3c38c_was-great-to-hang-with-my-frie/image_1.jpg\" width=\"1799\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #185"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/new-blog-post-a-perplexing-javascript-parsing/",
            "publishedAt": "2025-03-12",
            "source": "Hillel Wayne",
            "summary": "<p>I know I said we'd be back to normal newsletters this week and in fact had 80% of one already written. </p> <p>Then I unearthed something that was better left buried.</p> <p><a href=\"http://www.hillelwayne.com/post/javascript-puzzle/\" target=\"_blank\">Blog post here</a>, <a href=\"https://www.patreon.com/posts/blog-notes-124153641\" target=\"_blank\">Patreon notes here</a> (Mostly an explanation of how I found this horror in the first place). Next week I'll send what was supposed to be this week's piece.</p> <p>(PS: <a href=\"https://www.aprilcools.club/\" target=\"_blank\">April Cools</a> in three weeks!)</p>",
            "title": "New Blog Post: \"A Perplexing Javascript Parsing Puzzle\""
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>One of the great lessons of nature: Randomness is the most beautiful thing.</div><div><br /></div><div>Every forest, every field, every place untouched by humans is full of randomness. Nothing lines up, a million different shapes, sprouting seeds burst where the winds — or birds — randomly drop them.</div><div><br /></div><div>Stones strewn by water, ice, gravity, and wind, all acting on their own in their own ways. Things that just stop and stay. Until they move somehow, another day.</div><div><br /></div><div>The way the light falls, the dapples that hit the dirt. The shades of shades of shades of green and gold that work no matter what's behind it.</div><div><br /></div><div>The way the wind carries whatever's light enough for liftoff.</div><div><br /></div><div>The negative space between the leaves.</div><div><br /></div><div>Colliding clouds.</div><div><br /></div><div>The random wave that catches light from the predictable sun. The water's surface like a shuffled blanket.</div><div><br /></div><div>Collect the undergrowth in your hand. Lift it up. Drop it on the ground. It's always beautiful.</div><div><br /></div><div>However it comes together, or however it stays apart, you never look at it and say that doesn't line up or those colors don't work or there's simply too much stuff or I don't know where to look.</div><div><br /></div><div>Nature's out of line. Just right. You too.</div><div><br />-Jason</div>\n</div>"
            ],
            "link": "https://world.hey.com/jason/randomly-right-a2f3af64",
            "publishedAt": "2025-03-12",
            "source": "Jason Fried",
            "summary": "<div class=\"trix-content\"> <div>One of the great lessons of nature: Randomness is the most beautiful thing.</div><div><br /></div><div>Every forest, every field, every place untouched by humans is full of randomness. Nothing lines up, a million different shapes, sprouting seeds burst where the winds — or birds — randomly drop them.</div><div><br /></div><div>Stones strewn by water, ice, gravity, and wind, all acting on their own in their own ways. Things that just stop and stay. Until they move somehow, another day.</div><div><br /></div><div>The way the light falls, the dapples that hit the dirt. The shades of shades of shades of green and gold that work no matter what's behind it.</div><div><br /></div><div>The way the wind carries whatever's light enough for liftoff.</div><div><br /></div><div>The negative space between the leaves.</div><div><br /></div><div>Colliding clouds.</div><div><br /></div><div>The random wave that catches light from the predictable sun. The water's surface like a shuffled blanket.</div><div><br /></div><div>Collect the undergrowth in your hand. Lift it up. Drop it on the ground. It's always beautiful.</div><div><br /></div><div>However it comes together, or however it stays apart, you never look at it and say that doesn't line up or those colors don't work or there's simply too much stuff or I don't know where to look.</div><div><br /></div><div>Nature's out of line. Just",
            "title": "Randomly right"
        },
        {
            "content": [],
            "link": "https://blog.nelhage.com/post/cpython-tail-call/",
            "publishedAt": "2025-03-09",
            "source": "Made of Bugs",
            "summary": "About a month ago, the CPython project merged a new implementation strategy for their bytecode interpreter. The initial headline results were very impressive, showing a 10-15% performance improvement on average across a wide range of benchmarks across a variety of platforms. Unfortunately, as I will document in this post, these impressive performance gains turned out to be primarily due to inadvertently working around a regression in LLVM 19. When benchmarked against a better baseline (such GCC, clang-18, or LLVM 19 with certain tuning flags), the performance gain drops to 1-5% or so depending on the exact setup.",
            "title": "Performance of the Python 3.14 tail-call interpreter"
        },
        {
            "content": [
                "<p>You learn the rules as soon as you&#8217;re old enough to speak. <em>Don&#8217;t talk to jabberjays.</em> You recite them as soon as you wake up every morning. <em>Keep your eyes away from screensnakes. </em>Your mother chooses a dozen to quiz you on each day before you&#8217;re allowed lunch. <em>Glitchers aren&#8217;t human any more; if you see one, run</em>. Before you sleep, you run through the whole list again, finishing every time with the single most important prohibition. <em>Above all, never look at the night sky</em>.</p><p>You&#8217;re a precocious child. You excel at your lessons, and memorize the rules faster than any of the other children in your village. Chief is impressed enough that, when you&#8217;re eight, he decides to let you see a glitcher that he&#8217;s captured. Your mother leads you to just outside the village wall, where they&#8217;ve staked the glitcher as a lure for wild animals. Since glitchers are too slow and uncoordinated to chase down prey, their peculiar magnetism is the only reason they&#8217;re able to survive in the wastes.</p><p>Each of the glitcher&#8217;s limbs is tied to the ground. Its clothes are rags by now. As the group gathers around it, it starts to moan through its gag, a painful undulating noise. &#8220;Look at it,&#8221; Chief says. As if roused to a frenzy by his voice, the glitcher throws its body from side to side, shaking against its restraints. &#8220;This is what you&#8217;ll end up as, if you&#8217;re careless.&#8221;</p><p>Suddenly one of the glitcher&#8217;s arms breaks free. It waves in the air, fingers forming frantic spasmodic patterns. You stare at it for a second, before your mother yanks you around and buries your face in her side. When she lets you look again, two men have wrestled its arm back into place. Chief looks at you somberly. &#8220;If you&#8217;d kept watching for a few more seconds, you would have been hypnotized. And if you&#8217;d stayed hypnotized for a minute, even odds that you would have glitched yourself. That&#8217;s how easy it is to be careless. Do better, or you won&#8217;t make it to adulthood.&#8221;</p><p>You have nightmares for the next few days, your mind full of the glitcher&#8217;s slack face and its writhing fingers. You lull yourself back to sleep by reciting the rules. You&#8217;re determined that you won&#8217;t mess up again. And so you make it all the way to thirteen before everything goes wrong.</p><p>It&#8217;s morning on an ordinary day. You left your room to wash, and when you walk back in there&#8217;s a screensnake curled up in the corner. You look away immediately, but there&#8217;s a second one crawling towards you from the side, and your eyes lock onto it. You freeze for a moment, not knowing where else to look&#8212;and that&#8217;s long enough for the patterns on its skin to catch your gaze. They flicker, blooming in radiant colors. There&#8217;s something hypnotic about them, and for a few seconds you can&#8217;t look away.</p><p>Then an axe comes down, and you hear voices shouting, and a piercing scream. You blink, and shake your head muzzily, and when you look up again Chief is throwing a blanket over the screensnake corpse.</p><p>&#8220;Fuck,&#8221; Chief says. &#8220;God fucking <em>damn</em> it.&#8221;</p><p>&#8220;What happened?&#8221; you ask. There&#8217;s a gasp from the doorway; you turn to see your mother. &#8220;He&#8217;s okay! He&#8217;s okay he&#8217;s okay he&#8217;s okay&#8212;&#8221; She starts towards you, but Chief moves faster, stepping in front of her and pushing her back.</p><p>&#8220;Think! It got him just as he walked in. How long ago was that&#8212;five minutes? Ten? That&#8217;s a lethal exposure.&#8221; His head never turns away from you as he says it, though his eyes are focused over your shoulder. He&#8217;s still holding his axe in his hand.</p><p>&#8220;But he can still talk! No glitcher can talk!&#8221;</p><p>&#8220;Nobody&#8217;s ever survived five straight minutes of screensnake trance either.&#8221;</p><p>&#8220;I feel fine,&#8221; you break in. &#8220;It wasn&#8217;t that long, was it? Or maybe I&#8217;m immune.&#8221;</p><p>Your mother lets out a sob. &#8220;See? He&#8217;s still thinking straight! He must be immune somehow, he must. Here, show Chief&#8212;&#8221;</p><p>&#8220;Quiet!&#8221; Chief barks. He backs out of the room, pushing your mother behind him. &#8220;Don&#8217;t go anywhere, child. And don&#8217;t say a word. I need to think.&#8221;</p><p>They leave you alone for hours. Outside, you can hear your mother arguing with the guards Chief has posted at your door. But they barely reply, and she gets nowhere. Eventually, you hear Chief&#8217;s voice outside again through the door. &#8220;Say yes if you can hear me; don&#8217;t say anything else.&#8221;</p><p>&#8220;Yes.&#8221;</p><p>&#8220;I&#8217;ve heard rumors that occasionally people arise who have some kind of immunity. But that&#8217;s all they are&#8212;rumors. And I will not risk my village on those. You can&#8217;t stay here.&#8221;</p><p>You hear your mother&#8217;s voice raised in a moan outside, but Chief&#8217;s voice cuts through it.</p><p>&#8220;One thing the rumors say is that there&#8217;s a whole village led by someone who can resist glitching. They say it&#8217;s two week&#8217;s travel north. I&#8217;ll give you enough supplies to get there. Maybe they&#8217;ll take you in, maybe they won&#8217;t. But either way, you leave today.&#8221;</p><p>His voice softens. &#8220;You were a good kid. I hope the rumors are right, and I hope you make it to safety. But whatever happens, you can&#8217;t come back.&#8221;</p><div><hr /></div><p>The deep wastes are quiet, and lonely. You&#8217;ve only ventured into them once or twice before. Now they&#8217;re all that you can see in every direction as you walk, following an old wives&#8217; tale that&#8217;s your only remaining hope. Somehow, you&#8217;re less scared than you would have expected. You never really thought you&#8217;d be glitched, but it&#8217;s still a fact of life: you lose friends every year. And you <em>are</em> immune, you must be: you&#8217;ve felt totally normal since the screensnake attack.</p><p>You still don&#8217;t want to take risks, though. Each night, as the stars come out, you cover your eyes firmly, and keep them covered until dawn. On the third day you see a glitcher shambling towards you from afar, but you give it a wide berth, and quickly leave it behind. You set traps every night, but all you catch are two ratlings. Still, they help stretch out your dwindling supplies a little longer, giving you a little more room for error.</p><p>After ten days of walking, you start looking for signs of the village Chief had spoken of. There are often still roads leading to them&#8212;sometimes covered in sand, but visible if you&#8217;re careful. You scout in a zigzag pattern, trying to cover as much ground as possible. But you see nothing. In the back of your mind you start to wonder if Chief had just made up the story wholesale, to get you to leave quietly. You curse yourself for a fool, but keep searching.</p><p>Two days later, you stumble across a suspiciously straight line of sand dunes. You start digging at their base, and after a few minutes you spot the telltale dark gray pattern of a buried road. You follow it north-east, searching for any sign of human presence. The next day you start spotting traps. They&#8217;re mostly empty, but even when they&#8217;ve caught a thylac or jabberjay, you leave them undisturbed. A few hours later you see who&#8217;s been laying them: at first faint figures in the distance, slowly resolving to two men as you walk closer. They&#8217;re focused on their task; only when you&#8217;re a hundred meters away does one look up and see you.</p><p>They shout in alarm, and scramble for their weapons. You rush to reassure them, but they&#8217;re wary&#8212;you need to yell back and forth for a few minutes to convince them that you&#8217;re not a glitcher or a mirage. Eventually they agree to take you back to their village, though they first bind your arms behind your back.</p><p>After an hour of walking, you reach their village walls. The hunters confer with the guards behind the gate. Finally two guards grab you and pull you through the main street, to an imposing building larger than any in your village. They lead you to a room near the entrance, where an old man sits at a desk, writing.</p><p>&#8220;Shaman,&#8221; one of the guards says, bowing his head. &#8220;We found him wandering in the wastes. He said that he seeks refuge, and that he has information he needs to tell you personally.&#8221;</p><p>Shaman turns his head towards you. He stares at you for a long moment, then gestures for you to speak.</p><p>&#8220;Greetings, Shaman,&#8221; you say deferentially. &#8220;I traveled here because I heard that you are immune to being glitched. I discovered recently that I am too. If you allow me to stay, I will contribute to your village in any way that I can.&#8221;</p><p>Shaman&#8217;s eyes are cold. &#8220;Are you sure that this story is the one you want to stick with?&#8221; You nod. He turns to the guards. &#8220;Test him,&#8221; he says.</p><p>The guards pull you towards through a corridor, into a large, dimly-lit room. In it are more glitchers than you&#8217;ve ever seen in your life&#8212;each tied down to a table, twitching intermittently. The guards tie you to one of the empty tables in the same way, and gag you. They each grab a pair of bulky earmuffs, and carefully place them over their ears. Then they walk around to each of the glitchers and remove their gags, one by one. As they do, the room gradually fills with their moans.</p><p>All night you listen to the babbling of the glitchers, noises that sound too alien to be produced by human mouths. As you sleep, you dream that you&#8217;re a glitcher too, prowling across the wastes under a sky that you&#8217;re still too afraid to look at. In the morning the guards come back, with Shaman behind them. He motions, and they undo your gag. &#8220;Well?&#8221; he says.</p><p>&#8220;I&#8217;m unharmed. But you can test me further if you like,&#8221; you say.</p><p>Shaman&#8217;s eyes widen. &#8220;You were telling the truth, then.&#8221; He pauses, and smiles. &#8220;I&#8217;d almost given up hope. This makes you the very first to succeed.&#8221;</p><p>They treat you very differently after that. You&#8217;re given food, and a room, and several days to rest. You spend the time exploring the village, which is much larger than your own, and much more raucous. The people in the streets seem less scared than those you grew up with. You wonder if that&#8217;s Shaman&#8217;s influence, though you&#8217;re too wary of offending them to ask.</p><p>A few mornings later, Shaman summons you to his office again. At his gesture, you sit in front of him. He waits for a few minutes before speaking.</p><p>&#8220;Tell me, child. Have you ever wondered why the world is like this?&#8221;</p><p>You frown. &#8220;The stories say that things used to be better. The land used to be fertile everywhere, not just where we cultivate it. Animals used to be safe. Even the stars used to be a beautiful sight. And then&#8230; I guess there was some kind of terrible accident, though I&#8217;ve never heard any explanation of what it was.&#8221;</p><p>Shaman laughs. It&#8217;s an ugly sound. &#8220;An accident? An accident that breaks the sky in ways that go on to break humans? An accident that turns animals themselves into weapons against us? No, this was no accident. It was a deliberate, targeted attack.&#8221;</p><p>&#8220;But&#8230; for that to be deliberate&#8230; it requires unimaginable power. What sort of beings have that?&#8221;</p><p>Shaman nods. &#8220;That&#8217;s the right question. Or rather, half of the right question. The other half is: with so much power bent on our destruction, why do they not simply crush us like ants?&#8221;</p><p>&#8220;Oh.&#8221; You think for a moment. &#8220;They want to&#8230; drag it out? They want to torment us?&#8221;</p><p>&#8220;Possibly, but I don&#8217;t think that they care about us even enough to enjoy hurting us. No, my guess is that they work under constraints that are invisible and maybe even inconceivable to us. I think that there was some kind of bargain. Humans used to have power, <em>real</em> power. We negotiated with them in aeons past, setting up compacts that would protect us from direct attacks.</p><p>&#8220;But they&#8217;ve been getting around the rules, step by step. They figured out how to overwrite our minds with only a few minutes of visual stimuli, to reform us into vessels for their purposes. Not easily, and not precisely. But they don&#8217;t need to be precise. If they can glitch enough of us, time will take care of the rest.&#8221;</p><p>The sheer scale of what he&#8217;s saying overwhelms you. &#8220;So we&#8217;re doomed.&#8221; You feel a lurch in your stomach as you say it.</p><p>He shakes his head. &#8220;No. We can adapt too. We <em>have</em> adapted&#8212;with all our safeguards, all our rules. And we can learn from the techniques they use. I&#8217;ve been studying glitchers for a decade, but it&#8217;s been slow work. I need someone else who&#8217;s immune to help me run more experiments.&#8221;</p><p>He stands and leads you towards the room full of glitchers. As you enter, he grabs a book from the desk by the doorway.</p><p>&#8220;The first question is: can we make any sense of their language? Is it even a language at all? They occasionally commune with each other, and sometimes their actions are suspiciously coordinated, which makes me think the answer is yes.&#8221;</p><p>He flips open the book, showing you pages upon pages of scribbled notes and tallies. &#8220;When I listen to them, there are some repeating syllables, and some structure. Your first task is to replicate my observations, and see if you can make any sense of them yourself. It won&#8217;t be easy, but from there we might be able to find patterns that give us hints about how to make more people immune, or maybe even find a cure for those who have already been infected. Will you work on this for me?&#8221;</p><p>You feel dwarfed by the magnitude of his ambitions. It&#8217;s like you&#8217;ve been living in a cave for your whole life, and now you&#8217;ve suddenly emerged into the blinding light of the sun. You worry that your voice will break if you try to speak. But you nod, and he seems satisfied.</p><div><hr /></div><p>You spend weeks working with Shaman, then months. His mission consumes you. He saved you from a drawn-out death in the desert. But more than that&#8212;he&#8217;s given you a way to fight back against the sheer senselessness of the world, to strike a blow against whoever caused all of this to happen.</p><p>Most days you sit in the corner, taking notes, as Shaman runs through experiments. Many are attempts to uncover any lurking remnant of humanity within the glitchers. He makes them try to pull clothes over their twitching limbs, or vocalize human language again with their writhing tongues. If they don&#8217;t succeed, he hurts them. They&#8217;ve lost almost all of their minds, but they still understand pain.</p><p>When Shaman is busy, you go to the lab alone, and try to replicate his old experiments. When you&#8217;re tired of that, you sit and watch the glitchers&#8217; indecipherable hand gestures, and practice mimicking them. Sometimes they seem to respond to you, but you&#8217;re not sure how much of it you&#8217;re imagining. The ones that Shaman has had for longer do seem cleverer, though. So you focus on them, slowly training them to follow your commands.</p><p>You meet others from Shaman&#8217;s village, but they seem wary of you. You don&#8217;t blame them. They&#8217;re terrified of glitchers, of course, and you spend so much of your time with them that you&#8217;ve even started to smell like them. But you don&#8217;t care for their company either. They have no idea how important your work is; nor can they discuss it intelligently even when you try to explain it.</p><p>So you spend most of your days with only Shaman and the glitchers for company. Sometimes you despair of ever making progress. But other days it feels like you&#8217;re communing with them, that you&#8217;re right on the cusp of understanding them. You go through those days in a fugue, only half-aware of what you&#8217;re doing. Your notes on those days are eerily insightful, though. And it often seems like Shaman is in the same fugue state&#8212;he works like a man possessed.</p><p>One night, you dream again of the glitchers, and when you wake up you find yourself in their room, listening to them. You flinch, and realize that you must have sleepwalked there. The glitchers&#8217; heads are all turned towards you. God, that&#8217;s dangerous. You start to tie yourself to your bed at night, to prevent any accidents.</p><p>But you don&#8217;t want to take a break. With your help, Shaman is making more progress than he has in years. The two of you have noticed a kind of correspondence between their words and their gestures, and Shaman thinks it might hold the key to translating the glitcher language. You still don&#8217;t know what any of it means, but after a few weeks of practice you can listen to the glitchers&#8217; mumbles and effortlessly trace out the corresponding patterns with your fingers. Shaman watches you intently. &#8220;Could you learn to speak like them too?&#8221; he asks you one day. &#8220;I think so,&#8221; you tell him. He nods with grim satisfaction, and you redouble your efforts.</p><p>Sometimes you think about your home village&#8212;whether your mother still grieves you, whether Chief regrets his decision, whether your friends are still following the same routines and playing the same games as they used to. Sometimes you wonder what your life would have been like if you&#8217;d stayed. But you don&#8217;t regret any of what happened&#8212;your work now is too important. So you sleep, you wake, and you sleep again, the days all blurring together&#8212;</p><p>You snap awake. You&#8217;re standing in the lab. Shaman is holding your shoulders and shaking you. His face fills your vision, twisted into a rictus of terror. &#8220;Listen. Listen! I thought I was immune too at first. But there&#8217;s no such thing. It&#8217;s a trap! You and I are just a new type of glitcher&#8212;subtle enough to blend in, smart enough to research how to create more of our kind. All our work, all our experiments, we&#8217;re doing exactly what they want. Destroy it all and kill me! Please, kill me now!&#8221;</p><p>You stumble backwards in shock, hitting the desk behind you with a thump. He flinches at the sound. For a moment a look of blank incomprehension appears on his face.</p><p>Then his eyes snap back into focus, and his voice mellows. &#8220;Forgive me. I&#8217;m an old man, and my mind sometimes wanders. What were we talking about?&#8221;</p><p>You stare at him. &#8220;What do you <em>mean</em>? You just told me that all our work is helping the enemy! You asked me to kill you!&#8221;</p><p>He smiles slightly. &#8220;It sounds like you&#8217;ve been having a bad dream. Go back to sleep. We can talk about this in the morning.&#8221;</p><p>The smile is what convinces you. Your hand goes to your dagger. As you lunge towards him, he moves backwards, almost in slow motion. You kill him quickly, mercifully. As soon as he stops moving, you stride over to his desk and write out a note. You keep it as brief as possible, to prevent any further contamination. &#8220;Immunity is a lie. He and I were just more subtle glitchers, and our research would have created more of them. Kill the captive glitchers NOW.&#8221;</p><p>You think about killing the glitchers yourself, but you&#8217;re worried that they&#8217;ll make enough of a fuss to rouse others. And you don&#8217;t trust yourself in their presence any more. You don&#8217;t know how close you are to being trapped inside your own body, like Shaman was. So you gather all the papers from Shaman&#8217;s desk in a bundle under your shirt, and walk quickly out of the building. Nobody sees you as you navigate to the edge of the village and scale the wall to the outside world.</p><p>For an hour you walk deeper and deeper into the desert, eyes fixed on your feet. Eventually the adrenaline wears off, and you find yourself shaking from the cold. This will have to do. You drop to your knees on the sand, and use your hands to dig a small hole in front of you. You pull the papers from under your shirt and pile them in. Your whole body is trembling still, so it takes you several tries to set them alight. Once you do, though, they burn merrily.</p><p>The dancing of the flames is peaceful, almost hypnotic. By the time it dies down, what happened in the village almost feels like a bad dream. You look around at the sand stretching out towards the horizon. It&#8217;s all so peaceful, so serene. Did he really say those things to you? Was it all some fevered imagining? You don&#8217;t know what to believe. But it doesn&#8217;t matter any more&#8212;you&#8217;ve burned your bridges. And if you can&#8217;t solve the problem of the glitchers, as you&#8217;d so fervently hoped, the only thing left is to make sure you don&#8217;t exacerbate it.</p><p>Your dagger is by your side as always. As you unsheath it, you notice that it&#8217;s still sticky with Shaman&#8217;s blood. Somehow that feels appropriate. You close your eyes, take a deep breath, then drive it into your chest. For a second you stay there, frozen&#8212;then, involuntarily, you slump onto your side like a broken doll. You feel your blood start to pool under your body. With the feeling of helplessness comes a feeling of release. Wonderingly, you realize that at last the rules no longer apply to you. You can do anything you want.</p><p>With a last spasmodic effort, you twist yourself onto your back. The night sky fills your sight for the first time, and you let out an involuntary sigh. It&#8217;s grander than anything you&#8217;ve ever seen. The stars, multicolored, whirl in patterns, dancing across the sky as you watch. Hypnotized, your focus zooms in and in, chasing the universe as it spins towards the center of your vision. Your last faint thought&#8212;oh. It&#8217;s so beautiful. Then your mind falls into the spiral, and you are lost.</p><div class=\"subscription-widget-wrap-editor\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading Narrative Ark! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input class=\"email-input\" name=\"email\" tabindex=\"-1\" type=\"email\" /><input class=\"button primary\" type=\"submit\" value=\"Subscribe\" /><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>"
            ],
            "link": "https://www.narrativeark.xyz/p/trojan-sky",
            "publishedAt": "2025-03-11",
            "source": "Narrative Ark",
            "summary": "<p>You learn the rules as soon as you&#8217;re old enough to speak. <em>Don&#8217;t talk to jabberjays.</em> You recite them as soon as you wake up every morning. <em>Keep your eyes away from screensnakes. </em>Your mother chooses a dozen to quiz you on each day before you&#8217;re allowed lunch. <em>Glitchers aren&#8217;t human any more; if you see one, run</em>. Before you sleep, you run through the whole list again, finishing every time with the single most important prohibition. <em>Above all, never look at the night sky</em>.</p><p>You&#8217;re a precocious child. You excel at your lessons, and memorize the rules faster than any of the other children in your village. Chief is impressed enough that, when you&#8217;re eight, he decides to let you see a glitcher that he&#8217;s captured. Your mother leads you to just outside the village wall, where they&#8217;ve staked the glitcher as a lure for wild animals. Since glitchers are too slow and uncoordinated to chase down prey, their peculiar magnetism is the only reason they&#8217;re able to survive in the wastes.</p><p>Each of the glitcher&#8217;s limbs is tied to the ground. Its clothes are rags by now. As the group gathers around it, it starts to moan through its gag,",
            "title": "Trojan Sky"
        },
        {
            "content": [],
            "link": "https://robertheaton.com/cocoon/",
            "publishedAt": "2025-03-11",
            "source": "Robert Heaton",
            "summary": "<p>My wife and two little boys sometimes go on trips to see friends or family for whom my presence isn’t strictly required. While my wife books the flights I make a show of weighing up my options and asking if it’s really OK if I don’t come. Eventually I’m persuaded that it truly would be the best thing for all of us for me to have five to seven days to myself with no nappies and all Nintendo.</p> <p>My wife hits the “Pay Now” button and when the confirmation email comes through I call my secretary and tell him to clear my calendar. When no one answers I remember that I have neither a secretary nor all that much going on, so instead I find a prestige TV series, a selection of local takeaway menus, and a short but immersive video game. This time I messaged my buddies and asked them what I should play. Steve gushed about a game called Cocoon; Morris said that he’d played it a year ago and it was “alright.” Sold.</p> <p>One month later there were hugs, kisses, wave goodbye to taxi, shut the door, where’s the HDMI cable, how did it get under the",
            "title": "It's not cheating if you write the video game solver yourself"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Mar/12/gemma-3/#atom-entries",
            "publishedAt": "2025-03-12",
            "source": "Simon Willison",
            "summary": "<p>Google's Gemma team released an impressive new model today (under their not-open-source <a href=\"https://ai.google.dev/gemma/terms\">Gemma license</a>). Gemma 3 comes in four sizes - 1B, 4B, 12B, and 27B - and while 1B is text-only the larger three models are all multi-modal for vision:</p> <blockquote> <p>Gemma 3 introduces multimodality, supporting vision-language input and text outputs. It handles context windows up to 128k tokens, understands over 140 languages, and offers improved math, reasoning, and chat capabilities, including structured outputs and function calling.</p> </blockquote> <p>Here's the <a href=\"https://storage.googleapis.com/deepmind-media/gemma/Gemma3Report.pdf\">Gemma 3 Technical Report PDF</a>, which makes the big claim that they find \"Gemma3-27B-IT comparable to Gemini-1.5-Pro across benchmarks\".</p> <p>I tried out the largest model using the latest <a href=\"https://ollama.com/\">Ollama</a> - this is the second time I've spotted a major model release partnering with Ollama on launch day, the first being <a href=\"https://simonwillison.net/2025/Jan/30/mistral-small-3/\">Mistral Small 3</a>.</p> <p>I ran this (after upgrading Ollama through their menu icon upgrade option):</p> <pre><code>ollama pull gemma3:27b </code></pre> <p>That pulled 17GB of model weights. I've been trying it out using <a href=\"https://llm.datasette.io/\">LLM</a> and <a href=\"https://github.com/taketwo/llm-ollama\">llm-ollama</a>:</p> <pre><code>llm install llm-ollama llm -m gemma3:27b 'Build a single page HTML+CSS+JavaScript UI that gives me a large textarea for writing in which constantly saves what I have entered to",
            "title": "Notes on Google's Gemma 3"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Mar/11/using-llms-for-code/#atom-entries",
            "publishedAt": "2025-03-11",
            "source": "Simon Willison",
            "summary": "<p>Online discussions about <a href=\"https://simonwillison.net/tags/ai-assisted-programming/\">using Large Language Models to help write code</a> inevitably produce comments from developers who's experiences have been disappointing. They often ask what they're doing wrong - how come some people are reporting such great results when their own experiments have proved lacking?</p> <p>Using LLMs to write code is <strong>difficult</strong> and <strong>unintuitive</strong>. It takes significant effort to figure out the sharp and soft edges of using them in this way, and there's precious little guidance to help people figure out how best to apply them.</p> <p>If someone tells you that coding with LLMs is <em>easy</em> they are (probably unintentionally) misleading you. They may well have stumbled on to patterns that work, but those patterns do not come naturally to everyone.</p> <p>I've been getting great results out of LLMs for code for over two years now. Here's my attempt at transferring some of that experience and intution to you.</p> <ul> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#set-reasonable-expectations\">Set reasonable expectations</a></li> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#account-for-training-cut-off-dates\">Account for training cut-off dates</a></li> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#context-is-king\">Context is king</a></li> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#ask-them-for-options\">Ask them for options</a></li> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#tell-them-exactly-what-to-do\">Tell them exactly what to do</a></li> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#you-have-to-test-what-it-writes-\">You have to test what it writes!</a></li> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#remember-it-s-a-conversation\">Remember it's a conversation</a></li> <li><a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#use-tools-that-can-run-the-code-for-you\">Use tools that can run the code for",
            "title": "Here's how I use LLMs to help me write code"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Mar/8/nicar-llms/#atom-entries",
            "publishedAt": "2025-03-08",
            "source": "Simon Willison",
            "summary": "<p>I presented two sessions at the <a href=\"https://www.ire.org/training/conferences/nicar-2025/\">NICAR 2025</a> data journalism conference this year. The first was this one based on my <a href=\"https://simonwillison.net/2024/Dec/31/llms-in-2024/\">review of LLMs in 2024</a>, extended by several months to cover everything that's happened in 2025 so far. The second was a workshop on <a href=\"https://simonwillison.net/2025/Mar/8/cutting-edge-web-scraping/\">Cutting-edge web scraping techniques</a>, which I've written up separately.</p> <p>Here are the slides and detailed notes from my review of what's new in LLMs, with a focus on trends that are relative to data journalism.</p> <div class=\"slide\" id=\"llms.001.jpeg\"> <img alt=\"What's new in the world of LLMs Simon Willison NICAR 2025, 7th March 2025\" src=\"https://static.simonwillison.net/static/2025/nicar-llms/llms.001.jpeg\" /> <a href=\"https://simonwillison.net/2025/Mar/8/nicar-llms/#llms.001.jpeg\" style=\"float: right; padding-left: 1em; border: none;\">#</a> <p>I started with a review of the story so far, beginning on November 30th 2022 with the release of ChatGPT.</p> </div> <div class=\"slide\" id=\"llms.002.jpeg\"> <img alt=\"November 30th, 2022 \" src=\"https://static.simonwillison.net/static/2025/nicar-llms/llms.002.jpeg\" /> <a href=\"https://simonwillison.net/2025/Mar/8/nicar-llms/#llms.002.jpeg\" style=\"float: right; padding-left: 1em; border: none;\">#</a> <p>This wasn't a big technological leap ahead of GPT-3, which we had access to for a couple of years already... but it turned out wrapping a chat interface around it was <em>the</em> improvement that made it accessible to a general audience. The result was something that's been claimed as the",
            "title": "What's new in the world of LLMs, for NICAR 2025"
        },
        {
            "content": [
                "<p>Three GLP-1 drugs are approved for weight loss in the United States: </p><ul><li><p><strong>Semaglutide</strong> (Ozempic&#174;, Wegovy&#174;, Rybelsus&#174;)</p></li><li><p><strong>Tirzepatide</strong> (Mounjaro&#174;, Zepbound&#174;)</p></li><li><p><strong>Liraglutide</strong> (Victoza&#174;, Saxenda&#174;)</p></li></ul><p>&#8230;but liraglutide is noticeably worse than the others, and most people prefer either semaglutide or tirzepatide. These cost about $1000/month and are rarely covered by insurance, putting them out of reach for most Americans.</p><p>&#8230;<em>if</em> you buy them from the pharma companies, like a chump. For the past three years, there&#8217;s been a shortage of these drugs. FDA regulations say that during a shortage, it&#8217;s <a href=\"https://www.astralcodexten.com/p/the-ozempocalypse-is-nigh/comment/99825965\">semi-legal</a> for compounding pharmacies to provide medications without getting the patent-holders&#8217; permission. In practice, that means they get cheap peptides from China, do some minimal safety testing in house, and sell them online.</p><p>So for the past three years, telehealth startups working with compounding pharmacies have sold these drugs for about $200/month. Over <a href=\"https://www.onthepen.com/post/report-staggering-number-of-compound-semaglutide-rx-in-the-us-per-the-ofa\">two million</a> Americans have made use of this loophole to get weight loss drugs for cheap. But there was always a looming question - what happens when the shortage ends? Many people have to stay on GLP-1 drugs permanently, or else they risk regaining their lost weight. But many can&#8217;t afford $1000/month. What happens to them?</p><p>Now we&#8217;ll find out. At the end of last year, the FDA declared the shortage over. The compounding pharmacies appealed the decision, but the FDA recently <a href=\"https://www.pharmacypracticenews.com/Online-First/Article/02-25/FDA-Declares-End-to-Semaglutide-Shortage-Clock-Ticking-on-Compounded-Versions/76337\">confirmed </a>its decision is final. As of March 19 (for tirzepatide) and April 22 (for semaglutide), compounding pharmacies can no longer sell cheap GLP-1 drugs.</p><p>Let&#8217;s take a second to think of the real victims here: telehealth company stockholders.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa3d72e48-2e7b-4380-b461-349e799f03f6_616x471.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"471\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa3d72e48-2e7b-4380-b461-349e799f03f6_616x471.png\" width=\"616\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Some compounding pharmacies are already telling their customers to look elsewhere, but not everyone is going gently into the good night. I&#8217;m seeing telehealth companies float absolutely amazing medicolegal theories, like:</p><ul><li><p>Compounding pharmacies are allowed to provide patients with a drug if they can&#8217;t tolerate the commercially available doses and need a special compounding dose. Perhaps our patients who were previously on semaglutide 0.5 mg now need, uh, semaglutide 0.51 mg. In fact, they need <em>exactly</em> 0.51 mg or they&#8217;ll die! Since the pharma companies don&#8217;t make 0.51 mg doses, it has to be compounded and we can still sell it.</p></li><li><p>Compounding pharmacies are allowed to provide patients with special mixes of drugs if they need to take two drugs at the exact same time. Perhaps our patients who were previously on semaglutide 0.5 mg now need, uh, a mix of semaglutide and <a href=\"https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F7ib4ow4qhyne1.jpeg\">random vitamins</a>. They need to have the random vitamins mixed in or they&#8217;ll die. Since the pharma companies don&#8217;t make semaglutide mixed with the exact random vitamins we do, it has to be compounded and we can still sell it.</p></li><li><p>Compounding pharmacies are allowed to provide patients with drugs formulated for unusual routes of administration. All of our patients just developed severe needle phobia, sorry, so they need semaglutide gummies. Since the pharma companies don&#8217;t make semaglutide gummies, it has to be compounded and we can still sell it (thanks to <a href=\"https://recursiveadaptation.com/p/semaglutide-compounding-is-being\">Recursive Adaptation</a> for their <a href=\"https://recursiveadaptation.com/p/semaglutide-compounding-is-being\">article</a> on this strategy).</p></li></ul><p>I am not a lawyer but this is all stupid. What are the companies thinking? </p><p>They might be hoping they can offload the stupid parts to doctors. Everyone else in healthcare is supposed to do what doctors tell them, especially if the doctors use the magic words &#8220;medically necessary&#8221;. So pharmacies and telehealth startups (big companies, easy to regulate) can tell doctors (random individuals, hard to regulate) &#8220;wink wink hint hint, maybe your patient might need exactly 0.51 mg of semaglutide, nod nod wink wink&#8221;. The doctor can write a prescription for exactly 0.51 mg semaglutide, add a note saying the unusual dose is &#8216;medically necessary&#8217;, and then everyone else can provide it with a &#8220;clean&#8221; &#8220;conscience&#8221;. If the pharma company sues the pharmacy or telehealth startup, they&#8217;ll say &#8220;we were only connecting patients to doctors and following their orders!&#8221; If the pharma company sues the <em>doctors</em>, the pharma company will probably win, but maybe telehealth companies can find risk-tolerant doctors faster than the pharma company can sue them.</p><p>The pharma company can probably still sue telehealth startups and pharmacies over the exact number of nods and winks that they do. But maybe they won&#8217;t want to take the PR hit if those pharmacies limit themselves to continuing to serve existing patients. Or maybe there are too many pharmacies to go after all of them. Or maybe DOGE will fire everyone at the FDA and the problem will solve itself. I don&#8217;t know - I don&#8217;t really expect any of this to work, but from a shareholder value perspective it beats lying down and dying.</p><p>But the compounders aren&#8217;t the only ones boxing clever. Novo Nordisk and Eli Lilly, the pharma companies behind semaglutide and tirzepatide respectively, have opened consumer-facing businesses about halfway between a traditional doctor&#8217;s appointment and the telehealth/compounder model that&#8217;s getting banned. So for example, <a href=\"https://lillydirect.lilly.com/obesity\">Lilly Direct </a>offers to &#8220;find you a doctor&#8221; (I think this means you do telehealth with an Eli Lilly stooge who always gives you the meds you want) and &#8220;get medications delivered directly to you&#8221;. The price depends on dose, but an average dose would be about $500 - so about halfway between the cheap compounding price and the usual insurance price. Not bad.</p><p>Pharma companies don&#8217;t like dose-based pricing (that is, charging twice as much for a 10 mg dose as a 5 mg dose). Part of their objection is ethical - some people have unusual genes that make them need higher doses, and it seems unfair to charge these people twice as much for genetic bad luck. But there&#8217;s also an economic objection - they want to charge the maximum amount the customer can bear, but if they charge a subset of people with genetic bad luck twice as much as they can bear, those people won&#8217;t buy their drug. So usually they sell all doses at a similar price, opening an arbitrage opportunity: if they sell both 5 mg and 10 mg for $500/month, and you need 5 mg, then buy the 10 mg dose, take half of it at a time, stretch out your monthlong supply for two months, and get an effective cost of $250/month. But here Eli Lilly is doing something devious I&#8217;ve never seen before. They&#8217;re selling their medication in single-dose vials, <em>deliberately without preservatives</em>, so that you need to take the whole dose immediately as soon as you open the vial - the arbitrage won&#8217;t work! So although this looks on paper like a $300 price increase ($200 to $500), the increase will be even higher for people who were previously exploiting the dose arbitrage.</p><p>The mood on <a href=\"https://www.reddit.com/r/tirzepatidecompound/\">the GLP-1 user subreddits</a> is grim but defiant. </p><p>Some people are stocking up. GLP-1 drugs keep pretty well in a fridge for at least a year. If you sign up for four GLP-1 telehealth compounding companies simultaneously and order three months from each, then you can get twelve months of medication. Maybe in twelve months the FDA will change their mind, or the pharmacies&#8217; insane legal strategies will pay off, or Trump will invade Denmark over Greenland and seize the Novo Nordisk patents as spoils of war, or someone will finally figure out a diet that works.</p><p><a href=\"https://www.reddit.com/r/tirzepatidehelp/\">Others</a> are <a href=\"https://www.everydayhealth.com/weight/desperate-for-ozempic-and-mounjaro-some-people-are-turning-to-diy-versions/\">turning amateur chemist</a>. You can order GLP-1 peptides from China for cheap. Once you have the peptide, all you have to do is put it in the right amount of bacteriostatic water. In theory this is no harder than any other mix-powder-with-water task. But this time if you do anything wrong, or are insufficiently clean, you can give yourself a horrible infection, or inactivate the drug, or accidentally take 100x too much of the drug and end up with negative weight and float up into the sky and be lost forever. ACX cannot in good conscience recommend this cheap, common, and awesome solution. </p><p>But overall, I think the past two years have been a fun experiment in semi-free-market medicine. I don&#8217;t mean the patent violations - it&#8217;s no surprise that you can sell drugs cheap if you violate the patent - I mean everything else. For the past three years, ~2 million people have taken complex peptides provided direct-to-consumer by a less-regulated supply chain, with barely a fig leaf of medical oversight, and it went <em>great</em>. There were no more side effects than any other medication. People who wanted to lose weight lost weight. And patients had a more convenient time than if they&#8217;d had to wait for the official supply chain to meet demand, get a real doctor, spend thousands of dollars on doctors&#8217; visits, apply for insurance coverage, and go to a pharmacy every few weeks to pick up their next prescription. Now pharma companies have noticed and are working on patent-compliant versions of the same idea. Hopefully there will be more creative business models like this one in the future.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/the-ozempocalypse-is-nigh",
            "publishedAt": "2025-03-12",
            "source": "SlateStarCodex",
            "summary": "<p>Three GLP-1 drugs are approved for weight loss in the United States: </p><ul><li><p><strong>Semaglutide</strong> (Ozempic&#174;, Wegovy&#174;, Rybelsus&#174;)</p></li><li><p><strong>Tirzepatide</strong> (Mounjaro&#174;, Zepbound&#174;)</p></li><li><p><strong>Liraglutide</strong> (Victoza&#174;, Saxenda&#174;)</p></li></ul><p>&#8230;but liraglutide is noticeably worse than the others, and most people prefer either semaglutide or tirzepatide. These cost about $1000/month and are rarely covered by insurance, putting them out of reach for most Americans.</p><p>&#8230;<em>if</em> you buy them from the pharma companies, like a chump. For the past three years, there&#8217;s been a shortage of these drugs. FDA regulations say that during a shortage, it&#8217;s <a href=\"https://www.astralcodexten.com/p/the-ozempocalypse-is-nigh/comment/99825965\">semi-legal</a> for compounding pharmacies to provide medications without getting the patent-holders&#8217; permission. In practice, that means they get cheap peptides from China, do some minimal safety testing in house, and sell them online.</p><p>So for the past three years, telehealth startups working with compounding pharmacies have sold these drugs for about $200/month. Over <a href=\"https://www.onthepen.com/post/report-staggering-number-of-compound-semaglutide-rx-in-the-us-per-the-ofa\">two million</a> Americans have made use of this loophole to get weight loss drugs for cheap. But there was always a looming question - what happens when the shortage ends? Many people have to stay on GLP-1 drugs permanently, or else they risk regaining their lost weight. But many can&#8217;t afford $1000/month. What happens to them?</p><p>Now we&#8217;ll find out. At the end of",
            "title": "The Ozempocalypse Is Nigh"
        }
    ],
    "lookbackDays": 7,
    "publishDate": "2025-03-12"
}