{
    "articles": [
        {
            "content": [],
            "link": "https://interconnected.org/home/2025/10/15/3dp",
            "publishedAt": "2025-10-15",
            "source": "Matt Webb",
            "summary": "<div> <p>I belatedly joined the 3D printer club and got myself a brand new Bambu P1S. (Days before the next-gen P2S was released it turns out, but I got the P1S on sale so I don’t feel so bad.)</p> <p>I have wooden floors.</p> <p>So I’ve been printing printer foot adaptors to make the optional rubber anti-vibration feet (which I also bought) more effective.</p> <p><a href=\"https://makerworld.com/en/models/32227-bambu-lab-x1c-p1x-anti-vibration-feet-adapter\">Here’s the 3D model for the adaptors</a>. You open it in the app, select your printer and filament, and it prints directly.</p> <p><a href=\"https://www.instagram.com/genmon/p/DPzKIe1DbLz/\">Here are the adaptors printing on my insta</a>.</p> <p>I am very very into this as a concept: using the printer to print parts of itself. It is a glimpse of the old vision of 3D printers as bootstrapping machines. The old vision and maybe the future too.</p> <p>(<a href=\"https://en.wikipedia.org/wiki/Bootstrapping\">Bootstrapping</a> (Wikipedia) in the self-starting sense, i.e. <em>\"analogous to one who would lift himself by his own bootstraps,\"</em> which is where booting/rebooting/etc for computers comes from.)</p> <p>For instance <a href=\"https://reprap.org/wiki/RepRap\">RepRap</a>:</p> <blockquote> <p>a free desktop 3D printer capable of printing plastic objects. Since many parts of RepRap are made from plastic and RepRap prints those parts, <u>RepRap self-replicates by making a kit of itself</u> - a",
            "title": "I love the smell of autopoiesis in the morning"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/10/15/style/tiny-modern-love-stories-i-mightve-cast-a-love-spell.html",
            "publishedAt": "2025-10-15",
            "source": "Modern Love - NYT",
            "summary": "Modern Love in miniature, featuring reader-submitted stories of no more than 100 words.",
            "title": "Tiny Love Stories: ‘I Might’ve Cast a Love Spell’"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/10/15/podcasts/malala-yousafzai-modern-love.html",
            "publishedAt": "2025-10-15",
            "source": "Modern Love - NYT",
            "summary": "The global activist gets candid in her new memoir. She spoke with us about struggling with panic attacks, finding her personal style and changing her mind about what marriage could be.",
            "title": "Malala Yousafzai Thought She’d Never Fall in Love"
        },
        {
            "content": [
                "<img src=\"https://tonsky.me/blog/syntax-highlighting/cover.webp\" /><p>Syntax highlighting is a tool. It can help you read code faster. Find things quicker. Orient yourself in a large file.</p>\n<p>Like any tool, it can be used correctly or incorrectly. Let’s see how to use syntax highlighting to help you work.</p>\n<h1 id=\"christmas-lights-diarrhea\">Christmas Lights Diarrhea</h1>\n<p>Most color themes have a unique bright color for literally everything: one for variables, another for language keywords, constants, punctuation, functions, classes, calls, comments, etc.</p>\n<p>Sometimes it gets so bad one can’t see the base text color: everything is highlighted. What’s the base text color here?</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/diarrhea.webp\" /></figure>\n<p>The problem with that is, if everything is highlighted, nothing stands out. Your eye adapts and considers it a new norm: everything is bright and shiny, and instead of getting separated, it all blends together.</p>\n<p>Here’s a quick test. Try to find the function definition here:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/definitions_bad.webp\" /></figure>\n<p>and here:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/definitions_good.webp\" /></figure>\n<p>See what I mean?</p>\n<p>So yeah, unfortunately, you can’t just highlight everything. You have to make decisions: what is more important, what is less. What should stand out, what shouldn’t.</p>\n<p>Highlighting everything is like assigning “top priority” to every task in Linear. It only works if most of the tasks have lesser priorities.</p>\n<p class=\"loud\">If everything is highlighted, nothing is highlighted.</p>\n<h1 id=\"enough-colors-to-remember\">Enough colors to remember</h1>\n<p>There are two main use-cases you want your color theme to address:</p>\n<ol start=\"1\">\n  <li>Look at something and tell what it is by its color (you can tell by reading text, yes, but why do you need syntax highlighting then?)</li>\n  <li>Search for something. You want to know what to look for (which color).</li>\n</ol>\n<p>1 is a direct index lookup: color → type of thing.</p>\n<p>2 is a reverse lookup: type of thing → color.</p>\n<p>Truth is, most people don’t do these lookups at all. They might think they do, but in reality, they don’t.</p>\n<p>Let me illustrate. Before:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/change_before.webp\" /></figure>\n<p>After:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/change_after.webp\" /></figure>\n<p>Can you see it? I misspelled <code>return</code> for <code>retunr</code> and its color switched from red to purple.</p>\n<p>I can’t.</p>\n<p>Here’s another test. Close your eyes (not yet! Finish this sentence first) and try to remember what color your color theme uses for class names?</p>\n<p>Can you?</p>\n<p>If the answer for both questions is “no”, then your color theme is <em>not functional</em>. It might give you comfort (as in—I feel safe. If it’s highlighted, it’s probably code) but you can’t use it as a tool. It doesn’t <em>help</em> you.</p>\n<p>What’s the solution? Have an absolute minimum of colors. So little that they all fit in your head at once. For example, my color theme, Alabaster, only uses four:</p>\n<ul>\n  <li>Green for strings</li>\n  <li>Purple for constants</li>\n  <li>Yellow for comments</li>\n  <li>Light blue for top-level definitions</li>\n</ul>\n<p>That’s it! And I was able to type it all from memory, too. This minimalism allows me to actually do lookups: if I’m looking for a string, I know it will be green. If I’m looking at something yellow, I know it’s a comment.</p>\n<p class=\"loud\">Limit the number of different colors to what you can remember.</p>\n<p>If you swap green and purple in my editor, it’ll be a catastrophe. If somebody swapped colors in yours, would you even notice?</p>\n<h1 id=\"what-should-you-highlight\">What should you highlight?</h1>\n<p>Something there isn’t a lot of. Remember—we want highlights to stand out. That’s why I don’t highlight variables or function calls—they are everywhere, your code is probably 75% variable names and function calls.</p>\n<p>I do highlight constants (numbers, strings). These are usually used more sparingly and often are reference points—a lot of logic paths start from constants.</p>\n<p>Top-level definitions are another good idea. They give you an idea of a structure quickly.</p>\n<p>Punctuation: it helps to separate names from syntax a little bit, and you care about names first, especially when quickly scanning code.</p>\n<p>Please, please don’t highlight language keywords. <code>class</code>, <code>function</code>, <code>if</code>, <code>else</code>stuff like this. You rarely look for them: “where’s that if” is a valid question, but you will be looking not at the <code>if</code> the keyword, but at the condition after it. The condition is the important, distinguishing part. The keyword is not.</p>\n<p class=\"loud\">Highlight names and constants. Grey out punctuation. Don’t highlight language keywords.</p>\n<h1 id=\"comments-are-important\">Comments are important</h1>\n<p>The tradition of using grey for comments comes from the times when people were paid by line. If you have something like</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/javadoc.webp\" /></figure>\n<p>of course you would want to grey it out! This is bullshit text that doesn’t add anything and was written to be ignored.</p>\n<p>But for good comments, the situation is opposite. Good comments ADD to the code. They explain something that couldn’t be expressed directly. They are <em>important</em>.</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/yellow_comments.webp\" /></figure>\n<p>So here’s another controversial idea:</p>\n<p class=\"loud\">Comments should be highlighted, not hidden away.</p>\n<p>Use bold colors, draw attention to them. Don’t shy away. If somebody took the time to tell you something, then you want to read it.</p>\n<h1 id=\"two-types-of-comments\">Two types of comments</h1>\n<p>Another secret nobody is talking about is that there are two types of comments:</p>\n<ol start=\"1\">\n  <li>Explanations</li>\n  <li>Disabled code</li>\n</ol>\n<p>Most languages don’t distinguish between those, so there’s not much you can do syntax-wise. Sometimes there’s a convention (e.g. <code>--</code> vs <code>/* */</code> in SQL), then use it!</p>\n<p>Here’s a real example from Clojure codebase that makes perfect use of two types of comments:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/two_types_of_comments.webp\" /><figcaption>Disabled code is gray, explanation is bright yellow</figcaption></figure>\n<h1 id=\"light-or-dark\">Light or dark?</h1>\n<p>Per statistics, 70% of developers prefer dark themes. Being in the other 30%, that question always puzzled me. Why?</p>\n<p>And I think I have an answer. Here’s a typical dark theme:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/vscode_default_dark@2x.webp\" /></figure>\n<p>and here’s a light one:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/vscode_default_light@2x.webp\" /></figure>\n<p>On the latter one, colors are way less vibrant. Here, I picked them out for you:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/vscode_colors@2x.png\" /><figcaption>Notice how many colors there are. No one can remember that many.</figcaption></figure>\n<p>This is because dark colors are in general less distinguishable and more muddy. Look at Hue scale as we move brightness down:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/brightness_hue@2x.webp\" /></figure>\n<p>Basically, in the dark part of the spectrum, you just get fewer colors to play with. There’s no “dark yellow” or good-looking “dark teal”.</p>\n<p>Nothing can be done here. There are no magic colors hiding somewhere that have both good contrast on a white background and look good at the same time. By choosing a light theme, you are dooming yourself to a very limited, bad-looking, barely distinguishable set of dark colors.</p>\n<p>So it makes sense. Dark themes do look better. Or rather: light ones can’t look good. Science ¯\\_(ツ)_/¯</p>\n<p>But!</p>\n<p>But.</p>\n<p>There is one trick you can do, that I don’t see a lot of. Use background colors! Compare:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/bg_highlight@2x.png\" /></figure>\n<p>The first one has nice colors, but the contrast is too low: letters become hard to read.</p>\n<p>The second one has good contrast, but you can barely see colors.</p>\n<p>The last one has <em>both</em>: high contrast and clean, vibrant colors. Lighter colors are readable even on a white background since they fill a lot more area. Text is the same brightness as in the second example, yet it gives the impression of clearer color. It’s all upside, really.</p>\n<p>UI designers know about this trick for a while, but I rarely see it applied in code editors:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/badge.png\" /></figure>\n<p>If your editor supports choosing background color, give it a try. It might open light themes for you.</p>\n<h1 id=\"bold-and-italics\">Bold and italics</h1>\n<p>Don’t use. This goes into the same category as too many colors. It’s just another way to highlight something, and you don’t need too many, because you can’t highlight everything.</p>\n<p>In theory, you might try to <em>replace</em> colors with typography. Would that work? I don’t know. I haven’t seen any examples.</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/typography.png\" /><figcaption>Using italics and bold instead of colors</figcaption></figure>\n<h1 id=\"myth-of-number-based-perfection\">Myth of number-based perfection</h1>\n<p>Some themes pay too much attention to be scientifically uniform. Like, all colors have the same exact lightness, and hues are distributed evenly on a circle.</p>\n<p>This could be nice (to know if you have OCR), but in practice, it doesn’t work as well as it sounds:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/balanced.png\" /><figcaption>OkLab l=0.7473 c=0.1253 h=0, 45, 90, 135, 180, 225, 270, 315</figcaption></figure>\n<p>The idea of highlighting is to make things stand out. If you make all colors the same lightness and chroma, they will look very similar to each other, and it’ll be hard to tell them apart.</p>\n<p>Our eyes are way more sensitive to differences in lightness than in color, and we should use it, not try to negate it.</p>\n<h1 id=\"lets-design-a-color-theme-together\">Let’s design a color theme together</h1>\n<p>Let’s apply these principles step by step and see where it leads us. We start with the theme from the start of this post:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi00.png\" /></figure>\n<p>First, let’s remove highlighting from language keywords and re-introduce base text color:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi10.png\" /></figure>\n<p>Next, we remove color from variable usage:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi20.png\" /></figure>\n<p>and from function/method invocation:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi30.png\" /></figure>\n<p>The thinking is that your code is mostly references to variables and method invocation. If we highlight those, we’ll have to highlight more than 75% of your code.</p>\n<p>Notice that we’ve kept variable declarations. These are not as ubiquitous and help you quickly answer a common question: where does thing thing come from?</p>\n<p>Next, let’s tone down punctuation:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi40.png\" /></figure>\n<p>I prefer to dim it a little bit because it helps names stand out more. Names alone can give you the general idea of what’s going on, and the exact configuration of brackets is rarely equally important.</p>\n<p>But you might roll with base color punctuation, too:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi40_alt.png\" /></figure>\n<p>Okay, getting close. Let’s highlight comments:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi50.png\" /></figure>\n<p>We don’t use red here because you usually need it for squiggly lines and errors.</p>\n<p>This is still one color too many, so I unify numbers and strings to both use green:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi60.png\" /></figure>\n<p>Finally, let’s rotate colors a bit. We want to respect nesting logic, so function declarations should be brighter (yellow) than variable declarations (blue).</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi70.png\" /></figure>\n<p>Compare with what we started:</p>\n<figure>\n<img src=\"https://tonsky.me/blog/syntax-highlighting/dyi00.png\" /></figure>\n<p>In my opinion, we got a much more workable color theme: it’s easier on the eyes and helps you find stuff faster.</p>\n<h1 id=\"shameless-plug-time\">Shameless plug time</h1>\n<p>I’ve been applying these principles for <a href=\"https://github.com/tonsky/vscode-theme-alabaster/commit/5c840f5fb57e5cd0dce93ac8c450495bdb0a2658\">about 8 years now</a>.</p>\n<p>I call this theme Alabaster and I’ve built it a couple of times for the editors I used:</p>\n<ul>\n  <li><a href=\"https://github.com/tonsky/vscode-theme-alabaster\">VS Code</a></li>\n  <li><a href=\"https://github.com/tonsky/intellij-alabaster\">JetBrains IDEs</a></li>\n  <li><a href=\"https://github.com/tonsky/sublime-scheme-alabaster\">Sublime Text</a> (<a href=\"https://github.com/tonsky/clojure-sublimed/?tab=readme-ov-file#color-scheme\">twice</a>)</li>\n</ul>\n<p>It’s also been ported to many other editors and terminals; the most complete list is <a href=\"https://github.com/tonsky/sublime-scheme-alabaster?tab=readme-ov-file#variations-1\">probably here</a>. If your editor is not on the list, try searching for it by name—it might be built-in already! I always wondered where these color themes come from, and now I became an author of one (and I still don’t know).</p>\n<p>Feel free to use Alabaster as is or build your own theme using the principles outlined in the article—either is fine by me.</p>\n<p>As for the principles themselves, they worked out fantastically for me. I’ve never wanted to go back, and just one look at any “traditional” color theme gives me a scare now.</p>\n<p>I <em>suspect</em> that the only reason we don’t see more restrained color themes is that people never really thought about it. Well, this is your wake-up call. I hope this will inspire people to use color more deliberately and to change the default way we build and use color themes.</p>"
            ],
            "link": "https://tonsky.me/blog/syntax-highlighting/",
            "publishedAt": "2025-10-15",
            "source": "Nikita Prokopov",
            "summary": "<img src=\"https://tonsky.me/blog/syntax-highlighting/cover.webp\" /><p>Syntax highlighting is a tool. It can help you read code faster. Find things quicker. Orient yourself in a large file.</p> <p>Like any tool, it can be used correctly or incorrectly. Let’s see how to use syntax highlighting to help you work.</p> <h1 id=\"christmas-lights-diarrhea\">Christmas Lights Diarrhea</h1> <p>Most color themes have a unique bright color for literally everything: one for variables, another for language keywords, constants, punctuation, functions, classes, calls, comments, etc.</p> <p>Sometimes it gets so bad one can’t see the base text color: everything is highlighted. What’s the base text color here?</p> <figure> <img src=\"https://tonsky.me/blog/syntax-highlighting/diarrhea.webp\" /></figure> <p>The problem with that is, if everything is highlighted, nothing stands out. Your eye adapts and considers it a new norm: everything is bright and shiny, and instead of getting separated, it all blends together.</p> <p>Here’s a quick test. Try to find the function definition here:</p> <figure> <img src=\"https://tonsky.me/blog/syntax-highlighting/definitions_bad.webp\" /></figure> <p>and here:</p> <figure> <img src=\"https://tonsky.me/blog/syntax-highlighting/definitions_good.webp\" /></figure> <p>See what I mean?</p> <p>So yeah, unfortunately, you can’t just highlight everything. You have to make decisions: what is more important, what is less. What should stand out, what shouldn’t.</p> <p>Highlighting everything is like assigning “top priority” to every task in Linear. It only works if",
            "title": "I am sorry, but everyone is getting syntax highlighting wrong"
        },
        {
            "content": [
                "<p>It is increasingly often strange compiling the monthly roundup, because life comes at us fast. I look at various things I’ve written, and it feels like they are from a different time. Remember that whole debate over free speech? Yeah, that was a few weeks ago. Many such cases. Gives one a chance to reflect.</p>\n<p>In any case, here we go.</p>\n\n\n<h4 class=\"wp-block-heading\">Table of Contents</h4>\n\n\n<ol>\n<li><a href=\"https://thezvi.substack.com/i/176091622/don-t-provide-bad-training-data\">Don’t Provide Bad Training Data.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/maybe-don-t-say-maybe\">Maybe Don’t Say Maybe.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/throwing-good-parties-means-throwing-parties\">Throwing Good Parties Means Throwing Parties.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/air-travel-gets-worse\">Air Travel Gets Worse.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/bad-news\">Bad News.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/you-do-not-need-to-constantly-acknowledge-that-there-is-bad-news\">You Do Not Need To Constantly Acknowledge That There Is Bad News.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/prediction-market-madness\">Prediction Market Madness.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/no-reply-necessary\">No Reply Necessary.</a>\n<div> </div>\n</li>\n</ol>\n\n\n<span id=\"more-24791\"></span>\n\n\n</div>\n</li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/while-i-cannot-condone-this\">While I Cannot Condone This.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/antisocial-media\">Antisocial Media.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/government-working\">Government Working.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/tylenol-does-not-cause-autism\">Tylenol Does Not Cause Autism.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/jones-act-watch\">Jones Act Watch.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/for-science\">For Science!.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/work-smart-and-hard\">Work Smart And Hard.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/so-emotional\">So Emotional.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/where-credit-is-due\">Where Credit Is Due.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/good-news-everyone\">Good News, Everyone.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/i-love-new-york\">I Love New York.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/for-your-entertainment\">For Your Entertainment.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/gamers-gonna-game-game-game-game-game\">Gamers Gonna Game Game Game Game Game.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/i-was-promised-flying-self-driving-cars\">I Was Promised Flying Self-Driving Cars.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/sports-go-sports\">Sports Go Sports.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/176091622/opportunity-knocks\">Opportunity Knocks.</a></li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Don’t Provide Bad Training Data</h4>\n\n\n<p>People should be free to squander their money, but when other people make bad choices, this tends to not go well for you either, even when talking about consumer choices, let alone things like ‘building superintelligence thus causing everyone to die.’</p>\n<blockquote>\n<p><a href=\"https://x.com/ESYudkowsky/status/1968608314230538362\">Bryan Caplan</a>: If everyone but you squanders their money, everyone but you suffers.</p>\n<p>If everyone but you votes for terrible policies, everyone including you suffers.</p>\n<p><a href=\"https://x.com/ESYudkowsky/status/1968608314230538362\">Eliezer Yudkowsky</a>: Idiots with buying power have negative externalities, not just idiots with voting power. It means going on Amazon and seeing crap. It’s an easier problem to attack but not at all trivial.</p>\n<p>Eg broken Amazon reviews won’t let you find one non-crappy product even if it exists.</p>\n<p>Or to put it in another way: we live in an economy, not just a legal system. I too feel like there could and should be a libertarian solution rather than a tyrannical one, but I’m not in denial about the problem.</p>\n</blockquote>\n<p>There are also times when you don’t want to compete for the good stuff. Or when this makes it easy for you to save money or turn a profit, and it goes well for you.</p>\n<p>Most of the time, no, you want everyone to choose wisely. When others have good taste, and choose quality products, the market produces quality products. If not, not. When they rate things properly, you can find the good stuff. When we collectively make choices that enrich everyone, that too is good for everyone, and so on. It’s #NotOnlyPolicy.</p>\n<p>Again, no, you shouldn’t coerce these choices, but you mostly don’t want to live in a world where everyone else is squandering their money in dumb ways.</p>\n\n\n<h4 class=\"wp-block-heading\">Maybe Don’t Say Maybe</h4>\n\n\n<p><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0022103125000952\">Hosts don’t like it when you reply ‘maybe,’ they’d feel more respected if you said ‘no</a>’ when invited to an event. Certainly by saying ‘maybe’ you are making life easier for you and harder for the host. Invitees told themselves the ‘maybe’ indicated interest, which it does, but it’s mainly annoying since you have to plan for both outcomes.</p>\n<p>Thus, you should only reply ‘maybe’ if you get high value from the option, or you attending provides a lot of value to the host and you’re genuinely unsure. Assume that by doing so you are imposing a cost.</p>\n\n\n<h4 class=\"wp-block-heading\">Throwing Good Parties Means Throwing Parties</h4>\n\n\n<p><a href=\"https://www.atvbt.com/21-facts-about-throwing-good-parties/\">Uri gives us 21 Facts About Throwing Good Parties (via MR</a>). Mostly seems like great advice starting with the ‘announce at a quarter-hour so people will only be 15 minutes late,’ especially if you are trying to optimize the party as a public service.</p>\n<p>My biggest new takeaway is I was under considering the ‘know who else is going’ value of using apps like Partiful or Luma. I strongly endorse that if you want to leave a group at a party, you straight up walk away, don’t say anything (and if a group is bigger than ~5, strongly consider leaving it).</p>\n<p>One thing I challenge is that he thinks if you are gender imbalanced, the sparse gender will stop attending. It’s definitely true that women become apprehensive if too outnumbered, but running the other way is probably symptomatic of party design that didn’t appeal to men in the first place. Men are not, in general, less likely to show up to a party when there’s going to be more women.</p>\n<p>My biggest old takeaway, the first one on the list this time, that throwing a part at all is good, is you are not throwing enough parties, and you should not let the perfect be the enemy of the good. The MVP (minimum viable party) is inviting friends over, providing some food, and chilling. That’s a remarkably valuable public service. If obsessing over details would top you from throwing or enjoying it, skip those details.</p>\n<p><a href=\"https://thezvi.substack.com/p/monthly-roundup-26-january-2025\">One can compare this to</a> <a href=\"https://auren.substack.com/p/the-ultimate-guide-to-holding-world?utm_source=post-email-title&amp;publication_id=65520&amp;post_id=151795978&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3o9&amp;triedRedirect=true&amp;utm_medium=email\">Auren Hoffman’s advice</a> for dinner parties, which I discussed in the January 2025 roundup, where again a central theme is not letting perfect be the enemy of the good. I stand by my disagreement there that it is important in a dinner party that the food be good. It is less important for other party formats, but also in a pinch not so difficult to make the food good because delivery services exist.</p>\n<p>Also one can reiterate <a href=\"https://thezvi.substack.com/p/monthly-roundup-19-june-2024#:~:text=Curation%20of%20people%20is%20key.%20You%20only%20need%2014%20square%20feet%20of%20active%20party%20space%20per%20person.%20Create%20talking%20spaces%20where%20people%20face%20each%20other\">this thread from Kasay and my commentary on it</a> from June 2024, especially that you only need 14 square feet per person, and that ultimately the most important decision is who to invite, with another key factor being engineering a space to create alcoves of conversation.</p>\n\n\n<h4 class=\"wp-block-heading\">Air Travel Gets Worse</h4>\n\n\n<p><a href=\"https://x.com/SilvermanJacob/status/1967382332022858056\">Airplanes seem</a> <a href=\"https://x.com/ESYudkowsky/status/1967384442491769282\">to have</a> a growing systemic problem with <a href=\"https://www.wsj.com/business/airlines/air-travel-toxic-fumes-64839d6e?mod=Searchresults&amp;pos=2&amp;page=1\">exposing passengers to fumes in a way that is importantly bad for their health</a>, which they have handled badly and covered up in similar fashion to other industries with similar health issues.</p>\n<blockquote>\n<p>Eliezer Yudkowsky: If it’s true, aircraft manufacturers and airlines are engaging in a classic denial-coverup in the style of cigarette companies, leaded gasoline makers, or AI builders. (At smaller scale.)</p>\n<p>Patrick Collison: I’ve been tracking it for a few years (outside of MSM); I’m pretty sure it’s true in a way that does not reflect well on the sector.</p>\n</blockquote>\n<p>My quick math says that this is not common enough you should worry much about it as a passenger, and that air travel remains far safer than other forms of travel even in the worst case. Claude did a worst-case scenario estimate based on the claims and came up with a cost per flight of 0.00003 QALY, which is still at least one order of magnitude lower than any alternative form of transportation.</p>\n<p>But this is worth noticing.</p>\n\n\n<h4 class=\"wp-block-heading\">Bad News</h4>\n\n\n<p>The French left is being heavily influenced by a so-called ‘economist’ <a href=\"https://x.com/XFaure/status/1970803488511914149\">advocating for ultimately instituting an 8% annual wealth tax</a>, also known as full confiscatory taxation of all wealth subject to such a tax, which can then serve as a warning to the next ten generations. Nine of which will presumably forget, but that’s the way it goes.</p>\n<p>Halloween, a holiday so not deep that you don’t even get the day off of work or school, is out of control, complete with not only sales and banners but people who put intentional nightmare fuel (as in, items intentionally created to be scary especially to kids) <a href=\"https://x.com/webdevMason/status/1971670176501473711\">on display for over a month</a>.</p>\n<blockquote>\n<p>Lady Nimby: Why would you want this at your doorstep for 10% of your life? Why are my kids seeing this?</p>\n<p>Mason: Yeah, I love Halloween but I think you should be able to easily opt out of nightmare fuel. This is great decor for your indoor/backyard party.</p>\n</blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!GBbF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86c53a0c-b04e-4b57-9225-8934c730892d_1015x575.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>I’m not saying we should ban you from displaying that stuff if you want to, it’s your house. I am definitely saying that you shouldn’t want to beyond a few days tops, because it is cool in the context of a party or active trick-or-treating, and totally not cool left in place for several days before or after that.</p>\n<p>Halloween is of course only a secondary offender when compared to Christmas.</p>\n<p><a href=\"https://x.com/jbarro/status/1970491265910448222\">Broadway musicals are in deep trouble</a>, since 2020 there have been 46 new musicals costing $800 million and 43 of them have lost money, including all 18 last season. One neglected explanation is that New York has de facto banned hotel construction and largely banned AirBnB, so hotel prices are way up. The good news is that would be easy to fix.</p>\n<p>An article I suspect is itself slop (but in this case, fair!) says <a href=\"https://www.afterbabel.com/p/we-are-the-slop\">We Are The Slop</a>, living our lives in order to generate entertainment slop for others. Certainly influencers do this, that is their job, but the basic math says that like rock stars there is a lot of aspiration to that job but there are not so many slots that pay real money. Most of us do indeed live our lives with the cameras off.</p>\n\n\n<h4 class=\"wp-block-heading\">You Do Not Need To Constantly Acknowledge That There Is Bad News</h4>\n\n\n<p>There is a lot of bad news in the world. There is also a lot of good news in the world.</p>\n<p>I cannot emphasize enough that the existence of bad news, and especially of political bad news, should not be a constant preface to conversation or good news.</p>\n<p>You do not need to continuously self-flagellate to show that you care about the bad news. If others do insist that you do this, that is no good, you need to push back.</p>\n<p>This applies across all causes, across the political spectrum, and it especially applies to AI and the fact that it is likely that someone is going to build superintelligence and then everyone will die. Yes, And That’s Terrible, and we should spend some of the time trying to prevent it, but at other times the show must go on. <a href=\"https://www.google.com/search?q=don%27t+worry+be+happy&amp;rlz=1C1OPNX_enUS1015US1015&amp;oq=don%27t+worry+be+h&amp;gs_lcrp=EgZjaHJvbWUqDQgAEAAY4wIYsQMYgAQyDQgAEAAY4wIYsQMYgAQyCggBEC4YsQMYgAQyCggCEAAYiwMYgAQyBggDEEUYOTIHCAQQABiABDIGCAUQRRg8MgYIBhBFGDwyBggHEEUYPNIBCDE4NjRqMWo3qAIAsAIA&amp;sourceid=chrome&amp;ie=UTF-8#fpstate=ive&amp;vld=cid:d04ddf52,vid:JKZ92za6Dbo,st:0\">Worry, but also at other times Be Happy</a>.</p>\n<blockquote>\n<p><a href=\"https://x.com/TylerAlterman/status/1977841263559979276\">Tyler Alterman</a>: “Share your happiness with the world.” Duh, right? That’s some basic b***h stuff. But recently a Buddhist nun said this to me in this sort of knowing way and it’s been changing my life</p>\n<p>I realized that I am often not only hiding my happiness but actively turning it down. I’m doing this to fit in, to connect with the zeitgeist. And today’s zeitgeist has made it borderline offensive to be happy</p>\n<p>“You’re happy? What about the war? And misaligned AI? And Tr*mp???”</p>\n<p>Being happy is uncool right now in academia, amongst liberals, amongst humanitarians, and in art circles. It’s cringe in many locales of NYC and twitter. So I noticed that when I walk smiling through the streets, I start to feel like I’m Out Of Touch</p>\n<p>This nun, however, was pointing out that if you don’t share your happiness, if you don’t let thy cup runneth over, you’re depriving other people of something that can light them up</p>\n<p>No one wants to be seen as naive, spiritually bypassing, or brushing aside the horrors of the world. But a mature form of happiness, one that acknowledges these horrors, and which shines despite them&#8230;? that strikes me as exactly the sort of thing we need right now</p>\n<p>Nick Cammarata: almost got attacked in a russian subway over this. someone was angrily like what the f are you smiling about bc you’re not supposed to smile there but i don’t speak russian so i ignored him and he freaked but it was okay</p>\n<p>he was coming up behind me and someone I was with noticed I didn’t realize and grabbed me and pointed me towards him. door happened to be open so we hopped out and took the next one a min later, whole thing was like 15s</p>\n<p><a href=\"https://x.com/ChrischipMonk/status/1977860975618674788\">Chris Lakin</a>: “I must suffer to show that I care” is a memetic virus.</p>\n<p>Jake Eaton (again, this applies to a wide variety of groups): among a fraction of my leftiest friends, there appears to be an internalized norm that you cannot celebrate life if you don’t first acknowledge political reality. i’ve seen birth announcements that begin with the state of American politics, family photos captioned with “the world sucks but here’s this,” instagram carousels that begin with “this year has been hard,” so that i need to read on to figure out whether it’s cancer or trump</p>\n<p>maybe it’s an expression of grief — fine. but my sense is that the most progressive environments demand an outward expression of despair before personal celebration, either as some sort of act of solidarity or otherwise guilt. this started in the workplace before moving into our personal lives</p>\n<p>I wish I could find ways to explain how quietly corrosive that is, both socially, but more so personally. it makes me sad not for the world but for them! but my experience — having been in those environments for years — is that you have to find your own way out</p>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">Prediction Market Madness</h4>\n\n\n<p><a href=\"https://www.overcomingbias.com/p/futarchys-minor-flaw\">Robin Hanson points out that if you are trying to do futarchy,</a> you can avoid any non-causal correlation issues by creating enough different markets based on possible random decisions and decisions at different time points. I mean, yeah, okay, technically that works, but even if you can get clean definitions for all of this, how are you going to get price discovery on all of them? This is not a realistic ask.</p>\n<p><a href=\"https://x.com/jasonfurman/status/1976608398079610900\">There was insider trading of the winner of the Nobel Peace Prize</a>. Which is good.</p>\n<blockquote>\n<p>Jason Furman: The other day a student asked me about the prevalence of insider trading in prediction markets. I now have an answer.</p>\n</blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!rSP-!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F263c31ed-a941-432c-9add-483e6ab2f91b_1200x1138.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>If I was asked to draw a graph of what insider trading on a prediction market looks like, I would draw this graph. At a time when the outcome could plausibly be known, a rapid shoot upwards of the winner, up to some upper limit that still allows substantial gains, then settling at that limit, until the jump to ~100%.</p>\n<p>The even better news is that since insider trading mostly exhibits such obvious patterns, it is easy to avoid it. Here, there are two easy principles to learn.</p>\n<ol>\n<li>Do not trade after the decision has already been made and could be known.</li>\n<li>If you must trade, do not trade against this kind of sharp move up.</li>\n<li>Definitely, absolutely do not have resting sell orders on the book this late.</li>\n</ol>\n<p>The person buying is claiming to know the outcome, that the fair price is 100. You might choose to trade against that person if you think they’re often wrong, but understand that this is what you will be doing.</p>\n<p>Should insider trading be allowed here, as it is on Polymarket? I say yes. It depends on your goal. Do you want to be able to trade at and know the non-insider price, or to know the insider price and info? You can get at most one of those two things.</p>\n<p><a href=\"https://www.bloomberg.com/news/articles/2025-10-10/unusual-bets-on-nobel-peace-prize-winner-prompt-probe-into-leaks\">Norwegian officials are predictably not amused</a> by this particular bout of insider trading, and are investigating what they call a ‘criminal actor who wants to earn money on our information.’</p>\n<blockquote>\n<p><a href=\"https://x.com/Polymarket/status/1976821993606615231\">Polymarket</a>: JUST IN: It has been revealed only 5 people at the Nobel Peace Prize foundation knew the winner before they were announced.</p>\n<p>Everyone checking Polymarket knew.</p>\n</blockquote>\n<p><a href=\"https://x.com/robinhanson/status/1976716452234186994\">A good periodic reminder of one reason people often reject prediction markets</a>:</p>\n<blockquote>\n<p>Robin Hanson: Years ago a NYC based software firm ran some prediction markets, hoping in part to find &amp; promote “diamonds in the rough” employees who predict especially well. They did find such, but then said “Oh, not them”; such folks didn’t have the polish &amp; style they wanted.</p>\n<p>Let that be a warning to those who think that being proven right will gain them more respect and inclusion.</p>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">No Reply Necessary</h4>\n\n\n<p><a href=\"https://www.lesswrong.com/posts/8jkB8ezncWD6ai86e/obligated-to-respond\">Duncan Sabien notes that comments often create an obligation to respond</a>, and suggests a new way of differentiating <a href=\"https://ask.metafilter.com/55153/Whats-the-middle-ground-between-FU-and-Welcome#830421\">ask culture versus guess culture</a>. I see what he’s trying to do to connect them and both are interesting, but I think mostly distinct.</p>\n<p>The obligation to respond is that if others see a criticism [Z] to which you don’t respond, or others mischaracterize your [X] as if you said [Y] and respond to [Y], and especially if others then argue about [Y], then you’re in trouble. In the first case, your failure to respond will imply you don’t have a good response to [Z]. In the second case, they’ll start to believe you really did say [Y].</p>\n<p>The ultimate source of this obligation to respond is, essentially, that your failure to respond would be Bayesian evidence of inability to respond, or to respond well.</p>\n<p>As in, if I get a comment [C] that says [Z], and I had a good response [R] that answers [Z], then why didn’t I respond to [Z] with [R]? A conspicuous non-answer suggests I don’t know of any such [R]. A bad answer [B] also suggests I don’t have a good [R].</p>\n<p>A non-conspicuous non-answer does not. One price of consistently engaging with critical comments or statements, in any context, is that an increasing share of non-answers become conspicuous.</p>\n<p>Indeed, one of the reasons I rarely respond to comments these days is that I do not wish to create this obligation to respond to other comments, to avoid the time sink. When I do consider a comment worth responding to, because many would want to see that, I will often do so by quoting it in a full post.</p>\n<p>The theory on guess versus ask culture is that the distinction is about how many ‘echoes’ you trace. As in, ask culture traces zero echoes, you simply ask for what you want, and they are responsible for saying no and not holding the ask against you. Whereas guess culture traces one echo, you think about how they would respond, and you can imagine sophisticated others (guess harder!) tracking many echoes.</p>\n<p>I think this is an interesting idea but I don’t think it is right. In both guess and ask culture, you are responsible for an unlimited number of potential echoes. The difference is what consequences and thus echoes an action causes.</p>\n<p>Technically speaking, I think the actual dial is either or both of these:</p>\n<ol>\n<li>Narrowly: Ask culture is created by radically raising the penalty for imposing a penalty upon someone for refusing an explicit request. As you turn up that penalty, and turn it up under a broader set of circumstances, you get Ask culture.</li>\n<li>Broadly: Guess culture is created by, in an increasing variety of circumstances, punishing fully generally the creation of common knowledge.</li>\n</ol>\n<p>In case #1, I am less penalized for saying no, which means that there is far less reason to penalize you for asking, which in turn means you should ask, and indeed because you should ask I can then put the impetus upon you to ask, and impose various penalties upon you for instead trying to have me guess, and also my guess if you don’t ask is that you probably aren’t implicitly asking either.</p>\n<p>Explanation #2 is more compete, more general, and cleaner, once you grok it.</p>\n<p>Ask culture very much does not get you out of tracking social echoes in general.</p>\n<p>The ultimate both guess and ask culture move here is the anti-ask, as in: No Reply Necessary, or saying (NRN) the way you would with an email. Duncan mentions less blunt ways to say this, but I prefer the classic version, the straight NRN, without further explanation. As in, here is some information, and it is 100% fine on all levels to simply ignore it if you do not find it useful.</p>\n\n\n<h4 class=\"wp-block-heading\">While I Cannot Condone This</h4>\n\n\n<p><a href=\"https://www.lesswrong.com/posts/WK979aX9KpfEMd9R9/how-to-dress-to-improve-your-epistemics?commentId=Kd3bo6tFuA2mf5trZ\">John Wentworth advises us how to dress to improve our epistemics</a>, the central thesis is that coolness is status countersignaling. This oversimplifies but is a helpful note.</p>\n<p><a href=\"https://x.com/ATabarrok/status/1972697900657299964\">Have you tried making any effort at all </a>to talk to people in the industry you are studying or want to know about, including any of the many many free ways to request this? It seems very often the answer for PhD students is no. So you get papers where data is analyzed in detail but there has been zero contact with anyone in the real world. In general, remarkably many people are willing to talk to you if you ask.</p>\n<p><a href=\"https://scottsumner.substack.com/p/less-wrong\">Scott Sumner points to the concept of ‘defining deviancy up</a>’ by extending words that refer to extremely wrong and bad things [X] (such as genocide, slave labor or pedophilia) to include related things [Y] that most people would agree are, at minimum, a lot less wrong or bad. If you try to respond that [Y] is less bad than [X], or that the new expansive definition covers things it shouldn’t, people respond by claiming you’re saying [X] is fine (or you’re condoning [Y]). Other times, or eventually, things loop around, and definitions are so expansive the word becomes meaningless or fine, the same way mere ‘speeding’ is now ignored so they invented ‘reckless driving.’</p>\n<p><a href=\"https://www.sciencedirect.com/science/article/pii/S0167268125002458\">People are, according to a new study, ‘much more likely</a>’ <a href=\"https://marginalrevolution.com/marginalrevolution/2025/09/does-automation-reduce-stigma.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=does-automation-reduce-stigma\">to purchase</a> ‘stigmatized’ items like condoms and pregnancy tests at self-checkout counters.</p>\n<blockquote>\n<p>Abstract: On the intensive margin, we show that stigmatized items are much more likely to be purchased at self-checkout than at cashier registers, especially condoms and pregnancy tests. We estimate that customers are willing to pay 8.5 cents in additional time cost for the privacy of purchasing stigmatized items at self-checkout.</p>\n</blockquote>\n<p>I totally buy that if there is an open self-checkout line and an open cashier, and you are buying a pregnancy test, you are going to go for self-checkout on the intensive margin. Sure.</p>\n<p>But if anything, this effect looks surprisingly tiny. Customers are only willing to pay 8.5 cents in additional time? That’s not a lot of stigma. If one values time at $20 per hour, then this is on the order of fifteen seconds. Do you have any idea what people will do in other contexts to avoid mild social awkwardness? If people had the opportunity to pay money to not have to look anyone in the eye, some would pay $0, but you could get some people for dollars, and also you can stimulate new demand.</p>\n<blockquote>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/09/does-automation-reduce-stigma.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=does-automation-reduce-stigma\">Tyler Cowen</a>: I even draw distinctions across automated models. For instance, if I have “a stupid question,” I am more likely to ask Grok, since I would rather GPT maintain a higher opinion of what I do and do not know.</p>\n<p>Dismalist: Reminds me of a line in Mad About You when after hiring a cleaner to start coming the next day, Jamie starts cleaning the night before. Paul sees her, and says: We don’t need a cleaner. We need a credible threat of a cleaner!</p>\n</blockquote>\n<p>If you worry about ChatGPT or Claude’s memory on this, which I wouldn’t, you can use a temporary chat, or delete the chat afterwards. Let’s not panic and use Grok.</p>\n<p>Also, yeah, I absolutely hate the thing where you hire a person to do [X], and then you get pressure to do [X] for them in advance to avoid looking bad or being rude or what not. The whole point of hiring them is to get them to do [X] so you don’t have to, or so they can do it better.</p>\n<p>Another commentator notes that the right amount of stigma is sometimes not zero, indeed one can see this because for some prosocial items we approve of the existing negative stigma (as in, you buy wisely and the cashier looks at you approvingly).</p>\n\n\n<h4 class=\"wp-block-heading\">Antisocial Media</h4>\n\n\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/10/china-understands-negative-emotional-contagion.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=china-understands-negative-emotional-contagion\">China cracks down on ‘negative emotional contagion</a>’ <a href=\"https://www.nytimes.com/2025/10/08/world/asia/china-censorship-pessimism-despair.html\">and ‘excessively pessimistic’ social media users</a>. I do agree with Tyler Cowen that if you are spreading negative emotional contagion, ‘there is a very good chance’ you are likely to be ‘part of the problem,’ but it is a hell of a thing to ‘crack down’ on it.</p>\n<blockquote>\n<p>Lily Kuo (NYT): The authorities have punished two bloggers who advocated for a life of less work and less pressure; an influencer who said that it made financial sense not to marry and have children; and a commentator known for bluntly observing that China still lags behind Western countries in terms of quality of life.</p>\n<p>… Beijing is concerned that such pessimism doesn’t just discourage citizens from being productive members of society. It could turn into criticism of the ruling Communist Party.</p>\n<p>… In the city of Zhengzhou in central China, officials said two social media account owners were investigated for portraying the city in an unflattering light.</p>\n<p>… Weibo, a popular microblog, said last week that it <a href=\"https://archive.is/o/BQt5A/https://weibo.com/1934183965/Q6XoJrYRh?refer_flag=1001030103_\">suspended more than 1,200 accounts</a> that “spread rumors” about the economy and government welfare programs.</p>\n</blockquote>\n<p>Banning not only political dissent but any and all pessimistic speech in this way is, shall we say, highly pessimistic speech, not a sign things are going well.</p>\n<blockquote>\n<p>Lily Kuo: “The official message of positivity is contrasted by an economic reality that is just starkly different compared with the last decades,” said Katja Drinhausen, head of Chinese politics and society at the Mercator Institute for China Studies. “It will not be enough to keep online negative emotions in check.”</p>\n</blockquote>\n<p>I do not expect this to end well.</p>\n<p>Are you excited for this new method of sharing content on Twitter? I know I am.</p>\n<blockquote>\n<p><a href=\"https://x.com/generativist/status/1977441853877502350\">Nikita Bier</a> (Twitter): Starting next week we’ll be testing a new way to share and engage with web links on Twitter. The goal will be to ensure all content on the platform has equal visibility on Timeline.</p>\n<p>Johnny v5: oh wow. hoping this is legit. we all know AOL is the future. but hyperlinks — while mostly an untested technology — have shown some promise as a niche applications</p>\n</blockquote>\n<p><a href=\"https://www.bedrockprinciple.com/p/why-you-should-care-about-algorithms\">Ashkhen Kazaryan sounds the alarm about the case TikTok vs. Anderson</a>, in which it is held that if an algorithm promotes harmful content, it cuts through Section 230 immunity and becomes the platform’s speech. <a href=\"https://futurefreespeech.org/wp-content/uploads/2025/09/I-Built-This-Algo-Brick-by-Brick-September-2025-The-Future-of-Free-Speech.pdf\">As Kazaryan argues, the modern internet does not work without curation or without algorithms</a>.</p>\n<p>This is a tricky problem. Obviously you can’t make everything in every algorithmic feed (or ‘for you’ page) the responsibility or speech of the platform, as the Third Circuit did here, or you effectively ban such feeds. Also obviously, if you intentionally steer users towards particular content sufficiently strongly, then that should be on you. So you need a limiting principle to determine what constitutes a sufficiently non-neutral algorithm.</p>\n<p><a href=\"https://x.com/robertskmiles/status/1965924675281891754\">Sound advice from Rob Miles that bears repeating</a>.</p>\n<blockquote>\n<p>Rob Miles: There are a bunch of really basic and easy ways to improve your social media experience that I see smart people not doing.</p>\n<ol>\n<li>Turn off auto-playing wherever possible</li>\n<li>When you see something that you would prefer not to have seen, consider why it’s on your feed, and use the tools to remove it. You can unfollow people, mute people, mute words, or turn off retweets from people</li>\n<li>Deliberately don’t engage with things you want to see less of. If you engage with things because they make you angry or scared, social media will dump more of those things on you. Engage with what you want to see more of</li>\n<li>One thing I do is ‘tending the garden’: Scroll through your feed one item at a time, and for every single one, consider if you want more or less of that, and take action. Feed what you want, weed out what you don’t. Just a few minutes of deliberate regular maintenance helps a lot.</li>\n<li>Try to never use social media apps, just view in the browser, where you’re in control, and use tools like UBlock Origin and TamperMonkey to change things. LLMs are great at writing Tampermonkey scripts, I can simply ask my buddy Claude to make the website just how I want it!</li>\n</ol>\n</blockquote>\n<p>I cannot emphasize #3 enough, and I should try #5. With notably rare exceptions in high value spots, the rule is to never, ever, ever interact with something you want to not see in the future, no matter how wrong someone is on the internet. Negative interaction is interaction. That does not include muting or blocking, or saying ‘see less of this,’ which might not do much but are at least not going to make it worse.</p>\n<p><a href=\"https://x.com/AlexFinnX/status/1966583132158914961\">Twitter’s new algorithm has a ‘reputation score’ from 0-100</a>, where low scores reduce reach, and there is no way to check your own rating. I am actually rather sympathetic to this in theory, because reputation should absolutely play a role in reach, and also if you shared people’s reputations you can imagine what would happen next and all the accusations that would fly. The problem is I absolutely do not trust Elon Musk or Twitter to not put a thumb on the scale for various reasons both ideological and otherwise, and I also don’t trust them to not mess this up. If we are going to do this, the algorithm needs to be transparent, even if that doesn’t make it calculable from the outside.</p>\n\n\n<h4 class=\"wp-block-heading\">Government Working</h4>\n\n\n<p>[Editor’s note: As always, if you like avoiding politics as much or even more than I do, especially in 2025, consider skipping this section. The failure to mention other political topics here or elsewhere does not mean that I am not aware of or do not care about them, or that the ones I did choose to mention are the most important.]</p>\n<p>It is currently not working due to a shutdown. This is mostly not about that.</p>\n<blockquote>\n<p><a href=\"https://x.com/Acyn/status/1969897421523357977\">President Donald Trump (link has video, from Kirk’s memorial service):</a> [Charlie Kirk] did not hate his opponents. He wanted the best for them.</p>\n<p>That’s where I disagreed with Charlie. I hate my opponent and I don’t want the best for them. I’m sorry.</p>\n</blockquote>\n<p>The free speech situation is extremely terrible. I don’t care who started it, or who did what first, free speech is the most important, most sacred principle, period.</p>\n<blockquote>\n<p><a href=\"https://x.com/TheFIREorg/status/1967974382980284546\">FIRE</a>: President Trump suggested today that media outlets are engaging in “hate speech” by being “unfair” to him and “maybe” should be prosecuted.</p>\n<p>Trump’s statement demonstrates the inherent danger of “hate speech” laws: Those in power will always weaponize them to silence dissent.</p>\n</blockquote>\n<p>Many Trump statements have repeatedly made it clear he does not believe in free speech and demands control over the media, that he thinks the media needs to support him, or at least not oppose him, or else. <a href=\"https://www.wsj.com/opinion/ted-cruzs-finest-hour-15be6e64?st=Yoio56\">Carr’s jawboning, as warned about by Ted Cruz</a>, is only the most blatant incident.</p>\n<p>While the situation is extremely dire, we need to avoid saying things like ‘unprecedented attacks’ on free speech, or that it’s all over for free speech, or anything like that. This is a clear misunderstanding of the history of free speech, and an example of the kind of ‘spreading negativity’ that does indeed make you part of the problem, except unlike China I would never want to tell you that you couldn’t say it.</p>\n<p>Free speech has always been constantly under attack even in America, and I’m mostly not talking about the last decade. Our second president, John Adams, went hard after the speech of his opponents. We’ve been going back and forth on this for a very long time. Woodrow Wilson went after it hard. McCarthyism went after it extremely hard. Things after 9/11 or around 2020 were very not good. And so on. Social pressure on speech, including by the government, is universal.</p>\n<p>It was only <a href=\"https://x.com/eigenrobot/status/1970495269037920271\">this month that YouTube agreed to reinstate (under new government pressure) the accounts</a> of those who were suspended for saying the wrong things about Covid under a very broad supposed ‘misinformation’ crackdown instigated by heavy pressure from the Biden Administration, and admitted that they did so under Biden Administration pressure to censor speech that did not violate YouTube’s policies, which it now says was ‘unacceptable and wrong.’</p>\n<p>Many of the statements that got accounts suspended ultimately proved accurate, although of course many others were both highly irresponsible and highly false. Presumably, if I had done readings of my Covid posts on YouTube, or reposted the texts to Facebook, I would have been suspended many times over.</p>\n<blockquote>\n<p><a href=\"https://x.com/Jim_Jordan/status/1970474487809265878\">Rep. Jim Jordan:</a> But that’s not all. YouTube is making changes to its platform to prevent future censorship.</p>\n<p>YouTube is committing to the American people that it will NEVER use outside so-called “fact-checkers” to censor speech.</p>\n<p>No more telling Americans what to believe and not believe.</p>\n<p>YouTube also is trying out Community Notes.</p>\n<p>@elonmusk was ahead of the curve. Meta followed suit. And now YouTube.</p>\n</blockquote>\n<p>I am glad to see these changes, but it does make one ask about the limiting principle?</p>\n<blockquote>\n<p><a href=\"https://x.com/eigenrobot/status/1970495269037920271\">eigenrobot</a>: ok here’s a fun one is it restricting free speech to pressure a media platform to reinstate accounts that it had previously removed perhaps in response to government pressure. good luck figuring this one out using principles that are both coherent and non-exploitable</p>\n</blockquote>\n<p>I think my answer is ‘the pressure on YouTube here is in practice okay because it is (1) a push towards more speech and (2) undoing previous government pressure,’ and it would be unacceptable if either clause was untrue.</p>\n<p>For this go around, I’d draw a clear distinction, so far, between incidents directly related to Charlie Kirk, and incidents about other things. Performative lawsuits and wishful or general statements aside, so far from what I have seen actual consequences have been confined to people who decided to say ill-advised things specifically related to Charlie Kirk or his assassination, or at least to people’s actions surrounding that. Which is a relatively reasonable and compact thing to get bad mad about. Even comedians have the rule of ‘too soon.’</p>\n<p>Let us not forget all the hard earned progress we have made, even if the last decade has involved some backsliding and dialectic escalation. That doesn’t mean we can relax. We have to fight for this all the more. It does mean don’t despair.</p>\n<p>Things are quite bad, but don’t catastrophize. Whenever you see a decision like <a href=\"https://www.thefp.com/p/jawboning-and-jimmy-kimmel-free-speech-censorship\">Disney indefinitely caving on Kimmel</a>, suspending a show that was actively hemorrhaging money, you get people saying this means that they are now ‘state owned media’ or fascist or otherwise fully under state control. That’s not how any of this works, and wouldn’t be even if he had stayed off the air, although it was of course very good and right to exert a lot of pressure on Disney to bring him back.</p>\n<p>I also notice that, as terrible as this is, <a href=\"https://x.com/asymmetricinfo/status/1969135209112072447\">we don’t need to be too concerned about broadcast television or its licenses any longer</a>. Only 4% of households rely on broadcast television. If you strike down a Kimmel or Colbert, and demand is there, you only make them stronger. I don’t think we should sell off the broadcast spectrum, at least not quite yet. I think there’s value in preserving the low-end solutions to things. But I wouldn’t lose sleep over it if we did pull that plug entirely.</p>\n<p>If you strike down a Kimmel, and then there’s enough noise that Disney puts him back, you’ve very much gone into Streisand Effect territory and also royally pissed everyone involved off, pretty much across the comedy and journalist spectrums.</p>\n<p>Then if you respond to the restoration by announcing you’re going to sue ABC, because they dared give into your previous lawsuit to bend the knee and keep the peace? <a href=\"https://x.com/ArmandDoma/status/1970683391482961972\">Yeah, I’m guessing that is not going to go the way he would like.</a> It also makes it impossible to pretend Trump wasn’t trying to coerce the network.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Xfnd!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa8b6c999-0f34-4ec0-adef-a97622adbbf9_1064x970.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://variety.com/2025/tv/columns/apple-postponing-savant-charlie-kirk-huge-mistake-1236527471/\">AppleTV+ has decided to postpone Jessica Chastain in The Savant</a> in the wake of events. I agree with Aramide Tinubu <a href=\"https://x.com/jes_chastain/status/1970871919143497742\">and also Jessica Chastain</a> that this is a mistake, but it is the type of decision that has previously often been made in similar circumstances. The show will still be there for us in a few months.</p>\n<p><a href=\"https://www.natesilver.net/p/the-political-mood-feels-like-911\">Nate Silver notes that liberals who remember what it was like after 9/11</a> tended to be more wary about progressive cancel culture. Whereas now it seems like we have the opposite, realizing how bad things were and wanting to dish it out even worse. That only ends in one place.</p>\n<p>As long as the primary platforms for free speech are mostly owned by companies with a wide array of business interests, upon which the government can exercise broad discretion, it is very difficult for them to push back too hard against attacks on speech, although some good news is that a large part of the public will still to some large extent turn against any platform seen to be caving. It is easy to see why a Disney or Paramount would fold, at least up to a point. Disney found out that not folding has its own dangers.</p>\n<p>It is also easy to see why The New York Times didn’t fold.</p>\n<blockquote>\n<p><a href=\"https://x.com/nytmike/status/1967947878305022021\">Michael Schmidt</a>: NEW: <a href=\"https://www.washingtonpost.com/business/2025/09/16/trump-new-york-times-defamation-lawsuit/\">Trump just sued The New York Times for $15 billion</a> over stories written by me, @peterbakernyt @russbuettner @susannecraig. The suit has no merit. It’s just “an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people.”</p>\n<p>Full NYT statement. “This lawsuit has no merit. It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people.”</p>\n<p><a href=\"https://x.com/mattyglesias/status/1967997890925842785\">Matthew Yglesias</a>: One of the benefits of the New York Times being a company whose *only* business is journalism is that unlike Disney or Paramount or whatever they have no choice but to fight for the integrity of their news operation.</p>\n</blockquote>\n<p>I am very confident Michael is correct that the lawsuit against the New Your Times has no merit. I mean, you may have thought previous lawsuits had no merit, but this is a new level of not having merit. We’re talking a complete and profound absence of even the fig leaf of potential merit, <a href=\"https://x.com/Scott_Wiener/status/1967810756260589744\">full common knowledge of absolutely no merit.</a> He’s literally suing them for things like endorsing Kamala Harris too loudly and saying so, himself, out loud, where we can hear. This really is profoundly not okay.</p>\n<p>Looking back on that now that the time for a monthly roundup has come, I notice that we have largely moved on, and the pressure on this already feels like it is subsiding.</p>\n<p>It would be nice if we stopped committing murders, by which I mean <a href=\"https://www.miamiherald.com/news/nation-world/world/americas/venezuela/article312184848.html?taid=68d0c9d6ccd1500001b6bed1&amp;utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter\">sinking ‘suspected’ drug ships, accused of non-capital offenses, without due process of law</a>. I don’t want to hear ‘experts warn this raises serious international law questions’ when it’s clearly just straight up murder.</p>\n<p><a href=\"https://x.com/JeremyLNeufeld/status/1970477194918134065\">The Trump Administration released its new rule for prioritizing higher wage jobs</a> for H1-B visas (good, and important if we still hit the cap). Except instead of looking at the number known as ‘dollars paid to the employee,’ also called salary, they are using the complete bullshit system called DOL ‘wage levels.’</p>\n<blockquote>\n<p>Jeremy Neufeld: <a href=\"https://public-inspection.federalregister.gov/2025-18473.pdf\">The new Trump H-1B rule just dropped</a>!</p>\n<p>It prioritizes DOL “Wage Levels,” not real wages. DOL thinks an experienced acupuncturist making $40k is a higher “Wage Level” than an early-career AI scientist making $280k.</p>\n<p>That means more visas for outsourcers, fewer for real talent.</p>\n</blockquote>\n<p>As in, don’t worry about whether a job produces anything of value, or anyone is willing to pay you a lot to do it, ask whether someone is ‘experienced’ in that job.</p>\n<p>I have found zero people making any argument whatsoever, even an invalid one, in favor of using these ‘wage levels’ rather than salary.</p>\n<p>I never want Robin Hanson to stop Robin Hansoning, and I would never want Tyler Cowen to stop Tyler Cowening, <a href=\"https://marginalrevolution.com/marginalrevolution/2025/09/why-we-should-not-auction-off-all-h1-b-visas.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=why-we-should-not-auction-off-all-h1-b-visas\">as embodied by his claim that we should not auction off all H1-B visas</a> because this would have failed to attract the best upwardly mobile talent such as Sundar Pichai. This follows a long line of arguments of the form ‘do not allocate [X] by price because the most valuable but neglected talent, especially prospective travelers, would then not buy enough [X], and that is the most important thing’ where famously one [X] was traffic via congestion pricing.</p>\n<p>There is a real objection in such cases, which is that externalities exist that can’t be properly priced in, and we are unwilling or unable to reasonably price such externalities, and thus pure allocation by price will fail to be a full first best solution.</p>\n<p>It still beats the current allocation strategy of allocation via lottery, or via allocation via willingness to wait in line, including for the purposes Tyler worries about, and is vastly better in the vast majority of allocation decisions. The current system already has a huge invisible graveyard of trips and talent and so on. Vivian Darkbloom points out that in this case that Pichar is a terrible example and would definitely have made it in under the $100k proposed fee, whereas without the fee he has to survive a lottery draw.</p>\n<p>I would bet that under a pure auction system (as in, you choose a fee that roughly clears the market), the amount of top talent secured goes way up, there will be a huge correlation with willingness to put up the $100k fee. If you want to additionally subsidize extraordinary people? Sure, if you can identify them, also we have the O-1.</p>\n<p>Perhaps this is the best way to make the simple case: <a href=\"https://www.wsj.com/opinion/tariffs-mean-you-pay-more-for-worse-products-e36855cf?mod=panda_wsj_custom_topic_alert\">Tariffs Mean You Pay More For Worse Products.</a> I prefer paying less for better products.</p>\n<p>It seems Trump took the government shutdown <a href=\"https://x.com/SherylNYT/status/1976833075515666690\">as a reason to fire a lot of people in the CDC</a>, with the final total expected to be between 1,100 and 1,200 people?</p>\n<blockquote>\n<p><a href=\"https://x.com/samstein/status/1977051050822586410\">Sam Stein</a>: As the dust settles, it’s clear that Vought’s RIFs amount to a Friday night massacre at the CDC. Lots of confusion as to the total number gone. But several sources tell me top officials and many staff at the center for Chronic Disease Prevention and Health Promotion and the center for immunization and respiratory diseases are OUT. Am told the Ebola response team has been hit hard too.</p>\n<p>Again, there is mass confusion. but it appears the government’s chief agencies responding to outbreaks and studying infectious diseases have been gutted. if you know more we have a secure tip line here. I’m also on signal asteinindc.09</p>\n<p>To put a finer point on it. I’m told the ACTING DIRECTOR and CHIEF MEDICAL OFFICER for the National Center for Immunization and Respiratory Diseases are now gone.</p>\n<p>Am told CDC’s HR department had been furloughed because of the government shut down. They were then, un-furloughed so that they could process the RIFs to fire their colleagues. Can confirm. Some CDC experts who were RIFed on Friday have already had their firings rescinded by the administration.</p>\n</blockquote>\n<p>This is on top of the loss of 2,400 staff, or 18% of the agency, earlier in the year. About half the initial firings were rescinded this time around, it seems this government has a pattern of thinking it can fire a bunch of people and then say ‘oops’ on some of them later and it’s no big deal, and in this case it seems they’re blaming many of them on ‘coding errors in their job classifications’ which shows the level of attention to detail going on. <a href=\"https://x.com/matthewherper/status/1977184954422349846\">Matthew Harper called the situation</a> ‘chaos,’ <a href=\"https://www.statnews.com/2025/10/11/cdc-firings-government-shutdown-hhs/\">not normal and unprecedented in his 20 years of reporting</a>.</p>\n<p>Trump seems to be framing this as retaliation for the shutdown because the CDC is a ‘Democratic’ program, and taking a very ‘<a href=\"https://www.youtube.com/watch?v=3tmd-ClpJxA&amp;pp=ygUlbG9vayB3aGF0IHlvdSBtYWRlIG1lIGRvIHRheWxvciBzd2lmdA%3D%3D\">look what you made me do</a>’ attitude?</p>\n<p>Others are pushing back on the theory that the CDC is bad and incompetent, actually, so this is good actually, a line I’ve seen both from MAGA people <a href=\"https://x.com/ohabryka/status/1977212816450109807\">and also some others</a>.</p>\n<p>I have not been especially impressed with the CDC, shall we say, on Covid-19 related fronts or in other places I’ve gotten a close look. The problem is that presumably we can all agree that we need a well-staffed, highly functional and effective Centers for Disease Control in order to, ya know, track and control disease? Does ‘the Ebola response team has been hard hit’ sound like a wise move?</p>\n<p>With AI potentially enabling biological threats this now more than ever is not a program you cut. It seems highly plausible that CDC wasn’t doing a great job, but in that case we should be replacing or reforming the agency. I don’t see any sign of doing that.</p>\n<p>I continue to see a steady stream of nightmare stories coming out of the UK. I don’t consider this my beat, but I must note that things seem deeply, horribly wrong.</p>\n<p>We see things like <a href=\"https://x.com/avidseries/status/1972395240398151995\">UK’s NHS talking about the supposed benefits of first-cousin marriage</a>, almost on a weekly basis. And we get the kind of authoritarian ‘how has this person not been sacked and no one seems to care?’ statements such as this one:</p>\n<blockquote>\n<p><a href=\"https://x.com/paulg/status/1974899202569515321\">Paul Graham:</a> A spectacular example of Orwellian doublespeak from the UK Home Secretary: “Just because you have a freedom doesn’t mean you have to use it at every moment of every day.”</p>\n<p>In fact the ability do something whenever you want is practically the definition of a freedom.</p>\n</blockquote>\n<p>It is sufficiently bad that <a href=\"https://x.com/sam_atis/status/1977825614314045882\">ACX Grants are giving Sam Glover $60k to fight for UK free speech</a>, you can DM him to volunteer.</p>\n<p>When, one must ask, will the people rise up as one…</p>\n<blockquote>\n<p><a href=\"https://x.com/NewsWire_US/status/1977088257797324810\">NewsWire</a>: UK government outlaws free drink refills on hot chocolate, mocha and Coke Cola.</p>\n</blockquote>\n<p>…and say ‘but this time, you’ve gone too far’?</p>\n\n\n<h4 class=\"wp-block-heading\">Tylenol Does Not Cause Autism</h4>\n\n\n<p>Sections I did not expect to have to write.</p>\n<p>I am ashamed of every news article and comment on the subject that does not lead with, or at least put very high up, the obvious fact that Tylenol does not cause autism.</p>\n<p>It’s not only that <a href=\"https://x.com/DKThomp/status/1970294473436323936\">‘the quality of evidence is godawful,</a> or that the evidence actually points heavily in the other direction, which it does, with the correlations both going away under reasonable controls and also being very easy to explain if you think about common cause for five seconds. It’s that our prior on this should be extremely low and even if there were somehow a non-zero effect size it would be greatly eclipsed by the risks of not taking Tylenol when you need it, given the lack of alternatives available.</p>\n<p>The White House is also citing uncontrolled rises in autism rates over time that are very obviously caused mostly by expanded diagnostic criteria and active pushes to diagnose more high-functioning individuals, including calls for ‘diagnostic equality.’ The vast majority of people I know that are considered on the spectrum would have been undiagnosed back when I was a child.</p>\n<p>To be fair, there is <a href=\"https://www.youtube.com/watch?v=SGaQw5HyX38&amp;t=866s\">a possible mechanism</a> that isn’t completely crazy, and this is less terrible than if they had gone after vaccines. So the whole thing isn’t quite maximally bonkers, but again the whole thing is bonkers, <a href=\"https://www.slowboring.com/p/the-dangerous-war-on-tylenol\">deeply irresponsible and deeply stupid</a>.</p>\n<blockquote>\n<p><a href=\"https://x.com/sapinker/status/1970455702242988086\">Steven Pinker</a>: <a href=\"https://t.co/J6H0CUntF8\">Autism expert (and friend &amp; graduate school classmate) Helen Tager-Flusberg</a>: “I was shocked and appalled to hear the extreme statements without evidence in support of what any of the presenters said. &#8230; the most unhinged discussion of autism that I have ever listened to. It was clear that none of the presenters knew much about autism &#8230; and nothing about the existing science.”</p>\n<p>Key quote:</p>\n<p>“Singer: The new recommendations are not based on the science. The largest study in the systematic review that the administration cited found no association between prenatal Tylenol use and autism. The smaller studies that did indicate an association were of different sizes, did different analyses, used different doses and even measured autism in different ways.</p>\n<p>The key question is: Why are these pregnant women taking Tylenol in the first place? We know that fever during pregnancy is a risk factor for autism. So if they were taking Tylenol, was it the fever that caused the autism or the Tylenol? The smaller studies did not control sufficiently for this.”</p>\n</blockquote>\n<p>Also there is this:</p>\n<blockquote>\n<p><a href=\"https://x.com/JeromeAdamsMD/status/1970279364035256508\">Jerome Adams MD:</a> The White House, HHS, and all of the media have (completely) buried the lede. Every news headline should actually read:</p>\n<p>Despite bringing the full resources of the U.S. government to bear, RFK fails to find a connection between vaccines and autism!</p>\n<p>So can we put that to bed?<img alt=\"🙏🏽\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f64f-1f3fd.png\" style=\"height: 1em;\" /></p>\n</blockquote>\n<p>This is all actually a really big deal, to give women access to zero painkillers and ways to bring down fewer is dangerous, it is extremely painful, and would lead to obvious reactions if we actually act this stupid and cruelly:</p>\n<blockquote>\n<p>Elizabeth Be<a href=\"https://x.com/emzanotti/status/1970177695163035870\">nnet</a>t: Just popping in to say that if we tell pregnant women there are no OTC pain relievers they can take for any reason, good luck getting that birth rate up <img alt=\"😬\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f62c.png\" style=\"height: 1em;\" /></p>\n</blockquote>\n<p>We could also leave this here:</p>\n<blockquote>\n<p><a href=\"https://www.nytimes.com/2025/09/23/health/harvard-dean-autism-tylenol-lawsuits-payment.html\">Rebecca Robbins and Azeen Ghorayshi (NYT)</a>: The dean of the Harvard T.H. Chan School of Public Health, who consulted with top Trump health officials ahead of Monday’s warning about Tylenol and autism, was paid at least $150,000 to serve as an expert witness on behalf of plaintiffs in lawsuits against the maker of Tylenol.</p>\n<p>…</p>\n<p>In the decision to dismiss the lawsuits, the judge, Denise Cote, agreed with lawyers for the defendants that Dr. Baccarelli had “cherry-picked and misrepresented study results” in his testimony and was therefore “unreliable.”</p>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">Jones Act Watch</h4>\n\n\n<p><a href=\"https://www.bizjournals.com/houston/news/2025/09/23/jay-wall-jones-act-biz-voice-column.html?csrc=6398&amp;taid=68d2bd06a722300001ff8506&amp;utm_campaign=trueAnthemTrendingContent&amp;utm_medium=social&amp;utm_source=twitter\">Jay Wall III is the latest to point out</a> the Jones Act is a monument to inefficiency that costs American families and businesses a fortune while delivering almost none of (I would say the opposite of) its promised benefits. Some highlights:</p>\n<blockquote>\n<p>American-built coastal and feeder ships cost between $190 million and $250 million, while a similar vessel built in a foreign shipyard runs about $30 million.</p>\n<p>And what’s the result? One Chinese shipbuilder alone constructed more commercial vessels by tonnage in 2024 than the entire U.S. industry has built since the end of World War II.</p>\n<p>The U.S. share of the global commercial shipbuilding market has fallen to a pathetic 0.1%.</p>\n<p>Here’s another head-scratcher: The Jones Act is actually bad for the environment.</p>\n</blockquote>\n<p>This is not a detailed case, nor does it lay out the full costs involved, but yes.</p>\n\n\n<h4 class=\"wp-block-heading\">For Science!</h4>\n\n\n<p><a href=\"https://x.com/matthewesche/status/1971290870935847281\">What would have happened with 40% less NIH funding over the last 40 years</a>? Given recent events and a proposed 40% cut in the NIH budget, that is a great question, but it is deeply tricky to answer.</p>\n<p>As in, while the study described here was worth doing, it doesn’t answer the question.</p>\n<p>(To be clear, I strongly believe we should not be cutting NIH’s budget at this time.)</p>\n<blockquote>\n<p>Matt Esche: The study connects NIH grants with the papers they produced and the patents that build on the funded work, whether directly or via citation.</p>\n<p>It’s difficult to trace out exactly what an alternate world would look like, but simulations using NIH review scores and outcomes linkages reveal what it could mean.</p>\n<p>The alternate world with a 40% smaller NIH could mean a world with 65 fewer FDA-approved drugs, 11% of those approved between 2000 and 2023.</p>\n<p>Even under the most strict linkage &#8212; a drug patent that directly cites NIH funding &#8212; 14 of the 40 FDA-approved drugs with these patents are at risk when cutting the bottom 40% of funding.</p>\n<p>And, medicines under threat with a 40% smaller NIH are on average more highly valued, whether measured by the FDA’s priority review process or stock market reactions.</p>\n</blockquote>\n<p>Funding is helpful, but this does not tell us the counterfactual if we had cut all funding, even if we fully trust that we can get the counterfactual funding decisions via measuring prioritization rankings. If you hadn’t <a href=\"https://www.youtube.com/watch?v=phHe6aNcocQ&amp;pp=ygUUZmVkZXJhbCBmdW5kaW5nIGNha2U%3D\">received the federal funding</a>, would you have gotten other funding instead, or not? If you hadn’t been able to fund your project, would the project have happened later anyway? Here or overseas?</p>\n<p>Would lack of federal funding have caused others to step up, or collapsed the ecosystem? What happens to the displaced talent, and does talent not enter the field at all? Would a lot less time have been wasted seeking grants?</p>\n<p>Parallel and inevitable discovery are common, and so are drugs that could have been discovered long ago but happened not to be. It goes both ways. Would lack of progress and experience compound our losses, or would we have more low-hanging fruit?</p>\n\n\n<h4 class=\"wp-block-heading\">Work Smart And Hard</h4>\n\n\n<p><a href=\"https://x.com/jeremygiffon/status/1974960094468002074\">Work hard or work smart</a>? Jeremy Giffon suggests looking to see who prefers which, whether they maximize effort or elegance, with ‘work hard’ people looking to outwork you and ‘work smart’ people looking for ‘mate in one’ tactics. I reject the dichotomy. If you ‘work hard’ because you find value in working hard, and don’t look for the better way before you start working hard, you are confusing costs and benefits. Looking for the right way to optimize results as a function of work, including the planning work, is hard work.</p>\n<p>I’d also note that contra Giffon’s example, Trump in defeating Cruz for the 2016 nomination very much did not ‘mate in one’ but instead worked very hard, in his way, for quite a while, and pulled off a very complex set of moves, even if he often did not consciously know what he was doing. And that game, like Cruz’s, started decades before the campaign. And in his nightclub example, it’s not obvious which solution (work hard at the gate or work hard to skip the gate) is which.</p>\n\n\n<h4 class=\"wp-block-heading\">So Emotional</h4>\n\n\n<p>A standard Darvo strategy is:</p>\n<ol>\n<li>Gaslight people. Do and say false totally insane awful things. In a calm manner.</li>\n<li>Others react strongly, and in various ways point out what happened.</li>\n<li>Invoke the mellow heuristic, that whoever is more emotional is usually wrong.</li>\n</ol>\n<p><a href=\"https://www.econlib.org/archives/2015/04/the_mellow_heur.html\">The origin of The Mellow Heuristic seems to be, highly appropriately, Bryan Caplan</a>. Bryan is an expert at staying mellow and calm while saying things that are anywhere from contrarian and correct all the way to patently insane.</p>\n<p>The original justification is that ‘emotion clouds judgment’ which is true but it can also be highly useful, or highly appropriate or typical given facts or circumstances. There are cases where that logic applies but they seem rare, and more often the evidence and causation largely runs the other way. As in, sometimes the emotion isn’t causing poor thinking, the emotion in context is instead evidence of poor thinking, if there’s no other explanation for it, but if the emotion is justified by circumstances I think it provides little or no or even negative evidence.</p>\n<blockquote>\n<p><a href=\"https://x.com/ohabryka/status/1975817012086792230\">Stefan Schubert</a> (quoting the original Mellow Heuristic post): I think that people who disagree with Mechanize should engage with them with logical arguments, not sarcasm and mockery.</p>\n<p><a href=\"https://x.com/ohabryka/status/1975817012086792230\">Oliver Habryka</a>: The Mellow Heuristic seems pretty terrible to me. My guess is in most historical disputes I’ve been involved in it would get the wrong answer. Pretty close to as uninformative as it gets.</p>\n<p>[is challenged for examples, gives examples, is challenged that the examples are because rationalists perhaps pre-apply too much mellow heuristic, creating selection bias]</p>\n<p>I think the selection bias here is merely the result of needing reference points that can be pointed to. I could tell you “that time when I adjudicated a work dispute yesterday” but that’s of course useless.</p>\n<p>For lower stakes, my sense is the mellow heuristic is actively anti-correlated. If I have one programmer who has very strong feelings about a topic, and one who doesn’t, the one who has very strong feelings is a decent amount more likely to be right. There is a reason for their feelings!</p>\n</blockquote>\n<p>I think, in this particular case (IYKYK), the correct answer is to engage with the actual arguments, but also it seems right to use sarcasm and mockery, because they deserve it and because it is funny, and because it is often the easiest way to point out the underlying illogic of an argument.</p>\n<p>Where the Mellow Heuristic is useful is when the emotion is disproportionate to the situation even if they are telling the truth, or it is clearly so strong it is clouding judgment in ways that hurt their chance of being right, and most importantly when it is being used as itself an argument, an appeal to emotion, in a way that reveals a lack of a more logical argument, in response to something deserving of a counterargument.</p>\n<p>It is least useful in cases like this one where, as I put it in the weekly, that’s bait.</p>\n<p>Although what’s even funnier is, I think if you properly apply the Mellow Heuristic and similar questions to the Mechanize case, it does not go well for Mechanize, such as here where they respond to Bernie Sanders saying that Mechanize aims to ‘make it easier to pay workers less’ <a href=\"https://x.com/MechanizeWork/status/1975375323002020338\">by claiming that they pay their employees vastly more than Bernie Sanders pays his staffers</a>, which (1) is a highly emotional-style claim, (2) which is clearly designed to rile other people up, and (3) is completely irrelevant given the difference in role types.</p>\n<p>Again, this is Emergent Misalignment, saying the awful thing because it is awful. It’s play acting at being a villain, because you woke up and realized you didn’t die the hero.</p>\n\n\n<h4 class=\"wp-block-heading\">Where Credit Is Due</h4>\n\n\n<p>Credit scores, I say with love, are one of our most valuable inventions.</p>\n<p>The math behind credit scores is, and this too I say with love, deeply stupid.</p>\n<blockquote>\n<p>Rachel, Spirited Sparrow: My husband’s credit score was 841. He made a final payment on our vehicle and it immediately dropped to 795. Never missed a payment. But they want you to carry debt.</p>\n<p><a href=\"https://x.com/EigenGender/status/1976194150036013474\">EigenGender</a>: It’s kinda funny that some analyst probably ran a bad linear regression decades ago and it fuels constant conspiracy theories on here.</p>\n<p>Jai: Currently making payments predicts paying back further loans. Not currently doing that weakly predicts disengagement. I think the math is sound and fits reality &#8211; they do want you to carry debt to prove that you’re still the kind of person who pays back loans on time.</p>\n</blockquote>\n<p>There’s no mystery what is going on here. Having long duration open credit accounts that you’ve been consistently paying absolutely predicts future repayments. Credit scores also take into account various other correlates, to the extent they are legal to take into account, and excludes the ones that aren’t legal to take into account.</p>\n<p>It’s all very Level 1 thinking, squarely in the territory of Goodhart’s Law and riddled with obvious mistakes. The measures would be strictly better if they looked backwards in a sensible fashion and included length of paid off loans inside average age of loans, and otherwise take into account what evidence there actually is that you’ll pay your debts on time, and ideally do some Level 2 (or even Level 3) thinking, but those involved aren’t that clever, so they don’t.</p>\n<p>Perhaps some expert will chime in and say no, we ran the backtests and that doesn’t actually help, to which I reply that is a Skill Issue, you did it wrong, try again.</p>\n<p>The alternative hypothesis is that ‘they want you to carry debt’ is literal.</p>\n<p>The resulting scores are still highly useful, and still mostly ‘get it right,’ partly because most of the time obvious answer is right and in part because if you have the discipline to work to raise your credit score, that is strong evidence of good credit.</p>\n\n\n<h4 class=\"wp-block-heading\">Good News, Everyone</h4>\n\n\n<p>TIL <a href=\"https://x.com/SinaHartung/status/1966328658483957923\">you can type docs.new or sheets.new into your browser and get a new doc or sheet</a>.</p>\n\n<p><a href=\"https://x.com/eshear/status/1968945242825990145\">the fun fact I learned that Italian has two words for regret</a>, ‘rimorsi’ for something you did and wish you didn’t, and ‘rimpianti’ for something you didn’t do and wish you did. Emmett Shear points out there is no such distinction in machine learning algorithms that work on ‘regret,’ but the distinction is very important for actual outputs and decisions, and for many questions involving alignment.</p>\n<p><a href=\"https://www.richardhanania.com/p/independent-thinkers-are-allowed\">A report from the Abundance DC conference</a>.</p>\n<p><a href=\"https://x.com/WokePandemic/status/1970736462145692037\">Influencer posts a video asking for help cleaning an ancient temple, gets 60 to help</a>. There’s an obvious win-win opportunity here for a lot of similar content.</p>\n<p><a href=\"https://codexcc.neocities.org/\">A searchable collection of all Slate Star Codex book reviews</a>.</p>\n<p><a href=\"https://x.com/AlecStapp/status/1974095636049076312\">Home production work by women has gone way down over the last centur</a>y.</p>\n<div>\n<figure>\n<div> </div>\n</figure>\n</div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!SKNt!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa26997d2-14ff-4eb9-996f-e932cbcee5a8_1077x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Welcome to yet another graph where things get way better until the 1970s, at which point we stop seeing progress and everything stalls out. Great stagnation strikes again.</p>\n<p>This is contrasted with much higher investment by both parents in child care, as demands there move to absurd levels but we haven’t had technology to lighten the load. We can get things cleaner faster, but not provide more child care faster, unless you count giving the children screens.</p>\n\n\n<h4 class=\"wp-block-heading\">I Love New York</h4>\n\n\n<p><a href=\"https://x.com/mateosfo/status/1968748850450980917\">Matthew Lewis praises the transformations of the last decade</a> that have happened in New York City, finding it now the ultimate city that we need more of, where everything is right there for you and highly walkable and everyone is friendly and gets along and no one bats an eye at profoundly different cultural happenings. I agree. Yes, we should turn as many places as possible into Manhattans, which would then make them all much better than Manhattan because housing costs would go down.</p>\n<p><a href=\"https://x.com/david_perell/status/1973927845387792391\">David Perell in praise of New York.</a> Mostly this also seems right, especially the secondary note about New York having multiple core industries (and I’d add cultures and worlds) and this making things far less transactional than San Francisco despite New York having the finance world, because the status hierarchies are parallel and also you don’t constantly have business interests with everyone.</p>\n<p>The only place that felt wrong to me is he says people in New York are flakey due to excess of options, but I haven’t experienced that, and find people in San Francisco far more flakey even when they are literally the same people.</p>\n<p>I agree that transportation to and from the airports is one of the biggest obvious failures, although it’s ultimately a minor cost compared to rent even if you use taxis end to end. I am stubborn and mostly take the subway to and from JFK despite everything (and the train to EWR as well), but it’s certainly not fast and if I ever was using LGA that wouldn’t work.</p>\n<p>I also agree that friendships can be difficult and won’t become close by accident. The city is too large, you will meet lots of people but you have to actively make real friendships happen after that initial step.</p>\n<p>As he notes, the Duane Reeds and Best Buys of New York have locked up remarkably many goods, and this is super annoying on occasion. In some ways I agree it reflects loss of social trust, but mostly I think it reflects a narrow failure to enforce the shoplifting laws in an otherwise high trust society. As in, I feel exceedingly safe and like I can relax, but It Is Known that if you shoplift you basically get away with it, so in certain spots they have to play defense to avoid being the juiciest target.</p>\n<blockquote>\n<p><a href=\"https://x.com/david_perell/status/1974523246600180219\">David Perell:</a> The ideal distance to live away from your best friends is Walkie-Talkie distance: close enough where you can easily walk to each other’s place but far enough away so everyone has some space. And if you get enough friends in the neighborhood, it starts to feel like college again.</p>\n<p>Michael Miraflor: This is what NYC feels like when you’re young and just out of school and working at an office where people generally live a short train ride away. The city is small, your friends are close, and the city is a museum, playground, and source of inspiration wrapped into one.</p>\n<p>The office part matters imo. You can meet your best friends or your partner at your first office job. To be young and working hard in the trenches together and also celebrating and making real friendships IRL is an important part of it all &#8211; professional camaraderie, personal development, how to function in the world, etc, and a lot of it has been wrecked a bit by WFH.</p>\n</blockquote>\n<p>Alas, most of us are not young anymore, but yes everything being at your fingertips is the big secret weapon, both walking and via subways. You do still have to put in the effort if you want the friendships to be real.</p>\n<p><a href=\"https://sashachapin.substack.com/p/the-bay-area-is-cursed?triedRedirect=true\">Sasha praises New York City by contrast with the Bay Area</a>, which he refers to as cursed because everything must have purpose and beauty and grace are frowned upon. Really this is 5% praising New York and 95% absolutely unloading on San Francisco, or rather than San Francisco that reads this blog and is full of technology. The post is a joy to read purely for the experience of reading, even if you disagree with all of it.</p>\n<blockquote>\n<p>Sasha Chapin: In the Bay, beauty (personal and otherwise) is looked down on and the famous gender imbalance has chilling effects. Is there a less sexual city than this? Perhaps Salt Lake, but I’d imagine it’s close. My gorgeous friend M is self-conscious about wearing pretty dresses, which is insane anywhere else, but reasonable here: hotness is a quality people aren’t sure what to do with.</p>\n<p>Recently there was a themed Gender Ratio party where beautiful young women dressed glamorously, at least one for every man. In other cities this would be referred to as a party.</p>\n<p>…</p>\n<p>Sasha Chapin (from the comments): I lived in LA for a couple of years and deeply love it. LA is sincere pretend, the Bay is fake real.</p>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">For Your Entertainment</h4>\n\n\n<p><a href=\"https://x.com/ArthurB/status/1971491406804816254\">Are concerts and sporting events underpriced</a>?</p>\n<blockquote>\n<p>More Perfect Union: The CEO of Live Nation-Ticketmaster says that concert tickets are “underpriced” and have been “for a long time.”</p>\n<p>He also believes there’s plenty of room to raises prices.</p>\n<p>Ashley Nowicki: I don’t think a single fan of sports, music, or live entertainment in general would say tickets are underpriced.</p>\n<p>Arthur B: People see the cost they’re paying but do not intuitively associate missing out on sold-out shows with tickets being underpriced.</p>\n<p>With that said super fans do help market the acts and it makes sense to subsidize their tickets.</p>\n<p>A somewhat natural solution could be to increase prices across the board but keep tickets affordable for fans with reward / fidelity programs.</p>\n</blockquote>\n<p>You want all seats filled, so events that do not sell out are usually overpriced even if the selected prices maximize short term revenue, although in some cases you’re stuck in a larger venue than you can plausibly sell out and have no interest in investing in the future, for example perhaps you are the Miami Marlins.</p>\n<p>If you sell out, then the default is that you underpriced tickets if and only if resale prices are much higher than original ticket prices. If they’re similar or lower, great job.</p>\n<p>There are two catches.</p>\n<p>The first catch is that the scalper price is ‘not your fault,’ whereas the venue price is considered your fault. So you gain goodwill by charging less, even though this is dumb. This could be more valuable than the extra revenue and easier access to tickets that you get the other way? Maybe.</p>\n<p>The other catch is that you often have preferences over distribution of tickets, and who attends your sold out show, that do not entirely match willingness to pay.</p>\n<p>Another strong piece of evidence that prices are too low is that often people will spend lots of time and money to get to a concert, vastly in excess of the ticket price.</p>\n<p>I’ve been to three concerts recently, and have realized I don’t do this enough but that selection and preparation are crucial. You want to not miss the good opportunities, or within reason pass on them due to price, but also the mediocre opportunities are meh.</p>\n<p>The first was Weird Al Yankovic at Madison Square Garden, very much a ‘play the hits’ show and every inch a Weird Al Yankovic show, including S-tier use of the multimedia screens throughout. It was great fun and I was very happy I got a chance to see him, but at the same time I couldn’t actually see him in a meaningful way and I was mostly watching those screens, and the opening act of Puddles Pity Party was appropriate and did some interesting things but wasn’t ultimately my cup of tea.</p>\n<p>The second was The Who, in their The Song Is Over tour, also at Madison Square Garden, with Feist as the opening act. A big problem was that with this amount of rocking out I was unable to hear the lyrics of either band well enough to understand them if I didn’t already know what they were. The majority of the time this wasn’t a problem for The Who, but for Feist it was extremely frustrating as I only knew the one song, so while they seemed great effectively everything else didn’t have lyrics. And you could feel every time they talked how much these guys appreciated and loved their jobs and their fans, and that they were pushing to do this until they physically couldn’t anymore.</p>\n<p>The third was Garbage at The Brooklyn Paramount, which was standing room general admission, where the doors open at 7pm, opening act Starcrawler went on at 8pm, and Garbage only went on at 9pm, but not knowing this we showed up just before 7pm. Which despite a ton of waiting was ultimately a great decision, because by making a beeline to the stage, we got to be only about five effective rows deep. And that made a night and day difference. Starcrawler was effectively a (very strong) dancing performance by the lead singer since I couldn’t make out any lyrics at all, but we were close enough to appreciate it.</p>\n<p>And then we got to see Garbage up close and that was fantastic, including being able to fully take in the joy on Shirley’s face as she turned the microphone towards the crowd. Find something you love as much as she loves the crowd singing her greatest hits, which resonated a lot with me based on how I feel when I see people citing my classic posts, except of course her version is way cooler. And even the new-to-me more recent stuff was great.</p>\n<p>My overall conclusion is that yes, live music is Worth It, even if you’re somewhat old and busted and it requires a babysitter and so on, if and only if you do it right. And what doing it right means is (not that any of this is new or special, but I want to remember for the future and remind others):</p>\n<ol>\n<li>Show up for artists you resonate with.</li>\n<li>Do your homework. Know most of the songs cold. Ideally including the warmup.</li>\n<li>Pay up, in time or money, to get actually good seats if at all possible, and prioritize smaller venues to help do this.</li>\n<li>Have a plan for the downtime.</li>\n</ol>\n<p>My plan is, of course, to set up an AI to periodically check for opportunities.</p>\n<p><a href=\"https://x.com/fasc1nate/status/1968918030945001600\">A chart of which movies men and women rate relatively highly on IMDB</a>:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!YW92!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe149a867-4dc6-4868-9d64-db5561c5d2b1_845x995.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The patterns here are rather obvious. In addition to measuring the actual man versus woman gap, there is a clear contamination of the data based on women favoring movies based (I really, really hope!) on the preferences of their kids. If women actually think Despicable Me is the #145 best movie here, or The Hunger Games: Catching Fire is #83, I’m sorry ladies, you’re crazy, and honestly with Catching Fire no one involved has an excuse either way. And aside from Wonder Woman where this opinion is simply wrong, that movie was not good, the other half of that first list I find a highly acceptable expression of different preferences.</p>\n<p>The male list definitely seems very male. It especially includes a bunch of long and slow older movies that many really appreciate, which typically is not a thing I like, such as my experiences with Seven Samurai (I get people love it but man it drags) and Lawrence of Arabia, where I couldn’t even.</p>\n<p><a href=\"https://scottsumner.substack.com/p/the-greatest-plot-ever?utm_source=post-email-title&amp;publication_id=2934833&amp;post_id=173988962&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3o9&amp;triedRedirect=true&amp;utm_medium=email\">Scott Sumner offers his latest set of movie reviews</a>. As usual, his evaluations are almost always correct in an abstract Quality sense, but that’s not that big a portion of what I care about. This time around I have seen at most two of them.</p>\n<p>I bought into A Big Bold Beautiful Journey (4.5/5 stars) and he didn’t, and I agree that the later scenes rely on somewhat unearned emotion, so I get his only giving out a 2.9, that seems like a reasonable ‘didn’t work for me’ rating here. The other one I think I saw was The Last Days of Disco, he gives it 3.6 but I don’t remember it.</p>\n<p><a href=\"https://x.com/robinhanson/status/1972095603510251977\">Robin Hanson reviews One Battle After Another</a> and correctly identifies what you see if you take the movie at face value. You can of course respond ‘this is Paul Thomas Anderson and based on Pynchon’s Vineyard and obviously not intended that way,’ and one can debate how relevant that fact is here, as well.</p>\n<p>I did not like One Battle After Another, reluctantly giving it 3/5. The critical reaction being this positive, and seeing rave after rave, made me angry. I stand by that on reflection. The Quality level isn’t bad, but I think everyone thinks it is way higher Quality than it actually is, and most importantly even if you can look past the other stuff I hated you have to buy into the idea that Bob (Leo’s character) is sympathetic despite being among other things a completely unrepentant terrorist bomber, or the movie simply doesn’t work. I couldn’t do it.</p>\n<p>Critics think we’re both wrong, and gave it a Metacritic 95, but audiences aren’t much biting, <a href=\"https://www.bloomberg.com/opinion/articles/2025-10-09/north-korea-s-military-is-more-advanced-than-you-think\">only giving it $22.4 million on opening weekend on a $200 million budget</a>, so it almost has to win Best Picture to hope to break even. Film critic Jason Bailey says this is fine, they did it for the prestige and to mend relations with talent, they shouldn’t have to make money. Nice work if you can get it?</p>\n<p>I do admit that the whole thing showed strong faith in and willingness to spend on talent for a three hour, R-rated ‘explosive political thriller’ from Paul Thomas Anderson, whose movies are consistently liked but whose box office record is spotty. That the critics think the movie is so political, and this makes them like it even more, helps explain why I like it less.</p>\n<p>As for the rest of the movie reviews, as always <a href=\"https://letterboxd.com/thezvi/reviews/\">you can find them on Letterboxd</a>, where I make a point of reviewing everything I see no matter what, and I’ll have an end of year post. The trend of me being almost uncorrelated with the critics this year continues.</p>\n\n\n<h4 class=\"wp-block-heading\">Gamers Gonna Game Game Game Game Game</h4>\n\n\n<p>This month’s game is Hades 2. I’ve been enjoying it. It’s definitely ‘more Hades’ in very much a ‘meets expectations’ kind of way, so play it if and only if you played the first Hades, took on at least some Heat, and still want to go a second round.</p>\n<p><a href=\"https://x.com/OrlandoMagic/status/1968802967106060388\">Perfection</a>.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!iSt7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9255417e-5c2b-4cfa-86d1-ca8a7f8f9e1c_768x552.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/JoINrbs/status/1972037433832493105\">It seems like there should be a good free or cheap version</a> of ‘play against a GTO heads up poker bot and get live +/- EV feedback.’ I imagine the ultimate version of this is where you don’t output a particular action, you output a probabilistic action &#8211; you say ‘50% call, 25% fold, 25% raise pot’ or what not, and it then compares this to GTO, after which it selects a line at random and you continue.</p>\n<p>I understand why Ben is apologizing here, but he was right the first time.</p>\n<blockquote>\n<p><a href=\"https://x.com/benlandautaylor/status/1975274047069167875\">Ben Landau-Taylor</a>: There’s something very poetic about the biggest technology breakthrough of the last decade being possible only because of a quarter century of investment into higher resolution graphics for computer games.</p>\n<p>When I was a teenager I made fun of gamers who cared about graphics more than gameplay. Today I would like to apologize for my sins against technological progress. I didn’t understand and I’m sorry.</p>\n</blockquote>\n<p>Graphics are cool, but if you care more about graphics than gameplay you deserve for us to make fun of you, and focus on graphics has been horrible for gaming. Yes, it turns out that pushing GPUs harder led to LLMs, and you can view that outcome as more important (for good and bad) than the games, but that’s not why they did it. They had bad taste, often still have bad taste, and should be mocked for it.</p>\n<p><a href=\"https://www.rockpapershotgun.com/clair-obscur-expedition-33s-lead-writer-had-apparently-never-played-a-video-game-before-writing-it\">The lead writer of Clair Obscur: Expedition 33 had never played a video game</a>. She had a cowriter, she kind of would have had to, still this is super impressive. It definitely worked out, the script was very strong, although it doesn’t branch much.</p>\n\n\n<h4 class=\"wp-block-heading\">I Was Promised Flying Self-Driving Cars</h4>\n\n\n<p><a href=\"https://www.theargumentmag.com/p/please-let-the-robots-have-this-one\">Kelsey Piper writes a plea to let the robots have this one</a>, as in self-driving cars, in order to save over 30,000 American lives a year. Self-driving cars are so amazingly great that I consider preventing most car accidents a secondary benefit versus the lifestyle and mobility benefits. And yet support is perilous:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!IOp3!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F22763b02-19f8-49d2-b6b8-7e24f5ad0d72_1121x541.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>What’s craziest is that those over 65 want to ban self-driving cars. They stand to benefit the most, because they will soon be unable to drive. Self-driving equals freedom. Or perhaps what’s craziest is that people’s main objection is safety and trust, here is what people say to justify a ban and it isn’t jobs:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Av6X!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F42ead12c-21ee-4f2c-9277-05c5c826e217_1104x639.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>These concerns clearly have nothing to do with the actual safety data, which presumably most people don’t know.</p>\n<p>So I largely take back not wanting to primarily make the case in terms of safety, because people genuinely don’t understand that Waymos are vastly safer than human drivers. If we make the safety case, then people’s bigger objections go away. Except the whole ‘I hate AI’ objection, I guess.</p>\n<p><a href=\"https://x.com/FedericoNoemie/status/1968014985113768078\">Waymo is testing at SFO. Woo-hoo</a>! Even if they can’t go to the East Bay directly yet I would totally have them drive me to the last Bart station and go from there.</p>\n<p>Exposure makes the public like Waymo, <a href=\"https://sfstandard.com/2025/10/08/san-francisco-became-waymo-pilled/\">with two thirds of San Francisco now approving</a>, a major shift from two years ago. This is despite only 30% realizing that Waymos are safer than human drivers.</p>\n<p>How much safer are they? A lot. <a href=\"https://x.com/ethanteicher/status/1967980602965246145\">We got 96 million new miles of Waymo safety data.</a></p>\n<p>Not only are Waymos involved in vastly fewer serious crashes and injuries than human driven cars, as in 79% less airbag crashes and 91% fewer serious injuries over what is now a very large sample size, including very similar numbers on harm to pedestrians and bike riders.</p>\n<p><a href=\"https://www.understandingai.org/p/very-few-of-waymos-most-serious-crashes\">Very few of Waymo’s most serious crashes were Waymos’s fault</a>. In a majority of the major accidents the Waymo was not even moving. We can determine this because Waymos are full of cameras, so Kai Williams did exactly this. He could not find a single accident that was the fault of the self-driving itself, and 37 out of 41 were mostly or completely the fault of other drivers. The most serious accident where a Waymo was actually at fault involved the front left wheel literally detaching.</p>\n<p>This suggests that if we replaced all cars with Waymos, we would get vastly more than a 79% reduction in crashes and injuries. We would get more like a 95%+ reduction.</p>\n<p>As I said last month, I prefer not to rely on safety as the central argument, but the safety case is overwhelming. However, it is 2025, so you can just say things, and often people do. For example:</p>\n<blockquote>\n<p><a href=\"https://x.com/VitalCityNYC/status/1968715565876330799\">Vital City NYC:</a> This morning, the New York Editorial Board interviewed Bill de Blasio. In light of his history with Uber, the group asked what the city’s posture should be toward Waymo. He said: “The driverless cars are a public safety danger period.”</p>\n</blockquote>\n<p>The public safety danger is that there is the danger they might create public safety?</p>\n<p><a href=\"https://x.com/TheStalwart/status/1968307127551955176\">Joe Weisenthal (who to be clear loves Waymo) worries we aren’t ready for cars</a> to turn from a symbol of freedom to another thing run by Big Cloud. I’m not worried. It will take a while before there is any danger to ‘if you like your car you can keep your car’ or your ability to buy a new one, if you want that. For many of us, the symbol of practical freedom, and also the actual freedom, is the ability to call upon the cloud and get moved around at will.</p>\n<p>This is distinct from the ‘what I can do if the authorities or others with power are Out To Get Me’ type of freedom. Yes I do think there will be some loss there and impact on the psyche, but almost no one wants to pay the cost to keep that. A lot of things are going to change because of AI, whether or not we are ready, and the old thing here was not going to get preserved for so many reasons.</p>\n<p><a href=\"https://x.com/dylanmatt/status/1971288144793534812\">Mothers Against Drunk Driving is strongly in favor of autonomous vehicles</a>, as one would expect given their name.</p>\n\n\n<h4 class=\"wp-block-heading\">Sports Go Sports</h4>\n\n\n<p><a href=\"https://x.com/OllieConnolly/status/1974533791671833006\">How did Bill Belichick’s coaching stint at UNC go so perfectly terribly</a>? Couldn’t have happened to a nicer guy, or rather if it did we wouldn’t all be so happy about it.</p>\n<blockquote>\n<p>Ollie Connolly: This is as embarrassing as it gets for Belichick. But it’s also a damning (and funny) indictment of Mike Lombardi. <a href=\"https://www.nytimes.com/athletic/6684404/2025/10/03/bill-belichick-north-carolina-roster/\">It’s his roster</a> &#8212; and UNC looks like a bad FCS school compared to any FBS school.</p>\n<p>The plan to hand things off to Steve Belichick after two years is not going well.</p>\n</blockquote>\n<p>They turned over the entire roster, and it seems they chose poorly, often fighting teams in second tier conferences for players. Whoops. I’m sad for the kids that got filtered into the wrong tier, but they did choose to play for Bill Belichick, UNC is otherwise a nice school and they are getting paid. The players will be fine.</p>\n<p>Kicker quality keeps increasing and field goal range keeps expanding in the NFL. <a href=\"https://x.com/NateSilver538/status/1977765235860574548\">This has a number of downstream effects</a>. If even modest field position gives you 3 points, but you don’t that often get the full 7, this is going to create a lot of risk aversion.</p>\n<blockquote>\n<p>Derek Thompson: interesting that strategic optimization has pushed basketball and football in opposite directions: long shots vs. short passes</p>\n<p>NFL in 2025 has:</p>\n<p>&#8211; highest QB completion % ever</p>\n<p>&#8211; lowest INT% ever</p>\n<p>&#8211; fewest yards/catch ever</p>\n<p>&#8211; and, sort of a separate thing, but: most long field goal attempts ever</p>\n<p>fewest punts per game ever, too!</p>\n<p>Nate Silver: The field goals thing is sort of related to it. If you’re anywhere past the opponents’ 45-yard line or so, it’s riskier to gamble with downfield passes that may result in an INT because the expected value of the possession is higher when you’re almost assured of a FG.</p>\n<p>And really, these considerations apply even before then. With teams also starting out with better field position with the new kickoff rules, they’re often in a position where two first downs = field goal range. Don’t love it, don’t hate it, but it’s definitely different.</p>\n</blockquote>\n<p>I primarily watch college football these days, but I’m pretty sure that in the NFL this has gone too far. You shouldn’t spend this big a percentage of the time in confident field goal range, as it reduces the number of interesting decisions and distinctions between situations, and causes too much risk aversion. The NFL over the years assembled a bunch of moving parts into something that seemed ‘natural and dynamic’ in various ways, and it feels like various changes are moving it to feel more arbitrary and flow less well and also reduce variety.</p>\n<p>What should we do about it?</p>\n<p>I would start with changing kickoffs back to a default or average of about the 20 yard line, and if you don’t know how to do them safely without them looking bizarre and playing badly, why not just get rid of them and start the ball on the 20, or the option to start on your own 20 with a 4th and [X], for whatever [X] makes sense (maybe only if you’re behind in the second half?), as an onside kick alternative? You don’t actually need a kickoff. Or you could even just start with 4th and 15 all the time from e.g. your own 40, you’re not allowed to attempt a FG unless you make at least one first down, and by default you just punt, since punts don’t require this whole distinct logic and seem safe enough.</p>\n<p>Then we need to do something about the kickers. I’m sorry, but it’s bad for the game if 50+ yard field goals are reliable. If we can’t think of anything else, narrow and raise the uprights or even move them further back until it’s hard enough again (and adjust the extra point yard line to the desired difficulty level).</p>\n<p><a href=\"https://x.com/jbarro/status/1974120333079949807\">Americans increasingly see legal sports betting as a bad thing for society and sports</a>. I share Josh Barro’s expectation that this will become a campaign issue, if AI doesn’t overwhelm all other issues. As he notes, the Federal government can still ban it, if they’re willing to pull the trigger in full. I don’t think a full ban is the first best solution here, but if it is this for DraftKings and FanDuel, it’s an upgrade. If the future ends up being prediction markets with lots of liquidity at great prices and no discrimination against winners? That’s way better. I have a dream that we kill DraftKings and FanDuel and instead we have Polymarket and Kalshi battle it out with Pinnacle.</p>\n\n\n<h4 class=\"wp-block-heading\">Opportunity Knocks</h4>\n\n\n<p><a href=\"https://www.lesswrong.com/posts/AZwgfgmW8QvnbEisc/cfar-update-and-new-cfar-workshops?from=feedModal\">CFAR is running new workshops</a> on rationality, November 5-9 in California and January 21-25 near Austin, Texas.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/10/15/monthly-roundup-35-october-2025/",
            "publishedAt": "2025-10-15",
            "source": "TheZvi",
            "summary": "It is increasingly often strange compiling the monthly roundup, because life comes at us fast. I look at various things I’ve written, and it feels like they are from a different time. Remember that whole debate over free speech? Yeah, &#8230; <a href=\"https://thezvi.wordpress.com/2025/10/15/monthly-roundup-35-october-2025/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Monthly Roundup #35: October 2025"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3155/",
            "publishedAt": "2025-10-15",
            "source": "XKCD",
            "summary": "<img alt=\"If nothing else, that reasoning definitely overturns syllogisms.\" src=\"https://imgs.xkcd.com/comics/physics_paths.png\" title=\"If nothing else, that reasoning definitely overturns syllogisms.\" />",
            "title": "Physics Paths"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/zed-for-windows-is-here",
            "publishedAt": "2025-10-15",
            "source": "Zed Blog",
            "summary": "Zed for Windows is finally here. Download it today.",
            "title": "Windows When? Windows Now"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-10-15"
}