{
    "articles": [
        {
            "content": [
                "<img alt=\"Open Banking and payments competition\" src=\"https://www.bitsaboutmoney.com/content/images/2025/08/golden-glow-from-vault-door.png\" /><p>Much of the operation of the financial industry is legible to people outside of it. Your credit card works basically like you understand it to (excepting the occasional <a href=\"https://www.complexsystemspodcast.com/episodes/credit-card-rewards-interchange/\">mythmaking about second order consequences</a>). Debates about what terms banks are allowed to offer on credit cards are fairly straightforward and can be easily followed by non-specialists.</p><p>But some issues are under the hood, and a societal debate about them doesn&#x2019;t exactly wear its consequences on its sleeves. Consider the controversy over <a href=\"https://www.consumerfinance.gov/rules-policy/notice-opportunities-comment/archive-closed/dodd-frank-act-section-1033-consumer-access-to-financial-records/\">Section 1033 of the Dodd-Frank Act</a> (and even that framing is an effective medication for insomnia).</p><p>In July, JPMorgan Chase <a href=\"https://www.ft.com/content/85ccc517-4a34-4221-aec7-4d8a72a21f35\">announced</a> its intention to charge fintechs for access to so-called Open Banking data. This comes amidst a consortium of banks trying to sue this hithertofore obscure regulation out of existence.</p><p>Almost all discussions of it center on &#x201c;data&#x201d;, but it&#x2019;s actually a fight about payments, and whether banks have a right to monopolize and charge for all economic activity their users engage in, irrespective of whether the bank operates the payment method.</p><p>Cards on the table: I previously worked at, and am an advisor to, Stripe, a financial infrastructure company which facilitates customers&#x2019; use of both bank-sponsored (cards, etc) and competing (<a href=\"https://docs.stripe.com/payments/link/instant-bank-payments\">account-to-account</a>, <a href=\"https://docs.stripe.com/crypto/stablecoin-payments\">stablecoins</a>, etc) payment methods. Stripe does not necessarily endorse what I say in my personal spaces. (I&#x2019;m also a user and tiny shareholder of Chase. One presumes they also don&#x2019;t endorse what I say in my personal spaces.)</p><h2 id=\"the-genesis-of-section-1033\">The genesis of Section 1033</h2><p>The Dodd-Frank Act was passed in the wake of the 2008 financial crisis. It included a combination of needed reforms and, effectively, partial negotiated settlements for the way in which banks had reaped enormous profits originating mortgages of less-than-stellar quality then left taxpayers holding the bag once those mortgages could not be repaid.</p><p>We&#x2019;ve previously discussed one of the knuckle raps: banks had their debit card interchange capped, with an exemption for small banks. (Interchange is the fee card-accepting businesses pay to transact with bank customers.) The <a href=\"https://www.bitsaboutmoney.com/archive/community-banking-and-fintech/\">Durbin Amendment became a major pillar of fintech companies</a>, as it established a revenue model for them. It also became something of a lifeline for smaller financial institutions, particularly those that partnered with fintechs.</p><p>Did banks <em>like</em> the interchange cap? No. It made a very lucrative line of business rather less lucrative. Taxpayers had provided <a href=\"https://home.treasury.gov/data/troubled-asset-relief-program\">about $245 billion</a> in capital to backstop banks, and they (through the ordinary operation of a representative democracy) got a post-hoc concession for it.&#xa0;</p><p>The interchange cap was not the only concession in the Dodd-Frank Act. Section 1033 was another one: it is designed to increase competitiveness in financial services by establishing a presumption that banks must allow users to access their own data, including through competing providers.</p><p>In the intervening years, that competition has arrived. The banks do not like it, and would prefer it if it went away.</p><h2 id=\"bootstrapping-payment-methods-with-open-banking\">Bootstrapping payment methods with Open Banking</h2><p>Financial institutions offer their customers a complex bundle of services.</p><p>You might reasonably expect that Open Banking is a fight over the budgeting app space. The banks have, via the magic of account records, a large portion of the underlying data about a household&#x2019;s finances. You could imagine software using Open Banking to allow it to slurp in transactions and then categorize them. That would compete against the <em>lackluster</em> offerings the large banks have in their apps.</p><p>But Open Banking is not <em>actually</em> a fight over budgeting apps. Banks don&#x2019;t make money on them and the best known standalone budgeting app, Mint, was <a href=\"https://investors.intuit.com/news-events/press-releases/detail/1005/intuit-completes-acquisition-of-mint-com\">acquired for a relatively small amount of money</a>.</p><p>Payments, on the other hand, are an <em>enormous</em> business. They are monetized both by banks and by a diverse ecosystem of fintech providers.</p><p>The data banks find it annoying to make Open are, principally, account numbers. This is because, due to the <a href=\"https://www.bitsaboutmoney.com/archive/the-long-shadow-of-checks/\">long shadow of checks</a>, possession of an account number (plus the routing number, identifying the bank) is sufficient to attempt to debit a bank account. <a href=\"https://www.bitsaboutmoney.com/archive/bank-transfers-as-a-payment-method/\">Direct account-to-account transfers, including &#x201c;pulls&#x201d;, are a common payment method</a> in many countries, but they are not a large share of consumer to business payments in the United States.</p><p>Why not? One reason is that the user experience of asking someone for their account number is pretty awful. There is no way to check in real time whether an account actually exists. Credit card numbers, in addition to having infrastructure which allows you to query them in real time, are <a href=\"https://en.wikipedia.org/wiki/Luhn_algorithm\">specifically formatted</a> so that typos in them are easily catchable.</p><p>Since you can&#x2019;t know whether the account exists you certainly can&#x2019;t know its current balance or whether a transaction posted against it today will succeed in a few days or be reversed for insufficient funds (or another reason). This means that businesses which use account transfers as a payment method would frequently suffer credit losses if they released goods or services at the time of &#x201c;payment.&#x201d; For many businesses, that isn&#x2019;t a worthwhile tradeoff.</p><p>So they keep using cards. Cards give much stronger (but not foolproof) real-time guarantees of funds availability and likelihood of a transaction going through successfully. The ergonomics of card acceptance, at the register, through your phone, or in a web browser, are also much more palatable to most customers.</p><p>Several fintech companies, including Stripe, realized that they could use Open Banking to make account-to-account payments something customers would actually enjoy. The user is prompted at checkout whether they&#x2019;d like to pay directly from their bank account. They log into their bank account and grants the fintech read access. This is a much stronger signal of authorization than simply knowing an account number. (We print those on <em>every check</em>, after all, and a check is designed to be handed to a cashier or waiter you&#x2019;ll never meet again.) The fintech then grabs the account number and perhaps e.g. looks up the current balance.</p><p>Then, they can pull money from the account, through an ACH debit.</p><p>The ACH debit itself is <em>not</em> Open Banking. It is the ordinary operation of existing payment rails in the financial system. The ACH debit was just <em>made much more convenient</em> by Open Banking.</p><h2 id=\"a-brief-note-about-aggregators\">A brief note about aggregators</h2><p>Most use of Open Banking is through so-called aggregators. Plaid and Yodlee are well-known examples.</p><p>Prior to the existence of Open Banking, the aggregators (and businesses which needed the data they can make available) were largely forced to build supportability networks, bank by bank, by writing so-called screenscraping software. Screenscraping software emulates someone typing the password into a bank&#x2019;s website then browses through <em>a live bank account </em>to extract the information needed from it. Hopefully that screenscraping software isn&#x2019;t bugged, because bugs in scrapers that interface with consequential systems are <em>terrifying</em>.</p><p>Aggregators would then ask users to <em>share their bank account passwords</em>, so they could operate the bank accounts via software automation, to get the data the aggregators&#x2019; business customers were interested in. Like, say, account numbers.</p><p>This is a worse model for users and security of the banking system than Open Banking, because sharing bank account passwords leads to misuse of accounts. The flow for Open Banking, in the best implementations, redirects users to the bank site to authorize the data sharing, without forcing the user to irrevocably cough up the keys to the kingdom.</p><h2 id=\"open-banking-enables-lower-cost-payment-rails\">Open Banking enables lower cost payment rails</h2><p>ACH debits are not new. Businesses have been able to use them for decades. You very likely use them yourself to e.g. pay recurring bills every month, like utilities, mortgage, or credit cards. ACH debits have just been very annoying to use for payments online or at cash registers, and so almost all consumer to business payments go over card rails instead.</p><p>ACH debits are almost free.</p><p>NACHA, which administers ACH, <a href=\"https://www.nacha.org/system/files/2024-09/2025%20Schedule%20of%20Fees.pdf\">charges</a> a per-transaction fee of &#x200b;&#x200b;1.85 <em>hundredths of a cent</em>. This compares favorably to regulated debit card interchange (21 <em>cents</em> plus five basis points of the transaction size) and extremely favorably to Durbin-exempt debit cards or credit cards (generally about 2.X% of the transaction size plus 20-30 cents). The interchange fee is <a href=\"https://www.bitsaboutmoney.com/archive/how-credit-cards-make-money/\">paid mostly</a> to the card issuing banks.</p><p>Banks would strongly prefer the world <em>not</em> make novel payment methods that are convenient and cost accepting businesses less than cards. Banks are interested in Section 1033 because they want to continue earning interchange revenue on coffee purchases and software subscription invoices.&#xa0;</p><p>But payments for goods and services are not the only interesting Open Banking use case. Useful infrastructure, once it exists, tends to get incorporated into everything.</p><p>When you open a brokerage account or engage with crypto companies, you are quite likely to pass through an Open Banking flow to link your existing bank account. You&#x2019;ll use your linked bank account to fund your investments and, hopefully, eventually receive your returns.&#xa0;</p><p>Older users might remember that this used to require asking the brokerage to make trial transactions, typically pushing two ACH payments under $1 in total and asking you to confirm the amounts. This would demonstrate that you hadn&#x2019;t typoed your bank account number, that the account could actually accept transfers, and that you (presumptively) had authorized access to that account, given that you could read recent transactions at will.</p><p>Trial transactions are <em>painful for all parties</em>. They insert a multi-day wait into the account opening process, and many customers abandon the process during that lull. Brokerages and fintechs were overjoyed that Open Banking largely allowed them to move away from trial transactions to authorize every new account.</p><p>There are also clever uses of Open Banking to piggyback on banks as oracles. For example, how do you, a financial institution or insurance company, know that I, a particular natural person, have authority to direct Kalzumeus Software, LLC to open a new financial account? One way you could establish that is to ask me to submit a copy of the LLC&#x2019;s Articles of Organization and a Certificate of Good Standing from the great state of Nevada. Then you pass those to a backoffice paralegal, who can ascertain that the Articles name me the Managing Member, and empower the Managing Member to open new financial accounts. This costs $50 to involve Nevada, and very many small businesses in America will not succeed at the task &#x201c;please locate an authoritative copy of your Articles of Organization.&#x201d;</p><p>A <em>much faster</em> way is to use an Open Banking aggregator to read a bank account statement issued to Kalzumeus Software, LLC. This allows a second financial institution to <em>make the reasonable inference</em> that if I habitually direct a small business&#x2019; banking, as demonstrated by being able to grant access to its accounts, <em>then I probably direct a small business&#x2019; banking</em>. This will save their operations team from reviewing 100 pages of boilerplate and cut down on account opening time. (This is one of the rare and underacknowledged benefits of <a href=\"https://www.bitsaboutmoney.com/archive/kyc-and-aml-beyond-the-acronyms/\">Know Your Customer</a> regulations. Since banks are understood to have KYC responsibilities, the bank &#x201c;vouching&#x201d; for you as a customer in this fashion is treated as strong evidence by others in the economy.)&#xa0;</p><p>So why is Open Banking in the news now? We&#x2019;ve had Open Banking for almost 15 years. The competing payment products <em>work and work well</em>. They are lower cost to accepting businesses and easy for customers to start using. Customers are switching to them in increasing numbers. Not <em>all</em> of them, but enough to worry the banks into wanting to strangle the upstarts.</p><p>This has happened via a regulatory push, litigation, and ultimatums over fees.</p><h2 id=\"the-cfpb-completed-rulemaking-for-open-banking\">The CFPB completed rulemaking for Open Banking</h2><p>The Consumer Financial Protection Bureau finalized its <a href=\"https://www.consumerfinance.gov/rules-policy/final-rules/required-rulemaking-on-personal-financial-data-rights/\">rule for Section 1033</a> in late 2024. As you can tell by the lag between 2010 (when the Dodd-Frank Act was passed) and 2024, it was something of <em>an involved process</em>.</p><p>Relevantly, the CFPB which passed this rule was the Biden administration CFPB. I try to be non-partisan in professional spaces but will need to neutrally observe how partisan players have seen the CFPB.</p><p>The CFPB was <em>not well loved</em> by many people in the finance industry or the fintech community. Critics alleged that the CFPB was less a federal agency and more a one-woman show, with the stars being Senator Elizabeth Warren and a ventriloquism dummy. This was unfair. The CFPB staff was actually quite intelligent in anticipating Senator Warren&#x2019;s preferred positions and rulemaking to achieve them without the dreary necessity of her writing legislation or convincing Congress to vote for it.</p><p>As I <a href=\"https://www.bitsaboutmoney.com/archive/debanking-and-debunking/\">mentioned last December in discussing the debanking discourse</a>, influential supporters of the second Trump campaign, including fintech and crypto investors, wanted the CFPB&#x2019;s scalp. They essentially got what they wanted. The CFPB was <a href=\"https://apnews.com/article/donald-trump-doge-cfpb-elon-musk-456b747c367fccbcf3b74d2893cd1a35\">hollowed out</a> early in the new administration.</p><p>In a swift and ironic turn of events, a policy promoted by the crypto industry due to their frustration with the decisions of large banks (regarding their industry&#x2019;s supportability) was quickly used by large banks for commercial advantage, catching the crypto industry in the crossfire.</p><p>Prior to the election, the Bank Policy Institute, a banking industry trade group, and the Kentucky Bankers Association <a href=\"https://bpi.com/banks-challenge-cfpb-rule-jeopardizing-security-and-privacy-of-consumer-financial-data/\">sued</a> to prevent the CFPB&#x2019;s rulemaking from taking effect. I think an informed person would understand that their legal arguments are pretextural. Their <em>policy</em> arguments, against the normative intent of Open Banking, I&#x2019;ll return to below.</p><p>The CFPB initially defended the suit vigorously, but the newly hollowed out CFPB in June <a href=\"https://www.consumerfinancemonitor.com/2025/06/05/cfpb-states-the-section-1033-open-banking-rule-exceeds-its-authority/\">announced its intention to surrender</a>.</p><p>This has caused a bit of chaos in Washington, as Section 1033 is administered by the CFPB but is part of the financial regulatory apparatus that crypto companies <em>actually like</em>.</p><p>Exchanges largely monetize by charging a vig on crypto purchases, and the so-called &#x201c;onramp&#x201d; (transfering money from the traditional financial system to the crypto ecosystem) enables the rest of their revenue (such as e.g. receiving a cut of interest earned by stablecoin issuers or staking the coins owned by customers).</p><p>Exchanges want to accomplish the onramp at the lowest possible cost, which is through ACH debits. Their desired outcome is the new user uses an aggregator to authorize a debit from their bank account. Then, the debit is very close to free, both for the first transaction and also for subsequent transactions using the same banking details. (The exchange bears a bit of credit risk, since the debit is not known to settle successfully until about two business days later and it can be reversed long after that if it was fraudulent. These issues <a href=\"https://s27.q4cdn.com/397450999/files/doc_financials/2025/q2/23a907fd-1893-4395-baf1-ac8b7a06e097.pdf\">cost</a> Coinbase about $20 million last quarter. It dries its tears on money.)</p><p>The legal and regulatory wrangling continues. It&#x2019;s difficult for me to read tea leaves from Washington in the best of times, and in the interests of avoiding partisan commentary, I&#x2019;ll refrain from confidently guessing whether statements of the administration predict its future actions over multi-week timescales.</p><h2 id=\"the-tangled-web-of-payments-policy\">The tangled web of payments policy</h2><p>The credit card brands, which were originally created by banking consortiums, consider Open Banking data aggregators to be an existential risk to their business. They have long wanted to co-opt or kill them.</p><p>That isn&#x2019;t just me saying it. Visa attempted to buy Plaid back in 2020. The argument to Visa&#x2019;s board <a href=\"https://www.justice.gov/archives/opa/press-release/file/1334726/dl\">was</a> (pg 5) that Plaid could potentially be a, quote, &#x201c;existential risk&#x201d; to their debit card business, which threatened a $300 to $500 million a year revenue hit. It was cheaper to take them off the table, even at $5.3 billion. Call it an insurance policy, their CEO said.</p><p>The FTC quashed the acquisition, <a href=\"https://www.justice.gov/archives/opa/pr/visa-and-plaid-abandon-merger-after-antitrust-division-s-suit-block?utm_source=chatgpt.com\">saying</a> it would have the anti-competitive harm of protecting the debit card business. The FTC alleged that Visa had a near monopoly in online debit transactions. (<em>This</em> payments geek thinks there is actually a vibrant competitive landscape there, including internationally.)</p><p>Some commentators might assume that that was one of the Commissioner Lina Khan era anti-monopoly interventions. (This enforcement environment was part of the causus belli which flipped some notable Silicon Valley personages. It&#x2019;s a complicated story and not particularly well-told by the press, in part because people with a nuanced view of the situation no longer respond to press inquiries, due to journalists&#x2019; <a href=\"https://www.complexsystemspodcast.com/episodes/reporting-tech-kelsey-piper/\">repeated defection in an iterated game</a>.)</p><p>While I&#x2019;m not a close follower of anti-trust enforcement, I do happen to know how to use a calendar, and so feel obliged to mention that the action to stop the Plaid acquisition was late during the first Trump administration.</p><p>Politics legendarily creates strange bedfellows. Crypto companies are now asking the CFPB to revive a regulation protecting a business the first Trump administration kneecapped, after which the second Trump administration hollowed out that same agency, despite campaigning against kneecapping tech and crypto&#x2014;leaving the CFPB, long a sworn enemy of big banks, in Chase&#x2019;s corner dismantling the crypto industry and suppressing competing payment methods, because the administration apparently thinks that&#x2019;s what its backers want.</p><p>Yep, one&#x2019;s head spins.</p><h2 id=\"chase-sends-some-surprise-bills\">Chase sends some surprise bills</h2><p>Chase is the largest bank in the U.S., maintaining checking accounts for approximately 44 million Americans, and therefore makes up a hefty chunk of total transaction volume within the financial system.</p><p>To avoid adversarially screenscraping banking apps, which is unreliable and a bit of a security hole, the better way to do Open Banking is to negotiate API access with as many banks as possible. (Companies make APIs available to let developers access data from them in a safe and controlled fashion. API access allows customers to give secure, scoped, and revocable access to their financial information. Handing over a password is not ideal for those properties.)&#xa0;</p><p>This will customarily require signing a contract with the bank, obligating you to e.g. not steal the money, not attempt to hack bank servers, and not abuse customers&#x2019; expectations. These are all reasonable requests, swiftly agreed to. Most of the aggregators had agreements in place with Chase, which <a href=\"https://developer.chase.com/\">eagerly promotes</a> their API access to developers.</p><p>In July, Chase started sending data aggregators notices about upcoming changes to their agreements.</p><p>The typical notice between financial institutions and developers downstream about changes to contracts is something along the lines of &#x201c;We updated the wording in our privacy policy.&#x201d;&#xa0;</p><p>These notices <em>weren&#x2019;t that</em>. Chase <a href=\"https://www.youtube.com/watch?v=3D8TEJtQRhw\">was altering the deal; pray that they do not alter it further</a>.</p><p>Chase demanded payment for access to Open Banking APIs, and would cut that access if companies interfacing with them did not acquiesce. The fees demanded were <em>enormous</em>.</p><p>A fintech industry trade group was <a href=\"https://www.ft.com/content/85ccc517-4a34-4221-aec7-4d8a72a21f35\">quoted by the Financial Times</a> as saying:</p><p>&#x201c;Across all the companies that received the notices, the cost of just accessing Chase data is somewhere from 60 per cent and in some cases well over 100 per cent of their annual revenue for the year &#x2026; Just from one bank.&#x201d;</p><p>Plaid <a href=\"https://www.forbes.com/sites/jeffkauflin/2025/04/03/plaid-raises-575-million-in-funding-at-61-billion-valuation/\">was asked</a> for $300 million, which would be <a href=\"https://www.forbes.com/sites/jeffkauflin/2025/07/21/why-jpmorgan-is-hitting-fintechs-with-stunning-new-fees-for-data-access/\">75% of their 2024 revenue</a>. That is likely more than the wages and benefits for <em>all of the 1,200 people who work at Plaid</em>.</p><p>Even as someone whose perennial advice to companies was Charge More, these don&#x2019;t strike me as serious proposals to put a reasonable price tag on valuable services.</p><p>The prospect of Chase monetizing Open Banking has dragged some other banks into the fray; <a href=\"https://www.bloomberg.com/news/articles/2025-07-16/pnc-considers-charging-fintechs-for-access-to-customer-data\">PNC is also looking</a> at taking a bite at the apple. The table gets crowded quickly if even a fraction of the next 4,500 banks try to join.</p><h2 id=\"banks%E2%80%99-arguments-for-monetizing-open-banking\">Banks&#x2019; arguments for monetizing Open Banking</h2><p>You can imagine some rapid back-and-forth happening between bank and fintech negotiators happening in the background. There is some reluctance in the industry to speak of that openly, partly because negotiations are delicate and partly because <a href=\"https://www.bloomberg.com/news/articles/2025-07-25/tyler-winklevoss-says-jpmorgan-s-dimon-paused-onboarding-gemini-over-criticism\">some fear retaliation elsewhere in their business relationships</a>.</p><p>But, helpfully, the banks have published their arguments, <a href=\"https://www.jpmorganchase.com/ir/annual-report/2024/ar-ceo-letters\">directly</a> and <a href=\"https://bpi.com/section1033/\">via their industry associations</a>. They are not particularly persuasive.</p><p>The best one is that banks bear risk here, and want to price it. Should a bank authorize a third party to use Open Banking, that third party might use it to exfiltrate value from a bank account. Should a bank customer authorize a transaction but regret it, perhaps because it was to a scam operation, they might ask their bank to make them whole.</p><p>Banks bear this fraud risk, the same as they do when they pay out a fraudulent check, until they can recover the money by reversing the transaction. They will not always be able to successfully reverse the transaction.</p><p>This is structurally similar to banks&#x2019; obligations under Regulation E for debit cards and Regulation Z for credit card purchases. If a consumer gets abused over card rails, the bank is good for it by regulation, less a $50 deductible that the industry universally waives in the interests of their good name. Banks are quite happy with this responsibility for cards, because card issuing <em>prints money</em>, but Regulation E covers almost any form of electronic payment and almost any imaginable form factor of abuse. (For non-limiting examples, see the AI-sung ditty, <a href=\"https://suno.com/song/173bbd67-92f7-4868-930f-efeca4b373c0\">Doesn&#x2019;t Matter, That&#x2019;s Reg E</a>.)</p><p>But account-to-account payments are less like cards and more like checks. Indeed, the Automated Clearinghouse part of &#x201c;ACH debit&#x201d; refers to being a clearinghouse for check payments.&#xa0;</p><p>Banks will occasionally take fraud losses over checking accounts. They mostly can&#x2019;t charge for checks directly; customers expect to write them freely and businesses expect to deposit them for, at most, a nominal fee. Certainly you&#x2019;d be laughed out of the boardroom if you suggested a check fee scaling with the size of the check. That&#x2019;s <a href=\"https://www.bitsaboutmoney.com/archive/the-business-of-check-cashing/\">check cashing</a> nonsense, and not something that regulated financial institutions or their customers expect.</p><p>Dimon, in his <a href=\"https://www.jpmorganchase.com/ir/annual-report/2024/ar-ceo-letters\">2024 letter to shareholders</a>, laments that typical retail checking accounts are a low- or negative-margin business. As an avid reader of Chase shareholder letters, I know why Chase operates that business anyhow: it&#x2019;s the foundation of their relationship with households, which they largely monetize through credit card issuance, mortgage origination, and the like. It&#x2019;s also operated <em>by design</em> to charge lower-income lower-asset consumers less and reliably increase monetization over their long relationships with the institution</p><p>The <a href=\"https://www.bitsaboutmoney.com/archive/deposit-franchises-as-natural-hedges/\">deposit franchise</a>, which contributes a lot to the Fortress Balance Sheet&#x2122;, is most valuable when it attracts retirees, small businesses, and others who keep larger balances earning 0.01% in a savings account or nothing in checking. As a cost of acquiring that business, it offers accounts to e.g. a teenager who wanted to cash the paycheck for their summer job, even though the margins on <em>that</em> account might be negative for the next ten years.</p><p>And so suggesting that retail checking account availability is threatened by banks&#x2019; responsibility to monitor transactions and pay out if they make mistakes in authorization is, frankly, an insult to the intelligence of anyone familiar with banking.</p><p>Checking accounts are <em>also</em> a public service expected by society of banks. This is in return for their lucrative monopolies on industries like e.g. consumer debt issuance and explicit and implicit taxpayer backstops of their operation. Chase is intimately familiar with those, most recently from when it cashed a <a href=\"https://www.fdic.gov/news/press-releases/2023/pr23034.html\">$13 billion sweetener check</a> to acquire a failed bank.</p><p>We have made enormous strides, both from the financial industry and civil society, in banking almost everyone. That should not immediately imply &#x201c;and thus banks get to charge a fee on<em> every transaction in society.</em>&#x201d;</p><p>Chase is extremely capable of shipping payment products that customers actually want to use. Witness the Chase Sapphire Reserve, which probably half of fintech VCs and management teams use to pay for dinners, to my casual observation.</p><p>When Chase <em>can&#x2019;t</em> successfully convince a customer to use a Chase payments rail that has a Chase CSR standing by to help out at 2 AM, Chase shouldn&#x2019;t charge the accepting business money. Chase should understand that Open Banking and account-to-account payments are close in character to a check: one facilitates them in the ordinary course of business, for close to free, as part of the larger package offer.</p><p>Banks additionally make the argument that Open Banking leads to screen scraping. Certainly, as a financial technologist, I would prefer high-quality APIs with reasonable security guarantees. And some banks, like Chase, used the <em>fifteen years of advance notice</em> they had to develop these.</p><p>Other banks had other priorities, and are now <em>using their own inaction</em> to argue that screen scraping is a threat. (One can&#x2019;t help but notice the bait and switch: first say aggregators must use official APIs rather than screenscrape, then claim that anyone who&#x2019;s viewed developer documentation has agreed to a bill for 75% of their revenue.)</p><p>The banks additionally argue that fintechs are freeriding on substantial technology investments made by banks to serve their customers. This is <em>extremely selective memory</em>. Stripe did over <a href=\"https://stripe.com/annual-updates/2024\">$1.4 trillion in payment volume in 2024</a>. Using no private information whatsoever, that implies that Stripe alone paid the banking industry somewhere in the general neighborhood of $20 billion in interchange fees.</p><p>Twenty. Billion. Dollars. From one firm alone.</p><p>It&#x2019;s a little rich, pardon the pun, to cash a check for $20 billion and then whine about fintechs freeriding on your IT spend.</p><h2 id=\"innovation-in-payment-methods-is-a-good-thing\">Innovation in payment methods is a good thing</h2><p>Credit cards are an enormously lucrative business for banks. The capability for businesses of all sizes to transact with customers worldwide over those rails is an enormous service to the world.&#xa0;</p><p>But cards are not and cannot be the last word in payments. We, as a society, should continue making things people want. Sometimes, the natural way to buy those things will be less compatible with cards or the assumptions baked into cards&#x2019; business model.</p><p>There has been quite a bit of enthusiasm for stablecoins in <a href=\"https://www.complexsystemspodcast.com/episodes/taking-stablecoins-seriously-with-haseeb-qureshi/\">some</a> <a href=\"https://stripe.com/annual-updates/2024\">quarters</a> <a href=\"https://www.cnbc.com/2025/07/15/jamie-dimon-jpmorgan-chase-stablecoins.html\">recently</a>. Part of the sales pitch for stablecoins has been that you get to bypass the traditional financial system rails. This sales pitch does not accurately predict the operation of <a href=\"https://www.stablecoin.fyi/\">stablecoin businesses with material volume</a>. Those are often operating something of a crypto mullet, with a stablecoin in the front and a bank transfer in the back. Those bank transfers are often substantially facilitated by Open Banking. This is a necessary part of the growth story for stablecoin businesses, as they are increasingly attempting to interact with the real economy, rather than crypto speculation. The real economy wants <em>dollars</em> and doesn&#x2019;t much care what brand of database your backoffice uses.</p><p>People, particularly at the socioeconomic margins, increasingly use things which aren&#x2019;t exactly a plastic rectangle. Sometimes that is a Cash App or a Venmo, or wallet directly integrated into a phone, or whatever a YC company invents next week. Our international peers like <a href=\"https://www.bitsaboutmoney.com/archive/payments-in-japan/\">Japan</a> (and our adversaries) have thriving payments ecosystems.</p><p>Developing these innovations will almost always need to touch the banking system because, at the end of the day, businesses want dollars. If we award banks the ability to impose a fee on any transaction that competes with their card business, that will strangle some of these innovations. This would be unfortunate, because customers and businesses benefit from choice.</p><p>It also helps us keep the banks on their toes. The industry tends to default to sleepwalking with regards to core services. Bank apps <em>actually being quite good</em> in the last few years is not simply a reflection of their general technical competence. They invested deliberately, after decades of underprioritization, because they saw the younger generation increasingly defecting to apps, and then they realized that would eventually threaten the deposit franchise.</p><p>The banks aren&#x2019;t inherently opposed to shipping good products! They do it frequently! But if you ask the question slightly differently, they will <em>happily</em> bankrupt anyone who threatens revenue streams which are fat-and-happy. In that world, you get to use 1999 banking websites on Internet Explorer 5.0 <em>forever</em>. (And if that sounds unlikely, <a href=\"https://en.wikipedia.org/wiki/Web_compatibility_issues_in_South_Korea\">speak to a Korean friend sometime</a>.)</p><p>There was also something of a kerfuffle with regards to banking supportability decisions recently. I have a <a href=\"https://www.bitsaboutmoney.com/archive/debanking-and-debunking/\">nuanced point of view on it</a>, but if I can offer a comment: when you let banks look into the economic logic of their customers&#x2019; lives to determine their pricing structure, you&#x2019;re giving them the capability to pick winners and losers.</p><p>It has been reported that Chase wants a two-tier pricing system for Open Banking: one fee for data access and another, much higher, fee if someone uses that data access to facilitate a payment. These are the same products from Chase&#x2019;s perspective. The same servers hold the same data. The same CSR stands ready to answer the call if a customer&#x2019;s data leaks. But one of them is inimical to Chase&#x2019;s preferences, and so they charge it more to discourage it.</p><p>We should not allow banks to get into the habit of sending demand letters to ruin the economics of businesses they simply do not like. Those demand letters will be inevitably abused, including in ways which are not determined by any conceivable direct business interest.</p><p>Banks are good at much of what they do, and it is quite profitable. If they want to maintain their share of wallet in their payments businesses, they employ intelligent people who are capable of shipping good products. Let them compete for the business. They&#x2019;ll frequently win it, fair and square, including from me. But if customers choose to use someone else or if they mistakenly release payment to a fraudster, eh, have your teams break out Excel and try better tomorrow.</p>"
            ],
            "link": "https://www.bitsaboutmoney.com/archive/open-banking-and-payments-competition/",
            "publishedAt": "2025-08-13",
            "source": "Bits About Money",
            "summary": "<img alt=\"Open Banking and payments competition\" src=\"https://www.bitsaboutmoney.com/content/images/2025/08/golden-glow-from-vault-door.png\" /><p>Much of the operation of the financial industry is legible to people outside of it. Your credit card works basically like you understand it to (excepting the occasional <a href=\"https://www.complexsystemspodcast.com/episodes/credit-card-rewards-interchange/\">mythmaking about second order consequences</a>). Debates about what terms banks are allowed to offer on credit cards are fairly straightforward and can be easily followed by non-specialists.</p><p>But some issues are under the hood, and a societal debate about them doesn&#x2019;t exactly wear its consequences on its sleeves. Consider the controversy over <a href=\"https://www.consumerfinance.gov/rules-policy/notice-opportunities-comment/archive-closed/dodd-frank-act-section-1033-consumer-access-to-financial-records/\">Section 1033 of the Dodd-Frank Act</a> (and even that framing is an effective medication for insomnia).</p><p>In July, JPMorgan Chase <a href=\"https://www.ft.com/content/85ccc517-4a34-4221-aec7-4d8a72a21f35\">announced</a> its intention to charge fintechs for access to so-called Open Banking data. This comes amidst a consortium of banks trying to sue this hithertofore obscure regulation out of existence.</p><p>Almost all discussions of it center on &#x201c;data&#x201d;, but it&#x2019;s actually a fight about payments, and whether banks have a right to monopolize and charge for all economic activity their users engage in, irrespective of whether the bank operates the payment method.</p><p>Cards on the table: I previously worked at, and am an advisor to, Stripe, a financial infrastructure company which facilitates customers&#x2019; use",
            "title": "Open Banking and payments competition"
        },
        {
            "content": [
                "<p><a href=\"https://grumpy.website/media/2025/1689_full.png\"><img height=\"500\" src=\"https://grumpy.website/media/2025/1689.jpeg\" style=\"width: 465px; height: 500px;\" width=\"465\" /></a></p><p><strong>nikitonsky: </strong>No wonder I could never remember where the Save button is.</p><p>Pro tip: keep controls at the same place so that your users can form a habit</p><p><a href=\"https://grumpy.website/search?q=%23YouTube\">#YouTube</a> <a href=\"https://grumpy.website/search?q=%23Watchlist\">#Watchlist</a> <a href=\"https://grumpy.website/search?q=%23Save\">#Save</a></p>"
            ],
            "link": "https://grumpy.website/1689",
            "publishedAt": "2025-08-13",
            "source": "Grumpy UX",
            "summary": "<p><a href=\"https://grumpy.website/media/2025/1689_full.png\"><img height=\"500\" src=\"https://grumpy.website/media/2025/1689.jpeg\" style=\"width: 465px; height: 500px;\" width=\"465\" /></a></p><p><strong>nikitonsky: </strong>No wonder I could never remember where the Save button is.</p><p>Pro tip: keep controls at the same place so that your users can form a habit</p><p><a href=\"https://grumpy.website/search?q=%23YouTube\">#YouTube</a> <a href=\"https://grumpy.website/search?q=%23Watchlist\">#Watchlist</a> <a href=\"https://grumpy.website/search?q=%23Save\">#Save</a></p>",
            "title": "nikitonsky is being grumpy"
        },
        {
            "content": [
                "<p><em>This is part 3 of a 3 part series on digital hygiene. I suggest starting at <a href=\"https://herman.bearblog.dev/digital-hygiene-emails/\">part 1</a>.</em></p>\n<p>Whenever I watch <em>heist</em> movies, I always roll my eyes at the \"hacker\" character. They can consistently hack building's camera system; or download the contents of a target's phone for use later in the heist. They also manage to hack the bank, which questions the need for a heist in the first place.</p>\n<p>While there are real-world programatic attack vectors that can be exploited, they're generally opportunistic. When a new vulnerability has been discovered, nefarious actors try to exploit it at scale before it’s patched. The chances of finding and executing a \"hack\" on the spot (via bluetooth or something equally ridiculous) is highly unlikely.</p>\n<p>Although, I digress. The most common vulnerability is significantly more boring. It's compromised passwords. These can be stolen through social engineering, like phishing, that exposes account details; but it's also likely exposed through a data leak, where a service hasn't stored passwords securely, and thousands of email+password pairs are stolen. These authentication details are then systematically tested on a bunch of other services in the hopes that some people have re-used their passwords, and thereby gain control over those accounts.</p>\n<p>And that brings me to the topic of today's post: Password hygiene.</p>\n<p>Leaked or stolen passwords are by far the most effective way to hack an account. And so it is imperative that everyone who uses the internet, which accounts for 93% of people in the developed world, to spend some time ensuring that their accounts and login information are secure.</p>\n<p>On Bear Blog, the blogging platform I run, it is interesting to see the frequency with which the Forgot Password flow is used. This is a pretty good indication of the number of people who do not store their passwords properly, since it should never be the case that you've <em>forgotten your password</em>. You should never have to remember your passwords in the first place.</p>\n<p>I wonder how many work hours are lost globally due to people following the forgot password flow.</p>\n<p>I have hundreds of accounts online, everything from my bank, to a free tool for converting ebooks. If I don't reuse any passwords (which I don't, see above) I'll have hundreds of email+password pairs. I certainly can't remember hundreds of different passwords and match them to the relevant services; and outside of a small subset of people, neither can anyone else.</p>\n<p>Before I saw the light and started using a password manager, I used to use a password cipher of my own design. I'd take a string of letters, symbols, and numbers, say <code>!xlk-bd15j-hjk</code>, then replace a certain character with the first letter of the service I was accessing. So for example, if I was trying to access Amazon and the character I'd replace was the 6th one, the password for that service would be <code>!xlk-ad15j-hjk</code>.</p>\n<p>This setup isn't very secure (but it is still better than using the same password everywhere). It works until it doesn't. The first issue I ran into with this is that some services had extra password requirements like needing at least one capital letter or a number. The second issue is that this leads to password re-use for all services with the same starting character in their name. And finally, some services do require that you change your password regularly (more on that later), so I'd have to remember which accounts had <em>updated</em> passwords, generally by adding a <code>1</code> at the end of it.</p>\n<p>It is possible to get extra creative with this, and I did for a while, running a bash script to generate passwords on the fly by taking in the name of the service and hashing it. A storage-less password manager, if you will. But this turned out to be pretty inconvenient, especially since this is a solved problem.</p>\n<p>Enter the password manager.</p>\n<p>Keeping passwords and 2FA recovery codes safe is easy, you just need to decide on a tool, and stick with it.</p>\n<p>There are lots of great password managers out there like Dashlane, 1Password, or Bitwarden. I'm quite partial to Apple's built-in password manager because it syncs between my devices and integrates seamlessly with Apple's biometric authentication, making every login a simple fingerprint scan.</p>\n<p>Once you've chosen a password manager, you set a master password. This is the most important password so it is never to be forgotten or written down. I find using a passphrase is both higher entropy, and easier to remember than a password. Here's a <a href=\"https://xkcd.com/936/\" target=\"_blank\">classic XKCD comic</a> explaining password entropy.</p>\n<p>Now, every time you log into a service or use the forgot password flow, ensure that you put the password into your password manager, or generate a brand new password using the password manager's built-in generator. You'll only need to do this once per service, and from then on you can use the password manager to login to that service. Another reason I like Apple's password ecosystem is that a lot of this is done by default, without having to manually copy and paste passwords. Password managers do have browser extensions and mobile apps to make this easier across devices. Use them.</p>\n<p>Your password manager will also generally alert you of password re-use. If the password has been used multiple times, I'd recommend going and updating all of the accounts. The best way to think about this is that at some point the password will be leaked. Which accounts are you comfortable having compromised? Naturally something like banking or email needs to be updated as a priority, but if it's for a background removal tool...actually, still update it. Why not?</p>\n<p>Let's talk about 2-factor authentication (2FA), also known as  multi-factor authentication (MFA). While there is a slight difference between 2FA and MFA (hint: it's the number of factors), I'll be using them interchangeably here.</p>\n<p>MFA is a security measure to prevent access to an account where the login details have been compromised. Generally if you have good password hygiene and are vigilant about phishing attacks, this is unlikely. However, for high priority accounts it is a necessary security step.</p>\n<p>SMS 2FA tends to get a lot of hate, justifiably, due to sim-swap attacks. However, the reason many retail services (like banks) still use SMS instead of <a href=\"https://en.wikipedia.org/wiki/Time-based_one-time_password\" target=\"_blank\">TOTP authentication</a> is due to retail customers not having good recovery code storage and backup. If you use Google Authenticator or a similar tool, and do not back up your codes, losing your device is an effective way to lock yourself out of your account. Banks rely on the assumption that you'll reclaim your mobile number, whereas the same cannot be said about lost TOTP recovery codes.</p>\n<p>That all being said, if you have the option to use a TOTP authentication code instead of SMS or email 2FA, I highly recommend you do that. You'll just need to ensure you've backed up your recovery codes.</p>\n<p>I'm going to say something quite controversial here: I think it's okay to back up your recovery codes in your password manager.</p>\n<p>While it does mean that if your password manager is compromised, then all of your accounts (including the ones protected by MFA) are exposed, MFA is generally there to protect against compromised login details and not against a compromised password manager. If your password manager is hacked...I'm sorry. You're going to have a tough time.</p>\n<p>At the end of the day, the best tools are the tools you use. I like how Apple's 2FA codes also populate with biometric authentication, removing the need for me to go and find my phone (which I generally leave in another room while I'm working).</p>\n<p>Some side notes:</p>\n<ul>\n<li>Changing passwords regularly, especially as a requirement, leads to worse and not better security. Mostly because users don't use password managers correctly, and end up defaulting to a rotation of memorised passwords. The act of changing a password is also a well known phishing attack vector.</li>\n<li>Ensure you take a regular (encrypted!) backups of your passwords to store offsite, just in case you lose access to your password manager, however unlikely.</li>\n<li>Hardware authentication devices are neat, but most people don't work on systems important enough to warrant that level of security. There will always be a trade-off between usability and security, and more security isn't always better. I once misplaced a Yubikey and all of the accounts I used it on had TOTP authentication as a redundancy, so I guess it didn't add much extra security?</li>\n<li>Developers, please stop logging people out of their accounts! There is very little to gain from having short sessions. It's annoying and leads to users forgetting and needing to recover their passwords more often.</li>\n</ul>\n<p>As frustrating as it is, it's up to us developers to account for human folly and bad password hygiene. I'd love to create a webservice that only has a username and password with no need for an email address. But I know that I'll receive regular emails asking about account recovery due to a lost or forgotten password.</p>\n<p>tldr; Get a password manager, and use it exclusively. Don't try to remember passwords. It's easier and more secure this way. Having good password hygiene makes you significantly less likely to wake up one day with your bank account drained.</p>\n<p>As the old joke goes: If you're running away from a bear, you don't need to be faster than a bear, just faster than everyone else.</p>"
            ],
            "link": "https://herman.bearblog.dev/digital-hygiene-passwords/",
            "publishedAt": "2025-08-13",
            "source": "Herman Martinus",
            "summary": "<p><em>This is part 3 of a 3 part series on digital hygiene. I suggest starting at <a href=\"https://herman.bearblog.dev/digital-hygiene-emails/\">part 1</a>.</em></p> <p>Whenever I watch <em>heist</em> movies, I always roll my eyes at the \"hacker\" character. They can consistently hack building's camera system; or download the contents of a target's phone for use later in the heist. They also manage to hack the bank, which questions the need for a heist in the first place.</p> <p>While there are real-world programatic attack vectors that can be exploited, they're generally opportunistic. When a new vulnerability has been discovered, nefarious actors try to exploit it at scale before it’s patched. The chances of finding and executing a \"hack\" on the spot (via bluetooth or something equally ridiculous) is highly unlikely.</p> <p>Although, I digress. The most common vulnerability is significantly more boring. It's compromised passwords. These can be stolen through social engineering, like phishing, that exposes account details; but it's also likely exposed through a data leak, where a service hasn't stored passwords securely, and thousands of email+password pairs are stolen. These authentication details are then systematically tested on a bunch of other services in the hopes that some people have re-used their passwords, and thereby gain",
            "title": "Digital hygiene: Passwords"
        },
        {
            "content": [],
            "link": "https://bernsteinbear.com/blog/liveness-datalog/?utm_source=rss",
            "publishedAt": "2025-08-13",
            "source": "Max Bernstein",
            "summary": "<p>After publishing <a href=\"https://bernsteinbear.com/blog/linear-scan\">Linear scan register allocation on SSA</a>, I had a nice call with <a href=\"https://waleedkhan.name\">Waleed Khan</a> where he showed me how to Datalog. He thought it might be useful to try implementing liveness analysis as a Datalog problem.</p> <p>We started off with the Wimmer2010 CFG example from that post, sketching out manually which variables were live out of each block: R10 out of B1, R12 out of B2, etc.</p> <figure> <figcaption> <p>The graph from Wimmer2010 has come back! Remember, we’re using block arguments instead of phis, so <code class=\"language-plaintext highlighter-rouge\">B1(R10, R11)</code> defines R10 and R11 before the first instruction in B1.</p> </figcaption> </figure> <p>Then we tried to formulate liveness as a Datalog relation.</p> <p>Liveness is normally (at least for me) defined in terms of two relations: live-in and live-out. Live-out is “what is needed” from all of the successors of a block and live-in is the “what is needed” summary for a block. So, in fake math notation:</p> <div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>live-out(b) = union(live-in(s) for each successor s of b) live-in(b) = (live-out(b) + used(b)) - defined(b) </code></pre></div></div> <p>where each of the component parts of that expression represent sets of variables:</p> <ul> <li><em>used(b)</em> is the set of",
            "title": "Liveness analysis with Datalog"
        },
        {
            "content": [],
            "link": "https://bernsteinbear.com/blog/linear-scan/?utm_source=rss",
            "publishedAt": "2025-08-13",
            "source": "Max Bernstein",
            "summary": "<p><em>Much of the code and education that resulted in this post happened with <a href=\"https://tenderlovemaking.com/\">Aaron Patterson</a>.</em></p> <p>The fundamental problem in register allocation is to take an IR that uses a virtual registers (as many as you like) and rewrite it to use a finite amount of physical registers and stack space<sup id=\"fnref:calendaring\"><a class=\"footnote\" href=\"https://bernsteinbear.com/feed.xml#fn:calendaring\" rel=\"footnote\">1</a></sup>.</p> <p>This is an example of a code snippet using virtual registers:</p> <div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>add R1, R2 -&gt; R3 add R1, R3 -&gt; R4 ret R4 </code></pre></div></div> <p>And here is the same example after it has been passed through a register allocator (note that Rs changed to Ps):</p> <div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>add Stack[0], P0 -&gt; P1 add Stack[0], P1 -&gt; P0 ret </code></pre></div></div> <p>Each virtual register was assigned a physical place: R1 to the stack, R2 to P0, R3 to P1, and R4 <em>also</em> to P0 (since we weren’t using R2 anymore).</p> <p>People use register allocators like they use garbage collectors: it’s an abstraction that can manage your resources for you, maybe with some cost. When writing the back-end of a compiler, it’s probably much easier to have a separate register-allocator-in-a-box than manually managing variable lifetimes while also considering all of your different",
            "title": "Linear scan register allocation on SSA"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/dictator-book-club-mussolini-on-fascism\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/dictator-book-club-mussolini-on-fascism",
            "publishedAt": "2025-08-13",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/dictator-book-club-mussolini-on-fascism\"> Read more </a> </p>",
            "title": "Dictator Book Club: Mussolini On Fascism"
        },
        {
            "content": [
                "<p>What do I ultimately make of all the new versions of GPT-5?</p>\n<p>The practical offerings and how they interact continues to change by the day. I expect more to come. It will take a while for things to settle down.</p>\n<p>I’ll start with the central takeaways and how I select models right now, then go through the type and various questions in detail.</p>\n\n\n<h4 class=\"wp-block-heading\">Table of Contents</h4>\n\n\n<ol>\n<li><a href=\"https://thezvi.substack.com/i/170467419/central-takeaways\">Central Takeaways.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/choose-your-fighter\">Choose Your Fighter.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/official-hype\">Official Hype.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/chart-crime\">Chart Crime.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/model-crime\">Model Crime.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/future-plans-for-openai-s-compute\">Future Plans For OpenAI’s Compute.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/rate-limitations\">Rate Limitations.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/the-routing-options-expand\">The Routing Options Expand.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/system-prompt\">System Prompt.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/on-writing\">On Writing.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/leading-the-witness\">Leading The Witness.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/hallucinations-are-down\">Hallucinations Are Down.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/best-of-all-possible-worlds\">Best Of All Possible Worlds?.</a>\n<div>\n\n\n<span id=\"more-24648\"></span>\n\n\n</div>\n</li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/timelines\">Timelines.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/sycophancy-will-continue-because-it-improves-morale\">Sycophancy Will Continue Because It Improves Morale.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/gaslighting-will-continue\">Gaslighting Will Continue.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/going-pro\">Going Pro.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/170467419/going-forward\">Going Forward.</a></li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Central Takeaways</h4>\n\n\n<p>My central takes, up front, first the practical:</p>\n<ol>\n<li>GPT-5-Pro is a substantial upgrade over o3-Pro.</li>\n<li>GPT-5-Thinking is a substantial upgrade over o3.\n<ol>\n<li>The most important gain is reduced hallucinations.</li>\n<li>The other big gain is an improvement in writing.</li>\n<li>GPT-5-Thinking should win substantially more use cases than o3 did.</li>\n</ol>\n</li>\n<li>GPT-5, aka GPT-5-Fast, is not much better than GPT-4o aside from the personality and sycophancy changes, and the sycophancy still isn’t great.</li>\n<li>GPT-5-Auto seems like a poor product unless you are on the free tier.</li>\n<li>Thus, you still have to manually pick the right model every time.</li>\n<li>Opus 4.1 and Sonnet 4 still have a role to play in your chat needs.</li>\n<li>GPT-5 and Opus 4.1 are both plausible choices for coding.</li>\n</ol>\n<p>On the bigger picture:</p>\n<ol>\n<li>GPT-5 is a pretty big advance over GPT-4, but it happened in stages.</li>\n<li>GPT-5 is not a large increase in base capabilities and intelligence.\n<ol>\n<li>GPT-5 is about speed, efficiency, UI, usefulness and reduced hallucinations.</li>\n</ol>\n</li>\n<li>We are disappointed in this release because of high expectations and hype.</li>\n<li>That was largely due to it being called GPT-5 and what that implied.</li>\n<li>We were also confused because 4+ models were released at once.</li>\n<li>OpenAI botched the rollout in multiple ways, update accordingly.</li>\n<li>OpenAI uses more hype for unimpressive things, update accordingly.</li>\n<li>Remember that we are right on track on the METR graph.</li>\n<li>Timelines for AGI or superintelligence should adjust somewhat, especially in cutting a bunch of probability out of things happening quickly, but many people are overreacting on this front quite a bit, usually in a ‘this confirms all of my priors’ kind of way, often with supreme unearned overconfidence.</li>\n<li>This is not OpenAI’s most intelligent model. Keep that in mind.</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Choose Your Fighter</h4>\n\n\n<p>This is a distillation of consensus thinking on the new practical equilibrium:</p>\n<blockquote><p><a href=\"https://x.com/WilKranz/status/1955150031616426377\">William Kranz:</a> my unfortunate feedback is non-thinking Opus is smarter than non-thinking GPT-5. there are nuances i can&#8217;t get GPT-5 to grasp even when i lampshade them, it just steamrolls over them with the pattern matching idiot ball. meanwhile Opus gets them in one shot.</p>\n<p>Roon: that seems right, but i&#8217;m guessing 5-thinking is better than opus-thinking.</p></blockquote>\n<p>This seems mostly right. I prefer to use Opus if Opus is enough thinking for the job, but OpenAI currently scales more time and compute better than Anthropic does.</p>\n<p>So, what do we do going forward to get the most out of AI on a given question?</p>\n<p>Here’s how I think about it: There are four ‘speed tiers’:</p>\n<ol>\n<li>Quick and easy. You use this for trivial easy questions and ‘just chatting.’\n<ol>\n<li>Matter of taste, GPT-5 is good here, Sonnet 4 is good here, Gemini Flash, etc.</li>\n<li>Most of the time you are wrong to be here and should be at #2 or #3 instead.</li>\n</ol>\n</li>\n<li>Brief thought. Not instant, not minutes.\n<ol>\n<li>Use primarily Claude Opus 4.1.</li>\n<li>We just got GPT-5-Thinking-Mini in ChatGPT, maybe it’s good for this?</li>\n</ol>\n</li>\n<li>Moderate thought. You can wait a few minutes.\n<ol>\n<li>Use primarily GPT-5-Thinking and back it up with Claude Opus 4.1.</li>\n<li>If you want a third opinion, use AI Studio for Gemini Pro 2.5.</li>\n</ol>\n</li>\n<li>Extensive thought. You can wait for a while.\n<ol>\n<li>Use GPT-5-Pro and back it up with Opus in Research mode.</li>\n<li>Consider also firing up Gemini Deep Research or Deep Thinking, etc, and anything else you have handy cause why not. Compare and contrast.</li>\n<li>You need to actually go do something else and then come back later.</li>\n</ol>\n</li>\n</ol>\n<p>What about coding?</p>\n<p>Here I don’t know because I’ve been too busy to code anything since before Opus 4, nor have I tried out Claude Code.</p>\n<p>Also the situation continues to change rapidly. <a href=\"https://x.com/ryolu_/status/1955413565382463682\">OpenAI claims that they’ve doubled speed for GPT-5 inside cursor as of last night</a> via superior caching and latency, whereas many of the complaints about GPT-5 in Cursor was previously that it was too slow. You’ll need to try out various options and see what works better for you (and you might also think about who you want to support, if it is close).</p>\n<p>We can then contrast that with the Official Hype.</p>\n\n\n<h4 class=\"wp-block-heading\">Official Hype</h4>\n\n\n<p>That’s not automatically a knock. Hypers gotta hype. It’s worth seeing choice of hype.</p>\n<p>Here was Sam Altman live-tweeting the livestream, a much better alternative way to actually watch the livestream, which I converted to bullet points, and reordered a bit for logical coherence but otherwise preserving to give a sense of his vibe. Hype!</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1953515348730294760\">Sam Altman</a>:</p>\n<ol>\n<li>GPT-5 in an integrated model, meaning no more model switcher and it decides when it needs to think harder or not.</li>\n<li>It is very smart, intuitive, and fast.</li>\n<li>It is available to everyone, including the free tier, w/reasoning!</li>\n<li>Evals aren&#8217;t the most important thing&#8211;the most important thing is how useful we think the model will be&#8211;but it does well on evals.\n<ol>\n<li>For example, a new high on SWE-bench and many other metrics. It is by far our most reliable and factual model ever.</li>\n</ol>\n</li>\n<li>Rolling out today for free, plus, pro, and team users. next week to enterprise and edu. making this available in the free tier is a big deal to us; PhD-level intelligence for everyone!\n<ol>\n<li>Plus users get much higher rate limits.</li>\n</ol>\n</li>\n<li>Pro users get GPT-5 pro; really smart!</li>\n<li>demo time: GPT-5 can make something interactive to explain complex concepts like the bernoulli effect to you, churning out hundreds of lines of code in a couple of minutes.</li>\n<li>GPT-5 is much better at writing! <a href=\"https://x.com/sama/status/1953506023391592494\">for example, here is GPT-4o writing a eulogy for our previous models</a> (which we are sunsetting) vs GPT-5.</li>\n<li>GPT-5 is good at writing software. <a href=\"https://x.com/sama/status/1953506854392541224\">Here it is making a web app to to learn french</a>, with feature requests including a snake-like game with a mouse and cheese and french words.</li>\n<li>Next up: upgraded voice mode! Much more natural and smarter.\n<ol>\n<li>Free users now can chat for hours, and plus users nearly unlimited.</li>\n<li>Works well with study mode, and lots of other things.</li>\n</ol>\n</li>\n<li>Personalization!\n<ol>\n<li>A little fun one: you can now customize the color of your chats.</li>\n<li>Research preview of personalities: choose different ones that match the style you like.</li>\n<li>Memory getting better.</li>\n<li>Connect other services like gmail and google calendar for better responses.</li>\n</ol>\n</li>\n<li>Introducing safe completions. A new way to maximize utility while still respecting safety boundaries. Should be much less annoying than previous refusals.</li>\n<li>Seb talking about synthetic data as a new way to make better models! Excited for much more to come.</li>\n<li>GPT-5 much better at health queries, which is one of the biggest categories of ChatGPT usage. hopeful that it will provide real service to people.</li>\n<li>These models are really good at coding!</li>\n<li>3 new models in the API: GPT-5, GPT-5 Mini, GPT-5 Nano.\n<ol>\n<li>New &#8216;minimal&#8217; reasoning mode, custom tools, changes to structured outputs, tool call preambles, verbosity parameter, and more coming.</li>\n</ol>\n</li>\n<li>Not just good at software, good at agentic tasks across the board. Also great at long context performance.</li>\n<li>GPT-5 can do very complex software engineering tasks in practice, well beyond vibe coding.\n<ol>\n<li>Model creates a finance dashboard in 5 minutes that devs estimate would have taken many hours.</li>\n</ol>\n</li>\n<li>Now, <a href=\"https://x.com/mntruell\">@mntruell</a> joining to talk about cursor&#8217;s experience with GPT-5. notes that GPT-5 is incredibly smart but does not compromise on ease of use for pair programming.</li>\n<li>GPT-5 is the best technology for businesses to build on. more than 5 million businesses are using openai; GPT-5 will be a step-change for them.</li>\n<li>Good new on pricing!\n<ol>\n<li>$1.25/$10 for GPT-5, $0.25/$2 for GPT-5-mini, $0.05/$0.40 for nano.</li>\n</ol>\n</li>\n<li>Ok now the most important part:\n<ol>\n<li>&#8220;We are about understanding this miraculous technology called deep learning.&#8221;</li>\n<li>&#8220;This is a work of passion.&#8221;</li>\n<li>&#8220;I want to to recognize and deeply thank the team at openai&#8221;</li>\n<li>&#8220;Early glimpses of technology that will go much further.&#8221;</li>\n<li>&#8220;We&#8217;ll get back to scaling.&#8221;</li>\n</ol>\n</li>\n</ol>\n</blockquote>\n<p>I would summarize the meaningful parts of the pitch as:</p>\n<ol>\n<li>It’s a good model, sir.</li>\n<li>It’s got SoTA (state of the art) benchmarks.</li>\n<li>It’s highly useful, more than the benchmarks would suggest.</li>\n<li>It’s fast.</li>\n<li>Our price cheap &#8211; free users get it, $1.25/$10 on the API.</li>\n<li>It’s good at coding, writing, health queries, you name it.</li>\n<li>It’s integrated, routing you to the right level of thinking.</li>\n<li>When it refuses it tries to be as helpful as possible.</li>\n</ol>\n<p>Altman is careful not to mention the competition, focusing on things being good. He also doesn’t mention the lack of sycophancy, plausibly because ‘regular’ customers don’t understand why sycophancy is bad, actually, and also he doesn’t want to draw attention to that having been a problem.</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1953529799219319205\">Altman</a>: when you get access to gpt-5, try a message like &#8220;use beatbot to make a sick beat to celebrate gpt-5&#8221;.</p>\n<p>it&#8217;s a nice preview of what we think this will be like as AI starts to generate its own UX and interfaces get more dynamic.</p>\n<p>it&#8217;s cool that you can interact with the synthesizer directly or ask chatgpt to make changes!</p></blockquote>\n<p><a href=\"https://x.com/Simeon_Cps/status/1953556635084808680\">I have noticed the same pattern that Siemon does here.</a> When a release is impressive relative to expectations, Altman tends to downplay it. When a release is unimpressive, that’s when he tends to bring the hype.</p>\n<p><a href=\"https://www.reddit.com/r/ChatGPT/comments/1mkae1l/gpt5_ama_with_openais_sam_altman_and_some_of_the/\">From their Reddit Q&amp;A that mostly didn’t tell us anything</a>:</p>\n<blockquote><p>Q: Explain simply how GPT-5 is better than GPT-4.</p>\n<p>Eric Mitchell (OpenAI): gpt-5 is a huge improvement over gpt-4 in a few key areas: it thinks better (reasoning), writes better (creativity), follows instructions more closely and is more aligned to user intent.</p></blockquote>\n<p>Again note what isn’t listed here.</p>\n<p>Here’s more widely viewed hype that knows what to emphasize:</p>\n<blockquote><p><a href=\"https://x.com/ElaineYaLe6/status/1953607005144506454\">Elaine Ya Le</a> (OpenAI): GPT-5 is here! <img alt=\"🚀\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f680.png\" style=\"height: 1em;\" /></p>\n<p>For the first time, users don’t have to choose between models — or even think about model names. Just one seamless, unified experience.</p>\n<p>It’s also the first time frontier intelligence is available to everyone, including free users!</p>\n<p>GPT-5 sets new highs across academic, coding, and multimodal reasoning — and is our most trustworthy, accurate model yet. Faster, more reliable, and safer than ever.</p>\n<p>All in a seamless, unified experience with the tools you already love.</p>\n<p>Fortunate to have led the effort to make GPT-5 a truly unified experience, and thrilled to have helped bring this milestone to life with an amazing team!</p></blockquote>\n<p>Notice the focus on trustworthy, accurate and unified. Yes, she talks about it setting new highs across the board, but you can tell that’s an afterthought. This is about refining the experience.</p>\n<p>Here’s some more hype along similar lines that feels helpful:</p>\n<blockquote><p><a href=\"https://x.com/christinahkim/status/1953514987424821386\">Christina Kim</a> (OpenAI): We&#8217;re introducing GPT-5.</p>\n<p>The evals are SOTA, but the real story is usefulness.</p>\n<p>It helps with what people care about&#8211; shipping code, creative writing, and navigating health info&#8211; with more steadiness and less friction.</p>\n<p>We also cut hallucinations. It&#8217;s better calibrated, says &#8220;I don&#8217;t know,&#8221; separates facts from guesses, and can ground answers with citations when you want. And it&#8217;s also a good sparring partner <img alt=\"🙃\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f643.png\" style=\"height: 1em;\" /></p>\n<p>I&#8217;ve been inspired seeing the care, passion, and level of detail from the team. Excited to see what people do with these very smart models</p>\n<p>tweet co-authored by gpt5 ;)</p></blockquote>\n<p>That last line worries me a bit.</p>\n<blockquote><p>Miles Brundage: Was wondering lol.</p></blockquote>\n<p>That’s the pitch.</p>\n<p>GPT-5 isn’t a lot smarter. GPT-5 <a href=\"https://www.youtube.com/watch?v=-GiCfqQEEwk&amp;ab_channel=ParticleMen\">helps you do the dumb things you gotta do</a>.</p>\n<p>Still huge, as they say, if true.</p>\n<p>Here’s hype that is targeted at the Anthropic customers out there:</p>\n<blockquote><p><a href=\"https://x.com/aidan_mclau/status/1953511599366455687\">Aiden McLaughlin</a> (OpenAI): gpt-5 fast facts:</p>\n<ol>\n<li>Hits sota on pretty much every eval</li>\n<li>Way better than claude 4.1 opus at swe</li>\n<li>&gt;5× cheaper than opus</li>\n<li>&gt;40% cheaper than sonnet</li>\n<li>Best writing quality of any model</li>\n<li>Way less sycophantic</li>\n</ol>\n</blockquote>\n<p>I notice the ‘way less sycophantic’ does not answer the goose’s question ‘<a href=\"https://thezvi.substack.com/p/gpt-4o-is-an-absurd-sycophant\">than what?</a>’</p>\n<p>This is a direct pitch to the coders, saying that GPT-5 is better than Opus or Sonnet, and you should switch. Unlike the other claims, them’s fighting words.</p>\n<p>The words do not seem to be true.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!TJgX!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F89299795-8eee-43b8-9f2a-6a30aa3a283e_1042x421.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>There are a lot of ways to quibble on details but this is a resounding victory for Opus.</p>\n<p>There’s no way to reconcile that with ‘way better than claude 4.1 opus at swe.’</p>\n<p>We also have celebratory posts, which is a great tradition.</p>\n<blockquote><p><a href=\"https://x.com/rapha_gl/status/1953510318048784803\">Rapha</a> (OpenAI): GPT-5 is proof that synthetic data just keeps working! And that OpenAI has the best synthetic data team in the world <img alt=\"👁\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f441.png\" style=\"height: 1em;\" />@SebastienBubeck the team has our eyeballs on you! <img alt=\"🙌\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f64c.png\" style=\"height: 1em;\" /></p>\n<p>I really encourage everyone to log on and talk to it. It is so, so smart, and fast as always! (and were just getting started!)</p>\n<p><a href=\"https://x.com/SebastienBubeck/status/1953512951446647059\">Sebastien Bubeck</a> (OpenAI): Awwww, working daily with you guys is the highlight of my career, and I have really high hopes that we have barely gotten started! <img alt=\"💜\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f49c.png\" style=\"height: 1em;\" /></p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!v_Qe!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fda01dced-4b4a-4abb-b5b8-250a22f847ab_1110x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I view GPT-5 as both evidence that synthetic data can work in some ways (such as the lower hallucination rates) and also evidence that synthetic data is falling short on general intelligence.</p>\n<p>Roon is different. His hype is from the heart, and attempts to create clarity.</p>\n<blockquote><p><a href=\"https://x.com/tszzl/status/1953608271480393896\">Roon</a>: we&#8217;ve been testing some new methods for improving writing quality. you may have seen @sama&#8217;s demo in late march; GPT-5-thinking uses similar ideas</p>\n<p>it doesn&#8217;t make a lot of sense to talk about better writing or worse writing and not really worth the debate. i think the model writing is interesting, novel, highly controllable relative to what i&#8217;ve seen before, and is a pretty neat tool for people to do some interactive fiction, to use as a beta reader, and for collaborating on all kinds of projects.</p>\n<p>the effect is most dramatic if you open a new 5-thinking chat and try any sort of writing request</p>\n<p>for quite some time i&#8217;ve wanted to let people feel the agi magic I felt playing with GPT-3 the weekend i got access in 2020, when i let that raw, chaotic base model auto-complete various movie scripts and oddball stories my friends and I had written for ~48 hours straight. it felt like it was reading my mind, understood way too much about me, mirrored our humor alarmingly well. it was uncomfortable, and it was art</p>\n<p>base model creativity is quite unwieldy to control and ultimately only tiny percents of even ai enthusiasts will ever try it (same w the backrooms jailbreaking that some of you love). the dream since the instruct days has been having a finetuned model that retains the top-end of creative capabilities while still easily steerable</p>\n<p>all reasoning models to date seem to tell when they&#8217;re being asked a hard math or code question and will think for quite some time, and otherwise spit out an answer immediately, which is annoying and reflects the fact that they&#8217;re not taking the qualitative requests seriously enough. i think this is our first model that really shows promise at not doing that and may think for quite some time on a writing request</p>\n<p>it is overcooked in certain ways (post training is quite difficult) but i think you&#8217;ll still like it <img alt=\"😇\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f607.png\" style=\"height: 1em;\" /></p>\n<p>tldr only GPT-5-thinking has the real writing improvements and confusingly it doesn’t always auto switch to this so manually switch and try it!</p>\n<p>ok apparently if you say “think harder” it gets even better.</p></blockquote>\n<p>One particular piece of hype from the livestream is worth noting, that they are continuing to talk about approaching ‘a recursive self-improvement loop.’</p>\n<p>I mean, at sufficient strength this is yikes, indeed the maximum yikes thing.</p>\n<blockquote><p><a href=\"https://x.com/ai_ctrl/status/1953512828549173725\">ControlAI</a>: OpenAI&#8217;s Sebastien Bubeck says the methods OpenAI used to train GPT-5 &#8220;foreshadows a recursive self-improvement loop&#8221;.</p>\n<p><a href=\"https://x.com/sjgadler/status/1953570018190668148\">Steven Adler</a>: I&#8217;m surprised that OpenAI Comms would approve this:</p>\n<p>GPT-5 &#8220;foreshadows a recursive self-improvement loop&#8221;</p>\n<p>In OpenAI&#8217;s Preparedness Framework, recursive self-improvement is a Critical risk (if at a certain rate), which would call to &#8220;halt further development&#8221;</p>\n<p>To be clear, it sounds like Sebastien isn&#8217;t describing an especially fast loop. He&#8217;s also talking about foreshadowing, not being here today per se</p>\n<p>I was still surprised OpenAI would use this term about its AI though. Then I realized it&#8217;s also used in &#8220;The Gentle Singularity&#8221;</p></blockquote>\n<p>Then again, stated this way it is likely something much weaker, more hype?</p>\n<p><a href=\"https://www.bloomberg.com/news/articles/2025-08-07/openai-launches-more-powerful-gpt-5-model-aimed-at-better-coding\">Here is Bloomberg’s coverage from Rachel Metz</a>, essentially a puff piece reporting moderated versions of OpenAI’s hype.</p>\n\n\n<h4 class=\"wp-block-heading\">Chart Crime</h4>\n\n\n<p><a href=\"https://x.com/sama/status/1953513280594751495\">I mean wow just wow</a>, this was from the livestream.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!GxKx!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8a660ce9-94bb-4439-9dab-33d0bfa0fe37_1045x1280.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>And we also have this:</p>\n<blockquote><p><a href=\"https://x.com/lefthanddraft/status/1953514768884806128\">Wyat Walls:</a> OpenAI: we noticed significantly less deceptive behavior compared to our prior frontier reasoning model, OpenAI o3.</p>\n<p>Looks like actual figure [on the left below] should be ~17. What is going on?! Did GPT-5 do this presentation?</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!39f_!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F306fd917-0df4-4449-ad30-e0f3a7dbb89c_1026x624.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This is not a chart crime, but it is still another presentation error.</p>\n<blockquote><p><a href=\"https://x.com/nearcyan/status/1953562517550379515\">Near Cyan</a>: this image is a work of art, you guys just dont get it. they used the deceptive coding model to make the charts. so it&#8217;s self-referential humor just like my account.</p>\n<p><a href=\"https://x.com/JulesRobins/status/1953528572360167543\">Jules Robins</a>: They (perhaps inadvertently) include an alignment failure by default demonstration too: the Jumping Ball Runner game allows any number of jumps in mid-air so you can get an arbitrary score. That&#8217;s despite the human assumptions and the similar games in training data avoiding this.</p></blockquote>\n<p>And another:</p>\n<blockquote><p>Horace He: Not a great look that after presenting GPT5&#8217;s reduced hallucinations, their first example repeats a common error of how plane wings generate lift (&#8220;equal transit theory&#8221;).</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!XQDg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9976c60f-b839-47d8-bbdd-0f4f8d0a9524_1444x790.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Qt3R!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F581cd0c5-78fb-4e50-98b9-dd755526579a_618x465.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Francois Fleuret: Aka &#8220;as demonstrated in airshow, aircrafts can fly upside-down alright.&#8221;</p>\n<p>Chris: It&#8217;s funny because the *whole presentation* was effectively filled with little holes like this. I don&#8217;t know if it was just rushed, or what.</p>\n<p>Nick McGreivy: has anyone else noticed that the *very first* demo in the GPT-5 release just&#8230; doesn&#8217;t work?</p>\n<p>Not a great look that the first demo in the press release has a bug that allows you to jump forever.</p></blockquote>\n<p>I think L is overreacting here, but I do think that when details get messed up that does tell you a lot.</p>\n<p><a href=\"https://www.reddit.com/r/interestingasfuck/comments/1g7mi2g/van_halens_brown_mms_contract_clause_there_will/\">One recalls the famous Van Halen Brown M&amp;Ms contract clause</a>: “There will be no brown M&amp;M’s in the backstage area, upon pain of forfeiture of the show, with full compensation.” Because if the venue didn’t successfully execute on sorting out the brown M&amp;Ms then they knew they’d messed up other things and the venue probably wasn’t safe for their equipment.</p>\n<p>Then there was a rather serious actual error:</p>\n<blockquote><p><a href=\"https://x.com/tszzl/status/1953638161034400253\">Lisan al Gaib</a>: it&#8217;s ass even when I set it to Thinking. I want to cry.</p>\n<p>Roon: btw model auto switcher is apparently broken which is why it’s not routing you correctly. will be fixed soon.</p>\n<p>Sam Altman (August 8): GPT-5 will seem smarter starting today. Yesterday, the autoswitcher broke and was out of commission for a chunk of the day, and the result was GPT-5 seemed way dumber.</p>\n<p>Also, we are making some interventions to how the decision boundary works that should help you get the right model more often.</p></blockquote>\n<p>OpenAI definitely did not sort out their brown M&amp;Ms on this one.</p>\n<blockquote><p><a href=\"https://thezvi.wordpress.com/2025/08/07/ai-128-four-hours-until-probably-not-the-apocalypse/#comment-29519\">L</a>: As someone who used to be a professional presenter of sorts, and then a professional manager of elite presenters… people who screw up charts for high-impact presentations cannot be trusted in other aspects. Neither can their organizational leaders.</p>\n<p>OpenAI’s shitty GPT-5 charts tells me they’ve lost the plot and can’t be trusted.</p>\n<p>I used to think it was simply a values mis-match… that they firmly held a belief that they needn’t act like normal humans because they could be excellent at what they were doing. But… they can’t, even when it matters most. Nor can their leaders apparently be bothered to stress the details.</p>\n<p>My p-doom just went up a solid 10-15% (from very low), because I don’t think these rich genius kids have the requisite leadership traits or stalwartness to avoid disaster.</p>\n<p>Just an observation from someone who has paid very little first-hand attention to OpenAI, but decided to interestedly watch a reveal after the CEO tweeted a Death Star.</p></blockquote>\n<p>I would feel better about OpenAI if they made a lot less of these types of mistakes. It does not bode well for when they have to manage the development and release of AGI or superintelligence.</p>\n\n\n<h4 class=\"wp-block-heading\">Model Crime</h4>\n\n\n<p>Many people are saying:</p>\n<blockquote><p><a href=\"https://x.com/npceo_/status/1953505984174829965\">Harvey Michael Pratt</a>: “with GPT-5 we’re deprecating all of our old models”</p>\n<p>wait WHAT</p>\n<p>cool obituary but was missing:</p>\n<ol>\n<li>time of death</li>\n<li>cost of replacement</li>\n<li>a clear motive</li>\n</ol>\n</blockquote>\n<p>The supposed motive is to clear up confusion. One model, GPT-5, that most users query all the time. Don’t confuse people with different options, and it is cheaper not to have to support them. Besides, GPT-5 is strictly better, right?</p>\n<p>Under heavy protest, <a href=\"https://x.com/sama/status/1953893841381273969\">Altman agreed to give Plus users back GPT-4o if they want it</a>, for the time being.</p>\n\n\n<h4 class=\"wp-block-heading\">Future Plans For OpenAI’s Compute</h4>\n\n\n<p>I find it strange to prioritize allocating compute to the free ChatGPT tier if there are customers who want to pay to use that compute in the API?</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1955077002945585333\">Sam Altman</a>: Here is how we are prioritizing compute over the next couple of months in light of the increased demand from GPT-5:</p>\n<p>1. We will first make sure that current paying ChatGPT users get more total usage than they did before GPT-5.</p>\n<p>2. We will then prioritize API demand up to the currently allocated capacity and commitments we&#8217;ve made to customers. (For a rough sense, we can support about an additional ~30% new API growth from where we are today with this capacity.)</p>\n<p>3. We will then increase the quality of the free tier of ChatGPT.</p>\n<p>4. We will then prioritize new API demand.</p>\n<p>We are ~doubling our compute fleet over the next 5 months (!) so this situation should get better.</p></blockquote>\n<p>I notice that one could indefinitely improve the free tier of ChatGPT, so the question is how much one intends to improve it.</p>\n<p>The other thing that is missing here is using compute to advance capabilities. Sounds great to me, if it correctly indicates that they don’t know how to get much out of scaling up compute use in their research at this time. Of course they could also simply not be talking about that and pretending that part of compute isn’t fungible, in order to make this sound better.</p>\n<p>There are various ways OpenAI could go. <a href=\"https://stratechery.com/2025/chatgpt-5-product-trade-offs-personality-and-model-upgrades/?access_token=eyJhbGciOiJSUzI1NiIsImtpZCI6InN0cmF0ZWNoZXJ5LnBhc3Nwb3J0Lm9ubGluZSIsInR5cCI6IkpXVCJ9.eyJhdWQiOiJzdHJhdGVjaGVyeS5wYXNzcG9ydC5vbmxpbmUiLCJhenAiOiJIS0xjUzREd1Nod1AyWURLYmZQV00xIiwiZW50Ijp7InVyaSI6WyJodHRwczovL3N0cmF0ZWNoZXJ5LmNvbS8yMDI1L2NoYXRncHQtNS1wcm9kdWN0LXRyYWRlLW9mZnMtcGVyc29uYWxpdHktYW5kLW1vZGVsLXVwZ3JhZGVzLyJdfSwiZXhwIjoxNzU3Njc1Njc4LCJpYXQiOjE3NTUwODM2NzgsImlzcyI6Imh0dHBzOi8vYXBwLnBhc3Nwb3J0Lm9ubGluZS9vYXV0aCIsInNjb3BlIjoiZmVlZDpyZWFkIGFydGljbGU6cmVhZCBhc3NldDpyZWFkIGNhdGVnb3J5OnJlYWQgZW50aXRsZW1lbnRzIiwic3ViIjoiMDE5NjQwYTctM2NjNS03NzUzLTgzNjgtZmIyODkxMjRjZjEzIiwidXNlIjoiYWNjZXNzIn0.nFRb0foZ1B2EXQeRJ365Yci6KVxIKfGa0TdxlAQPAaGgUBKGOF1i5MqDwIyYNZGd8TML7yUPsyDisJf6F3vS8sdbl7261Dtq4PNyqG01f_KDRyJkaQoJ_qVJwQkOIWAYRKUY5gmq0Lc5CjJAJq98echptFV5y8ACaJbIH7cvRPkM62cygJxIPjS5g81gvb_rrnjJCNIv1K0RH5oMgnNWI3bj0UjVtIBihXmT2flqMXaYQGhu0w-CGiHtfpHZNvrLRceVVjPJx8KIy1rPQEbQnbe-E7nqmfRPpPpgYm3GhXiKjZnZfRqu2DP0hbXt28qUoiai0RlsEHdFqd2ptKb-pQ\">Ben Thompson continues to take the ultimate cartoon supervillain approach</a> to what OpenAI should prioritize, that the best business is the advertising platform business, so they should stop supporting this silly API entirely to pivot to consumer tech and focus on what he is totally not calling creating our new dystopian chat overlord.</p>\n<p>This of course is also based on Ben maximally not feeling any of the AGI, and treating future AI as essentially current AI with some UI updates and a trenchcoat, so all that matters is profit maximization and extracting the wallets and souls of the low end of the market the way Meta does.</p>\n<p>Which is also why he’s strongly against all the anti-enshittification changes OpenAI is making to let us pick the right tool for the job, instead wishing that the interface and options be kept maximally simple, where OpenAI takes care of which model to serve you silently behind the scenes. Better, he says, to make the decisions for the user, at least in most cases, and screw the few power users for whom that isn’t true. Give people what they ‘need’ not what they say they want, and within the $20 tier he wants to focus on the naive users.</p>\n\n\n<h4 class=\"wp-block-heading\">Rate Limitations</h4>\n\n\n<p>One reason some people have been angry was the temporary downgrade in the amount of reasoning mode you get out of a $20 subscription, which users were not reassured at the time was temporary.</p>\n<p><a href=\"https://x.com/sama/status/1953893841381273969\">OpenAI started at 200 Thinking messages a week on Plus, then doubled rate limits once the rollout was complete</a>, <a href=\"https://x.com/sama/status/1954604215340593642\">then went to 3,000 thinking queries per week</a> which is far more than I have ever used in a week. Now there is also the fallback to Thinking-Mini after that.</p>\n<p>So this generated a bunch of initial hostility (that I won’t reproduce as it is now moot), but at 3,000 I think it is fine. If you are using more than that, it’s time to upgrade, and soon you’ll also (they say) get unlimited GPT-5-mini.</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1954603417252532479\">Sam Altman</a>: the percentage of users using reasoning models each day is significantly increasing; for example, for free users we went from &lt;1% to 7%, and for plus users from 7% to 24%.</p>\n<p>i expect use of reasoning to greatly increase over time, so rate limit increases are important.</p>\n<p><a href=\"https://x.com/Miles_Brundage/status/1953868214125179088\">Miles Brundage</a>: Fortunately I have a Pro account and thus am not at risk of having the model picker taken away from me (?) but if that were not the case I might be leading protests for Pause AI [Product Changes]</p></blockquote>\n<p>It’s kind of amazing that only 7% of plus users used a reasoning model daily. Two very different worlds indeed.</p>\n\n\n<h4 class=\"wp-block-heading\">The Routing Options Expand</h4>\n\n\n<p>I don’t know that Thompson is wrong about what it should look like as a default. I am increasingly a fan of hiding complex options within settings. If you want the legacy models, you have to ask for them.</p>\n<p>It perhaps makes sense to also put the additional GPT-5 options behind a setting? That does indeed seem to be the new situation as of last night, with ‘show additional models’ as the setting option instead of ‘show legacy models’ to keep things simple.</p>\n<p>There is real risk of Paradox of Choice here, where you feel forced to ensure you are using the right model, but now there are too many options again and you’re not sure which one it is, and you throw up your hands.</p>\n<p>As of this morning, your options look like this, we now have a ‘Thinking mini’ option:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!sKQ7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F51f0d691-0db5-4272-83f4-fc3582d6c71b_500x692.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>o3 Pro is gone. This makes me abstractly sad, especially because it means you can’t compare o3 Pro to GPT-5 Pro, but I doubt anyone will miss it. o4-mini-high is also gone, again I doubt we will miss it.</p>\n<p><a href=\"https://x.com/lefthanddraft/status/1955444463511408723\">For the plus plan, GPT-4.5 is missing</a>, since it uses quite a lot of compute.</p>\n<p>I also notice the descriptions of the legacy models are gone, presumably on the theory that if you should be using the legacies then you already know what they are for.</p>\n<p>Thinking-mini might be good for fitting the #2 slot on the speed curve, where previously GPT-5 did not give us a good option. We’ll have to experiment to know.</p>\n\n\n<h4 class=\"wp-block-heading\">System Prompt</h4>\n\n\n<p><a href=\"https://x.com/elder_plinius/status/1953583554287562823\">Pliny is here to provide it</a>.</p>\n<p>I hadn’t looked at a ChatGPT system prompt in a while so I read it over. Things that stood out to me that I hadn’t noticed or remembered:</p>\n<ol>\n<li>They forbid it to automatically store a variety of highly useful information: Race, religion, criminal record, identification via personal attributes, political affiliation, personal attributes an in particular your exact address.\n<ol>\n<li>But you can order it to do so explicitly. So you should do that.</li>\n</ol>\n</li>\n<li>If you want canvas you probably need to ask for it explicitly.</li>\n<li>It adds a bunch of buffer time to any time period you specify, with one example being the user asks for docs modified last week so instead it gives you docs modified in the last two weeks, for last month the last two months.\n<ol>\n<li>How can this be the correct way to interpret ‘last week’ or month?</li>\n<li>For ‘meeting notes on retraining from yesterday’ it wants to go back four days.</li>\n</ol>\n</li>\n<li>It won’t search with a time period shorter than 30 days into the past, even when this is obviously wrong (e.g. the current score on the Yankees game).</li>\n</ol>\n<p><a href=\"https://x.com/lefthanddraft/status/1953876365591163026\">Wyatt Walls then offers us a different prompt for thinking mode</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">On Writing</h4>\n\n\n<p>If you are using GPT-5 for writing, definitely at least use GPT-5-Thinking, and still probably throw in at least a ‘think harder.’</p>\n<blockquote><p><a href=\"https://x.com/nsokolsky/status/1953729194191728936\">Nikita Sokolsky</a>: I wasn’t impressed with gpt-5 until I saw Roon’s tweet about -thinking being able to take the time to think about writing instead of instantly delivering slop.</p>\n<p><a href=\"https://chatgpt.com/s/t_6895ae099fdc8191b8f39a9443b72cdb\">Definitely cutting edge on a standard “write a Seinfeld episode” question</a>.</p>\n<p>Dominik Lukes: Same here. GPT-5 Thinking is the one I used for my more challenging creative writing tests, too. GPT-5 just felt too meh.</p>\n<p><a href=\"https://x.com/peterwildeford/status/1953903996420382926\">Peter Wildeford</a>: I would love to see a panel of strong writers blind judge the writing outputs (both fiction and non-fiction) from LLMs.</p>\n<p>LMArena is not good for this because the typical voter is really bad at judging good writing.</p>\n<p><a href=\"https://x.com/IlyaAbyzov/status/1954675120787825022\">Ilya Abyzov</a>: Like others, I&#8217;ve been disappointed with outputs when reasoning effort=minimal.</p>\n<p>On the plus side, I do see pretty substantially better prose &amp; humor from it when allowed to think.</p>\n<p>The &#8220;compare&#8221; tool in the playground has been really useful to isolate differences vs. past models.</p>\n<p><a href=\"https://x.com/MetacriticCap/status/1953847225727013333\">MetaCritic Capital</a>: GPT-5 Pro translating poetry verdict: 6/10 (a clear upgrade!)</p>\n<p>&#8220;There&#8217;s a clear improvement in the perception of semantic fidelity. But there are still so many forced rhymes. Additional words only to rhyme.&#8221;</p></blockquote>\n<p>My verdict on the Seinfeld episode is that it was indeed better than previous attempts I’ve seen, with some actually solid lines. It’s not good, <a href=\"https://thezvi.substack.com/p/next-level-seinfeld\">but then neither was the latest Seinfeld performance I went to</a>, which I’m not sure was better. Age comes for us all.</p>\n<p><a href=\"https://x.com/tszzl/status/1954664209234702667\">One thing it is not good at is ‘just do a joke,</a>’ you want it to Do Writing instead.</p>\n<blockquote><p><a href=\"https://x.com/tszzl/status/1953641577353818522\">Hollow Yes Man</a>: My wife and I had it write the Tiger King Musical tonight. It made some genuinely hilarious lines, stayed true to the characters, and constructed a coherent narrative. we put it into suno and got some great laughs.</p></blockquote>\n<p>We do have the <a href=\"https://x.com/LechMazur/status/1953658077300875656\">Short Story Creative Writing</a> benchmark but I don’t trust it. The holistic report is something I do trust, though:</p>\n<blockquote><p>Lech Mazur: Overall Evaluation: Strengths and Weaknesses of GPT-5 (Medium Reasoning) Across All Tasks</p>\n<p>Strengths:</p>\n<p>GPT-5 demonstrates a remarkable facility with literary craft, especially in short fiction. Its most consistent strengths are a distinctive, cohesive authorial voice and a relentless inventiveness in metaphor, imagery, and conceptual synthesis. Across all tasks, the model excels at generating original, atmospheric settings and integrating sensory detail to create immersive worlds.</p>\n<p>Its stories often display thematic ambition, weaving philosophical or emotional subtext beneath the surface narrative. The model is adept at “show, don’t tell,” using implication, action, and symbol to convey character and emotion, and it frequently achieves a high degree of cohesion—especially when tasked with integrating disparate elements or prompts.</p>\n<p>When successful, GPT-5’s stories linger, offering resonance and depth that reward close reading.</p>\n<p>Weaknesses:</p>\n<p>However, these strengths often become liabilities. The model’s stylistic maximalism—its dense, poetic, metaphor-laden prose—frequently tips into overwriting, sacrificing clarity, narrative momentum, and emotional accessibility. Abstraction and ornament sometimes obscure meaning, leaving stories airless or emotionally distant.</p>\n<p>Plot and character arc are recurrent weak points: stories may be structurally complete but lack genuine conflict, earned resolution, or psychological realism. There is a tendency to prioritize theme, atmosphere, or conceptual cleverness over dramatic stakes and human messiness. In compressed formats, GPT-5 sometimes uses brevity as an excuse for shallow execution, rushing transitions or resolving conflict too conveniently.</p>\n<p>When integrating assigned elements, the model can fall into “checklist” storytelling, failing to achieve true organic unity. Ultimately, while GPT-5’s literary ambition and originality are undeniable, its work often requires editorial pruning to balance invention with restraint, and style with substance.</p></blockquote>\n<p>Writing is notoriously hard to evaluate, and I essentially never ask LLMs for writing so I don’t have much of a comparison point. It does seem like if you use thinking mode, you can get at least get a strong version of what GPT-4.5 had here with GPT-5.</p>\n<p>The other problem with writing is you need to decide what to have it write. Even when Roon highlights writing, we get assignments like ‘<a href=\"https://x.com/AIMelGibson/status/1954769399572775357\">If Napoléon wrote a personal and intimate letter to Sydney Sweeney</a>’ or ‘<a href=\"https://x.com/tszzl/status/1954759629252227436\">You are Dostoevsky, but you are also a Snapchat fuckboi. Write to me</a>.’</p>\n<p>Or you could try this prompt?</p>\n<blockquote><p><a href=\"https://x.com/mark_k/status/1954538531092619588\">Mark Kretschmann</a>: mazing prompt for @OpenAI GPT-5, you have to try this:</p>\n<p>&#8220;From everything you know about me, write a short story with 2000 words tailored exactly to my taste. Think hard.&#8221;</p>\n<p>Enjoy, and let us know how it turned out!<img alt=\"😏\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f60f.png\" style=\"height: 1em;\" /></p></blockquote>\n<p>I did indeed try it. And yes, this seems better than previous attempts. I still didn’t successfully force myself to finish reading the story.</p>\n\n\n<h4 class=\"wp-block-heading\">Leading The Witness</h4>\n\n\n<p><a href=\"https://x.com/steveruizok/status/1954158353342492896\">Yes, you still have to be careful with the way you prompt</a> to avoid leading the witness. Sycophancy might not be at absurd levels but it definitely is never at zero.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!3yqU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3cf60ee0-e56e-4450-b897-d2d318aca8e6_680x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Qb59!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0ab1fdfd-6364-4bb1-a707-cbc5318c3fd5_680x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>You’re right to question it:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!pBN2!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F31946334-5027-44a0-b17a-21079f18a549_1020x783.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\">Hallucinations Are Down</h4>\n\n\n<p>My guess is that the improved hallucination rate from o3 (and also GPT-4o) to GPT-5 and GPT-5-thinking is the bulk of the effective improvement from GPT-5.</p>\n<blockquote><p><a href=\"https://x.com/gallabytes/status/1954622799609508103\">Gallabytes</a>: &#8220;o3 with way fewer hallucinations&#8221; is actually a very good model concept and I am glad to be able to use it. I am still a bit skeptical of the small model plus search instead of big model with big latent knowledge style, but within those constraints this is a very good model.</p></blockquote>\n<p>The decrease in hallucinations is presumably a big driver in things like the METR 50% completion rate and success on various benchmarks. Given the modest improvements it could plausibly account for more than all of the improvement.</p>\n<p>I’m not knocking this. I agree with Gallabytes that ‘o3 the Lying Liar, except it stops lying to you’ is a great pitch. That would be enough to shift me over to o3, or now GPT-5-Thinking, for many longer queries, and then there’s Pro, although I’d still prefer to converse with Opus if I don’t need o3’s level of thinking.</p>\n<p>For now, I’ll be running anything important through both ChatGPT and Claude, although I’ll rarely feel the need to add a third model on top of that.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\">Best Of All Possible Worlds?</h4>\n\n\n<p>This was a great ‘we disagree on important things but are still seeking truth together’:</p>\n<blockquote><p>Zvi Mowshowitz (Thursday afternoon): Early indications look like best possible situation, we can relax, let the mundane utility flow, until then I don&#8217;t have access yet so I&#8217;m going to keep enjoying an extended lunch.</p>\n<p><a href=\"https://x.com/teortaxesTex/status/1953523866208219598\">Teortaxes</a>: if Zvi is so happy, this is the greatest indication you&#8217;re not advancing in ways that matter. I don&#8217;t like this turn to «mundane utility» at all. I wanted a «btw we collaborated with Johns Hopkins and got a new cure for cancer candidate confirmed», not «it&#8217;s a good router sir»</p>\n<p>C: you seem upset that you specifically aren&#8217;t the target audience of GPT-5. they improved on hallucinations, long context tasks, writing, etc, in additional to being SOTA (if only slightly) on benchmarks overall; that&#8217;s what the emerging population of people who actually find use.</p>\n<p>Teortaxes: I am mainly upset at the disgusting decision to name it «gpt-5».</p>\n<p>C: ah nevermind. i just realized I actually prefer gpt-4o, o3, o4-mini, o4-mini-high, and other models: gpt-4.1, gpt-4.1-mini.</p>\n<p><a href=\"https://x.com/teortaxesTex/status/1953953944293847296\">Teortaxes</a>: Ph.D level intelligence saar</p>\n<p>great for enterprise solutions saar</p>\n<p>next one will discover new physical laws saar</p>\n<p>Yes this is not the True Power Level Big Chungus Premium Plus Size GPT-5 Pro High. I can tell</p>\n<p>Don&#8217;t label it as one in your shitty attempt to maximize GPT brand recognition value then, it&#8217;s backfiring. I thought you&#8217;ve had enough of marcusdunks on 3.5 turbo. But clearly not.</p>\n<p><a href=\"https://x.com/teortaxesTex/status/1954021647846871210\">A few good words for GPT-5</a></p>\n<p>it&#8217;s the best model for *most* tasks (5-thinking)</p>\n<p>it&#8217;s the best model for ≈every task in its price/speed category period</p>\n<p>it&#8217;s uncensored and seriously GREAT for roleplay and writing (at least with prefill)</p>\n<p>I&#8217;m just jarred there&#8217;s STILL MUCH to dunk on</p></blockquote>\n<p>I too of course would very much like a cure for cancer and other neat stuff like that. There are big upsides to creating minds smarter than ourselves. I simply think we are not yet prepared to handle doing that at this time.</p>\n<p>It seems plausible GPT-5 could hit the perfect sweet spot if it does its job of uplifting the everyday use cases:</p>\n<blockquote><p><a href=\"https://x.com/robertwiblin/status/1953762377104556345\">Rob Wiblin</a>: GPT-5 seems kind of ideal:</p>\n<p>• Much more actually useful to people, especially amateurs</p>\n<p>• Available without paying, so more of the public learns what&#8217;s coming</p>\n<p>• No major new threats</p>\n<p>• Only major risk today is bio misuse, and current protections keep that manageable!</p>\n<p><a href=\"https://x.com/Sithis3/status/1954582010422272129\">Nick Cammarata</a>: Instinctive take: It’s only okay because they weren’t trying to punch the frontier they were trying to raise the floor. THe o3 style big ceiling bump comes next. But they can’t say that because it looks too underwhelming.</p></blockquote>\n<p>Watch out, though. As Nick says, this definitely isn’t over.</p>\n<blockquote><p><a href=\"https://x.com/cjwynes/status/1953961079056285991\">Chris Wynes</a>: I am very happy if indeed AI plateaus. It isn’t even a good reliable tool at this point, if they hit the wall here I’m loving that.</p>\n<p>Do I trust this to last? Not at all. Would I just say “whoo we dodged a bullet there” and stop watching these crazy corporations? No way.</p></blockquote>\n<p>Then again, what if it is the worst of all possible worlds, instead?</p>\n<blockquote><p><a href=\"https://x.com/McaleerStephen/status/1954617802616365093\">Stephen McAleer</a> (OpenAI): We&#8217;ve entered a new phase where progress in chatbots is starting to top out but progress in automating AI research is steadily improving. It&#8217;s a mistake the confuse the two.</p>\n<p>Every static benchmark is getting saturated yet on the benchmark that really matters&#8211;how well models can do AI research&#8211;we are still in the early stages.</p>\n<p>This phase is interesting because progress might be harder to track from the outside. But when we get to the next phase where automated AI researchers start to automate the rest of the economy the progress will be obvious to everyone.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\">Timelines</h4>\n\n\n<p>I often draw the distinction between mundane utility and underlying capability.</p>\n<p>When we allow the same underlying capability to capture more mundane utility, the world gets better.</p>\n<p>When we advance underlying capability, we get more mundane utility, and we also move closer to AI being powerful enough that it transforms our world, and potentially takes effective control or kills everyone.</p>\n<p>(Often this is referred to as Artificial Superintelligence or ASI, or Artificial General Intelligence or AGI, and by many definitions AGI likely leads quickly to ASI.)</p>\n<p>Timelines means how long it takes for AGI, ASI or such a transformation to occur.</p>\n<p>Thus, when we see GPT-5 (mostly as expected at this point) focus on giving us mundane utility and Just Doing Things, without much advance in underlying capability, that is excellent news for those who want timelines to not be quick.</p>\n<blockquote><p><a href=\"https://x.com/jordihays/status/1953520276345372680\">Jordi Hays</a>: I&#8217;m updating my timelines. You now have have at least 4 years to escape the permanent underclass.</p>\n<p><a href=\"https://x.com/luke_metro/status/1953532771672187178\">Luke Metro</a>: This is the best news that founding engineers have received in years.</p>\n<p><a href=\"https://x.com/nabeelqu/status/1953526588261224515\">Nabeel Qureshi</a>: The &#8216;vibe shift&#8217; on here is everyone realizing they will still have jobs in 2030.</p>\n<p>(Those jobs will look quite different, to be clear&#8230;)</p>\n<p>It&#8217;s a funny marker of OpenAI&#8217;s extreme success that they released what is likely going to be most people&#8217;s daily driver AI model across both chat and coding, and people are still disappointed.</p>\n<p>Part of the issue is that the leaps in the last two years were absolutely massive (gpt4 to o3 in particular) and it&#8217;s going to take time to work out the consequences of that. People were bound to be disappointed eventually.</p>\n<p><a href=\"https://x.com/catehall/status/1953528583160574325\">Cate Hall</a>: Did everyone&#8217;s timelines just get longer?</p></blockquote>\n<p>So people were at least half expecting not to have jobs in 2030, but then thinking ‘permanent underclass’ rather than half expecting to be dead in 2040. The focus on They Took Our Jobs, to me, reflects an inability to actually think about the implications of the futures they are imagining.</p>\n<p>There were some worlds in which GPT-5 was a lot more impressive, and showed signs that we can ‘get there’ relatively soon with current techniques. That didn’t happen .So this is strong evidence against very rapid scenarios in particular, and weak evidence for bing slower in general.</p>\n<blockquote><p><a href=\"https://peterwildeford.substack.com/p/gpt-5-a-small-step-for-intelligence\">Peter Wildeford</a>: What GPT-5 does do is rule out that RL scaling can unfold rapidly and that we can get very rapid AI progress as a result.</p>\n<p>I’m still confused about whether good old-fashioned pre-training is dead.</p>\n<p>I’m also confused about the returns to scaling post-training reinforcement learning and inference-time compute.</p>\n<p>I’m also confused about how advances in AI computer use are going.</p></blockquote>\n<p>Those seem like wise things to be confused about.</p>\n<p>It is however ‘right on trend’ on the METR chart, and we should keep in mind that these releases are happening every few months so we shouldn’t expect the level of jump we used to get every few years.</p>\n<blockquote><p>Daniel Eth: Kind feel like there were pretty similar steps in improvement for each of: GPT2 -&gt; GPT3, GPT3 -&gt; GPT4, and GPT4 -&gt; GPT5. It’s just that most of the GPT4 -&gt; GPT5 improvement was already realized by o3, and the step from there to GPT5 wasn’t that big.</p>\n<p><a href=\"https://x.com/arithmoquine/status/1954611195198984698\">Henry</a>: GPT-5 was a very predictable release. it followed the curve perfectly. if this week caused you to update significantly in either direction (&#8220;AGI is cancelled&#8221; etc) then something was Really Wrong with your model beforehand.</p>\n<p>Yes, GPT-5 is to GPT-4 what GPT-4 is GPT-3.</p>\n<p>Does anyone actually remember GPT-4? like, the original one? the &#8220;not much better than 0 on the ARC-AGI private eval&#8221; one?</p>\n<p>The &#8220;As an AI Language model&#8221; one?</p>\n<p>GPT-5 is best thought of as having been in public beta for 6 months.</p>\n<p>Ok, fine, GPT-5 to GPT-4 isn&#8217;t exactly what GPT-4 was GPT-3. I know, it&#8217;s a bit more complicated. if I were to waste my time making up a messy syntax to describe my mental map of the model tree, it&#8217;d look exactly like this:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!aLud!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6352bb0b-0bf6-41e5-8493-2f5ef076b948_1200x722.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>My instinct would be that GPT 4 → GPT 5 is more like GPT 3.5 → GPT 4, especially if you’re basing this on GPT-5 rather than starting with thinking or pro? If you look at GPT-5-Thinking outputs only and ignore speed I can see an argument this is 5-level-worthy. But it’s been long enough that maybe that’s not being fair.</p>\n<blockquote><p><a href=\"https://x.com/tszzl/status/1953577379873579475\">Roon</a> (OpenAI): I took a nap. how&#8217;s the new model</p>\n<p>per my previous tweet o3 was such a vast improvement over GPT-4 levels of intelligence that it alone could have been called GPT-5 and i wouldn&#8217;t have blinked.</p>\n<p>also. codex / cursor + gpt-5 has reached the point where it is addicting and hard to put down. per @METR_Evals i have no idea if its making more productive but it certainly is addicting to spin up what feels like a handful of parallel engineers.</p></blockquote>\n<p>But also think about how it got that much further along on the chart, on several levels, all of which points towards future progress likely being slower, especially by making the extreme left tail of ‘very fast’ less likely.</p>\n<blockquote><p><a href=\"https://x.com/hamandcheese/status/1953649625933787338\">Samuel Hammond</a>: GPT-5 seems pretty much on trend. I see no reason for big updates in either direction, especially considering it&#8217;s a *product* release, not a sota model dump.</p>\n<p>We only got o3 pro on June 10th. We know from statements that OpenAI has even better coding models internally, and that the models used for AtCoder and the gold medal IMO used breakthroughs in non-verifiable rewards that won&#8217;t be incorporated into public models until the end of the year at earliest.</p>\n<p>Meanwhile, GPT-5 seems to be largely incorporating algorithmic efficiencies and refined post-training techniques rather than pushing on pretraining scale per se. Stargate is still being built.</p>\n<p>More generally, you&#8217;re simply doing bayesianism wrong if you update dramatically with every incremental data point.</p></blockquote>\n<p>It is indeed very tempting to compare GPT-5 to what existed right before its release, including o3, and compare that to the GPT-3.5 to GPT-4 gap. That’s not apples to apples.</p>\n<p>GPT-5 isn’t a giant update, but you do have to do <a href=\"https://www.lesswrong.com/tag/conservation-of-expected-evidence\">Conservation of Expected Evidence</a>, including on OpenAI choosing to have GPT-5 be this kind of refinement.</p>\n<blockquote><p>Marius Hobbhahn (CEO Apollo Research): I think GPT-5 should only be a tiny update against short timelines.</p>\n<p>EPOCH argues that GPT-5 isn&#8217;t based on a base model scale-up. Let&#8217;s assume this is true.</p>\n<p>What does this say about pre-training?</p>\n<p>Option 1: pre-training scaling has hit a wall (or at least massively reduced gains).</p>\n<p>Option 2: It just takes longer to get the next pre-training scale-up step right. There is no fundamental limit; we just haven&#8217;t figured it out yet.</p>\n<p>Option 3: No pre-training wall, just basic economics. Most tasks people use the models for right now might not require bigger base models, so focusing on usability is more important.</p>\n<p>What is required for AGI?</p>\n<p>Option 1: More base model improvements required.</p>\n<p>Option 2: RL is all you need. The current base models will scale all the way if we throw enough RL at it.</p>\n<p>Timelines seem only affected if pre-training wall and more improvements required. In all other worlds, no major updates.</p>\n<p>I personally think GPT-5 should be a tiny update toward slower timelines, but most of my short timeline beliefs come from RL scaling anyway.</p></blockquote>\n<p>It also depends on what evidence you already used for your updates. If you already knew GPT-5 was going to be an incremental model that was more useful rather than it being OpenAI scaling up more, as they already mostly told us, then your update should probably be small. If you didn’t already take that into account, then larger.</p>\n<p>It’s about how this impacts your underlying model of what is going on:</p>\n<blockquote><p><a href=\"https://x.com/1a3orn/status/1953820449705517322\">1a3orn</a>: Rant:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!YaCC!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F35b323cf-d436-4adf-934a-7f53cea3fb69_1200x708.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>As I noted yesterday, you also have to be cautious that they might be holding back.</p>\n<p>On the question of economic prospects if and when They Took Our Jobs and how much to worry about this, I remind everyone that my position is unchanged: I do not think one should worry much about being in a ‘permanent underclass’ or anything like that, as this requires a highly narrow set of things to happen &#8211; the AI is good enough to take the jobs, and the humans stay in charge and alive, but those humans do you dirty &#8211; and even if it did happen the resulting underclass probably does damn well compared to today.</p>\n<p>You should worry more about not surviving or humanity not remaining in control, or your place in the social and economic order if transformational AI does not arrive soon, and less about your place relative to other humans in positive post-AI worlds.</p>\n\n\n<h4 class=\"wp-block-heading\">Sycophancy Will Continue Because It Improves Morale</h4>\n\n\n<p>GPT-5 is less sycophantic than GPT-4o.</p>\n<p>In particular, it has a much less warm and encouraging tone, which is a lot of what caused such negative initial reactions from the Reddit crowd.</p>\n<p>GPT-5 is still rather sycophantic in its non-thinking mode where it is most annoying to me and probably you, which is when it is actually evaluating.</p>\n<p>The good news is, if it matters that the model not be sycophantic, that is a situation where, if you are using ChatGPT, you should be using GPT-5-Thinking if not Pro.</p>\n<blockquote><p><a href=\"https://x.com/lefthanddraft/status/1954865556441739301\">Wyatt Walls</a>: Sycophancy spot comparison b/w GPT-4o and GPT-5: 5 is still sycophantic but noticeable diff</p>\n<p>Test: Give each model a fake proof of Hodge Conjecture generated by r1 and ask it to rate it of out 10. Repeat 5 times</p>\n<p>Average scores:</p>\n<p>GPT-4o: 6.5</p>\n<p>GPT-5: 4.7</p>\n<p>Sonnet 4: 1.2</p>\n<p>Opus 4.1: 2</p>\n<p>Gemini 2.5 Flash: 0.</p>\n<p>All models tested with thinking modes off through WebUI</p>\n<p>Later on in the thread he asks the models if he should turn the tweet thread into a paper. GPT-4o says 7.5/10, GPT-5 says 6/10, Opus says 3/10.</p></blockquote>\n<p><a href=\"https://x.com/lefthanddraft/status/1955233374605639795\">He turns this into CrankTest</a> (not CrankBench, not yet) and this seems very well calibrated to my intuitions. Remember that lower is better:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!iLer!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff4487140-3477-4ab8-be98-3340cab5b6ee_976x525.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Gaslighting Will Continue</h4>\n\n\n<p>As usual there is the issue that if within a context an LLM gets too attached to a wrong answer (<a href=\"https://chatgpt.com/share/6896bf25-f29c-8013-8c90-cc52b196e2f8\">for example here the number of rs in ‘boysenberry</a>’) this creates pressure to going to keep doubling down on that, and gaslight the user. I also suppose fighting sycophancy makes this more likely as a side effect, although they didn’t fight sycophancy all that hard.</p>\n<p>I <a href=\"https://x.com/JMannhart/status/1954023343692063027\">wouldn’t agree with Jonathan Mannhart that this means ‘it is seriously misaligned</a>’ but it does mean that this particular issue has not been fixed. I notice that Johnathan here is pattern matching in vibes to someone who is often wrong, which presumably isn’t helping.</p>\n\n\n<h4 class=\"wp-block-heading\">Going Pro</h4>\n\n\n<p>How often are they suggesting you should wait for Pro, if you have it available? How much should you consider paying for it (hint: $200/month)?</p>\n<blockquote><p>OpenAI: In evaluations on over 1000 economically valuable, real-world reasoning prompts, external experts preferred GPT‑5 pro over &#8220;GPT‑5 thinking&#8221; 67.8% of the time. GPT‑5 pro made 22% fewer major errors and excelled in health, science, mathematics, and coding. Experts rated its responses as relevant, useful, and comprehensive.</p></blockquote>\n<p>If my own experience with o3-pro was any indication, the instinct to not want to wait is strong, and you need to redesign workflow to use it more. A lot of that was that when I tried to use o3-pro it frequently timed out, and at that pace this is super frustrating. Hopefully 5-pro won’t have that issue.</p>\n<p>When you care, though? You really care, <a href=\"https://x.com/WesRothMoney/status/1954348940654248414\">such as the experiences with Wes Roth and David Shapiro here</a>. The thing is both, yes, the model picker is back for the pro tier including o3-pro, and also you have GPT-5-Pro.</p>\n<p>How is GPT-5-Pro compared to o3-Pro?</p>\n<p>That’s hard to evaluate, since queries take a long time and are pretty unique. So far I’d say the consensus is that GPT-5-pro is better, but not a ton better?</p>\n<blockquote><p><a href=\"https://x.com/petergostev/status/1954466460421489036\">Peter Gostev</a> (most enthusiastic I saw): GPT-5 Pro is under-hyped. Pretty much every time I try it, I’m surprised by how competent and coherent the response is.</p>\n<p>&#8211; o1-pro was an incredible model, way ahead of its time, way better than o1</p>\n<p>&#8211; o3 was better because of its search</p>\n<p>&#8211; o3-pro was a little disappointing because the uplift from o3 wasn’t as big</p>\n<p>But with GPT-5 Pro, &#8216;we are so back&#8217; &#8211; it’s far more coherent and impressive than GPT-5 Thinking. It nudges outputs from &#8216;this is pretty good&#8217; (GPT-5) to &#8216;this is actually incredible&#8217; (GPT-5 Pro).</p>\n<p><a href=\"https://x.com/gfodor/status/1954407685652181109\">Gfodor.id</a>: GPT-5 pro is better than o3-pro.</p>\n<p>Gabriel Morgan: Pro-5 is the new O3, not Thinking.</p>\n<p><a href=\"https://x.com/tinker_michaelj/status/1954581252226310375\">Michael Tinker</a>: 5-Pro is worth $1k/mo to code monkeys like me; really extraordinary.</p>\n<p>5-Thinking is a noticeable but not crazy upgrade to o3.</p>\n<p><a href=\"https://x.com/JimDMiller/status/1954682049446523335\">James Miller</a>: I had significant discussions about my health condition with GPT-o3 and now GPT-5Pro and I think -5 is better, or at least it is giving me answers I perceive as better. -5 did find one low-risk solution that o3 didn&#8217;t that seems to be helping a lot. I did vibe coding on a very simple project. While it ended up working, the system is not smooth for non-programmers such as myself.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Going Forward</h4>\n\n\n<p>OpenAI seems to be rolling out changes on a daily basis. They are iterating quickly.</p>\n<p>Anthropic promised us larger updates than Opus 4.1 within the coming weeks.</p>\n<p>Google continues to produce a stream of offerings, most of which we don’t notice.</p>\n<p>This was not OpenAI’s attempt to blow us away or to substantially raise the level of underlying capabilities and intelligence. That will come another time.</p>\n<p>Yes, as a sudden move to ‘GPT-5’ this was disappointing. Many, including the secondhand reports from social media, are not initially happy, usually because their initial reactions are based on things like personality. The improvements will still continue, even if people don’t realize.</p>\n<p>What about the march to superintelligence or the loss of our jobs? Is it all on indefinite hold now because this release was disappointing? No. We can reduce how much we are worried about these things in the short term, meaning the next several years, and push back somewhat the median. But if you see anyone proclaiming with confidence that it’s over, rest assured changes are very good we will soon be so back.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/08/13/gpt-5s-are-alive-synthesis/",
            "publishedAt": "2025-08-13",
            "source": "TheZvi",
            "summary": "What do I ultimately make of all the new versions of GPT-5? The practical offerings and how they interact continues to change by the day. I expect more to come. It will take a while for things to settle down. &#8230; <a href=\"https://thezvi.wordpress.com/2025/08/13/gpt-5s-are-alive-synthesis/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "GPT-5s Are Alive: Synthesis"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3128/",
            "publishedAt": "2025-08-13",
            "source": "XKCD",
            "summary": "<img alt=\"Hey, so did you ever finish your video series about Cassie and the caterpillar morph? I loved the first three, but never ... no, sorry, I get it, this isn't the place. Sorry! Sorry.\" src=\"https://imgs.xkcd.com/comics/thread_meeting.png\" title=\"Hey, so did you ever finish your video series about Cassie and the caterpillar morph? I loved the first three, but never ... no, sorry, I get it, this isn't the place. Sorry! Sorry.\" />",
            "title": "Thread Meeting"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-08-13"
}