{
    "articles": [
        {
            "content": [
                "<p><em>[This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked]</em></p><h1><strong>I. THE TASTE OF VICTORY</strong></h1><p>The Tupinamb&#225; people ate their enemies. This fact scared <a href=\"https://en.wikipedia.org/wiki/Hans_Staden\">Hans Staden</a>, a German explorer who was captured by Tupinamb&#225; warriors in 1554, when they caught him by surprise during a hunting expedition. As their prisoner for nearly a year, Staden observed a number of their cannibalism rituals. They were elaborate, public affairs; here&#8217;s a description of them from Duffy and Metcalf&#8217;s <em>The Return of Hans Staden</em>, an assessment of Staden&#8217;s voyage and claims: (Ch. 2, pg. 51-52)</p><blockquote><p>First a rope was placed around the neck of the captive so that he might not escape; at night the rope was tied to the hammock in which the captive slept. Straps that were not removed were placed above and below the knees. The captives were given women, who guarded them and also slept with them. These women were high-status daughters and sisters of chiefs; they were unmarried and sometimes gave birth to the child of a captive. Some of the captives might be held for a period of time until corn was planted and new large clay vessels&#8212;for drink and cooking flesh&#8212;were made. Guests were invited to the ceremony, and they often arrived eight to fifteen days in advance of it. A special small house was erected, with no walls but with a roof, in which the captives were placed with women and guards two or three days before the ceremony. In the other houses, feathers were prepared for a headdress or for body ornamentation, and inks were made for tattoos. Women and girls prepared fifty to one hundred vats of fermented manioc beer. Then, when all was ready, they painted the victim&#8217;s face blue, mounted a headdress of wax covered with feathers on him, and wound a cotton cord around his waist. The guests began to drink in the afternoon and continued all through the night. At dawn, the one who was to do the killing came out with a long, painted wooden club and smashed the captive on the head, splitting it open. The attacker then withdrew for eight to fifteen days of abstinence while the others ate the cooked flesh of the captive and finished all of the drink made for the occasion.</p></blockquote><p>Staden himself was supposed to be eaten, but through a mix of luck and deception managed to convince the Tupinamb&#225; that he should not be. Among other reasons, he claimed that their God didn&#8217;t <em>like</em> the idea of him being eaten: (Ch. 2, pg. 61)</p><blockquote><p>When the families in Nha&#234;pep&#244;-oa&#231;&#250;&#8217;s hut began to return from Mambucabe, they came sobbing with terrible news. Disease had broken out during the two weeks when Nha&#234;pep&#244;-oa&#231;&#250; and his people were there rebuilding the long houses that had been burned down by the Tupinikin. &#8230; Shocked at the impact of the disease that descended so suddenly and with such devastating results, the Tupinamb&#225; struggled to understand the meaning of the outbreak. Staden&#8217;s prophecy of the anger of the moon was re- interpreted to foretell the sickness that befell them. Nha&#234;pep&#244;-oa&#231;&#250;&#8217;s brother came to Staden and said: &#8220;My brother suspects that your God must be angry.&#8221; Staden immediately insisted that this in fact was the case: &#8220;I told him yes, my God was angry, because he wanted to eat me.&#8221;</p></blockquote><p>His final deception was to talk his way onto a French ship, the <em>Catherine</em>, in late 1554. After four months crossing the Atlantic, Europe was in sight, and he was free. He later wrote a bestselling memoir about his time among the Tupinamb&#225;, whose English translation was hilariously titled <em>True History: An Account of Cannibal Captivity in Brazil</em>.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!hkVp!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F092ac40c-bf9b-4efb-baa5-2a844647400d_614x662.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"662\" src=\"https://substackcdn.com/image/fetch/$s_!hkVp!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F092ac40c-bf9b-4efb-baa5-2a844647400d_614x662.jpeg\" width=\"614\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">A woodcutting illustration from Staden&#8217;s book that illustrates part of a Tupinamb&#225; cannibalism ritual. True history, visualized.</figcaption></figure></div><p>At one point in his book, Staden recounts admonishing a Tupinamb&#225; warrior named Cunhambebe about eating human flesh. From Duffy and Metcalf: (Ch. 2, pg. 67)</p><blockquote><p>Staden writes that Cunhambebe held a leg to his mouth and asked him if he wanted to eat it. Staden refused, saying that even animals did not eat their own species. Cunhambebe replied in Tupi, according to Staden: &#8220;<em>Jau war sehe</em> [Jau&#225;ra ich&#234;]&#8221;: &#8220;I am a tiger&#8221; (i.e., the American jaguar). Then he said, Staden writes, &#8220;it tastes good.&#8221;</p></blockquote><p>Why did they eat their enemies? Partly for revenge, partly because well-cooked people (apparently) taste good, and partly because the associated festivities were fun. But another reason might have been that they could obtain some of their enemy&#8217;s strength&#8212;their courage and bravery, for example&#8212;by eating them. At least according to <a href=\"https://en.wikipedia.org/wiki/Tupi_people\">Wikipedia</a>,</p><blockquote><p>The warriors captured from other Tupi tribes were eaten as it was believed by them that this would lead to their strength being absorbed and digested; thus, in fear of absorbing weakness, they chose only to sacrifice warriors perceived to be strong and brave.</p></blockquote><p>I had a hard time finding support for this claim elsewhere. The closest I could find was some <a href=\"https://read.dukeupress.edu/hahr/article-abstract/80/4/721/26622/Hans-Staden-and-the-Cultural-Politics-of\">discussion</a> by Neil Whitehead, an anthropologist and one of the translators of a recent English version of Staden&#8217;s memoir, regarding possible motives for Tupinamb&#225; cannibalism rituals beyond revenge. He writes:</p><blockquote><p>&#8230; it is Staden&#8217;s testimony in particular that allows latter-day interpreters to escape the sterile vision of Tupi war and cannibalism as merely an intense aspect of a revenge complex. By making the crucial connection between killing and the accumulation of beautiful names, as described by Staden, Viveiros de Castro is able to elaborate the motivations for war and cannibalism beyond the &#8216;revenge&#8217; model &#8230;</p></blockquote><p>Whether or not the Wikipedia claim is true, the idea that you can acquire some of a person&#8217;s essence by eating them isn&#8217;t unique to the Tupinamb&#225;; it&#8217;s enough of a meme that it has its own <a href=\"https://tvtropes.org/pmwiki/pmwiki.php/Main/CannibalismSuperpower\">TVTropes page</a>. You&#8217;re probably familiar with at least some of the examples listed there.</p><p>From a modern vantage point, it&#8217;s clear that if groups like the Tupinamb&#225; practiced cannibalism for the purpose of acquiring aspects of their enemies, they were misguided. Maybe they could get some <em>protein</em> by doing this, but they certainly couldn&#8217;t acquire any of the things that make us fundamentally human, courage and bravery included. You can&#8217;t get anything <em>cognitive</em>&#8212;personality! memories! identity!&#8212;by eating someone&#8217;s arm, or leg, or heart. They&#8217;re just a bunch of molecules, no longer meaningfully linked to the core features of the former person.</p><p>Right?</p><h1><strong>II. PERSONAL IDENTITY AND HEART TRANSPLANTS</strong></h1><p>People that have gotten heart transplants sometimes report extremely weird changes afterward. Mitchell Liester, a doctor and Assistant Clinical Professor at the University of Colorado&#8217;s School of Medicine, has collected a bunch of examples of this in an article titled &#8220;<a href=\"https://doi.org/10.1016/j.mehy.2019.109468\">Personality changes following heart transplantation: The role of cellular memory</a>&#8221; (<em>Medical Hypotheses</em>, 2020). For example, an avid meat-eater received a heart from a vegetarian, and claimed post-transplant:</p><blockquote><p>&#8220;I hate meat now. I can&#8217;t stand it. I was McDonald&#8217;s biggest money maker, and now meat makes me throw up. Actually, when I even smell it, my heart starts to race.&#8221;</p></blockquote><p>Another woman, Claire Sylvia, received a heart-lung transplant from an 18-year-old man and seemed to acquire his taste for beer, green peppers, and chicken nuggets. The donor apparently liked chicken nuggets so much that they were found on him when he died.</p><p>But you might think that this isn&#8217;t that weird. Getting a heart transplant is a major operation that involves lots of drugs (e.g., for immune suppression and anesthesia) and surgery, and it&#8217;s at least plausible that the associated trauma to your body changes what foods taste good to you.</p><p>But some of the other accounts are <em>weirder</em>. A lesbian that received a heart from a 19-year-old heterosexual woman reports becoming predominantly sexually attracted to men:</p><blockquote><p>&#8220;&#8230; I&#8217;m engaged to be married now. He&#8217;s a great guy and we love each other. The sex is terrific. The problem is, I&#8217;m gay. At least, I thought I was. After my transplant, I&#8217;m not&#8230; I don&#8217;t think anyway&#8230; I&#8217;m sort of semi- or confused gay. Women still seem attractive to me, but my boyfriend turns me on. Women don&#8217;t. I have absolutely no desire to be with a woman. I think I got a gender transplant.&#8221;</p></blockquote><p>A man who received a heart from a passionate young musician reports suddenly becoming obsessed with classical music, listening to it for hours on end and greatly annoying his wife in the process:</p><blockquote><p>&#8220;&#8230; he&#8217;s driving me nuts with the classical music. He doesn&#8217;t know the name of one song and never, never listened to it before. Now, he sits for hours and listens to it. He even whistles classical music songs that he could never know.&#8221;</p></blockquote><p>Consider this snippet about a 5-year-old boy who received a heart from a 3-year-old boy:</p><blockquote><p>Some recipients develop aversions after obtaining a new heart. For example, a 5-year-old boy received the heart of a 3-year-old boy but was not told the age or cause of his donor&#8217;s death. Still, he offered the following description of his donor following surgery: &#8220;He&#8217;s just a little kid. He&#8217;s a little brother like about half my age. He got hurt bad when he fell down. He likes Power Rangers a lot I think, just like I used to. I don&#8217;t like them anymore though&#8221;. The donor died after falling from an apartment window while trying to reach a Power Ranger toy that had fallen on the ledge of the window. After receiving his new heart, the recipient would not touch Power Rangers.</p></blockquote><p>Leister includes a number of stories like this: a nine-year-old boy avoids water after getting a heart from a little girl who drowned; a college professor began to have recurring dreams about a flash of light burning his face after getting a heart from a police officer who died in a shooting during a drug bust; a woman often feels the pain of the car accident that killed her donor. It&#8217;s possible that all these people are lying, but the phenomenon is apparently common enough that this seems unlikely. It also doesn&#8217;t seem likely that what they report is just due to a surgery-related brain injury. In many cases, organ receivers report information about their donor, including information about their name, or their cause of death, that they didn&#8217;t appear to have access to.</p><p>Claire Sylvia wrote a whole memoir, playfully called <em>A Change of Heart</em>, about the changes she experienced. Here&#8217;s a dream she wrote about, as quoted in a great <a href=\"https://www.psychologytoday.com/us/articles/202409/what-the-heart-remembers\">Psychology Today</a> article:</p><blockquote><p>&#8220;I&#8217;m in an open outdoor place with grass all around. It&#8217;s summer. With me is a young man who is tall, thin, and wiry, with sandy-colored hair. His name is Tim&#8212;I think it&#8217;s Tim Leighton, but I&#8217;m not sure. I think of him as Tim L. We&#8217;re in a playful relationship, and we&#8217;re good friends.</p><p>&#8220;It&#8217;s time for me to leave, to join a performing group of acrobats. I start to walk away from him, but I suddenly feel that something remains unfinished between us. I turn around and go back to him to say goodbye. Tim is standing there watching me, and he seems happy when I return.</p><p>&#8220;Then we kiss. And as we kiss, I inhale him into me. It feels like the deepest breath I&#8217;ve ever taken, and I know that Tim will be with me forever.&#8221;</p></blockquote><p>She <em>inhaled</em> him. That&#8217;s almost a bit too on the nose. She didn&#8217;t know it at the time, but her donor&#8217;s name was Tim <em>Lamirande</em>. Spooky, right?</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!Rdrh!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4b25bb21-df99-4ad1-a1e6-817c90cafd1d_855x1360.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1018.0116959064327\" src=\"https://substackcdn.com/image/fetch/$s_!Rdrh!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4b25bb21-df99-4ad1-a1e6-817c90cafd1d_855x1360.jpeg\" width=\"640\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">The cover of Claire Sylvia&#8217;s <a href=\"https://www.amazon.com/Change-Heart-Memoir-Claire-Sylvia/dp/0316821497\">memoir</a>. Sylvia received a heart-lung transplant from an 18-year-old man, and reported changes in personality and preference that mimicked the man&#8217;s.</figcaption></figure></div><p>Is there something special about the heart? In a newer article titled &#8220;<a href=\"https://www.mdpi.com/2673-3943/5/1/2\">Personality Changes Associated with Organ Transplants</a>&#8221; (<em>Transplantology</em>, 2024) Liester and coauthors claim that other kinds of transplants, like kidney and liver transplants, can produce similar changes. It really seems like it&#8217;s the <em>internalization of part of someone else</em> that matters, not the internalization of their heart specifically.</p><p>I really encourage you to read these stories. They&#8217;re <em>crazy</em>. If even a <em>quarter</em> of them are true, they speak to something deep about the biology of personal identity and memory that we don&#8217;t yet understand. How could a heart recipient inherit <em>memories of how their donor died</em>?</p><p>Then again, the world is full of kooky stories about inexplicable phenomena, and many of these stories are probably fake, no matter how many people strongly and sincerely believe them. Everyone&#8217;s heard about <a href=\"https://en.wikipedia.org/wiki/Out-of-body_experience\">out-of-body experiences</a> and <a href=\"https://en.wikipedia.org/wiki/Parapsychology\">psychic phenomena</a>. Despite the many believers in psi, and despite their many earnest accounts of events seemingly outside the bounds of science as we know it&#8212;heck, even despite <a href=\"https://slatestarcodex.com/2014/04/28/the-control-group-is-out-of-control/\">serious attempts</a> to study some of these phenomena, and <a href=\"https://en.wikipedia.org/wiki/Stargate_Project_(U.S._Army_unit)\">secret</a> <a href=\"https://www.cia.gov/readingroom/docs/CIA-RDP96-00789R002800180001-2.pdf\">funding</a> from the U.S. government to do so, in some cases&#8212;we probably ought to remain skeptical.</p><p>And part of that skepticism comes from our hard-won knowledge about how the physical world works. For example, we probably shouldn&#8217;t believe someone that claims to be able to bend spoons with their mind, because the laws of physics don&#8217;t provide any plausible ways this can happen. As far as we know, some type of signal has to <em>physically propagate</em> from the body of the spoonbender to the spoon in order for them to bend it. And given our knowledge of possible physical signals, there are only so many ways this can happen. No one has found that spoonbenders&#8217; brains produce any long-range waves, electromagnetic or otherwise, capable of bending a spoon. Since &#8220;<a href=\"https://arxiv.org/abs/2101.07884\">the laws of physics underlying the phenomena of everyday life are completely known</a>&#8221;, and are moreover <em>extremely well-supported</em>, we should be extra skeptical of claimed phenomena that appear to violate them.</p><p>(<strong>Side note:</strong> the firm belief that psi phenomena must occur in accordance with the laws of physics motivated a number of physicists to study whether quantum mechanics could explain things like spoonbending. Physicist and historian David Kaiser writes entertainingly about these physicists in <em><a href=\"https://www.hippiessavedphysics.com/\">How the Hippies Saved Physics</a></em>.)</p><p>The relevant knowledge for evaluating these heart transplant stories is our knowledge of biology, and how human memory works. And everyone knows memories are stored in the brain, not the heart, so we ought to be highly skeptical.</p><p>They <em>are</em> just in the brain, right?</p><p>&#8230;Right?</p><p>&#8230;</p><p>This leads us to the subject of our review: the synaptic plasticity and memory hypothesis.</p><h1><strong>III. THE SYNAPTIC PLASTICITY AND MEMORY HYPOTHESIS</strong></h1><p>As formalized by Martin, Greenwood, and Morris in a <a href=\"https://www.annualreviews.org/content/journals/10.1146/annurev.neuro.23.1.649\">2000 review paper</a>, the <strong>synaptic plasticity and memory hypothesis</strong> (SPM) claims:</p><blockquote><p><em>Activity-dependent synaptic plasticity is induced at appropriate synapses during memory formation, and is both necessary and sufficient for the information storage underlying the type of memory mediated by the brain area in which that plasticity is observed.</em></p></blockquote><p>More simply, it says that learning and memory amount to changes in <em><a href=\"https://en.wikipedia.org/wiki/Synaptic_weight\">synaptic weights</a></em>, the connections between <a href=\"https://en.wikipedia.org/wiki/Neuron\">neurons</a>. According to this hypothesis, what it physically <em>means</em> to learn something, or store a memory, is to make one or more connections between neurons stronger or weaker.</p><p>For most people even vaguely familiar with neuroscience and the brain, this claim rings as trivially true. This idea is so entrenched, in fact, that I'd wager most people don't even know it has a name. (I didn&#8217;t, anyway.) The most popular quantitative models of the brain, <a href=\"https://en.wikipedia.org/wiki/Neural_network_(machine_learning)\">artificial neural networks</a> (ANNs), assume that the strengths of the connections between neurons, or &#8220;<em>weights</em>&#8221;, completely determine how networks behave. These are the things that are assumed to change during learning, maybe through an algorithm like <a href=\"https://en.wikipedia.org/wiki/Backpropagation\">backpropagation</a>, or maybe through something that looks more like <a href=\"https://en.wikipedia.org/wiki/Hebbian_theory\">Hebbian learning</a>. If these models learn something, or store a memory, it <em>has</em> to be through changes in weights.</p><p>In AI, too, weights are king. The term &#8220;weights&#8221; is even used as a synonym for &#8220;model parameters&#8221;. Weights are the numbers that completely characterize what a state-of-the-art model has learned through expensive training, and these days they can be ferociously protected trade secrets.</p><p>The SPM hypothesis is one of the most well-supported theories in the life sciences, and might fairly be called the cornerstone hypothesis of neuroscience. It&#8217;s one of the key assumptions of a framework called <a href=\"https://en.wikipedia.org/wiki/Connectionism\">connectionism</a>, which posits that all of the things that make us human&#8212;our ability to talk, think, reason, remember, and so on&#8212;follow from networks of interacting neurons, and changes in the strengths of connections between those neurons. It&#8217;s a framework that used to be somewhat controversial, but that most neuroscientists accept these days. And they accept it for <a href=\"https://www.nature.com/articles/s41583-023-00705-w\">good reasons</a>, both empirical and philosophical; it&#8217;s been extremely successful!</p><p>And yet I think it&#8217;s wrong, or at least woefully incomplete. In this review, I&#8217;ll rant about why.</p><p>Usefully, Morris et al. lay out a set of criteria for deciding whether the SPM hypothesis is true:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!PCB9!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb2d874dd-3716-4315-8919-2de28fc89293_1600x671.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"278.64285714285717\" src=\"https://substackcdn.com/image/fetch/$s_!PCB9!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb2d874dd-3716-4315-8919-2de28fc89293_1600x671.png\" width=\"664\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Criteria from Martin, Greenwood, and Morris for evaluating the SPM hypothesis.</figcaption></figure></div><p>But they really just boil down to <em>necessity</em> and <em>sufficiency</em>. Is a synaptic weight change <em>necessary</em> for an animal to learn or memorize something? If a mouse receives a shock (a common stimulus in <a href=\"https://en.wikipedia.org/wiki/Fear_conditioning\">fear conditioning</a> experiments), could we <em>in principle</em> look inside its brain and find synaptic weights that encode the memory of that shock? If we found such weights, could we modify the memory, or even generate an entirely new <em>fake</em> memory, by perturbing them?</p><p>Is a synaptic weight change <em>sufficient </em>for encoding learning and memory? If we changed some weights, and <em>only</em> some weights, can we change a memory? Can we make a new memory from scratch <em>just</em> by modifying synaptic weights, or would we have to change something else too? Learning and memory happen <em>if and only</em> if synaptic weight changes happen; that&#8217;s the SPM hypothesis in a nutshell.</p><p>When I say that the SPM hypothesis is <em>wrong</em>, I mean it&#8217;s wrong in the same way that something like <a href=\"https://en.wikipedia.org/wiki/Newton%27s_laws_of_motion\">Newton&#8217;s laws</a> are wrong: it&#8217;s useful, but its domain of applicability is limited. In particular, <strong>I am not saying that synaptic weight changes are not causally related to learning and memory</strong>. They almost certainly are, and this point is so well-established that saying otherwise just seems wrong.</p><p>To understand my issue, it&#8217;s useful to distinguish between what I&#8217;ll call the <strong>strong SPM hypothesis</strong> and the <strong>weak SPM hypothesis</strong>. The strong version says that learning/memory is literally physically equivalent to changes in synaptic weights. The weak version says that learning/memory can be stored in changes to synaptic weights, but isn&#8217;t <em>only</em> stored in them. I believe the weak version, but not the strong version.</p><p>In principle, worrying about this distinction could amount to pedantry. Maybe there are other mechanisms for learning or storing memories, but they&#8217;re weird edge cases, and mostly don&#8217;t matter for the kinds of learning and memory we typically care about. I don&#8217;t think this is true, for reasons that will become clear as we go on.</p><p>The crux of my negative review of the SPM hypothesis is this: cells are extraordinarily complex molecular machines, and there&#8217;s a lot going on inside of them that the SPM hypothesis implicitly neglects. We often abstract away most of the biophysical complexity of neurons, which are <a href=\"https://en.wikipedia.org/wiki/Cell_(biology)\">cells</a>. As cells, they take up physical space, and can have weird, complicated shapes. They talk to other (<a href=\"https://en.wikipedia.org/wiki/Glia\">not necessarily neural</a>) cells. Each individual neuron has a complicated (<a href=\"https://en.wikipedia.org/wiki/Gene_regulatory_network\">gene regulatory</a>) network inside it, whose complexity parallels that of many of our models of entire neural circuits. Do we really think that <em>none of this</em> complexity is involved in processes as complicated and multiscale as learning and memory?</p><p>You might respond: sure, neurons are cells and cells are complicated, but we can abstract away those details, and imagine that whatever is going on inside cells <em>ultimately</em> just serves the modification of synaptic weights. I also don&#8217;t think this is true, and will try to argue against it.</p><p>How should we proceed? First I&#8217;ll say a little bit about the history of the SPM hypothesis, so we know how we got here, and what competing ideas fell by the wayside. Then I&#8217;ll talk about necessity and sufficiency. Finally, I&#8217;ll talk about an alternative hypothesis that I think is more promising, and that can, among other things, potentially explain the weird heart transplant stories discussed above.</p><h1><strong>IV. A BRIEF HISTORY OF THE HYPOTHESIS</strong></h1><p>Especially since the early 2010s, when exponential success in AI started to drive significant progress in neuroscience (and lead to many articles like &#8220;<a href=\"https://www.nature.com/articles/s41593-019-0520-2\">A deep learning framework for neuroscience</a>&#8221;), the SPM hypothesis has become something of a dogma. Like I said above, the most popular models of real neural networks are artificial ones, which learn features and behaviors entirely through changes in synaptic weights. <em>By design</em>, this hypothesis class excludes other interesting possibilities.</p><p>But the SPM hypothesis wasn&#8217;t always the only game in town. Fortuitously, I found a chapter in a 1976 neuroscience textbook by Nobel Prize winner <a href=\"https://en.wikipedia.org/wiki/Eric_Kandel\">Eric Kandel</a> (<em><a href=\"https://archive.org/details/cellularbasisofb0000kand\">Cellular Basis of Behavior</a></em>) that recounts some of the history of ideas regarding neuronal plasticity. It&#8217;s a pretty surreal experience reading this chapter now, many decades later, since the relevant paradigms have changed so much.</p><p>In Kandel&#8217;s telling, there are two main hypotheses for explaining why and how behavior changes&#8212;and hence, learning and memory&#8212;are possible. He calls them the &#8220;dynamic change hypothesis&#8221; and &#8220;plastic change hypothesis&#8221;.</p><p>The &#8220;dynamic change hypothesis&#8221; suggests that learning and memory is due to <em>persistent activity</em> in neural circuits: if you see a picture of a cat, and the associated photons impinge on your retina and travel through your visual system, ripples associated with this activity linger for a while. The fact that they linger causes the system to behave differently, and we can identify the differences in system behavior due to the ripples with learning and memory. Kandel attributes this idea to the physiologist Alexander Forbes (1922) and Lorente de N&#243; (1938). Nowadays, persistent activity is <a href=\"https://www.cell.com/trends/cognitive-sciences/abstract/S1364-6613(19)30320-1\">thought to play a role in short-term memory</a>, but isn&#8217;t taken seriously as a hypothesis for universally explaining learning and memory. Kandel doesn&#8217;t really take it seriously for this purpose either.</p><p>According to Kandel, (<em>Cellular Basis of Behavior</em>, Ch. 11, pg. 476)</p><blockquote><p>The plastic change hypothesis states that learning involves a functional or plastic change in the properties of neurons or in their interconnections.</p></blockquote><p>Note that he says &#8220;in the properties of neurons&#8221;; he&#8217;s referring not just to the <em>connections</em> between neurons (i.e., synaptic weights), but also to their <em>intrinsic properties</em>, like their degree of electrical excitability. This makes the &#8220;plastic change hypothesis&#8221; somewhat more inclusive than the SPM hypothesis, which only concerns connection strengths.</p><p>He primarily attributes the plastic change hypothesis to <a href=\"https://en.wikipedia.org/wiki/Santiago_Ram%C3%B3n_y_Cajal\">Santiago Ram&#243;n y Cajal</a>, a luminary to whom many other ideas foundational to neuroscience are usually (and probably correctly) attributed. In the mid-1890s, Ram&#243;n y Cajal synthesized nascent ideas about the nervous system by other workers, like Lugaro and Tanzi. In a classic 1909 textbook (<em>Histologie du syst&#232;me nerveux de l'homme &amp; des vert&#233;br&#233;s</em>), he wrote:</p><blockquote><p>The extension, the growth, and the multiplication of the appendages of the neuron do not stop at birth; they continue and nothing is more striking than the difference between the length and the number of the cellular ramifications, of the second and third order, in a newborn and an adult man.</p><p>The new cellular extensions do not grow at random; they have to orient themselves according to major neural currents or according to intracellular associations which are the object of repeated action of will. We think that formation of those new branches is followed by an increased blood flow which brings necessary nutrition. The mechanisms are probably chemo-tactile like the ones we observed during histogenesis of the spinal cord.</p><p>The ability of the neurons to grow in an adult and their power to create new associations can explain learning and the fact that man can change his ideological systems. Our hypothesis can even explain the conservation of very old memories such as memories from youth in an old man and in an amnesiac or in a mental patient, because the association pathways that have existed for a long time and have been exercised for many years are probably very powerful and were formed at the time when the plasticity of the neuron was at its maximum.</p></blockquote><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!D1rF!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff6170b59-25f1-426e-88ce-4fca10686938_672x777.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"777\" src=\"https://substackcdn.com/image/fetch/$s_!D1rF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff6170b59-25f1-426e-88ce-4fca10686938_672x777.png\" width=\"672\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p><a href=\"https://en.wikipedia.org/wiki/Santiago_Ram%C3%B3n_y_Cajal#/media/File:Cajal_cortex_drawings.png\">Three Ram&#243;n y Cajal drawings</a>. The left two depict parts of the adult human cortex; the rightmost depicts part of the cortex of a 1.5 month old infant. Note the vast differences between infant and adult structure.</p><p>Later, people like Jerzy Konorski (1948) and Donald Hebb (1949) substantially expanded on the idea. Hebb&#8217;s ideas were particularly influential. In Hebb&#8217;s famous <em><a href=\"https://en.wikipedia.org/wiki/Organization_of_Behavior\">Organization of Behavior</a></em>, he wrote:</p><blockquote><p>Let us assume that the persistence or repetition of a reverberatory activity (or &#8220;trace&#8221;) tends to induce lasting cellular changes that add to its stability. The assumption can be precisely stated as follows: When an axon of cell A is near enough to excite cell B and repeatedly or persistently takes part in firing it, some growth process or metabolic change takes place in one or both cells so that A&#8217;s efficiency as one of the cells firing B, is increased.</p></blockquote><p>Hebb&#8217;s idea is now usually paraphrased as &#8220;<a href=\"https://en.wikipedia.org/wiki/Hebbian_theory\">neurons that fire together, wire together</a>&#8221;.</p><p>But when did the plastic change hypothesis become the SPM hypothesis? When did we mostly forget about changes to intrinsic excitability, or changes in other properties of single neurons? (I say &#8220;mostly&#8221; because people know that intrinsic excitability can change, and you sometimes see studies that acknowledge its existence and say something about it, but the idea remains niche. It seems to be in the category of things that one <em>could</em> pay attention to, but that one doesn&#8217;t <em>need</em> to pay attention to in practice. Synaptic weights are thought to be way more important.)</p><p>Kandel doesn&#8217;t say, probably because he wrote his textbook (remember: 1976!) before the SPM hypothesis supplanted the more general plastic change hypothesis. But Martin, Greenwood, and Morris <em>do</em> comment on this in the introduction to their paper. They reference <a href=\"https://en.wikipedia.org/wiki/Long-term_potentiation\">long-term potentiation</a> (LTP), the phenomenon that increases in synaptic weights can be maintained on a time scale of minutes to months, which was only discovered in mammals in the late 1960s and early 1970s. LTP was given its modern name in <a href=\"https://www.sciencedirect.com/science/article/abs/pii/0006899375906976?via%3Dihub\">1975</a>, just one year before Kandel&#8217;s textbook was published.</p><p>Martin, Greenwood, and Morris wrote:</p><blockquote><p>In short, thinking about LTP&#8217;s putative role in memory has moved on from a relatively simple hypothesis (Hebb 1949) to a set of more specific ideas about activity-dependent synaptic plasticity and the multiple types of memory that we now know to exist (Kandel &amp; Schwartz 1982, Lynch &amp; Baudry 1984, McNaughton &amp; Morris 1987, Morris &amp; Frey 1997). These distinct hypotheses do, however, share a common core, which we will call the synaptic plasticity and memory (SPM) hypothesis &#8230;</p></blockquote><p>They acknowledge the existence of changes to neuron-intrinsic properties like excitability, but view synaptic weight changes as more important, and as most probably the locus of learning and memory storage. Apart from LTP and <a href=\"https://en.wikipedia.org/wiki/Long-term_depression\">long-term depression</a> (LTD), which refers to a persistent weakening of synaptic weights,</p><blockquote><p>There are other forms of activity-dependent neuronal plasticity, such as excitatory postsynaptic potential (EPSP)-spike potentiation and changes in membrane properties (e.g. after-hyper-polarization); these are not, in general, input specific. We recognize, but also exclude from detailed discussion, experience-dependent alterations in neurogenesis or cell survival (Kempermann et al 1997, Gould et al 1999, van Praag et al 1999). These may reflect the nervous system creating the neural space for subsequent learning rather than the on-line encoding of the specific experiences that trigger this change.</p></blockquote><p>Interestingly, they also reference the idea (&#8220;experience-dependent alterations in neurogenesis or cell survival&#8221;) that learning and memory could happen through introducing new neurons to circuits, or removing old neurons, but implicitly claim that such changes aren&#8217;t important compared to synaptic weight changes.</p><p>In a follow-up review paper from 2014, where Morris is again the last author, Morris essentially sticks to his guns: (Takeuchi, Duszkiewicz, and Morris, <em>Phil. Trans. R. Soc. B</em>, 2014)</p><blockquote><p>Martin et al. laid out a framework for testing rigorously the widely held notion that synaptic potentiation and depression are key players in mediating the creation of memory traces or engrams. That framework has stood the test of time, with exciting new approaches using contemporary techniques exploring the idea further with respect to detectability, anterograde and retrograde alteration. &#8230; Critical experiments remain to be done, but the neuroscience community can justifiably feel tantalizingly close to having tested one of the great ideas of modern neuroscience. Forty years on, LTP continues to excite us all as it slowly gives up its mechanistic secrets and reveals its important functional role in learning and memory.</p></blockquote><p>The rough history of the SPM hypothesis, then, goes something like this. Around 1900, there was still much we didn&#8217;t know about the nervous system (or biology, for that matter; remember that molecular biology really only got started in the 1950s), but even early workers like Ram&#243;n y Cajal recognized that connections between neurons could offer a useful substrate for modulating circuit behavior, and hence for learning and memory. This lead to the &#8220;plastic change hypothesis&#8221;, which took a more modern form around 1950 with the work of Hebb et al. When LTP and LTD were discovered in the 1970s, and appeared to successfully account for a variety of longer-term forms of learning, the stock of synaptic weight changes rose, and the stock of other known forms of plasticity (e.g., plasticity in single-neuron properties, and in rates of neuron creation and death) fell. By 2000, when the SPM hypothesis paper was published, workers had good reason to believe LTP and LTD explained most learning and memory phenomena of interest. Other forms of synaptic plasticity were discovered after LTP and LTD, like <a href=\"https://en.wikipedia.org/wiki/Homeostatic_plasticity\">homeostatic plasticity</a> and <a href=\"https://en.wikipedia.org/wiki/Spike-timing-dependent_plasticity\">spike-timing-dependent plasticity</a>, but the SPM hypothesis is general enough to accommodate them. After ANNs succeeded at pretty much every task we threw at them since the early 2010s, and people started to focus on ANN-based models of the brain, the SPM hypothesis became a dogma.</p><p>It&#8217;s worth pointing out that there are other ideas about potential biological substrates of memory that don&#8217;t fit neatly within this linear narrative. We&#8217;ll discuss one such idea a bit later.</p><h1><strong>V. THE NECESSITY OF SYNAPTIC WEIGHT CHANGES FOR MEMORY</strong></h1><p>The SPM hypothesis says that synaptic weight changes are necessary for learning and memory. Is that true? I think the answer is a strong <em>no</em>, for a few different types of reasons. (And it goes without saying that this will impact my final rating of the SPM hypothesis.)</p><p>First, <strong>it&#8217;s uncontroversial that there are other forms of information storage</strong>, even in humans. There&#8217;s <a href=\"https://en.wikipedia.org/wiki/Immunological_memory\">immune memory</a>, which involves the production of antibodies and changes in T and B cells, all of which help immune systems respond more quickly and effectively to previously encountered pathogens. The existence of this type of memory is majorly responsible for why many of us are not constantly hobbled by sickness.</p><p>Apparently there&#8217;s some debate over whether immune memory really &#8216;counts&#8217; as memory, or at least as memory anything like the cognitive forms of memory psychologists study. A paper by philosopher David Cola&#231;o (&#8220;<a href=\"https://link.springer.com/article/10.1007/s13164-025-00768-x\">On Consistently Assessing Alleged Mnemonic Systems (or, why isn&#8217;t Immune Memory &#8220;really&#8221; Memory?)</a>&#8221;), says that there are two common arguments against &#8216;counting&#8217; immune memory as a cognitive-like form of memory:</p><blockquote><p>The first is that the immune system does not exhibit the errors exemplified in human memory, which I call the <em>Error Argument</em>. The second is that the immune system can be described and explained in causal terms alone, which I call the <em>Mere Causal Argument</em>.</p></blockquote><p>The &#8220;Error Argument&#8221; is about the fact that there are characteristic ways humans <em>misremember</em> things, or can be manipulated to misremember things, for example by prompting. (If you&#8217;ve taken an intro psychology course, maybe you&#8217;ve heard of the <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0022537174800113\">car crash Loftus and Palmer stuff</a>.) The &#8220;Mere Causal Argument&#8221; is apparently about the requirement that memory, like other cognitive things, ought to involve some latent variables, and not be totally input-dependent. Cola&#231;o elaborates:</p><blockquote><p>Many things that might seem cognitive (or specifically mnemonic) can be described and explained in causal terms alone, this argument continues. For instance, Adams and Garrison claim that the behavior of bacteria might initially seem cognitive, but &#8220;on closer inspection there are complete explanations (none of which constitute cognitive processing)&#8221; (Adams and Garrison 2013, p. 341). They conclude that &#8220;there are non-representational explanations of why they do what they do,&#8221; such as chemical or physical explanations that are causal, while &#8220;the explanation of cognitive behavior includes the representational content of the internal states&#8221; (Adams and Garrison 2013, p. 346).</p></blockquote><p>I can&#8217;t convey how much I hate this kind of argument and find it stupid. Either you believe everything is ultimately elementary particles obeying the laws of physics, as <a href=\"https://plato.stanford.edu/entries/physicalism/\">physicalism</a> posits, or you don&#8217;t. If you don&#8217;t, fair enough, but I&#8217;m not sure how you&#8217;d falsify your position. If you <em>do</em> believe this, then thoughts, feelings, and so on are just useful ways of <em>talking</em> about a complex physical system. One way of talking involves molecules, while another way involves things like thoughts and feelings. Just because you can describe the molecular interactions relevant for some memory system, doesn&#8217;t mean it&#8217;s not a memory system, or not cognitive. Most neuroscientists would agree that an SPM-hypothesis-like account of memory can ultimately be described in terms of interactions between molecules, and moreover would deny that this means it doesn&#8217;t count as memory.</p><p><strong>There are other known forms of non-synaptic memory, too</strong>, with <a href=\"https://en.wikipedia.org/wiki/Epigenetics\">epigenetics</a> being a cool (but not totally well understood) form. One interesting example of it in action: people who were still in the womb during a famine experienced additional health problems later in life, including higher rates of obesity. And in some cases, <a href=\"https://www.nature.com/articles/s41418-023-01159-4\">so did their kids, and their </a><em><a href=\"https://www.nature.com/articles/s41418-023-01159-4\">kids&#8217; kids</a></em>. Their bodies remembered the famine, and passed on that memory to multiple generations of offspring. How? People think that epigenetic changes like <a href=\"https://en.wikipedia.org/wiki/DNA_methylation\">DNA methylation</a> are responsible, since these changes can be fairly stable, and can be heritable.</p><p>Next, <strong>experiments have shown examples of non-synaptic memory storage</strong>. A study from the lab of UCLA neurobiologist David Glanzman (&#8220;<a href=\"https://elifesciences.org/articles/3896\">Reinstatement of long-term memory following erasure of its behavioral and synaptic expression in </a><em><a href=\"https://elifesciences.org/articles/3896\">Aplysia</a></em>&#8221;) showed that you can erase synaptic weight changes in sea slugs, and that this doesn&#8217;t totally erase the associated memory. The memory could be reinstated&#8212;that is, they found you can &#8216;jog&#8217; the memory of the slugs&#8212;which seems to imply that memory was stored somewhere other than in synaptic weights.</p><p>A dramatic followup experiment by Glanzman&#8217;s group suggested that the memory was at least partly stored as RNA. Their experiment involved sensitizing one slug to touch, by shocking it, extracting RNA from that slug, and then injecting that RNA into a <em>different</em> slug. They found that the second slug became sensitive to touch, <em>as if it had been shocked</em>. In other words, it seems like the &#8216;memory&#8217; of the shock got transferred! See their 2018 paper (&#8220;<a href=\"https://www.eneuro.org/content/5/3/ENEURO.0038-18.2018.short\">RNA from Trained Aplysia Can Induce an Epigenetic Engram for Long-Term Sensitization in Untrained Aplysia</a>&#8221;), and a related 2019 review article (&#8220;<a href=\"https://www.nature.com/articles/s41539-019-0048-y\">Is plasticity of synapses the mechanism of long-term memory storage?</a>&#8221;) for more discussion.</p><p>Finally, forget about synaptic weight changes, and forget about synapses all together. <strong>Even single cells can learn and store memories!</strong> To me, this is the most persuasive argument against the necessity of synapses. Single-celled organisms, by definition, are just one cell, and hence have no nervous system or synapses to speak of. Yet it appears that they can learn and store (ethologically relevant) memories. The memories in question are certainly much simpler than what you might have in mind when you imagine human memory; a paramecium isn&#8217;t waxing nostalgic over its most recent birthday party. But one can argue that they are memories nonetheless.</p><p>What kinds of memories do single cells possess? The full gamut of possibilities is unclear, but a simple and well-studied kind of memory is <em><a href=\"https://en.wikipedia.org/wiki/Habituation\">habituation</a></em>. The idea is that you take a single cell, and repeatedly subject it to some stimulus, like a physical poke or light flash. Often, cells repeatedly subjected to a stimulus like this will eventually either decide to escape, or become desensitized to the stimulus. If you poke a cell too much, but it comes to &#8216;think&#8217; that your pokes don&#8217;t matter, it starts ignoring them. &#8220;<em>You&#8217;re just messing with me</em>,&#8221; it might say if it could talk.</p><p>The habituation behavior of the ciliate <em><a href=\"https://en.wikipedia.org/wiki/Stentor_coeruleus\">Stentor</a> <a href=\"https://www.youtube.com/watch?v=PZoaKzEXzi8\">coeruleus</a></em> is a canonical example. It&#8217;s shaped like a tiny trumpet, or rice grain. When it gets physically poked, it contracts. When you poke it enough, it <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1002/neu.480010309\">stops</a> <a href=\"https://app.jove.com/t/64692/studying-habituation-in-stentor-coeruleus\">responding</a>, and maintains its long tube shape despite your pokes.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!L8xm!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86f0bf41-9eb2-4e6b-8f25-57cf5bb295df_1266x306.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"155.65876777251185\" src=\"https://substackcdn.com/image/fetch/$s_!L8xm!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86f0bf41-9eb2-4e6b-8f25-57cf5bb295df_1266x306.png\" width=\"644\" /><div></div></div></a><figcaption class=\"image-caption\"><em>Stentor coeruleus </em>under different states of contraction. It normally looks like a long tube, but contracts as a response to potentially threatening stimuli, like mechanical forces.</figcaption></figure></div><p>Habituation is admittedly extremely simple, but even a behavior as simple as this remains mysterious in some ways. Consider this: if you wait a while after <em>Stentor</em> stops responding, it will &#8216;recover&#8217;. That is, it will respond if you start poking it again. Keep poking it for long enough a <em>second</em> time, and it will stop responding a second time. Here&#8217;s the interesting part: in the second &#8216;round&#8217;, it will stop responding to your pokes <em>faster than it did the first time</em>. This implies that it &#8216;remembers&#8217; that it got poked a bunch sometime in the recent past. In other words, there is the shorter-term memory of the recent pokes (&#8216;the current pokes are not dangerous, so I should stop responding&#8217;) and a longer-term memory of less-recent pokes (&#8216;the current pokes are like the previous pokes, which were not dangerous, so I should learn faster this time&#8217;). How does this work? There are ideas out there, but the truth is that no one really knows! Obviously, the mechanism for this type of multiple-time-scale memory can&#8217;t rely on synapses.</p><p>Gershman, Balbi, Gallistel, and Gunawardena discuss some of the history of single-cell learning and related controversies (for example, does this really &#8216;count&#8217; as learning and memory?) in a recent and readable review paper titled &#8220;<a href=\"https://elifesciences.org/articles/61907\">Reconsidering the evidence for learning in single cells</a>&#8221;. Although times are changing, in the mid-twentieth century there was serious resistance to the idea that single cells could learn and store memories. <a href=\"https://en.wikipedia.org/wiki/Beatrice_Gelber\">Beatrice Gelber</a> was a pioneering scientist that studied learning in protozoa like paramecia. As Gershman et al. recount, she encountered substantial resistance to the idea that paramecia could exhibit sophisticated learning, even from other psychologists working on paramecia. Donald Jensen, one such psychologist, wrote:</p><blockquote><p>Gelber freely applies to Protozoa concepts (reinforcement and approach response) and situations (food presentation) developed with higher metazoan animals. I feel that such application overestimates the sensory and motor capabilities of this organism&#8230; If analogies are necessary, a more apt one might be that of an earthworm which crawls and eats its way through the earth, blundering onto food-rich soil and avoiding light, heat, and dryness. Gelber&#8217;s assertion loses its force when the blind, filter-feeding mode of life of Paramecia is considered.</p></blockquote><p>As Gershman et al. note, this is probably a bad analogy, since worms have been found to exhibit fairly sophisticated learning and memory! This was clear even in 1957, when Jensen wrote.</p><p>If you buy that single cells can learn and store memories, you should probably also believe that the associated mechanisms, which must be based on molecules internal to the cell rather than synaptic weights, are probably widely conserved across evolution. After all, evolution is a <a href=\"https://en.wikipedia.org/wiki/Evolutionary_tinkering\">tinkerer</a>, and something that previously worked is extremely likely to be used again. This is especially true for things that are really important, like <a href=\"https://en.wikipedia.org/wiki/Endless_Forms_Most_Beautiful_(book)\">developmental mechanisms</a>&#8212;so why not for memory, something similarly basic and important?</p><p>Relatedly, it seems unlikely that no organism could learn or remember <em>anything</em> before synapses existed. There had to be some other, simpler mechanism that worked before large-scale, synapse-based neural networks were common. But if this is true, why wouldn&#8217;t it continue to be used in one form or another <em>after</em> modifications to synaptic weights began to play a role in learning and memory?</p><p>(On the other hand, it&#8217;s certainly true that one mechanism can strongly supplant another. Consider that lesions to the <a href=\"https://en.wikipedia.org/wiki/Motor_cortex\">motor cortex</a>, a relatively newer brain structure, are devastating to humans, but not necessarily <a href=\"https://doi.org/10.1016/j.neuron.2015.03.024\">that</a> <a href=\"https://www.nature.com/articles/s41593-024-01792-3\">serious</a> for other mammals. The motor cortex is just one brain area involved in motor control, but is particularly dominant in humans. How to think about this <a href=\"https://www.frontiersin.org/journals/neuroscience/articles/10.3389/fnins.2023.971980/full\">isn&#8217;t completely clear</a>.)</p><p>Before I end this section, I want to go back to one of the arguments Cola&#231;o discussed. It seems like a lot of our argument hinges on what we mean by learning and memory. If we accept that the simple changes in behavior exhibited by single cells or sea slugs reflect some form of &#8216;learning&#8217; or &#8216;memory&#8217;, then it really does seem like one has to take a broader view, and (for example) engage with non-synaptic mechanisms. Some people might just not think these behavioral changes are worth associating with the rich phenomenology of human memory.</p><p>How should we define memory, then? I think it&#8217;s worth taking a permissive view, since otherwise&#8212;essentially by definition&#8212;we&#8217;re excluding non-human animals, or non-human complex systems more generally, from being able to learn and store memories. Biology is complicated, and it&#8217;s plausible to me that something as basic as memory is a matter of degree rather than kind. Maybe single cells don&#8217;t exhibit <em>all</em> of the rich phenomenology associated with human memories, but there are still important enough similarities that we should use some of the same words.</p><p>A minimal definition of learning and memory is something like &#8220;<a href=\"https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2019.02523/full\">the capacity to store and retrieve information</a>&#8221; on some time scale. This is a bit impoverished, but I think it does the job.</p><p>Did we go too far? If you kick a rock, so that a piece of it breaks off, does this mean that the rock now &#8216;stores&#8217; information about you kicking it, and hence &#8216;memorizes&#8217; something about your kick? I&#8217;d bite the bullet and say <em>yes</em>. But a rock can&#8217;t use the absence of that piece to inform adaptive behavior in the same way that a living organism can, or equivalently its retrieval capabilities are extremely limited. It also has more limited storage capabilities: your friend will remember a whole temporal sequence of you kicking them (and will probably not be too happy), whereas the rock can probably only &#8216;store&#8217; the final result. In other words, maybe there&#8217;s a sense in which non-living physical systems like rocks have memory, but it isn&#8217;t very good.</p><h1><strong>VI. THE SUFFICIENCY OF SYNAPTIC WEIGHT CHANGES FOR MEMORY</strong></h1><p>The SPM hypothesis says that synaptic weight changes are sufficient for learning and memory. Is that true? I think the answer is again a strong <em>no</em>.</p><p>We&#8217;ve already encountered Glanzman et al.&#8217;s experiments, which suggest (at least in sea slugs) that synaptic weights are not the only format for information storage. These experiments directly falsify one of Martin, Greenwood, and Morris&#8217; proposed tests: you can destroy a bunch of synaptic weights, but not destroy the associated memory.</p><p>There&#8217;s a more dramatic example of large-scale synaptic weight destruction in nature whose phenomenology parallels that finding. In the process of becoming a butterfly, a caterpillar&#8217;s entire body&#8212;including its brain&#8212;undergoes major structural changes. These changes involve a vast array of synapses being pruned, remodeled, and generally reorganized. And despite all of this, it seems like it&#8217;s at least possible that a butterfly can <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0001736\">retain</a> <a href=\"https://www.tandfonline.com/doi/full/10.1080/19420889.2015.1073424#d1e159\">memories</a> of its life as a caterpillar. More generally, this seems to be true of <a href=\"https://en.wikipedia.org/wiki/Holometabolism\">holometabolous insects</a>, which have distinct larval and adult stages.</p><p>Blackiston, Shomrat, and Levin discuss more examples like this in a 2015 article titled &#8220;<a href=\"https://www.tandfonline.com/doi/full/10.1080/19420889.2015.1073424#d1e159\">The stability of memories during brain remodeling: A perspective</a>&#8221;:</p><blockquote><p>Holometabolous insects reorganize their brains during pupation in the transition from larva to adult, with many neurons of the central nervous system pruning to the cell body before the generation of adult specific structures. Planarian species are capable of regenerating their entire brain from a tail fragment in the event of fission or amputation, with new tissue arising from a neoblast stem cell population. Arctic ground squirrels demonstrate a drastic reduction in brain volume during hibernation at near freezing temperatures, which is corrected within hours of arousal. In all 3 of these animal groups, learned behaviors have been observed to survive the striking reorganization of the brain.</p></blockquote><p>Sam Gershman, in a magisterial 2023 review (&#8220;<a href=\"https://gershmanlab.com/pubs/memory_synthesis.pdf\">The molecular memory code and synaptic plasticity: A synthesis</a>&#8221;), elaborates on regeneration and planaria learning:</p><blockquote><p>&#8230; if repeatedly shocked after presentation of a light, a planarian will learn to avoid the light (Thompson and McConnell, 1955). Now suppose you cut off a planarian&#8217;s head after it has learned to avoid light. Within a week, the head will have regrown. The critical question is: will the new head remember to avoid light? Remarkably, a number of experiments, using light-shock conditioning and other learning tasks, suggested (albeit controversially) that the answer is yes (McConnell et al., 1959; Corning and John, 1961; Shomrat and Levin, 2013). What kind of memory storage mechanism can withstand utter destruction of brain tissue?</p></blockquote><p>It&#8217;s worth pointing out that some of these examples are controversial, or at least not nearly as well-studied as more mainstream memory-related phenomena. But if any of these examples is at least <em>kind of</em> true, the SPM hypothesis doesn&#8217;t come out looking great. These examples also speak against the possibility that non-synaptic memory mechanisms are just &#8216;edge cases&#8217;, since the behaviors involved (metamorphosis, regeneration, and hibernation) are pretty varied, and also fairly important for the animals that perform them.</p><p><strong>And there are other reasons to think synapses are insufficient as a learning and memory storage mechanism</strong>. Synaptic weights naturally &#8216;decay&#8217; and &#8216;turn over&#8217; on a time scale of hours to weeks. In that sense, they are not completely stable places to store information. In the aforementioned 2023 review, Gershman points this out as a serious problem with a synaptic-weight-based account of learning and memory:</p><blockquote><p>Excitatory synapses are typically contained in small dendritic protrusions, called spines, which grow after induction of LTP (Engert and Bonhoeffer, 1999). Spine sizes are in constant flux (see Mongillo et al., 2017, for a review). Over the course of 3 weeks, most dendritic spines in auditory cortex will grow or shrink by a factor of 2 or more (Loewenstein et al., 2011). In barrel cortex, spine size changes are smaller but still substantial (Zuo et al., 2005). Spines are also constantly being eliminated and replaced, to the extent that most spines in auditory cortex are replaced entirely over the same period of time (Loewenstein et al., 2015). In the hippocampus, the lifetime of spines is even shorter&#8212;approximately 1&#8211;2 weeks (Attardo et al., 2015). Importantly, much of the variance in dendritic spine structure is independent of plasticity pathways and ongoing neural activity (Minerbi et al., 2009; Dvorkin and Ziv, 2016; Quinn et al., 2019; Yasumatsu et al., 2008), indicating that these fluctuations are likely not generated by the covert operation of classical plasticity mechanisms. Collectively, these observations paint a picture of profound synaptic instability.</p></blockquote><p>How can we remember things for years with synapses that turn over on a time scale of weeks or less? Maybe we can imagine neural circuits playing an elaborate game of <a href=\"https://en.wikipedia.org/wiki/Hot_potato\">hot potato</a>, and constantly moving information around to prevent synaptic turnover from destroying it. But this explanation seems problematic given the orders of magnitude that separate hours and weeks from decades.</p><p>At this point, I think it&#8217;s helpful to recall a point we made earlier: persistent activity, reverberations of neural activity due to some previously presented stimulus, is probably a reasonable mechanism for <em>short-term</em> memory, but not long-term memory. Maybe there are tricks one can play to get it to hold onto information for a little longer, but these will only go so far&#8212;it faces a fundamental limitation. But this isn&#8217;t the end of the world, because it can couple to a longer-term memory mechanism so that one gets the best of both worlds. (Persistent activity can&#8217;t hold onto information as long as a synaptic-weight-based mechanism, but its faster dynamics make it more responsive to stimuli, which is good for <em>inputting</em> a quickly-changing signal.) The idea that persistent activity and longer-term storage mechanisms interact is popular, and is sometimes called the &#8220;<a href=\"https://www.nature.com/articles/nn1100_1166\">dual-trace</a>&#8221; theory.</p><p>Maybe it&#8217;s turtles all the way down? If synaptic weights turn over on a time scale of weeks, maybe there&#8217;s something slower that turns over on a time scale of months. And maybe there&#8217;s something else that&#8217;s slower than that. Why just one &#8216;fast&#8217; and one &#8216;slow&#8217; mechanism? Why not &#8216;fast&#8217;, and &#8216;slow&#8217;, and &#8216;even slower&#8217;, and &#8216;even slower than that&#8217;, and so on?</p><p>This line of thinking leads us to an alternative to the SPM hypothesis, which I discuss next.</p><h1><strong>VII. THE CELLULAR PROCESSES AND MEMORY HYPOTHESIS</strong></h1><p>Earlier, I referenced experiments from the Glanzman lab that appeared to show that injecting an untrained sea slug with RNA from a trained slug &#8216;<a href=\"https://www.eneuro.org/content/5/3/ENEURO.0038-18.2018.short\">transferred</a>&#8217; a training-associated memory. It turns out this kind of experiment has a long history.</p><p>In parallel with ideas due to Hebb and others that learning and memory might be associated with the connections between neurons, a different idea floated around: maybe memory was stored via molecules like proteins or RNA. In the 1950s and 1960s, when molecular biology was just getting started and people began to get excited about the possibilities associated with molecules like DNA, this was a natural idea. If a lot of biology could ultimately be described in molecular terms, why not learning and memory too? Were there memory molecules? If so, what were they like, and how did they work? See a (pessimistic) 1976 article by Gaito (&#8220;<a href=\"https://link.springer.com/article/10.3758/bf03326600\">Molecular psychobiology of memory: Its appearance, contributions, and decline</a>&#8221;), one of the early workers in this area, for a sense of how people thought.</p><p><a href=\"https://en.wikipedia.org/wiki/James_V._McConnell\">James McConnell</a> was a psychologist interested in learning and memory, among other things. Inspired by the idea that learning and memory might ultimately be stored in molecules, in 1962 he performed a simple experiment with worms: if you train a worm to be afraid of a light stimulus (by associating it with a shock), and then <em>grind it up and feed it to another worm</em>, does the second worm acquire the fear? Said differently, do you acquire the fears of the animals you eat? In an article hilariously titled &#8220;Memory transfer through cannibalism in planarians&#8221;, McConnell showed that the answer seemed to be <em>yes</em>!</p><p>An <a href=\"https://www.apa.org/monitor/2010/06/memory-transfer\">article in the </a><em><a href=\"https://www.apa.org/monitor/2010/06/memory-transfer\">Monitor</a></em> notes that</p><blockquote><p>The cannibalism studies, both startling and vivid in their imagery, and McConnell, never one to shy away from the media, caught the public eye. At a time when scientists remained sequestered in their labs, McConnell appeared with his cannibalistic worms on television (i.e., &#8220;The Way Out Men,&#8221; &#8220;Mr. Wizard&#8221; and &#8220;The Steve Allen Show&#8221;), while articles profiling his work appeared in Time, Newsweek, Life, Esquire and Fortune. Eminently quotable, McConnell referred to his work as confirming the Mau Mau hypothesis, and the &#8220;McCannibal&#8221; moniker didn&#8217;t bother him one bit. He made grand pronouncements about the future of &#8220;memory pills&#8221; and &#8220;memory injections,&#8221; promising more than he and others working in the area could actually deliver.</p></blockquote><p>Maybe unsurprisingly, the subsequent history of this line of work is muddled. (Otherwise, we probably would&#8217;ve heard about &#8220;memory pills&#8221; and &#8220;memory injections&#8221;.) It didn&#8217;t help that McConnell first published these results in a journal he ran called <em><a href=\"https://www.goodreads.com/book/show/8466815-the-worm-re-turns\">Worm Runner&#8217;s Digest</a></em>, which mixed science with satire. Also, people had a hard time reproducing McConnell&#8217;s result, especially in animals more sophisticated than worms. On this point, Gershman <a href=\"https://gershmanlab.com/pubs/memory_synthesis.pdf\">writes</a> that</p><blockquote><p>The first studies of memory transfer between rodents were reported by four separate laboratories in 1965 (Babich et al., 1965b,a; Fjerdingstad et al., 1965; Reinis, 1965; Ungar and Oceguera-Navarro, 1965). By the mid-1970s, hundreds of rodent memory transfer studies had been carried out. According to one tally (Dyal, 1971), approximately half of the studies found a positive transfer effect. This unreliability, combined with uncertainty about the underlying molecular substrate and issues with inadequate experimental controls, were enough to discredit the whole line of research in the eyes of the neuroscience community (Setlow, 1997).</p></blockquote><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!tECw!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1ea3c600-4b5b-46cc-9981-8624f2918167_692x1072.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"852.0231213872833\" src=\"https://substackcdn.com/image/fetch/$s_!tECw!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1ea3c600-4b5b-46cc-9981-8624f2918167_692x1072.png\" width=\"550\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">The cover of a collection of articles from <em>Worm Runner&#8217;s Digest</em>, where McConnell first published his worm cannibalism results.</figcaption></figure></div><p>For this and a variety of other reasons&#8212;including the discovery of LTP, which boosted the idea that synaptic weights were causally related to learning and memory&#8212;by the late 1970s, researchers became generally pessimistic about the prospects of the &#8220;biochemical&#8221; memory hypothesis.</p><p>But people never <em>totally</em> gave it up.</p><p>Over the years, various researchers have made apparently unrelated suggestions that this or that molecule might provide a potential memory storage mechanism. <a href=\"https://en.wikipedia.org/wiki/Francis_Crick\">Francis Crick</a>, of Watson and Crick fame, suggested that <a href=\"https://en.wikipedia.org/wiki/Post-translational_modification\">post-translational modifications</a> of proteins (i.e., you take a protein and you glue something to it) are an <a href=\"https://www.nature.com/articles/312101a0\">appealing potential memory storage format</a>. Robin Holliday <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0022519399909955?via%3Dihub\">suggested that</a> epigenetic mechanisms like DNA methylation might play a role in long-term memory. Various people suggested that specific molecules like <a href=\"https://en.wikipedia.org/wiki/Ca2%2B/calmodulin-dependent_protein_kinase_II\">CaMKII</a> or <a href=\"https://en.wikipedia.org/wiki/CREB\">CREB transcription factors</a> could store memory, or at the very least were causally involved in memory formation in an important way.</p><p>Over the years, there were a number of reviews and perspectives on these somewhat heterodox approaches to learning and memory. And over the past ten years, they&#8217;ve grown increasingly common. Consider these titles:</p><blockquote><p>&#8220;<a href=\"https://ruccs.rutgers.edu/images/personal-charles-r-gallistel/publications/GallistelBalsamLngMemory2014.pdf\">Time to rethink the neural mechanisms of learning and memory</a>&#8221;</p><p>Gallistel and Balsam, <em>Neurobiology of Learning and Memory</em> (2014)</p><p>&#8220;<a href=\"https://www.frontiersin.org/journals/systems-neuroscience/articles/10.3389/fnsys.2016.00088/full\">The Demise of the Synapse As the Locus of Memory: A Looming Paradigm Shift?</a>&#8221;</p><p>Trettenbrein, <em>Front. Syst. Neurosci</em>. (2016)</p><p>&#8220;<a href=\"https://www.nature.com/articles/s41539-019-0048-y\">Is plasticity of synapses the mechanism of long-term memory storage?</a>&#8221;</p><p>Abraham, Jones, and Glanzman, <em>npj Science of Learning</em> (2019)</p><p>&#8220;<a href=\"https://doi.org/10.1016/j.nlm.2020.107164\">Locating the engram: Should we look for plastic synapses or information-storing molecules?</a>&#8221;</p><p>Langille and Gallistel, <em>Neurobiology of Learning and Memory</em> (2020)</p><p>&#8220;<a href=\"https://elifesciences.org/articles/61907\">Reconsidering the evidence for learning in single cells</a>&#8221;</p><p>Gershman, Balbi, Gallistel, and Gunawardena, <em>eLife</em> (2021)</p><p>&#8220;<a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0006291X21007518\">The central importance of nuclear mechanisms in the storage of memory</a>&#8221;</p><p>Gold and Glanzman, <em>Biochemical and Biophysical Research Communications</em> (2021)</p><p>&#8220;<a href=\"https://doi.org/10.1177/10738584221086488\">Memory: Synaptic or Cellular, That Is the Question</a>&#8221;</p><p>Arshavsky, <em>The Neuroscientist</em> (2023)</p></blockquote><p>All right, all right, we get it! Synapses aren&#8217;t enough!</p><p>But despite the pleading of these titles, in 2025 this still very much remains a minority view, or at the very least something most neuroscientists don&#8217;t think about regularly. (Maybe if you asked them to really think about it, they&#8217;d agree that there&#8217;s potentially something interesting going on.) It&#8217;s also apparently hard to get mainstream funding to study possible non-synaptic, molecular mechanisms for memory. I heard secondhand that Glanzman has had trouble getting funding since he published those studies. I&#8217;m not sure whether this anecdote is true, but if it <em>is</em> true, it&#8217;s surprising. You can give someone a memory by having them eat someone else with that memory? Seriously? That is objectively <em>insanely cool</em>, and I don&#8217;t know why more people aren&#8217;t excited about it.</p><p>Where does all of this leave us? Maybe at this point you&#8217;re on board, and think that synaptic weight changes are neither necessary nor sufficient for learning and memory. So what&#8217;s the alternative? Is it just the SPM hypothesis plus plus, where we take synaptic mechanisms and tack on a bunch of additional mechanisms? Kind of, but we can do a little better than that.</p><p>As an alternative to the SPM, I want to put forward the <strong>cellular processes and memory hypothesis</strong> (CPM). In the spirit of Martin, Greenwood, and Morris&#8217; 2000 review article, I&#8217;ll define the CPM hypothesis as the claim that:</p><blockquote><p><em>The formation, consolidation, and retrieval of learning and memory in biological systems often involves stimulus-dependent, non-synaptic molecular and intracellular processes. These processes do not just serve synaptic-weight-based mechanisms, but provide complementary mechanisms. They are necessary for making and keeping long-term memories, but not sufficient, and interact with synaptic-weight-based mechanisms in nontrivial ways.</em></p></blockquote><p>(Just to be clear, this idea definitely isn&#8217;t original to me. I&#8217;m just the only one calling it this.)</p><p>What are these molecular and intracellular processes I allude to? Is learning and memory stored in RNA, as McConnell thought and Glanzman et al.&#8217;s experiments suggest? Is it stored in post-translational modifications to proteins, like Crick thought? Is it stored via epigenetic mechanisms, or in the stable states of gene regulatory networks, or in the action of transcription factors?</p><p>The truth is that no one really knows. But I think there&#8217;s evidence for all of these, and in general a good rule of thumb is to believe that biology embraces a multiplicity of solutions when more than one solution exists. I&#8217;d bet that all of these things contribute, and work together with synaptic-weight-based mechanisms to store long-term memories.</p><p>Two final comments here, because now we&#8217;re getting (even more) into wild speculation and topics of ongoing research. First, most neurobiologists would agree that molecular mechanisms are involved in learning and memory; this claim is definitely not controversial. What&#8217;s controversial is whether these processes store information <em>independently of</em>, or in a fashion <em>complementary to</em>, synaptic-weight-based mechanisms. If this were the case, molecular mechanisms are certainly there and play a role, but may not be that interesting from a higher-level computational or systems perspective. They&#8217;re details that we can just abstract away.</p><p>I don&#8217;t think this is the case, since otherwise the memory transfer experiments and single-cell learning experiments (among others) would be hard to explain. There isn&#8217;t any good reason to believe that RNA molecules track synaptic weight changes, and moreover with a fidelity high enough to encode them well, and moreover that other cells (in other animals!) somehow &#8216;know&#8217; to decode some aspect of those RNA in order to decode something about synaptic weight changes. And if you do believe this, this is basically just saying that RNA molecules encode memory (albeit, memory possibly originally stored in synaptic weight changes), but using more words. The memory transfer experiments, which suggest that molecules like RNA are sufficient for transferring a memory, are consistent with the CPM hypothesis but inconsistent with the SPM hypothesis.</p><p>Lastly, you might wonder: if there are perfectly good synaptic-weight-based mechanisms for learning and memory, why would you need these other mechanisms? I think the answer to this puzzle relates to the relatively short time scale on which synapses turn over, an observation I mentioned earlier. You&#8217;d really like a mechanism that&#8217;s slower, since slower processes tend to hold onto information for longer. Intracellular processes like signaling cascades, gene regulatory dynamics, epigenetic dynamics, and so on all operate on time scales much slower than that of synaptic weight changes. It&#8217;s possible that these intracellular mechanisms are better for storing long-term, but probably not short-term, memories.</p><h1><strong>VIII. THE TERRA INCOGNITA OF CELLULAR MEMORY</strong></h1><p>A few years ago, when I first heard about some of these ideas, I was heavily inspired by a review article I mentioned above (&#8220;<a href=\"https://gershmanlab.com/pubs/memory_synthesis.pdf\">The molecular memory code and synaptic plasticity: A synthesis</a>&#8221;) by Sam Gershman, a neuroscientist and psychologist at Harvard. It makes many of the same points I&#8217;ve made here, and in more detail. I really suggest you read it if you find any of this interesting. Actually, it would be more accurate to say that I <em>learned</em> these points from that article, and spent part of this review just regurgitating them.</p><p>The end of that review is so beautifully written that I can&#8217;t resist quoting it in full here:</p><blockquote><p>Why can so little be firmly asserted, despite decades of intensive research? One reason is that the associative-synaptic conceptualization of memory is so deeply embedded in the thinking of neurobiologists that it is routinely viewed as an axiom rather than as a hypothesis.</p><p>Consequently, the most decisive experiments have yet to be carried out. Looking at the history of research on nuclear mechanisms of memory is instructive because it has long been clear to neurobiologists that DNA methylation and histone modification play an important role. However, the prevailing view has been that these mechanisms support long-term storage at synapses, mainly by controlling gene transcription necessary for the production of plasticity-related proteins (Zovkic et al., 2013). The notion that these nuclear mechanisms might themselves be storage sites effectively became invisible, despite many early suggestions, because such a notion was incompatible with the associative-synaptic conceptualization. It was not the case that a non-associative hypothesis was considered and then rejected; it was never considered at all, presumably because no one could imagine what that would look like. This story testifies to the power of theory, even when implicit, to determine how we interpret experimental data and ultimately what experiments we do (Gershman, 2021).</p><p>We need new beginnings. Are we prepared to take a step off the terra firma of synaptic plasticity and venture into the terra incognita of a molecular memory code?</p></blockquote><p>It isn&#8217;t an exaggeration to say that the SPM hypothesis is a central, foundational element of how most neuroscientists think, whether or not they&#8217;ve heard the term &#8220;SPM hypothesis&#8221;. It&#8217;s been extremely productive, and will no doubt continue to be productive for those that cling to it, but a new world awaits those courageous enough to let go. We ought to embrace a broader conception of how learning and memory might be possible.</p><p>Consider the heart transplant stories we started with. These stories are all <em>extremely weird</em>. Can it really be true that one person can remember someone else&#8217;s first-person experience of death, or acquire someone else&#8217;s sexuality, or know the name of a person they&#8217;ve never met or heard about? According to the CPM hypothesis, these phenomena are at least biologically <em>plausible</em>, and hence worth taking seriously. If memories aren&#8217;t just stored in the connections between cells, but in the cells themselves&#8212;as molecules, or perhaps as dynamic processes involving molecules&#8212;then there&#8217;s no reason to think that memories are particular to the brain. Maybe your memory of your fifth birthday party is in your arm, or leg, or heart. And if it&#8217;s potentially in these weird other places, and if the format in which information is stored is similar from person to person, then why <em>couldn&#8217;t </em>transplanting an organ transplant the memories stored in them?</p><p>If the CPM hypothesis is even partially true, the implications are stunning. Can you forget something about your fifth birthday party if someone chops your arm off? Does eating the liver of an animal give you some of its memories? (Does it depend on the animal, or the body part?) Is cannibalism actually good, at least in the sense that you can acquire nontrivial capabilities of the person you eat? Could we treat a memory-related disease by intervening on someone&#8217;s heart? Could we manipulate memories, or inject new ones, by intervening on a non-brain part of the body? To all of these: maybe. It&#8217;s a brand new world! <em>Terra incognita!</em></p><p>The SPM hypothesis is useful and well-supported, but I hope I&#8217;ve convinced you that it&#8217;s wrong.</p><h1><strong>IX. THE VERDICT</strong></h1><p>Three out of five stars, good for its time but doesn't hold up to modern scrutiny. Like a human leg, a bit tough to swallow.</p><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity",
            "publishedAt": "2025-09-12",
            "source": "SlateStarCodex",
            "summary": "<p><em>[This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked]</em></p><h1><strong>I. THE TASTE OF VICTORY</strong></h1><p>The Tupinamb&#225; people ate their enemies. This fact scared <a href=\"https://en.wikipedia.org/wiki/Hans_Staden\">Hans Staden</a>, a German explorer who was captured by Tupinamb&#225; warriors in 1554, when they caught him by surprise during a hunting expedition. As their prisoner for nearly a year, Staden observed a number of their cannibalism rituals. They were elaborate, public affairs; here&#8217;s a description of them from Duffy and Metcalf&#8217;s <em>The Return of Hans Staden</em>, an assessment of Staden&#8217;s voyage and claims: (Ch. 2, pg. 51-52)</p><blockquote><p>First a rope was placed around the neck of the captive so that he might not escape; at night the rope was tied to the hammock in which the captive slept. Straps that were not removed were placed above and below the knees. The captives were given women, who guarded them and also slept with them. These women were high-status daughters and sisters of",
            "title": "Your Review: The Synaptic Plasticity and Memory Hypothesis"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3141/",
            "publishedAt": "2025-09-12",
            "source": "XKCD",
            "summary": "<img alt=\"Mantle plumes explain Hawaii, Yellowstone, Iceland, the East African Rift, the Adirondack uplift, the Permian extinction, the decline of Rome, the DB Cooper hijacking, and the balrog in Moria. Those little hills of sand in your yard are caused by antle plumes.\" src=\"https://imgs.xkcd.com/comics/mantle_model.png\" title=\"Mantle plumes explain Hawaii, Yellowstone, Iceland, the East African Rift, the Adirondack uplift, the Permian extinction, the decline of Rome, the DB Cooper hijacking, and the balrog in Moria. Those little hills of sand in your yard are caused by antle plumes.\" />",
            "title": "Mantle Model"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/auto-update-post-mortem",
            "publishedAt": "2025-09-12",
            "source": "Zed Blog",
            "summary": "How we broke auto-update in production and what are we going to do going forward.",
            "title": "Auto Update Post-Mortem"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-09-12"
}