{
    "articles": [
        {
            "content": [
                "<p>In a recent post about <a href=\"https://dynomight.net/money/\">trading stuff for money</a>, I mentioned:</p>\n\n<blockquote>\n  <p>Europe had a [blood plasma] shortage of around 38%, which it met by importing plasma from paid donors in the United States, where blood products account for 2% of <em>all</em> exports by value.</p>\n</blockquote>\n\n<p>The internet’s reaction was: “TWO PERCENT?” “<strong>TWO PERCENT OF U.S. EXPORTS ARE BLOOD!?</strong>”</p>\n\n<p>Well, I took that 2% number from a 2024 <a href=\"https://www.economist.com/finance-and-economics/2024/08/29/the-plasma-trade-is-becoming-ever-more-hypocritical\">article in the Economist</a>:</p>\n\n<blockquote>\n  <p>Last year American blood-product exports accounted for 1.8% of the country’s total goods exports, up from just 0.5% a decade ago—and were worth $37bn. That makes blood the country’s ninth-largest goods export, ahead of coal and gold. All told, America now supplies 70% or so of the plasma used to make medicine.</p>\n</blockquote>\n\n<p>I figured the Economist was trustworthy on matters of economics. But note:</p>\n\n<ol>\n  <li>That 1.8% number is for blood <em>products</em>, not just blood.</li>\n  <li>It’s a percentage of <em>goods</em> exported, excluding services.</li>\n  <li>It’s wrong.</li>\n</ol>\n\n<p>The article doesn’t explain how they arrived at 1.8%. And since the Economist speaks in the voice of God (without bylines), I can’t corner and harass the actual journalist. I’d have liked to reverse-engineer their calculations, but this was impossible since the world hasn’t yet caught on that they should always <a href=\"https://dynomight.net/digits/\">show lots of digits</a>.</p>\n\n<p>So what’s the right number? In 2023, total US goods exports were <a href=\"https://www.census.gov/foreign-trade/Press-Release/ft900/ft900_2405.pdf#page=20\">$2,045 billion</a>, almost exactly ⅔ of all exports, including services.</p>\n\n<p>How much of that involves blood? Well, the government keeps statistics on trade based on an insanely detailed <a href=\"https://hts.usitc.gov/reststop/file?release=2023HTSARev8&amp;filename=Chapter%2098\">classification scheme</a>. All goods get some number. For example, <a href=\"https://en.wikipedia.org/wiki/Airship\">dirigibles</a> fall under <a href=\"https://hts.usitc.gov/reststop/file?release=2025HTSRev9&amp;filename=Chapter%2088\">HTS 8801.90.0000</a>:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blood/dirgibles.png\" /></p>\n\n<p>Leg warmers fall under HTS 6406.99.1530:</p>\n\n<p><img alt=\"leg warmers\" src=\"https://dynomight.net/img/blood/leg_warmers.png\" /></p>\n\n<p>So what about blood? Well, <a href=\"https://www.usitc.gov/publications/docs/tata/hts/bychapter/1000c30.pdf#page=3\">HTS 3002</a> is the category for:</p>\n\n<blockquote>\n  <p>Human blood; animal blood prepared for therapeutic, prophylactic or diagnostic uses; antisera and other blood fractions and modified immunological products, whether or not obtained by means of biotechnological processes; vaccines, toxins, cultures of micro-organisms (excluding yeasts) and similar products:</p>\n</blockquote>\n\n<p>The total exports in this category in 2023 were 41.977 billion, or 2.05% of all goods exports. But that category includes many products that don’t require human blood such as most vaccines.</p>\n\n<p>To get the actual data, you need to go through a <a href=\"https://dataweb.usitc.gov/trade/search/Export/HTS\">website</a> maintained by the US Trade Commission. This website has good and bad aspects. On the one hand, it’s slow and clunky and confusing and often randomly fails to deliver any results. On the other hand, when you re-submit, it clears your query and then blocks you for submitting too many requests, which is nice.</p>\n\n<p>But after a lot of tearing of hair, I got what seems to be the most detailed breakdown of that category available. There are some finer subcategories in the taxonomy, but they don’t seem to have any data.</p>\n\n<p>So let’s go through those categories. To start, here are some that would seem to almost always contain human blood:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Category</th>\n      <th>Description</th>\n      <th>Exports ($)</th>\n      <th>Percentage of US goods exports</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>3002.12.00.10</td>\n      <td>HUMAN BLOOD PLASMA</td>\n      <td>5,959,103,120</td>\n      <td>0.2914%</td>\n    </tr>\n    <tr>\n      <td>3002.12.00.20</td>\n      <td>NORMAL HUMAN BLOOD SERA, WHETHER OR NOT FREEZE-DRIED</td>\n      <td>38,992,251</td>\n      <td>0.0019%</td>\n    </tr>\n    <tr>\n      <td>3002.12.00.30</td>\n      <td>HUMAN IMMUNE BLOOD SERA</td>\n      <td>5,608,090</td>\n      <td>0.0003%</td>\n    </tr>\n    <tr>\n      <td>3002.12.00.90</td>\n      <td>ANTISERA AND OTHER BLOOD FRACTIONS</td>\n      <td>4,808,069,119</td>\n      <td>0.2351%</td>\n    </tr>\n    <tr>\n      <td>3002.90.52.10</td>\n      <td>WHOLE HUMAN BLOOD</td>\n      <td>22,710,898</td>\n      <td>0.0011%</td>\n    </tr>\n    <tr>\n      <td><strong>TOTAL</strong></td>\n      <td><strong>(YES BLOOD)</strong></td>\n      <td><strong>10,834,483,478</strong></td>\n      <td><strong>0.5298%</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Next, there are several categories that would seem to essentially <em>never</em> contain human blood:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Category</th>\n      <th>Description</th>\n      <th>Exports ($)</th>\n      <th>Percentage of US goods exports</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>3002.12.00.40</td>\n      <td>FETAL BOVINE SERUM (FBS)</td>\n      <td>146,026,727</td>\n      <td>0.0071%</td>\n    </tr>\n    <tr>\n      <td>3002.42.00.00</td>\n      <td>VACCINES FOR VETERINARY MEDICINE</td>\n      <td>638,191,743</td>\n      <td>0.0312%</td>\n    </tr>\n    <tr>\n      <td>3002.49.00.00</td>\n      <td>VACCINES, TOXINS, CULTURES OF MICRO-ORGANISMS EXCLUDING YEASTS, AND SIMILAR PRODUCTS, NESOI</td>\n      <td>1,630,036,341</td>\n      <td>0.0797%</td>\n    </tr>\n    <tr>\n      <td>3002.59.00.00</td>\n      <td>CELL CULTURES, WHETHER OR NOT MODIFIED, NESOI</td>\n      <td>79,384,134</td>\n      <td>0.0039%</td>\n    </tr>\n    <tr>\n      <td>3002.90.10.00</td>\n      <td>FERMENTS</td>\n      <td>361,418,233</td>\n      <td>0.0177%</td>\n    </tr>\n    <tr>\n      <td><strong>TOTAL</strong></td>\n      <td><strong>(NO BLOOD)</strong></td>\n      <td><strong>2,869,107,296</strong></td>\n      <td><strong>0.1403%</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Finally, there are categories that include <em>some</em> products that <em>might</em> contain human blood:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Category</th>\n      <th>Description</th>\n      <th>Exports ($)</th>\n      <th>Percentage of US goods exports</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>3002.13.00.00</td>\n      <td>IMMUNOLOGICAL PRODUCTS, UNMIXED, NOT PUT UP IN MEASURED DOSES OR IN FORMS OR PACKINGS FOR RETAIL SALE</td>\n      <td>624,283,112</td>\n      <td>0.0305%</td>\n    </tr>\n    <tr>\n      <td>3002.14.00.00</td>\n      <td>IMMUNOLOGICAL PRODUCTS, MIXED, NOT PUT UP IN MEASURED DOSES OR IN FORMS OR PACKINGS FOR RETAIL SALE</td>\n      <td>5,060,866,208</td>\n      <td>0.2475%</td>\n    </tr>\n    <tr>\n      <td>3002.15.01.00</td>\n      <td>IMMUNOLOGICAL PRODUCTS, PUT UP IN MEASURED DOSES OR IN FORMS OR PACKINGS FOR RETAIL SALE</td>\n      <td>13,317,356,469</td>\n      <td>0.6512%</td>\n    </tr>\n    <tr>\n      <td>3002.41.00.00</td>\n      <td>VACCINES FOR HUMAN MEDICINE, NESOI</td>\n      <td>7,760,695,744</td>\n      <td>0.3795%</td>\n    </tr>\n    <tr>\n      <td>3002.51.00.00</td>\n      <td>CELL THERAPY PRODUCTS</td>\n      <td>595,963,010</td>\n      <td>0.0291%</td>\n    </tr>\n    <tr>\n      <td>3002.90.52.50</td>\n      <td>HUMAN BLOOD; ANIMAL BLOOD PREPARED FOR THERAPEUTIC, PROPHYLATIC OR DIAGNOSTIC USES; ANTISERA AND OTHER BLOOD FRACTIONS, ETC. NESOI</td>\n      <td>914,348,561</td>\n      <td>0.0447%</td>\n    </tr>\n    <tr>\n      <td><strong>TOTAL</strong></td>\n      <td><strong>(MAYBE BLOOD)</strong></td>\n      <td><strong>28,273,513,104</strong></td>\n      <td><strong>1.3826%</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>The biggest contributor here is IMMUNOLOGICAL PRODUCTS (be they MIXED or UNMIXED, PUT UP or NOT PUT UP). The largest fraction of these is probably antibodies.</p>\n\n<p>Antibodies are <em>sometimes</em> made from human blood. You may remember that in 2020, some organizations collected human blood from people who’d recovered from Covid to make antibodies. But it’s important to stress that this is quite rare. Human blood, after all, is expensive. So—because capitalism—whenever possible animals are used instead, often rabbits, goats, sheep, or <a href=\"https://en.wikipedia.org/wiki/Humanized_mouse\">humanized mice</a>.</p>\n\n<p>I can’t find any hard statistics on this. But I know several people who work in this industry. So I asked them to just guess what fraction might include human blood. Biologists don’t like numbers, so this took a lot of pleading, but my best estimate is 8%.</p>\n\n<p>When looking at similar data a few years ago, <a href=\"http://marketdesigner.blogspot.com/2020/05/plasma-and-plasma-products-such-as.html\">Market Design</a> suggested that that <a href=\"https://en.wikipedia.org/wiki/Immunoglobulin_therapy\">immunoglobulin products</a> might also fall under this category. But as far as I can tell this is not true. I looked up the tariff codes for a few immunoglobulin products, and they all seem to fall under 3002.90 (“HUMAN BLOOD; ANIMAL BLOOD PREPARED FOR THERAPEUTIC, PROPHYLATIC OR DIAGNOSTIC USES; ANTISERA AND OTHER BLOOD FRACTIONS, ETC. NESOI”)</p>\n\n<p>What about vaccines or <a href=\"https://en.wikipedia.org/wiki/Cell_therapy\">cell therapy</a> products? These almost never contain human blood. But they are <em>sometimes</em> made by growing human cell lines, and <em>sometimes</em> those cell lines require human <a href=\"https://en.wikipedia.org/wiki/Serum_(blood)\">blood <em>serum</em></a> to grow. More pleading with the biologists produced a guess that this is true for 5% of vaccines and 80% of cell therapies.</p>\n\n<p><em>Aside</em>: Even if they do require blood serum, it’s somewhat debatable if they should count as “blood products”. How far down the supply chain does that classification apply? If I make cars, and one of my employees gets injured and needs a blood transfusion, are my cars now “blood products”?</p>\n\n<p>Anyway, here’s my best guess for the percentage of products in this middle category that use human blood:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Category</th>\n      <th>Description</th>\n      <th>Needs blood (guess)</th>\n      <th>Exports ($)</th>\n      <th>Percentage of US goods exports</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>3002.13.00.00</td>\n      <td>IMMUNOLOGICAL PRODUCTS, UNMIXED, NOT PUT UP IN MEASURED DOSES OR IN FORMS OR PACKINGS FOR RETAIL SALE</td>\n      <td>8%</td>\n      <td>49,942,648</td>\n      <td>0.0024%</td>\n    </tr>\n    <tr>\n      <td>3002.14.00.00</td>\n      <td>IMMUNOLOGICAL PRODUCTS, MIXED, NOT PUT UP IN MEASURED DOSES OR IN FORMS OR PACKINGS FOR RETAIL SALE</td>\n      <td>8%</td>\n      <td>404,869,296</td>\n      <td>0.0198%</td>\n    </tr>\n    <tr>\n      <td>3002.15.01.00</td>\n      <td>IMMUNOLOGICAL PRODUCTS, PUT UP IN MEASURED DOSES OR IN FORMS OR PACKINGS FOR RETAIL SALE</td>\n      <td>8%</td>\n      <td>1,065,388,517</td>\n      <td>0.0521%</td>\n    </tr>\n    <tr>\n      <td>3002.41.00.00</td>\n      <td>VACCINES FOR HUMAN MEDICINE, NESOI</td>\n      <td>5%</td>\n      <td>388,034,787.2</td>\n      <td>0.0190%</td>\n    </tr>\n    <tr>\n      <td>3002.51.00.00</td>\n      <td>CELL THERAPY PRODUCTS</td>\n      <td>80%</td>\n      <td>476,770,408</td>\n      <td>0.0233%</td>\n    </tr>\n    <tr>\n      <td>3002.90.52.50</td>\n      <td>HUMAN BLOOD; ANIMAL BLOOD PREPARED FOR THERAPEUTIC, PROPHYLATIC OR DIAGNOSTIC USES; ANTISERA AND OTHER BLOOD FRACTIONS, ETC. NESOI</td>\n      <td>90%</td>\n      <td>822,913,704</td>\n      <td>0.0402%</td>\n    </tr>\n    <tr>\n      <td><strong>TOTAL</strong></td>\n      <td><strong>(GUESSED BLOOD)</strong></td>\n      <td> </td>\n      <td><strong>3,207,919,363.22</strong></td>\n      <td><strong>0.1569%</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>So 0.5298% of goods exports almost certainly use blood, and my best guess is that another 0.1569% of exports also include blood, for a total of 0.6867%.</p>\n\n<p>Obviously, this is a rough cut. But I couldn’t find any other source that shows their work in any detail, so I hoped that by publishing this I could at least prod Cunningham’s law into action. Sorry for all the numbers.</p>"
            ],
            "link": "https://dynomight.net/blood/",
            "publishedAt": "2025-05-05",
            "source": "Dynomight",
            "summary": "<p>In a recent post about <a href=\"https://dynomight.net/money/\">trading stuff for money</a>, I mentioned:</p> <blockquote> <p>Europe had a [blood plasma] shortage of around 38%, which it met by importing plasma from paid donors in the United States, where blood products account for 2% of <em>all</em> exports by value.</p> </blockquote> <p>The internet’s reaction was: “TWO PERCENT?” “<strong>TWO PERCENT OF U.S. EXPORTS ARE BLOOD!?</strong>”</p> <p>Well, I took that 2% number from a 2024 <a href=\"https://www.economist.com/finance-and-economics/2024/08/29/the-plasma-trade-is-becoming-ever-more-hypocritical\">article in the Economist</a>:</p> <blockquote> <p>Last year American blood-product exports accounted for 1.8% of the country’s total goods exports, up from just 0.5% a decade ago—and were worth $37bn. That makes blood the country’s ninth-largest goods export, ahead of coal and gold. All told, America now supplies 70% or so of the plasma used to make medicine.</p> </blockquote> <p>I figured the Economist was trustworthy on matters of economics. But note:</p> <ol> <li>That 1.8% number is for blood <em>products</em>, not just blood.</li> <li>It’s a percentage of <em>goods</em> exported, excluding services.</li> <li>It’s wrong.</li> </ol> <p>The article doesn’t explain how they arrived at 1.8%. And since the Economist speaks in the voice of God (without bylines), I can’t corner and harass the actual journalist. I’d have liked to reverse-engineer their calculations, but this",
            "title": "So much blood"
        },
        {
            "content": [
                "<h2 id=\"tldr\">TL;DR:</h2> <p>This is what I personally do to prepare for a world with AGI:</p> <ul> <li>No long-term commitments <ul> <li>Didn’t do a PhD</li> <li>Didn’t buy a house</li> </ul> </li> <li>I don’t build an AI vertical (Supplier to AGI &gt; Consumer of AGI)</li> <li>I am moving to the US (but keeping my Swedish ties)</li> <li>I build stuff while I can <ul> <li>To have impact</li> <li>To have fun (I don’t learn boring things for later utility)</li> </ul> </li> <li>I try to slow aging (being healthy is way more important now than ever before)</li> </ul> <h2 id=\"giving-advice\">Giving advice</h2> <p>My favourite book is Siddhartha by Hermann Hesse, which is about an Indian boy who leaves home to figure out the meaning of life. He tries everything from fasting and meditation to wealth and pleasure, and finally learns wisdom can’t be taught, only lived. My main takeaway is skepticism of a mentality that can result in learned helplessness; there is no silver bullet advice to solve all your problems.</p> <p>However, I don’t subscribe to the opposite extreme either. I think advice can be useful if you see it as one of many data points and don’t view it as a substitute for learning-by-doing. Advice can put you on a path with fewer mistakes, but you will make plenty of mistakes even on the best path. So, you will still have the opportunity to learn.</p> <p>Sometimes it can seem as if a single piece of advice made all the difference. For example, after an <a href=\"https://80000hours.org/speak-with-us/?int_campaign=2021-08__primary-navigation\">80000h call</a> with <a href=\"https://x.com/lxrjl\">Alex Lawsen</a>, I immediately shifted my full attention to AI safety, and haven’t looked back since. I am forever grateful for that call, but what I think was really happening was that I already had hundreds of unconscious data points in this direction. It was only a question of time before something made me conscious of it.</p> <p>It is strange to grow up. Suddenly I find myself on the other side of the advice-question. It is fun, but also scary. I can’t be sure that you put the appropriate weight on my words. I definitely have a negative bias—I’ll feel terrible if my advice causes you pain, but won’t take credit if it leads to success (that’s your achievement, not mine). This incentivizes me to give safe advice, even though, paradoxically, my number one recommendation is always to take more risks (my New Year’s resolution was “take more risks” four years in a row, and it worked out great for me).</p> <p>I recently found another solution to my negative bias. I recorded an <a href=\"https://www.youtube.com/watch?v=FT6zDd_a2YI&amp;t=14s\">episode on my podcast</a> about how to invest for AGI. Afterwards, my friend criticized the fact that I did not ask the guest what his investments were. “Advice is useless if you don’t know whether the person giving it follows it themselves” he claimed. I think this is great advice on giving advice (I am unsure if my friend gives advice this way). In this post I will try to give career advice indirectly by telling you how I think about the world and how I personally act as a result of that. I think this might be more useful, and I will feel less bad if it causes us both pain.</p> <h2 id=\"my-world-model\">My world model</h2> <p>I think the most important thing to be aware of when thinking about one’s future is AI. It is impossible to know how it will play out, but one of <a href=\"https://ai-2027.com/\">the most credible predictions</a> I have found predicts that AI is capable of automating most white collar jobs by late 2027. Adoption will not be instant, so let’s say that we have 5 more years as productive members of the economy.</p> <figure>  <source class=\"responsive-img-srcset\" /> <img class=\"img-fluid rounded z-depth-1\" height=\"auto\" src=\"https://lukaspetersson.github.io/assets/img/agi-2027.png\" width=\"80%\" />  </figure> <p>5 years is my median guess, but the distribution has a fat tail. The researchers behind the 2027 prediction put <a href=\"https://ai-2027.com/research/timelines-forecast\">significant probability mass on 2036</a> or later, and I do too. However, I think it is better to plan for shorter timelines and be wrong than the other way around. Most things I do are still okay in the 2036 world, but the things I would do for the 2036 world would be quite bad in the 2027 world (this might not be true for others though).</p> <p>The best career decisions put you on an <a href=\"https://paulgraham.com/superlinear.html\">exponential growth path</a>. On an exponential path, your growth starts slow but speeds up dramatically later. At first, starting just one year later doesn’t seem like a big deal, because early on there’s almost no visible difference between you and someone who started sooner. But the real cost isn’t the small difference at the start - it’s losing out on the big gains at the end, where exponential growth truly kicks in.</p> <figure>  <source class=\"responsive-img-srcset\" /> <img class=\"img-fluid rounded z-depth-1\" height=\"auto\" src=\"https://lukaspetersson.github.io/assets/img/delayed_exponential.png\" width=\"80%\" />  </figure> <h2 id=\"what-i-do\">What I do</h2> <p>The first decision I ever made as a consequence of my worldview was not to pursue a PhD. With the world changing so rapidly, it seemed impossible to select a topic that would still be relevant five years later. When I began my undergraduate studies, computer science was undoubtedly considered one of the best choices if you wanted a successful career. Now, six years later, the outlook for junior developers appears quite grim.</p> <p>Similarly, I decided not to buy an apartment. When the world changes this quickly, being tied to one location isn’t ideal.</p> <p>I prioritize creating over learning. I’ve done many boring things in my life, often to learn something that might become useful in the future. However, this only makes sense if you expect a future in which that knowledge pays off over a long period. As a result, I now do this much less. (I’ve also empirically found that things which were boring to learn rarely turned out to be useful.)</p> <p>I’m having fun. Another reason not to learn boring things is that it’s hard to know if they’ll actually be useful. When the future is uncertain, the value of trying to predict it diminishes, and optimizing for the short term makes more sense. For me, this means following curiosity. At my startup, Andon Labs, following curiosity is how we make decisions. I don’t think there’s a single person on planet Earth who’s having more fun than I am (except maybe my co-founder, <a href=\"https://x.com/axelbacklund\">Axel</a>).</p> <p>I am moving to the US (but keeping my Swedish ties). Growing up, I never thought I would live anywhere else for extended periods. Sweden consistently tops charts for quality of life, and we punch above our weight in technology and creative output. We were never going to “win” against the US in these areas, but as long as we remained their friends, I didn’t think it would matter. However, two things have changed my view on this. 1) Political tensions between the US and Europe have made this friendship much less certain. 2) With AI, the advantages of “winning” might be significantly greater than I previously thought. On the other hand, if we end up with dangerously misaligned AI, living in the US might not be ideal. Having both options could therefore be very valuable.</p> <p>I (try to) create things that will last. So far in this post, my underlying principle has been that the world will move quickly, making it harder to predict. But that doesn’t mean we shouldn’t try. I recently recorded a <a href=\"https://www.youtube.com/watch?v=FT6zDd_a2YI&amp;t=14s\">podcast with Mark Cummings</a> where we discussed how one might invest their money if superintelligent AI becomes a reality. In short, investing in things the AI itself will need seems like a good bet. The majority of my money is in companies like Nvidia and their suppliers (would be in the AI labs if their shares were publicly traded). I’m not convinced this is the best expected-value bet though. Throughout history, putting your money into index funds has consistently proven to be the best choice for most people. Instead, I see it as a form of insurance. I’m confident I’ll have enough to live a happy life in all “normal” future scenarios. It’s only in extreme AGI scenarios that this might not hold true. For example, the wealth gains from AGI might concentrate among a select few, significantly diminishing my relative wealth to a point where I am struggling. Thus, holding some stocks that benefit from AGI might serve as insurance against worst-case outcomes.</p> <p>However, far more important is spending my time on the right things. The small amount of money I have invested in stocks is insignificant compared to how much I value my time. I spend almost all of my time on my startup. <a href=\"https://x.com/garrytan/status/1902749661477450221\">Startups are growing faster than ever</a> right now, and the hottest sector is AI verticals. I’ve written extensively before about why <a href=\"https://lukaspetersson.com/blog/2025/bitter-vertical/\">I think focusing on AI verticals is a terrible idea</a>. It’s only a matter of time before horizontal AI solutions render vertical AI obsolete. Instead, I take an approach similar to my investment strategy: I create things that AI itself will need.</p> <p>Finally, and perhaps most importantly, I try to take care of my body. Dario Amodei <a href=\"https://www.darioamodei.com/essay/machines-of-loving-grace\">predicts</a> that AI will enable 100 years’ worth of biological research within the decade from 2030 to 2040. Given this, I think it’s quite plausible that we will have stopped (or significantly reduced) aging by then. We might even be able to reverse it, but if not, the body you have in 2035 could be the body you’ll have for the rest of your (very long) life. Therefore, I sleep 8–9 hours per day, eat only healthy foods, exercise regularly, and meditate daily. These practices have always been important, but now they might matter more than ever.</p> <h2 id=\"i-am-lucky-and-you-are-too\">I am lucky, and you are too</h2> <p>I feel very lucky to be my current age (26) during this particular moment in history. I’m old enough to have experienced a time when knowing how to code was a superpower possessed by only a few. I’m old enough to have grown up without a phone addiction. I’m old enough to have enjoyed the bliss of university life (with the illusion that it was a productive use of my time). I’m old enough to have gained enough experience to become a productive member of the economy. But most importantly, I’m young enough to still have the hunger to make an impact during these final years when humans alone are capable of shaping the world.</p> <p>This should not discourage anyone who is at a different age; anyone can craft a story about why they’re alive at the perfect time.</p> <p>Follow me on <a href=\"https://x.com/lukaspet\">X</a> or subscribe via <a href=\"https://lukaspetersson.com/feed.xml\">RSS</a> or <a href=\"https://lukaspet.substack.com/\">Substack</a> to stay updated.</p>"
            ],
            "link": "https://lukaspetersson.github.io/blog/2025/agi-life/",
            "publishedAt": "2025-05-05",
            "source": "Lukas Petersson",
            "summary": "<h2 id=\"tldr\">TL;DR:</h2> <p>This is what I personally do to prepare for a world with AGI:</p> <ul> <li>No long-term commitments <ul> <li>Didn’t do a PhD</li> <li>Didn’t buy a house</li> </ul> </li> <li>I don’t build an AI vertical (Supplier to AGI &gt; Consumer of AGI)</li> <li>I am moving to the US (but keeping my Swedish ties)</li> <li>I build stuff while I can <ul> <li>To have impact</li> <li>To have fun (I don’t learn boring things for later utility)</li> </ul> </li> <li>I try to slow aging (being healthy is way more important now than ever before)</li> </ul> <h2 id=\"giving-advice\">Giving advice</h2> <p>My favourite book is Siddhartha by Hermann Hesse, which is about an Indian boy who leaves home to figure out the meaning of life. He tries everything from fasting and meditation to wealth and pleasure, and finally learns wisdom can’t be taught, only lived. My main takeaway is skepticism of a mentality that can result in learned helplessness; there is no silver bullet advice to solve all your problems.</p> <p>However, I don’t subscribe to the opposite extreme either. I think advice can be useful if you see it as one of many data points and don’t view it as a substitute for learning-by-doing. Advice",
            "title": "Your life on the AGI-pill"
        },
        {
            "content": [
                "<p>Rob Henderson has a great <a href=\"https://www.robkhenderson.com/p/experts-and-elites-play-fundamentally\">essay</a> summarizing the expert vs elite distinction I discussed in 6 prior posts (<a href=\"https://www.overcomingbias.com/p/experts-versus-eliteshtml\">1</a> <a href=\"https://www.overcomingbias.com/2021/02/more-on-experts-vs-elites.html\">2</a> <a href=\"https://www.overcomingbias.com/p/yet-more-elites-vs-expertshtml\">3</a> <a href=\"https://www.overcomingbias.com/p/elites-must-rulehtml\">4</a> <a href=\"https://www.overcomingbias.com/p/are-elites-displacing-expertshtml\">5</a> <a href=\"https://www.overcomingbias.com/p/elite-vs-expert-innovation\">6</a>):</p><blockquote><p>Experts are people who know things. They&#8217;re judged by other experts&#8212;people who speak the same language, use the same methods, and know the same details. You can spot experts by their credentials, their technical precision, or just the way they argue. They care about being right. They&#8217;re evaluated on whether their work holds up&#8212;whether it can be tested, measured, replicated, or defended under scrutiny. They debate each other, go deep into the weeds, and let the details decide who&#8217;s correct.</p><p>Elites are different. They&#8217;re not judged on technical knowledge but on being impressive across a broader range: wealth, looks, taste, social fluency, connections, charisma, and cultural feel. Elite institutions tend to screen for such qualities, which is why educational pedigree is also often important. &#8230; They talk to other elites&#8212;not necessarily in the same field, but from the same orbit. Their speech is less about precision and more about mood, values, and gestures. Social grooming and chimp politics. Instead of drilling down, they smooth over. Instead of proving their point, they bring people along to crystallize a consensus. They win arguments through allegiance rather than getting closer to the actual objective truth. &#8230;</p><p>Elites like to say they&#8217;re just following the experts. &#8220;We believe the science,&#8221; they&#8217;ll insist. But elites can overrule expert opinion&#8212;especially on issues charged with moral or emotional weight. They pretend their views came from neutral experts, when they often don&#8217;t. &#8230; A lot of elites, though, were experts first. &#8230;</p><p>Academics tend to stay in their lane. &#8220;Here&#8217;s what I know about my field.&#8221; But they&#8217;ll stop short of broader recommendations. They&#8217;re cautious, disciplined, trained to qualify their claims. Their audience is other experts. The job is to be precise, not persuasive.</p><p>Public intellectuals play a different game. They range wider, speak more freely, and they&#8217;re more comfortable telling people what should be done. They aren&#8217;t just sharing knowledge. They&#8217;re trying to build coalitions, shape opinion, steer the ship. Which means their language shifts. Less jargon, less hedging. And they&#8217;re judged differently, too. &#8230;</p><p>We like to pretend that anyone can speak up, offer ideas, or take action. But in practice, we tend to accept important moves only when they come from elites. And even then, only when they&#8217;re delivered in the &#8220;correct&#8221; elite style. Proposals for reforms, innovations, or new lines of research are rarely taken seriously unless they come from high-status people. (<a href=\"https://www.robkhenderson.com/p/experts-and-elites-play-fundamentally\">More</a>)</p></blockquote><p>Now you might think that elites would worry about being in the group known to adopt less truth-oriented habits, and try to correct for this, for example by trying harder to be more precise, qualify claims, and tell people things they might not want to hear. But in my experience, they just don&#8217;t. Giving people prestige makes people more confident in themselves, not more doubtful.  Elites instead seem to assume that they are immune from any elite biases, because they were once an expert.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/elite-confidence",
            "publishedAt": "2025-05-05",
            "source": "Robin Hanson",
            "summary": "Rob Henderson has a great essay summarizing the expert vs elite distinction I discussed in 6 prior posts (1 2 3 4 5 6):",
            "title": "Elite Confidence"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/May/5/llm-video-frames/#atom-entries",
            "publishedAt": "2025-05-05",
            "source": "Simon Willison",
            "summary": "<p>The new <strong><a href=\"https://github.com/simonw/llm-video-frames\">llm-video-frames</a></strong> plugin can turn a video file into a sequence of JPEG frames and feed them directly into a long context vision LLM such as GPT-4.1, even when that LLM doesn't directly support video input. It depends on a plugin feature I added to <a href=\"https://llm.datasette.io/en/stable/changelog.html#v0-25\">LLM 0.25</a>, which I released last night.</p> <p>Here's how to try it out:</p> <div class=\"highlight highlight-source-shell\"><pre>brew install ffmpeg <span class=\"pl-c\"><span class=\"pl-c\">#</span> or apt-get or your package manager of choice</span> uv tool install llm <span class=\"pl-c\"><span class=\"pl-c\">#</span> or pipx install llm or pip install llm</span> llm install llm-video-frames llm keys <span class=\"pl-c1\">set</span> openai <span class=\"pl-c\"><span class=\"pl-c\">#</span> Paste your OpenAI API key here</span> llm -f video-frames:video.mp4 \\ <span class=\"pl-s\"><span class=\"pl-pds\">'</span>describe the key scenes in this video<span class=\"pl-pds\">'</span></span> \\ -m gpt-4.1-mini</pre></div> <p>The <code>video-frames:filepath.mp4</code> syntax is provided by the new plugin. It takes that video, converts it to a JPEG for every second of the video and then turns those into <a href=\"https://llm.datasette.io/en/stable/usage.html#attachments\">attachments</a> that can be passed to the LLM.</p> <p>Here's a demo, against <a href=\"https://static.simonwillison.net/static/2025/cleo.mp4\">this video</a> of Cleo:</p> <div style=\"margin-bottom: 0.4em;\"> <video controls=\"controls\" loop=\"loop\" poster=\"https://static.simonwillison.net/static/2025/cleo-still.jpg\" preload=\"none\" style=\"width: 100%; height: auto;\"> <source src=\"https://static.simonwillison.net/static/2025/cleo.mp4\" type=\"video/mp4\" /> </video> </div> <div class=\"highlight highlight-source-shell\"><pre>llm -f video-frames:cleo.mp4 <span class=\"pl-s\"><span class=\"pl-pds\">'</span>describe key",
            "title": "Feed a video to a vision LLM as a sequence of JPEG frames on the CLI (also LLM 0.25)"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX meetups this week in Cape Town, Waterloo, Tokyo, Amsterdam, Berlin, Seattle, Boston, and San Diego. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">the post</a> for details.</p><p><strong>2: </strong>Remember, the due date for the <a href=\"https://www.astralcodexten.com/p/everything-except-book-review-contest\">Everything-Except-Book Review Contest</a> is May 12 - next Monday!</p><p><strong>3: </strong>New subscribers-only post, <a href=\"https://www.astralcodexten.com/p/you-can-keep-having-an-opinion-even\">You Can Keep Having An Opinion Even When The Government Also Has It</a>. It&#8217;s about Trump and wokeness again.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-380",
            "publishedAt": "2025-05-05",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX meetups this week in Cape Town, Waterloo, Tokyo, Amsterdam, Berlin, Seattle, Boston, and San Diego. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">the post</a> for details.</p><p><strong>2: </strong>Remember, the due date for the <a href=\"https://www.astralcodexten.com/p/everything-except-book-review-contest\">Everything-Except-Book Review Contest</a> is May 12 - next Monday!</p><p><strong>3: </strong>New subscribers-only post, <a href=\"https://www.astralcodexten.com/p/you-can-keep-having-an-opinion-even\">You Can Keep Having An Opinion Even When The Government Also Has It</a>. It&#8217;s about Trump and wokeness again.</p>",
            "title": "Open Thread 380"
        },
        {
            "content": [],
            "link": "https://buttondown.com/thesephist/archive/radio-city/",
            "publishedAt": "2025-05-05",
            "source": "The Sephist",
            "summary": "<p>Hi friends,</p> <p><em>(welcome to my email dispatch! You can sign up for these or read the archive at</em> <a href=\"https://buttondown.email/thesephist?utm_source=thesephist&amp;utm_medium=email&amp;utm_campaign=radio-city\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"><em>buttondown.email/thesephist</em></a> 💌)</p> <p>One of the beautiful privileges of living in a city like New York is that you can just go for a stroll around town and encounter pieces of art that could plausibly belong in museums. My favorite such area of the city is the Rockefeller Plaza.</p> <p>Imagine yourself as John D. Rockefeller in 1930, one of the most capitalist capitalists to ever have been capitalized. The economy is tumbling into a recession and then a depression, jeopardizing your plan for a new metropolitan opera house — how European of Rockefeller, an American success story! — by throwing the Met Opera's own economics into disarray.</p> <p>Millions deep into the financing of the project, Rockefeller digs his heels into the ground and pivots the plans for the opera into a home for new, rapidly rising American media industries like radio and broadcast TV — RCA, NBC, Associated Press, and others, many of which are corporate tenants to this day.</p> <p>Commemorating this shift is the namesake of the reframed megaproject: not an opera house, but \"<strong>Radio City</strong>\".</p> <p>There",
            "title": "Radio City"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3085/",
            "publishedAt": "2025-05-05",
            "source": "XKCD",
            "summary": "<img alt=\"In addition to gravity, burritos interact through the strong, weak, and electromagnetic forces, which is believed to be a major contributor to their popularity.\" src=\"https://imgs.xkcd.com/comics/about_20_pounds.png\" title=\"In addition to gravity, burritos interact through the strong, weak, and electromagnetic forces, which is believed to be a major contributor to their popularity.\" />",
            "title": "About 20 Pounds"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-05"
}