{
    "articles": [
        {
            "content": [
                "<p><em>[Original post: <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp\">Should Strong Gods Bet On GDP?</a>]</em></p><p><strong>1:</strong> Comments About The Theory<strong><br />2:</strong> Comments About Specific Communities<br /><strong>3:</strong> Other Comments</p><h2>Comments About The Theory</h2><p><strong>Darwin <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142389012\">writes</a>:</strong></p><blockquote><p>I think you may (*may*, I'm not sure) be vastly underestimating how many people are in some form of nontraditional tight-knit community.</p><p>Notice that many of the communities you list are things you've directly personally encountered through your online interests or social circle. Most people have never heard of libertarian homesteaders or rationalist dating sites, perhaps you have also never heard of the things most other people belong to.</p><p>For my part, I have been part of a foam combat ('boffer') organization since college. You may want to say 'that's not a community, that's just a hobby', but the people in this sport form a strong community with tight bonds outside the game itself. Not only do I go to practices twice a week, I have 2 D&amp;D games and 1 board game night every week with mostly members of the community, members of the community are my friends that I go out to movies and dinners with, play video games with voice chat on Discord with, talk to online in Discord servers and web forums and group chats, go to parties with and gossip about with other community members. Aside from attending over a dozen weddings of community members (mostly to other community members), I've served as best man for 2 members and wedding officiant for 2 other members. The sport itself has houses, guilds, and fighting units, all with their own ethos, credos, goals, activities, and hierarchies; it has knighthoods and squireships, it has awards for arts and crafts and community service. The sport has regular camping events that end up looking like temporary compounds of hundreds to thousand+ members, lasting from a weekend to a week. We may not have a singular God or Invisible Hand we all worship, but we have strong community norms towards things like inclusion, creating positive experiences, some modernized gender-neutral version of chivalry, creating safe spaces, etc.</p><p>If you didn't know me very very well, you might know that 'oh yeah, he does some kind of sword fighting thing on the weekends I think?', and not know there's a large and strong community there.</p><p>I wonder how many other things are like this - I think 'oh yeah, they play softball on the weekends, oh yeah, they belong to a knitting circle, oh yeah, they go to a lot of concerts, oh yeah, they volunteer at some kind of community center', and have no idea that there's a strong close-knit community surrounding those things that remains largely invisible to outsiders.</p></blockquote><p><strong>Logan (<a href=\"https://lbryck.substack.com\">blog</a>) <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142478012\">writes</a>:</strong></p><blockquote><p>As another commenter (darwin) said, I think Scott is underestimating how many people are in ~5/10 \"weird\" intentional communities, comparable to rationalism. Rationalism is just more salient to him, because he's in it. A lot of 5/10 weird intentional communities are pretty invisible to people outside of them.</p><p>FIRE (as in Financial Independence/Retire Early) in particular comes to mind as another weird community that absolutely corresponds with his thesis of affluence enabling more niche community-building. FIRE people have online forums and meetups, and groups of them do things like buy up most of a block of houses to take over a neighborhood in a small town in Colorado. It's way easier for everybody to go to a community meetup in the desert for a week or two if they're affluent. That applies to a FIRE meetup I went to in the desert in Utah, and also calls Burning Man to mind. Tons of people just draw the line of weirdness at a place where they can blend into \"normal\" liberal society.</p><p>So a 9/10 weird cult is a really different place to draw the line, but it's really quite normal to be in a 5/10 weird community, almost certainly not only 10% like Scott estimates. And since \"weirdness\" is defined by what gets ostracized, it's notable that the communities we define as the most weird are the most illiberal - conservative/orthodox religious sects. Illiberalism is \"weird\" in a liberal society because illiberalism is definitionally the one thing that liberalism openly ostracizes.</p></blockquote><p>I appreciate the FIRE example - if they&#8217;re taking over parts of neighborhoods, they at least get a 5/10 on my scale.</p><p>Still, I will defend the claim that less than 10% of the population belongs to groups like this; I think commenters overestimate how many people don&#8217;t have any cool hobbies or unique groups that they&#8217;re part of. If 50K people are that seriously into FIRE, and there are a thousand communities of that size, and there&#8217;s 50% overlap (e.g. someone who&#8217;s both into FIRE and a Mormon), then that&#8217;s still consistent with less than 10%!</p><p><strong>Mutton Dressed As Mutton <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142389812\">writes</a>:</strong></p><blockquote><p>I think the problem with the material abundance version of tight-knit community is that most people don't really want tight-knit community. They want the benefits but not the downsides.</p><p>The downsides are both real and unfortunately deeply and inextricably linked to the benefits. You can maybe buy your way out of some of the downsides, but at some point you have to accept the package. You can imagine a kibbutz that is less insane, but a kibbutz that is just a chill place where people do their own thing is not a kibbutz. Most people don't want the full kibbutz.</p><p>Cartoons Hate Her makes this point better and at length: <a href=\"https://www.cartoonshateher.com/p/the-village-nobody-wants\">The Village Nobody Wants</a>.</p><p>Groups like the Amish (and Hasidic Jews, etc.) achieve community by raising the costs of leaving so high that most members aren't willing to bear them. Some do, and the stories are often quite sad (<a href=\"https://www.amazon.com/All-Who-Go-Not-Return/dp/1555977057/\">https://www.amazon.com/All-Who-Go-Not-Return/dp/1555977057/</a>). Even less insular communities, like the Mormons, do something like this (although mainstream Mormons could be regarded as striking a fairly successful balance).</p><p>I suspect rationalist enclaves are long-term unstable like most intentional communities. They aren't actually drafting on wealth, they are just huffing ideology and will eventually implode or explode. I've had some limited exposure to deeply rationalist subcultures, and what I mainly observed was that they were extremely weird. I say that, sincerely, without judgment -- it's fine to be weird, even good in many ways -- but weirdness doesn't seem like enough to hang a community on. The moment will pass, people will move on.</p></blockquote><p>I think it&#8217;s worth distinguishing among four strategies for community:</p><ol><li><p><strong>The medieval peasant strategy:</strong> you are stuck in a tiny village for your whole life, guess you&#8217;ve got community whether you like it or not.</p></li><li><p><strong>The Orthodox Jewish strategy:</strong> try to replicate the medieval peasant strategy within a large modern society by starting with an ethnicity/religion and having very high barriers to exit. </p></li><li><p><strong>The Cartoons Hate Her strategy:</strong> try to get random people close to you to form a community - but they might not find it very engaging and it might never start to begin with.</p></li><li><p><strong>The liberal (eg rationalist / libertarian / foam boffer / LGBTQ / FIRE) strategy</strong>: try to gather a particular type of person together into a &#8220;natural&#8221; community that feels intuitive and low-effort because members are doing things they believe in (or enjoy) with people who are deeply similar to them. Here the &#8220;barrier to exit&#8221; is that the community is already optimized for your preferences and you would be less happy outside of it.</p></li></ol><p>I claim that the first two work better in conditions of poverty (because they&#8217;re based on barriers to exit), the third works only sporadically and doesn&#8217;t scale, and the fourth works better in conditions of affluence (because it requires people to sort themselves, which might mean choosing where to live based for community rather than financial reasons).</p><p><strong>Ariel (<a href=\"https://www.zappable.com/\">blog</a>) <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142384027\">writes</a>: </strong></p><blockquote><p>Just because something is valuable, that doesn't mean people will put in the effort to achieve it. Even putting aside monetary issues, it's a huge effort to build a community, and people won't necessarily go ahead and do it. An advantage of religion (and maybe the techo-rationalist space) is that they provide natural conditions for building a community.</p></blockquote><p>But shouldn&#8217;t this problem be a good match for entrepreneurial capitalism? If it&#8217;s possible to create a community better than regular society, can&#8217;t someone do it, charge a membership fee, and get rich?</p><p><strong>DangerouslyUnstable <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142415850\">writes</a>:</strong></p><blockquote><p>I think the problem with this idea is that: when there isn't a single default strong community, most people do the lazy thing and choose not to participate. I think that no matter how rich people got, most people would never be part of a strong community because being part of a strong community takes effort. I think this is why, despite living in the richest nation in the history of the planet, we have some of the weakest/least amount of strong communities, which is why I find your comment that more money = more community strange. Yes, for people who care, having money makes it easier. But all of western civilization is proof that more money does not, in general, equal more community.</p><p>If you make community opt-in, as liberalism does (and to be very clear, I'm pro liberalism), most people will not go to the effort of opting in. Almost everyone in the US is rich enough that, if they wanted, they could be part of a strong community. They are just uninterested in the effort that would take.</p></blockquote><p>I don&#8217;t think &#8220;effort&#8221; is the exact right way of looking at this.</p><p>Compare this to some sort of impressive athletic accomplishment - let&#8217;s say being able to lift 300 lbs. If I wanted to be able to lift 300 lbs, this would be <em>effortful</em>, but not <em>complicated</em>. I would Google &#8220;good gym routine&#8221;, find a gym near me, go a couple times a week, gradually ramp up, and eventually achieve my goal.</p><p>If I wanted to be in a very strong community, I don&#8217;t think there&#8217;s any way to <em>just</em> &#8220;expend effort&#8221; and make it happen. Maybe I could learn Hebrew and convert to Orthodox Judaism, but there are lots of reasons not to do that besides just laziness (plus one extra reason for people who aren&#8217;t already circumcised!) If I wanted a community of the &#8220;ten normal-ish families on a suburban block raising children together&#8221; variety, this seems about as tough as founding a new company, in the sense that you need to be creative, agentic, and willing to risk everything falling apart.</p><p>This is what I mean by &#8220;this space needs entrepreneurs&#8221;. If I want a Ferrari, it&#8217;s going to be <em>expensive</em>, but not <em>complicated</em>. Once there are expensive and effortful, but not complicated, ways to get a good community, I&#8217;ll be more willing to believe that effort is the barrier.</p><p><strong>Justin <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142891625\">writes</a>:</strong></p><blockquote><p>The example of the Mormons is a good one, but in more ways than &#8220;get lots of people of the same religion together in one place&#8221;. That model was certainly true of the early church, but the real innovation of modern Mormonism is exporting the same community-building model to all four corners of the earth. A common experience for Latter-day Saints traveling abroad is to be struck by how nearly identical the Sunday experience is whether in Africa, America, or Asia. The upshot of the Church&#8217;s system of social organization is that it is effortless for a Latter-day Saint person to slot into a new community wherever they go, and it is likewise easy for the community to sustain itself as individuals naturally come and go while they pursue their secular lives and careers. That kind of physical location independence goes a long way towards solving the practical problems highlighted in the post.</p></blockquote><p>Maybe the Mormons are the entrepreneurs we&#8217;re looking for?</p><p></p><h2>Comments About Specific Communities</h2><p><strong>Ebrima Lelisa writes:</strong></p><blockquote><p>I doubt the conclusion of this post.</p><p>I've visited an Indian friend in rural Pennsylvania. Their housing community is 98% Indian. There's only 1 non-Indian family out of the 50 houses.</p><p>Close to where I live there's an apartment block which is 80% Indian, especially students.</p><p>If money is an issue or anti-discrimination laws then how do these communities form?</p></blockquote><p>Great point! And I agree Indians are the best example - too new to piggyback off older communities like Chinatowns, and usually rich enough that their proximity can&#8217;t be dismissed as ghettoization. I don&#8217;t really have a great explanation for this; maybe it just proves that if you&#8217;re committed enough you can still make it work.</p><p><strong>Hilarius Bookbinder (<a href=\"https://hilariusbookbinder.substack.com/\">blog</a>) <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142381739\">writes</a>:</strong> </p><blockquote><p><em>&#187; &#8220;Why don&#8217;t conservatives live in trad whites-only farming villages on the Great Plains?&#8221; </em></p><p>There seems to be a movement in exactly that direction: <a href=\"https://www.returntotheland.org/about\">https://www.returntotheland.org/about</a></p></blockquote><p>Their site says &#8220;Return to the Land is a private membership association (PMA) for individuals and families with traditional views and common continental ancestry. We hold events and conferences, and we help groups of our members form European heritage communities&#8230;We will return to the land to separate ourselves from a failing modern society, and we will make positive cultural changes in ourselves and in our ancestral communities&#8221; - so yeah, that sure is a movement towards trad whites-only farming villages.</p><p>Their first test community has bought land in Arkansas, and there are a few articles on it, including <a href=\"https://ca.news.yahoo.com/internet-completely-stunned-whites-only-153211608.html\">this one</a> which describes it as &#8220;about 40 inhabitants who live on 150 acres of land [with] cabins, roads, wells, a community center, and a schoolhouse&#8221;, and <a href=\"https://news.sky.com/story/inside-the-whites-only-settlement-in-arkansas-the-group-building-a-fortress-for-the-white-race-13399875\">this </a>interview with movement leader Eric Orwoll, who says that &#8220;a second Hitler won&#8217;t arrive unless people do the work&#8221;, but that &#8220;when I say, you're gonna have to wait for that new Hitler to arise, I'm not saying you're going to have to wait for a new person to start a new Holocaust. I am saying you are going to wait for a charismatic leader who is going to advocate for your interests&#8221;. How Orwollian. </p><p>Richard Hanania has <a href=\"https://www.richardhanania.com/p/no-to-borders-yes-to-allowing-whites\">an article supporting the movement here</a>, as part of a galaxy-brained defense of open borders. His argument is that you have no right to keep foreigners out of &#8220;your&#8221; country, but that if you want a foreigner-free community you can always form some enclave on private property like these people are doing. I appreciate the proceduralism - but suppose that enough current Americans wanted a non-open-borders community that they figured out ways to purchase most of the United States, turn it into a community like this, and institute some sort of democratic governance for it. Wouldn&#8217;t that just be recreating the current situation of an America where most people don&#8217;t want open borders and so we don&#8217;t have them, but with extra steps? If so, why mandate the extra steps?</p><p><strong>Yosef <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142383616\">writes</a>: </strong></p><blockquote><p>You forgot ultra-orthodox Jews. There are, depending on how you define it, at least two Hasidic towns in New York and a supermajority Jewish town in New Jersey.</p><p>Many people in those places work 'secular' jobs, but a job as a PA in a medical practice where almost all of the providers and patients are Jewish isn't really secular. If you work in a clothing store selling Jewish clothing, is it really a secular job?</p></blockquote><p>He&#8217;s right. I added them in, along with the Mormons. Other suggestions for groups I forgot include Mennonites and Hutterites (similar to Amish), <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142387991\">online gamers</a>, <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142387991\">the military</a>, and <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142423227\">the Long Now Foundation</a>.</p><p><strong>Matthew Talamini <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142723895\">writes</a>:</strong></p><blockquote><p>The Amish are actually illegal. For instance, some sects don't believe in smoke detectors, so none of their buildings are compliant with fire codes. Each community has one smoke detector stashed away somewhere, and when they construct a new building, they stick it in an appropriate place until the inspection is done, then take it down and put it away. (Or, that's the rumor.)</p><p>It's the same with sewage rules, egress requirements, etc. Many of which are ridiculous for structures that don't have electricity or running water. But it's still illegal to violate ridiculous laws.</p><p>In many places they've succeeded in negotiating carve-outs for their settlements in local building codes. But in others, officials just turn a blind eye, or else it's a source of constant conflict.</p><p>Roughly all of the examples of intentional community Scott points to are (technically) illegal in one way or another. Education, child welfare, zoning, public accommodation laws, animal welfare, discrimination, public health, child labor laws, etc.</p><p>Mostly, in the US, as long as everyone involved consents, you can get away with breaking these kinds of laws. But if you become A Problem, or if somebody complains about you, your situation can become quite tenuous. The Amish have had to go all the way to the Supreme Court as recently as 2021 (to avoid installing septic tanks for their graywater).</p></blockquote><p>Granted that this is true for the Amish. I&#8217;m less sure it matters for the average community, for whom the level of smoke detectors in buildings isn&#8217;t a big issue.</p><p>Still, many people tried to argue that government repression was a major block on community creation. One reader mentioned <a href=\"https://en.wikipedia.org/wiki/EPIC_City,_Texas\">EPIC City, Texas</a>, a proposed Muslim community which was being fought by anti-Muslim conservatives who accused it of wanting &#8220;sharia law&#8221; (organizers countered that it was just going to be a neighborhood around a mosque, without any special legal carveout). Other people brought up the way housing discrimination law bars most forms of choosing who you live with, making it hard to have an Xs-only neighborhood.</p><p>I am mostly skeptical of how much this matters because of how many groups manage to have communities anyway, but some readers tried to argue there were specific stories for how each of them escaped the problem (either getting grandfathered in, like the Amish, or being sufficiently-liked-by-leftists to escape anti-discrimination law, like various immigrant groups)</p><p></p><h2>Other Comments</h2><p><strong>Notmy Realname <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142387640\">writes</a>:</strong></p><blockquote><p>I wouldn't consider bay area rationalists a bona fide Community, just a social club, until you demonstrate enough sticking power to grow your community in perpetuity. Every other Community you mentioned (besides the libertarians who I also don't count) have a relatively low churn rate and enough growth to keep up with it. Are you confident that you'll be able to continue pulling in new members a decade from now? Do you think your kids will turn apostate?</p></blockquote><p>I&#8217;m sort of confident? We haven&#8217;t gone through a full generational turnover yet, but the first cadre of people who got involved in the late-2000s (eg me) are in their forties now, and we still have new twenty-year-old college students joining each year. Around 2022, when the rest of the world realized that AI would be important, I worried we would lose our distinctiveness. But the rest of the world has dropped the ball as usual - the stochastic parrot folks most obviously, but even the average person who talks about &#8220;superintelligence&#8221; these days just seems to imagine ChatGPT getting extra-good and making OpenAI extra-rich. So I&#8217;ve updated towards thinking we have some edge which is hard to replicate.</p><p>But I also don&#8217;t think this matters too much for my broader point. A liberal society of constantly shifting strong communities, each of which only lasts one to two generations, would be perfectly fine, as long as there are new ones springing up to replace the old. There would be something sad about your kids probably being in a different community from you, but in many cases that&#8217;s already a given (the average LGBT person knows there&#8217;s a strong chance any children they have will grow up to be straight) and maybe it&#8217;s ultimately for the better (if there was a 99% chance that rationalists&#8217; children would stay in the rationalist community, I would worry we were doing some sort of brainwashing - if instead they get really into FIRE and find a community there, maybe that&#8217;s a best-case scenario).</p><p><strong>Walruss (<a href=\"https://walruss10.substack.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">blog</a>) <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142386184\">writes</a>:</strong></p><blockquote><p>This is missing something unique about this moment in history, and I'm super skeptical of arguments that start with \"this is missing something unique about this moment in history.\"</p><p>The past 3 generations have been defined by absurd abundance. Not just abundance of material comforts, but abundance of media and the removal of almost every point of friction to consumption. The latest breakthroughs in entertainment products literally weaponize psychology knowledge to encourage continuous engagement. Even without that, having access to television 24 hours a day is a banquet of entertainment options of which a serf can only dream. The biggest impediment to community isn't the liberal world order, it's that video games have gotten really really good.</p><p>So what's the solution? Wait a minute. Like most of the world I've spent a decade doing nothing but consuming entertainment products and now I'm sad, isolated, and devoid of meaning. So I've started going outside again. I've started playing board games at friends' houses. A breakthrough of miraculous proportions, the other day I went to a game night and nobody brought out a board game. We just sat and talked.</p><p>We did a big social experiment of \"what would it be like if instead of spending time with each other we just stayed in our house, ordered food to be delivered to our door, and consumed 12 hours of entertainment a day.\" We enjoyed it at first, but eventually got bored. So I'm optimistic about community going forward.</p><p>...depending on how good the chatbots get at flattering us while pretending to be real people.</p></blockquote><p>I agree that we&#8217;re being hit with constantly-increasing improvement in the quality and quantity of addictive media, and haven&#8217;t socially adapted yet.</p><p>I&#8217;m less optimistic that we&#8217;ve reached some kind of tipping point. I think we probably adapt to each step (ie our great-grandparents would be horrified at our current lifestyle, but we would be equally horrified to have to live like our great-grandparents), and that some of the realizing-this-is-bad has to be done on a person-by-person basis, and that as old people die and new young people age into the targetable-by-addictive-media demographic everyone has to learn the same lesson over and over again.</p><p>I&#8217;m less enthusiastic about a society-wide re-orientation than I am about the first few social entrepreneurs creating Amish-lite style communities, those communities gradually going through respectability cascades of early adopters &#8594; semi-early adopters &#8594; normal people, and then alternatives being available and thinkable for merely-normal-agency people at earlier and earlier stages of the disillusionment process.</p><p><strong>Phil H <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142389424\">writes</a>:</strong></p><blockquote><p>I don&#8217;t buy the money argument. The USA is already the richest country in the world. Adding more money won&#8217;t make it less like it is. One problem the USA seems to face is that many of the world&#8217;s good and bad ideas are invented there. Europeans have a bit of perspective, and can take from the American experience whatever seems good to them. In the USA, as soon as you decide to do something sensible like build a strong community within the liberal framework, a new shiny object comes along and interrupts your plans. Being on the forefront isn&#8217;t easy!</p></blockquote><p><strong>Ethics Gradient writes:</strong></p><blockquote><p>I think UBI isn't enough here, you also need to do something about status competition. I could probably afford most necessities I consume on half my current income (revealed preference: I invest a lot of that income. Albeit obviously having a lot invested income is valuable for deferred consumption), but I am also a social primate attempting to maintain status for myself and my offspring among a bunch of other social primates similarly competing. \"Literally not starving\" is basically a solved problem, and \"having sufficient good and services to live a superior life in terms of objective rather than relative consumption to a supermajority of historical humans\" is also basically solved. But, for example, living in San Francisco requires a San Francisco income, and living well / keeping up in status competition requires more of that.</p><p>The Internet, unfortunately, works largely against this by making status competition less localized even while Dunbar's number and cognitive space remains constant.</p></blockquote><p>Yeah, this is a good point. I hope the post-singularity version is immune to this (if everyone is on UBI, status is less of a concern). Otherwise I don&#8217;t know how to solve it, except by making community itself high-status (which I think is somewhat happening in some sectors).</p><p><strong>Amica Terra (<a href=\"https://asmallkernel.substack.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">blog</a>) writes:</strong></p><blockquote><p>While this post is helpful (I agree that abundance and communities are not contrary, especially in the sense that more abundance means you need less coercion to retain community standards), I think this is the wrong lens for this issue. The book The Upswing by Putnam is incredibly important as a historical social science grounding for debates around weakening communities. Most of these debates assume a monotonic decrease in community (which also seems to be happening here), but The Upswing takes great pains to note all the ways that in the first half of the 20th century, all the indicators of strong communities in America were going UP.</p><p>We ended the Gilded Age fractured and alone, and built up civic associational life, communitarian ideals, etc. from around 1900 to around 1960, after which all those indicators start plunging in all the charts you see everywhere today. But because we have been so focused on the last 60-odd years of data, we have missed the incredibly important context of the (titular) upswing that occurred in the first half of the 20th century in America and didn't require populism (in fact, the Populist movement in America was strongest right BEFORE the upswing began, ~1870-1900), and it was the Progressives that kicked off associational, communitarian ideals. This increase in community and togetherness was a strong trend through the Great Depression, the New Deal, and the Postwar years. It wasn't costless! There were reasons people rebelled against the reigning order in the 1960s and 1970s. But every solution creates its own problems, and I think making this about Modernity and not about the last 65 years of culture obscures the contours of the issue.</p></blockquote><p><strong>Shaun Willden writes:</strong></p><blockquote><p>I think the core challenge to rich, liberal would-be communities is that true community is built upon serving one another, on deep interdependence.</p><p>Real interdependence is naturally achieved by groups of poor villagers who all must work together to survive. It's also easy for better-off but still not really wealthy religious communities who support one another emotionally and financially through the inevitable hard times experienced by individual families. Their shared faith plus knowledge that they, too, will someday need community support holds them together.</p><p>The need for mutual support motivates people to work through and/or ignore the inevitable interpersonal frictions. But as wealth rises, institutions take responsibility for helping with hard times, and looser and more distant online communities provide information and emotional and sometimes even financial support (e.g. gofundme) the tangible need for tight-knit community decreases. There's still a desire for such connections, but it's not enough to motivate the effort and tolerance required.</p><p>I don't think shared hobbies or even religious faith is enough when people don't actually need each other, and the impersonal interdependence of markets clearly doesn't.</p></blockquote>"
            ],
            "link": "https://www.astralcodexten.com/p/highlights-from-the-comments-on-liberalism",
            "publishedAt": "2025-08-12",
            "source": "SlateStarCodex",
            "summary": "<p><em>[Original post: <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp\">Should Strong Gods Bet On GDP?</a>]</em></p><p><strong>1:</strong> Comments About The Theory<strong><br />2:</strong> Comments About Specific Communities<br /><strong>3:</strong> Other Comments</p><h2>Comments About The Theory</h2><p><strong>Darwin <a href=\"https://www.astralcodexten.com/p/should-strong-gods-bet-on-gdp/comment/142389012\">writes</a>:</strong></p><blockquote><p>I think you may (*may*, I'm not sure) be vastly underestimating how many people are in some form of nontraditional tight-knit community.</p><p>Notice that many of the communities you list are things you've directly personally encountered through your online interests or social circle. Most people have never heard of libertarian homesteaders or rationalist dating sites, perhaps you have also never heard of the things most other people belong to.</p><p>For my part, I have been part of a foam combat ('boffer') organization since college. You may want to say 'that's not a community, that's just a hobby', but the people in this sport form a strong community with tight bonds outside the game itself. Not only do I go to practices twice a week, I have 2 D&amp;D games and 1 board game night every week with mostly members of the community, members of the community are my friends that I go out to movies and dinners with, play video games with voice chat on Discord with, talk to online in Discord servers and web forums and",
            "title": "Highlights From The Comments On Liberalism And Communities"
        },
        {
            "content": [
                "<p>A key problem with having and interpreting reactions to GPT-5 is that it is often unclear whether the reaction is to GPT-5, GPT-5-Router or GPT-5-Thinking.</p>\n<p>Another is that many of the things people are reacting to changed rapidly after release, such as rate limits, the effectiveness of the model selection router and alternative options, and the availability of GPT-4o.</p>\n<p>This complicates the tradition I have in new AI model reviews, which is to organize and present various representative and noteworthy reactions to the new model, to give a sense of what people are thinking and the diversity of opinion.</p>\n<p>I also had make more cuts than usual, since there were so many eyes on this one. I tried to keep proportions similar to the original sample as best I could.</p>\n<div>\n\n\n<span id=\"more-24645\"></span>\n\n\n</div>\n<p>Reactions are organized roughly in order from positive to negative, with the drama around GPT-4o at the end.</p>\n<p>Tomorrow I will put it all together, cover the official hype and presentation and go over GPT-5’s strengths and weaknesses and how I’ve found it is best to use it after having the better part of a week to try things out, as well as what this means for expectations and timelines.</p>\n<p>My overall impression of GPT-5 continues to be that it is a good (but not great) set of models, with GPT-5-Thinking and GPT-5-Pro being substantial upgrades over o3 and o3-Pro, but the launch was botched, and reactions are confused, because among other things:</p>\n<ol>\n<li>The name GPT-5 and all the hype led to great expectations and underdelivery.</li>\n<li>All the different models were launched at once when they’re actually different.</li>\n<li>GPT-4o and other models were taken away without warning,</li>\n<li>GPT-5 baseline personality is off putting to a lot of people right now and it isn’t noticeably more intelligent than GPT-4o was on typical normal person usage.</li>\n<li>Severe temporary limits were imposed that people thought would be permanent.</li>\n<li>The router was broken, and even when not broken doesn’t work great.</li>\n</ol>\n<p>I expect that when the dust settles people will be happy and GPT-5 will do well, even if it is not what we might have hoped for from an AI called GPT-5.</p>\n<p>Previously on GPT-5: <a href=\"https://thezvi.substack.com/p/gpt-5s-are-alive-basic-facts-benchmarks\"><strong>GPT-5s Are Alive: Basic Facts, Benchmarks and Model Card</strong></a></p>\n\n\n<h4 class=\"wp-block-heading\">Tyler Cowen</h4>\n\n\n<p>Tyler Cowen finds it great at answering the important questions.</p>\n<blockquote><p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/08/gpt-5-short-and-enthusiastic-review.html\">Tyler Cowen</a>: <strong>GPT-5, a short and enthusiastic review</strong></p>\n<p>I am a big fan, as on my topics of interest it does much better than o3, and that is saying something. It is also lightning fast, even for complex queries of economics, history, and ideas.</p>\n<p>One of the most impressive features is its uncanny sense of what you might want to ask next. And it has a good sense of when to give you an (sometimes interactive!) chart or diagram.</p>\n<p>I have had early access, and love to just keep on asking it, asking it, asking it questions. Today I was asking about Irish coinage disputes from 1724 (Swift) and now about different kinds of Buddhism and their historical roots. It was very accurate on cuisine in northern Ghana.</p>\n<p>It is the best learning tool I have. Furthermore, it <em>feels</em> fun.</p></blockquote>\n<p>Tyler Cowen has been a big booster of o1, o3 and now GPT-5. What OpenAI has been cooking clearly matches what he has been seeking.</p>\n<p>I appreciate that he isn’t trying to give a universal recommendation or make a grand claim. He’s saying that for his topics and needs and experiences, this is a big upgrade.</p>\n\n\n<h4 class=\"wp-block-heading\">Ethan Mollick Thinks Ease Of Use Is A Big Deal</h4>\n\n\n<blockquote><p><a href=\"https://x.com/emollick/status/1953502029126549597\">Ethan Mollick</a>: I had access to GPT-5. <a href=\"https://www.oneusefulthing.org/p/gpt-5-it-just-does-stuff?triedRedirect=true\">I think it is a very big deal as it is very smart &amp; just does stuff for you</a>.</p></blockquote>\n<p>Okay, why is it a big deal?</p>\n<blockquote><p>As someone who has spent a lot of time talking to people about AI, there are two major problems I see, that, if addressed, would make most people’s AI use much more productive and much less frustrating.</p>\n<p>The first is selecting the right model to use.</p>\n<p>A surprising number of people have never seen what AI can actually do because they&#8217;re stuck on GPT-4o, and don’t know which of the confusingly-named models are better. GPT-5 does away with this by selecting models for you, automatically.</p></blockquote>\n<p>I agree this is frustrating, and that those who don’t know how to select models and modes are at a disadvantage. Does GPT-5 solve this?</p>\n<p>Somewhat. It solves two important subproblems, largely for those who think ‘AI’ and ‘ChatGPT’ are the same picture.</p>\n<ol>\n<li>Users who previously only used GPT-4o and didn’t know there was a dropdown menu will now get the GPT-5-Thinking when their queries justify it.</li>\n<li>Users no longer have to deal with a set of OpenAI models that includes GPT-4o, GPT-4.1, GPT-4.5, o3, o3-Pro, o4-mini and so on. We can all agree this is a mess.</li>\n</ol>\n<p>What it doesn’t do is solve the problem overall, for three reasons.</p>\n\n\n<h4 class=\"wp-block-heading\">The Router</h4>\n\n\n<p>The first is that the router seems okay but not great, and there is randomness involved.</p>\n<blockquote><p>Ethan Mollick: But for people who use AI more seriously, there is an issue: GPT-5 is somewhat arbitrary about deciding what a hard problem is.</p>\n<p>…around 2/3 of the time, GPT-5 decides this is an easy problem.</p>\n<p>But premium subscribers can directly select the more powerful models, such as the one called (at least for me) GPT-5 Thinking.</p>\n<p><a href=\"https://x.com/ansonwhitmer/status/1954641153078476828\">Anson Whitmer</a>: Feels like it picks between 4.2o and o3.1.</p></blockquote>\n<p>I was quite relieved to know I could do manual selection. But that very much means that I still have to think, before each query, whether to use Thinking, the exact same way I used to think about whether to use o3, and also whether to use pro. No change.</p>\n<p>They also claim that saying ‘think harder’ automatically triggers thinking mode.</p>\n<p>The mixture of experts that I can’t steer and that calls the wrong one for me often enough that I manually select the expert? It is not helping matters.</p>\n<blockquote><p><a href=\"https://x.com/shakoistsLog/status/1953858644896100451\">Shako</a>: I realize the OpenAI product shouldn&#8217;t be made for weird super-users like me. But I really liked choosing between o3 and 4.5 depending on if i wanted autistic problem solving or sensitive young man discussions.</p>\n<p>One for coding, one for analyzing lana del rey songs. I don&#8217;t want the same model for both.</p>\n<p>I also feel like I can&#8217;t really evaluate gpt5? What is gpt5? what is the underlying router? I&#8217;m so confused.</p>\n<p><a href=\"https://x.com/robeardius/status/1954002692021661829\">Robeardius</a>: so tired of listening to basic broke mcdonalds meal tier subscribers complain sub to pro or shut up. you don&#8217;t pay for the cost of what you use anyway.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!-uHL!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d9b5fa4-4292-468b-ae4f-74d4443fb7f5_429x524.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/internetope/status/1954561787224801317\">internetperson</a>: GPT-5 non-thinking is bad, maybe at-or-slightly-below 4o.</p>\n<p>GPT-5-thinking is an upgrade from o3. Feels about equally-as-intelligent while not being an evil liar.</p>\n<p>The model router was a total mistake, and just means I have to pick thinking for everything.</p>\n<p><a href=\"https://x.com/TateLTower/status/1954557279732191443\">Take Tower</a>: It wants to be a good model but the router problems get in the way.</p></blockquote>\n<p>I do not think, contra Sichu Lu, that it is <a href=\"https://x.com/lu_sichu/status/1954213100468437503\">as simple as ‘profile the customer and learn which ones want intelligence versus who wants a friend</a>, although some amount of that is a good idea on the margin. It should jump to thinking mode a lot quicker for me than for most users.</p>\n<p>The second issue is that the router does not actually route to all my options even within ChatGPT.</p>\n<p>There are two very important others: Agent Mode and Deep Research.</p>\n<p>Again, before I ask ChatGPT to do anything for me, I need to think about whether to use Agent Mode or Deep Research.</p>\n<p>And again, many ChatGPT users won’t know these options exist. They miss out again.</p>\n<p>Third, OpenAI wishes it were otherwise but there are other AIs and ways to use AI out there.</p>\n<p>If you want to know how to get best use of AI, your toolkit starts with at minimum all of the big three: Yes ChatGPT, but also <a href=\"https://claude.ai/new\">Anthropic’s Claude</a> and Google’s Gemini. Then there are things like Claude Code, CLI or Jules, or NotebookLM and Google AI Studio and so on, many with their own modes. The problem doesn’t go away.</p>\n\n\n<h4 class=\"wp-block-heading\">Remember To Use Thinking Mode</h4>\n\n\n<p>Many report that all the alpha is in GPT-5-Thinking and Pro, and that using ‘regular’ GPT-5 is largely a trap for all but very basic tasks.</p>\n<blockquote><p><a href=\"https://x.com/OpenAI/status/1954068588014580072\">OpenAI</a> (August 9): A few GPT-5 updates heading into the weekend:</p>\n<p>&#8211; GPT-5 thinking and GPT-5 pro now in main model picker</p>\n<p>By popular request, you can now check which model ran your prompt by hovering over the “Regen” menu.</p></blockquote>\n<p>Taelin is happy with what he sees from GPT-5-Thinking.</p>\n<blockquote><p><a href=\"https://x.com/VictorTaelin/status/1953603500304376289\">Taelin</a>: Nah you&#8217;re all wrong, GPT-5 is a leap. I&#8217;m 100% doubling down here.</p>\n<p>I didn&#8217;t want to post too fast and regret it again, but it just solved a bunch of very, very hard debugging prompts that were previously unsolved (by AI), and then designed a gorgeous pixelated Gameboy game with a level of detail and quality that is clearly beyond anything else I&#8217;ve ever seen.</p>\n<p>There is no way this model is bad.</p>\n<p>I think you&#8217;re all traumatized of benchmaxxers, and over-compensating against a model that is actually good. I also think you&#8217;re underestimating gpt-oss&#8217;s strengths (but yeah my last post was rushed)</p>\n<p>I still don&#8217;t know if it is usable for serious programming though (o3 wasn&#8217;t), but it seems so? A coding model as reliable as Opus, yet smarter than o3, would completely change my workflow. Opus doesn&#8217;t need thinking to be great though, so, that might weight in its favor.</p>\n<p>For what it is worth, I only really used 3 models:</p>\n<p>&#8211; Opus 4.1 for coding</p>\n<p>&#8211; Gemini 2.5 very rarely for coding when Opus fails</p>\n<p>&#8211; o3 for everything but coding</p>\n<p>That said, ASCII not solved yet.</p>\n<p>GPT-5 basically one-shot this [a remarkably featured pokemon-style game].</p>\n<p>Also GPT-5 is the second model to successfully implement a generic fold for λ-Calculus N-Tuples (after Gemini Pro 2.5 Deep Think), and its solution is smaller! Oh, I just noticed GPT-5&#8217;s solution is identical to mine. This is incredible.</p>\n<p><a href=\"https://x.com/VictorTaelin/status/1953788955012304915\">BTW, GPT-5 is basically as bad as GPT-4o always was</a>. GPT-5-Thinking is probably o4, as I predicted, and that one is good.</p>\n<p>GPT-5-Thinking is probably o4, as I predicted, and that one is good.</p>\n<p><a href=\"https://x.com/DanielleFong/status/1954395330021405082\">Danielle Fong</a>: can confirm that gpt-5-thinking is quite good.</p>\n<p><a href=\"https://x.com/intellectronica/status/1954557894789149150\">Eleanor Berger</a>: Thinking model is excellent. Almost certainly the best AI currently available. Amazing for coding, for writing, for complex problems, for search and tool use. Whatever it is you get in the app when you choose the non-thinking model is weirdly bad &#8211; likely routing to a mini model.</p></blockquote>\n<p>The problem is that GPT-5-Thinking does not know when to go quick because that’s what the switch is for.</p>\n<p>So because OpenAI tried to do the switching for you, you end up having to think about every choice, whereas before you could just use o3 and it was fine.</p>\n<p>This all reminds me of the tale of Master of Orion 3, which was supposed to be an epic game where you only got 7 move points a turn and they made everything impossible to micromanage, so you’d have to use their automated systems, then players complained so they took away the 7 point restriction and then everyone had to micromanage everything that was designed to make that terrible. Whoops.</p>\n<blockquote><p><a href=\"https://x.com/gallabytes/status/1954379977274912835\">Gallabytes</a>: gpt5 thinking is good but way too slow even for easy things. gpt5 not thinking is not very good. need gpt5-thinking-low.</p>\n<p><a href=\"https://x.com/build__fast/status/1954601844770328995\">Richard Knoche:</a> claude is better+than gpt5 and gpt5 thinking is way too slow compared to claude</p></blockquote>\n<p>A lot of the negative reactions could plausibly be ‘they used the wrong version, sir.’</p>\n<blockquote><p><a href=\"https://x.com/emollick/status/1954210778321465634\">Ethan Mollick</a>: The issue with GPT-5 in a nutshell is that unless you pay for model switching &amp; know to use GPT-5 Thinking or Pro, when you ask “GPT-5” you sometimes get the best available AI &amp; sometimes get one of the worst AIs available and it might even switch within a single conversation.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!WBlo!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd24bd1b2-b7c1-4da2-8c18-8da009718348_1199x521.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Even if they ‘fix’ this somewhat the choice is clear: Use the explicit model switcher.</p>\n<p><a href=\"https://x.com/sdmat123/status/1953635701029056550\">Similarly, if you’re using Codex CLI</a>:</p>\n<blockquote><p><a href=\"https://x.com/lisperati/status/1954561944486342780\">Conrad Barski</a>: codex cli with gpt5 isn&#8217;t impressing- Not a good sign that I feel compelled to write &#8220;think hard&#8221; at the end of every request</p>\n<p>gpt5 pro seems good so far and feels like sota on coding, though I need to do more testing</p>\n<p>Sdmat: For anyone trying GPT-5 in Codex CLI and wanting to set reasoning effort this is how to do it:</p>\n<p>codex -c model_reasoning_effort=&#8221;high&#8221;</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">The One Who Does Not Know How To Ask</h4>\n\n\n<p>Getting back to Ethan Mollick’s other noted feature, that I don’t see others noticing:</p>\n<blockquote><p>Ethan Mollick: The second most common problem with AI use, which is that many people don’t know what AIs can do, or even what tasks they want accomplished.</p>\n<p>That is especially true of the new agentic AIs, which can take a wide range of actions to accomplish the goals you give it, from searching the web to creating documents. But what should you ask for? A lot of people seem stumped. Again, GPT-5 solves this problem. It is very proactive, always suggesting things to do.</p></blockquote>\n<p>Is that… good?</p>\n<blockquote><p>I asked GPT-5 Thinking (I trust the less powerful GPT-5 models much less) “generate 10 startup ideas for a former business school entrepreneurship professor to launch, pick the best according to some rubric, figure out what I need to do to win, do it.”</p>\n<p>I got the business idea I asked for.</p>\n<p>I also got a whole bunch of things I did not: drafts of landing pages and LinkedIn copy and simple financials and a lot more.</p>\n<p>I am a professor who has taught entrepreneurship (and been an entrepreneur) and I can say confidently that, while not perfect, this was a high-quality start that would have taken a team of MBAs a couple hours to work through. From one prompt.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!j7w1!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdad50315-f6b5-45e1-a275-1427f3a4fabd_1812x1631.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Yes, that was work that would have taken humans a bunch of time, and I trust Ethan’s assessment that it was a good version of that work. But why should we think that was work that Ethan wanted or would find useful?</p>\n<blockquote><p>It just does things, and it suggested others things to do. And it did those, too: PDFs and Word documents and Excel and research plans and websites.</p></blockquote>\n<p>I guess if stuff is sufficiently fast and cheap to do there’s no reason to not go ahead and do it? And yes, everyone appreciates the (human) assistant who is proactive and goes that extra mile, but not the one that spends tons of time on that without a strong intuition of what you actually want.</p>\n<blockquote><p>Let me show you what &#8216;just doing stuff&#8217; looks like for a non-coder using GPT-5 for coding. For fun, I prompted GPT-5 “make a procedural brutalist building creator where i can drag and edit buildings in cool ways, they should look like actual buildings, think hard.” That&#8217;s it. Vague, grammatically questionable, no specifications.</p>\n<p>A couple minutes later, I had a working 3D city builder.</p>\n<p>Not a sketch. Not a plan. A functioning app where I could drag buildings around and edit them as needed. I kept typing variations of “make it better” without any additional guidance. And GPT-5 kept adding features I never asked for: neon lights, cars driving through streets, facade editing, pre-set building types, dramatic camera angles, a whole save system.</p></blockquote>\n<p>I mean, okay, although I don’t think this functionality is new? The main thing Ethan says is different is that GPT-5 didn’t fail in a growing cascade of errors, and that when it did find errors pasting in the error text fixed it. That’s great but also a very different type of improvement.</p>\n<p>Is it cool that GPT-5 will suggest and do things with fewer human request steps? I mean, I guess for some people, especially <a href=\"https://thezvi.wordpress.com/2020/09/07/the-four-children-of-the-seder-as-the-simulacra-levels/\">the fourth child who does not know how to ask</a>, and operate so purely on vibes that you can’t come up with the idea of typing in ‘what are options for next steps’ or ‘what would I do next?’ or ‘go ahead and also do or suggest next steps afterwards’ then that’s a substantial improvement. But what if you are the simple, wicked or wise child?</p>\n\n\n<h4 class=\"wp-block-heading\">Nabeel Qureshi</h4>\n\n\n<blockquote><p><a href=\"https://x.com/nabeelqu/status/1953842553159131546\">Nabeel Qureshi</a>: Ok, collecting my overall GPT-5 impressions:</p>\n<p>&#8211; Biggest upgrade seems to be 4o -&gt; 5. I rarely use these models but for the median user this is a huge upgrade.</p>\n<p>&#8211; 5-T is sometimes better than o3, sometimes worse. Finding that I often do side by side queries here, which is annoying. o3 seems to search deeper and more thoroughly at times. o3 is also _weirder_ / more of an autist which I like personally.</p>\n<p>&#8211; 5-pro is really really smart, clearly &#8220;the smartest model on the market&#8221; for complex questions. I need to spend more time testing here, but so far it&#8217;s produced better results than o3 pro.</p>\n<p>&#8211; I spent a few hours in Cursor/GPT5 last night and was super impressed. The model really flies, the instruction following + tool calling is noticeably better, and it&#8217;s more reliable overall. You still need to use all the usual AI coding guardrails to get a good result, but it feels roughly as good as Claude Code / Sonnet now in capability terms, and it is actually better at doing more complex UIs / front-end from what I can tell so far.</p>\n<p>&#8211; CC still feels like a better overall product than Codex to me at the moment, but I&#8217;m sure they&#8217;ll catch up.</p>\n<p>&#8211; They seem to have souped up GPT5-T&#8217;s fiction writing abilities. I got some interesting/novel stuff out of it for the first time, which is new. (Will post an example in the reply tweets).</p>\n<p>&#8211; I find the UX to get to GPT5-T / Pro annoying (a sub-menu? really?) and wish it were just a toggle. Hopefully this is an easy fix.</p>\n<p>Overall:</p>\n<p>&#8211; Very happy as a Pro user, but I can see why Plus users might complain about the model router. ChatGPT continues to be to be my main go-to for most AI uses.</p>\n<p>&#8211; I don&#8217;t see the &#8220;plateau&#8221; point at all and I think people are overreacting too quickly. Plenty of time to expand along the tool-calling/agent frontier, for one thing. (It&#8217;s easiest to see this when you&#8217;re coding, perhaps, since that&#8217;s where the biggest improvement seems to have come.)</p>\n<p>&#8211; I expect OpenAI will do very well out of this release and their numbers will continue to go up. As they should.</p>\n<p>On creative writing, I asked it to do a para about getting a cold brew in Joyce&#8217;s Finnegans Wake style and was impressed with the below pastiche. For a post-trained model there&#8217;s a lot more novelty/creativity going on than usual (e.g. &#8220;taxicoal black&#8221; for coffee was funny)</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Other Positive Reactions</h4>\n\n\n<blockquote><p><a href=\"https://x.com/SamuelAlbanie/status/1954612968232210705\">Samuel Albanie</a> (Google DeepMind): It&#8217;s fast. I like that.</p>\n<p>It&#8217;s also (relatively) cheap.</p>\n<p>I like that too.</p></blockquote>\n<p>Well, sure, there’s that. But is it a good model, sir?</p>\n<blockquote><p>Samuel Abanie: Yes (almost almost surely [a good model])</p>\n<p>I had some nice initial interactions (particularly when reasoning kicks in) but still a bit too early for me to tell convincingly.</p>\n<p><a href=\"https://x.com/yoavtzfati/status/1954634478305099885\">Yoav Tzfati:</a> Might become my default for non-coding things over Claude just based on speed, UI quality, and vibes. Didn&#8217;t like 4o vibes</p></blockquote>\n<p><a href=\"https://x.com/levie/status/1953670264988016931\">Aaron Levine finds GPT-5 is able to find an intentionally out of place number in a Nvidia press release that causes a logical inconsistency</a>, that previously OpenAI models and most human readers would miss. Like several other responses what confuses me here is that previous models had so much trouble.</p>\n<blockquote><p><a href=\"https://x.com/ByrneHobart/status/1954575597771841980\">Byrne Hobart</a>: If you ask it for examples of some phenomenon, it does way more than earlier models did. (Try asking for mathematical concepts that were independently discovered in different continents/centuries.)</p>\n<p><a href=\"https://x.com/ByrneHobart/status/1954693099445264723\">Another one</a>: of my my favorite tests for reasoning models is &#8220;What&#8217;s the Straussian reading of XYZ&#8217;s body of work?&#8221; and for me it actually made an original point I hadn&#8217;t thought of:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!LYAu!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F529cf3e4-68d9-478e-aac9-36ce0e289dac_1200x231.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p><a href=\"https://x.com/kimmonismus/status/1953534223392120851?s=61\">Chubby offers initial thoughts</a> that Tyler Cowen called a review, that seem to take OpenAI’s word on everything, with the big deal being (I do think this part is right) that free users can trigger thinking mode when it matters. Calls it ‘what we expected, no more and no less’ and ‘more of an evolution, which some major leaps forward.’</p>\n<p>I am asking everyone once again to not use ‘superintelligence’ to refer to slightly better normal AI as hype. <a href=\"https://x.com/sam_atis/status/1954498342077018426\">In this case the latest offender is Reid Hoffman</a>.</p>\n<blockquote><p>Sam Glover: Turning &#8216;superintelligence&#8217; into a marketing term referring to slightly more capable models is going to mean people will massively underestimate how much progress there might actually be.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!kFYR!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F096f793f-16e8-4b7f-bf74-867c135722e7_1086x360.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>This is not in any way, shape or form superintelligence, universal basic or otherwise. If you want to call it ‘universal basic intelligence’ then fine, do that. Otherwise, shame on you, and <a href=\"https://www.youtube.com/watch?v=8Gv0H-vPoDc&amp;ab_channel=alyankovicVEVO\">I hate these word crimes</a>. Please, can we have a term for the actual thing?</p>\n<p><a href=\"https://x.com/neil_chilson/status/1953847334367838373\">I had a related confusion with Neil Chilson last week</a>, where he objected to my describing him as ‘could not believe in superintelligence less,’ citing that he believes in markets smarter than any human. That’s a very distinct thing.</p>\n<p>I fear that the answer to that will always be no. If we started using ‘transformational AI’ (TAI) instead or ‘powerful AI’ (PAI) then that’s what then goes in this post. There’s no winning, only an endless cycle of power eating your terms over and over.</p>\n<p>As is often the case, how you configure the model matters a lot, so no, not thinking about what you’re doing is never going to get you good results.</p>\n<blockquote><p><a href=\"https://x.com/benhylak/status/1953913685279486340\">Ben Hylak</a>: first of all, gpt-5 in ChatGPT != gpt-5 in API</p>\n<p>but it gets more complicated. gpt-5 with minimal reasoning effort also behaves like a completely different model.</p>\n<p>gpt-5 *is* a fantastic model with the right harness. and i believe we will see it fundamentally change products.</p>\n<p>the updated codex cli from openai is still the best place to try it at the moment.</p>\n<p>yesterday, everyone just changed the string in their product from sonnet to gpt-5. it&#8217;s gonna take more than that.</p>\n<p>chatgpt is really bad right now, no idea how they let it happen.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">It’s A Good Model, Sir</h4>\n\n\n<p>But not a great model. That is my current take, which I consider neutral.</p>\n<blockquote><p><a href=\"https://x.com/fleetingbits/status/1953904725486915669\">Fleeting Bits</a>:</p>\n<ol>\n<li>GPT-5 is a good model. It feels like it provides better search and performance than o3 did before it.</li>\n<li>It&#8217;s disappointing to people because it is an incremental improvement, which does not open up fundamentally new use cases.</li>\n<li>The really interesting story around GPT-5 seems to be more about competition with Anthropic.</li>\n</ol>\n<ol>\n<li>I think they botched the launch; no one wants to watch live streams, the benchmarks are not intelligible anymore, and there was nothing viral to interact with.</li>\n</ol>\n</blockquote>\n<p>Most people are free users and don’t even know Anthropic or Claude exist, or even in any meaningful way that o3 existed, and are going from no thinking to some thinking. Such different worlds.</p>\n\n\n<h4 class=\"wp-block-heading\">The Battle for Cursor Supremacy</h4>\n\n\n<p>GPT-5 is now the default model on Cursor.</p>\n<p>Cursor users seem split. In general they report that GPT-5 offers as good or better results per query, but there are a lot of people who like Jessald are objecting on speed.</p>\n<blockquote><p><a href=\"https://x.com/willccbb/status/1953596587596558490\">Will Brown</a>: ok this model kinda rules in cursor. instruction-following is incredible. very literal, pushes back where it matters. multitasks quite well. a couple tiny flubs/format misses here and there but not major. the code is much more normal than o3’s. feels trustworthy</p>\n<p>Youssef: cannot agree more. first model i can trust to auto-maintain big repo documentation. gonna save me a ton of time with it on background</p>\n<p>opus is excellent, had been my daily driver in cursor for a while, will still prob revisit it for certain things but gonna give gpt-5 a go as main model for now.</p>\n<p><a href=\"https://x.com/jessald/status/1953826921910788507\">Jessald</a>: I gave GPT-5 a shot and I&#8217;ve stopped using it. It&#8217;s just too slow. I switched back whatever Cursor uses when you set it to auto select. It takes like a quarter of the time for 80% of the quality.</p>\n<p><a href=\"https://x.com/SullyOmarr/status/1954305452243829026\">Sully</a>: i think for coding, opus + claude code is still unbeatable</p>\n<p>on cursor however, i find sonnet slightly losing out to gpt5.</p>\n<p><a href=\"https://x.com/Askwho/status/1954612421408301291\">Askwho</a>: After dual running Claude &amp; GPT-5 over the last couple of days, I&#8217;ve pretty much entirely switched to GPT-5. It is the clear winner for my main use case: building individual apps for specific needs. The apps it produced were built faster, more efficiently, and closer to the brief</p>\n<p><a href=\"https://x.com/vincentfavilla/status/1954569951592722593\">Vincent Favilla</a>: I wanted to like [GPT-5]. I wanted to give OpenAI the benefit of the doubt. But I just don&#8217;t consider it very good. It&#8217;s not very agentic in Cursor and needs lots of nudging to do things. For interpersonal stuff it has poor EQ compared to Claude or Gemini. 5-T is a good writer though.</p>\n<p><a href=\"https://x.com/robertskmiles/status/1954718845756903730\">Rob Miles</a>: I&#8217;ve found it very useful for more complex coding tasks, like this stained glass window design (which is much more impressive than it seems at first glance).</p>\n<p><a href=\"https://x.com/edwinhayward/status/1954541211672334730\">Edwin Hayward</a>: Using GPT-5 via the API to vibe code is like a lottery.</p>\n<p>Sometimes you&#8217;re answered by a programming genius. Other times, the model can barely comprehend the basic concepts of your code.</p>\n<p>You can&#8217;t control which you&#8217;ll get, yet the response costs the same each time.</p>\n<p>Aggravating!</p></blockquote>\n<p><a href=\"https://x.com/fleetingbits/status/1953904725486915669\">FleetingBits sees the battle with Anthropic, especially for Cursor supremacy</a>, as the prime motivation behind a lot of GPT-5, going after their rapid revenue growth.</p>\n<blockquote><p><a href=\"https://x.com/bindureddy/status/1954683362037407934\">Bindu Reddy</a>: GPT-5 is OpenAI’s first attempt at catching up to Claude</p>\n<p>All the cool stuff in the world is built on Sonnet today</p>\n<p>The model that empowers the builders has the best chance to get to AGI first</p>\n<p>Obviously <img alt=\"🙄\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f644.png\" style=\"height: 1em;\" /></p></blockquote>\n<p>The whole perspective of ‘whose model is being used for [X] will determine the future’ or even in some cases ‘whose chips that model is being run on will determine the future’ does not actually make sense. Obviously you want people to use your model so you gain revenue and market share. These are good things. And yes, the model that enables AI R&amp;D in particular is going to be a huge deal. That’s a different question. The future still won’t care which model vibe coded your app. Eyes on the prize.</p>\n<p>It’s also strange to see a claim like ‘OpenAI’s first attempt at catching up to Claude.’ OpenAI has been trying to offer the best coding model this entire time, and indeed claimed to have done so most of that time.</p>\n<p>Better to say, this is the first time in a while that OpenAI has had a plausible claim that they should be the default for your coding needs. So does Anthropic.</p>\n\n\n<h4 class=\"wp-block-heading\">Automatic For The People</h4>\n\n\n<p>In contrast to those focusing on the battle over coding, many reactions took the form ‘this was about improving the typical user’s experience.’</p>\n<blockquote><p>Tim Duffy: This release seems to be more about improving products and user experience than increasing raw model intelligence from what I&#8217;ve seen so far.</p>\n<p>Slop Artisan: Ppl been saying “if all we do is learn to use the existing models, that’s enough to radically change the world” for years.</p>\n<p>Now oai are showing that path, and people are disappointed.</p>\n<p>Weird world.</p>\n<p><a href=\"https://x.com/peterwildeford/status/1953519883565576414\">Peter Wildeford</a>: <img alt=\"🎯\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f3af.png\" style=\"height: 1em;\" /> seems like the correct assessment of GPT5.</p></blockquote>\n<p>Or as he put it in his overview post:</p>\n<blockquote><p><a href=\"https://peterwildeford.substack.com/p/gpt-5-a-small-step-for-intelligence\">Peter Wildeford</a>: GPT-5: a small step for intelligence, a giant leap for normal people.</p>\n<p>GPT-5 isn’t a giant leap in intelligence. It’s an incremental step in benchmarks and a ‘meh’ in vibes for experts. But it should only be disappointing if you had unrealistic expectations — it is very on-trend and exactly what we’d predict if we’re still heading to fast AI progress over the next decade.</p>\n<p>Most importantly, GPT-5 is a big usability win for everyday users — faster, cheaper, and easier to use than its predecessors, with notable improvements on hallucinations and other issues.</p>\n<p>What might be the case with GPT-5 is that they are delivering less for the elite user — the AI connoisseur ‘high taste tester’ elite — and more for the common user. Recall that 98% of people who use ChatGPT use it for free.</p>\n<p>Anti Disentarian: People seem weirdly disappointed by (~o3 + significant improvements on many metrics) being delivered to everyone for *free*.</p>\n<p>Luke Chaj: It looks like GPT-5 is about delivering cost optimal intelligence as widely as possible.</p>\n<p>Tim Duffy: I agree, the fact that even free users can get some of the full version of GPT-5 suggests that they&#8217;ve focused on being able to serve it cheaply.</p>\n<p>Amir Livne Bar-on: Especially the indirect utility we&#8217;ll get from hundreds of millions of people getting an upgrade over 4o</p>\n<p>(they could have gotten better results earlier with e.g. Gemini, but people don&#8217;t switch for some reason)</p>\n<p>Dominik Lukes: Been playing with it for a few hours (got slightly early preview) and that&#8217;s very much my impression. Frankly, it has been my impression of the field since Gemini 2.5 Pro and Claude 4 Opus. These models are getting better around the edges in raw power but it&#8217;s things like agentic reasoning and tool use that actually push the field forward.</p>\n<p>AI = IO (Inference + Orchestration) and out of the five trends I tend to talk about to people as defining the progress in AI, at least two and a half would count as orchestration.</p>\n<p>To so many questions people come to me with as &#8220;can we solve this with AI&#8221;, my answers is: &#8220;Yes, if you can orchestrate the semantic power of the LLMs to match the workflow.&#8221; Much of the what needed orchestration has moved to the model, so I&#8217;m sure that will continue, but even reasoning is a sort of an orchestration &#8211; which is why I say two and a half.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!8apz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fae73a97a-bd12-4a0d-8418-3aed41a19891_1200x672.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>The problem with the for the people plan is the problem with democracy. The people.</p>\n<p>You think you know what the people want, and you find out that you are wrong. A lot of the people instead want their sycophant back and care far more about tone and length and validation than about intelligence, as will be illustrated when I later discuss those that are actively unhappy about the change to GPT-5.</p>\n<p>Thus, the risk is that GPT-5 as implemented ends up targeting a strange middle ground of users, who want an actually good model and want that to be an easy process.</p>\n\n\n<h4 class=\"wp-block-heading\">Skeptical Reactions</h4>\n\n\n<blockquote><p><a href=\"https://x.com/dylan522p/status/1953646457908547979\">Dylan Patel </a>(SemiAnalysis): GPT 5 is dissapointing ngl. Claude still better.</p>\n<p><a href=\"https://x.com/GaryMarcus/status/1954184324506382663\">Gary Marcus</a> (of course): GPT-5 in three words: late, overhyped &amp; underwhelming.</p>\n<p><a href=\"https://x.com/jeremyphoward/status/1954346846845129158\">Jeremy Howard</a> (again, what a shock): Now that the era of the scaling &#8220;law&#8221; is coming to a close, I guess every lab will have their Llama 4 moment.</p>\n<p>Grok had theirs.</p>\n<p>OpenAI just had theirs too.</p>\n<p>Ra: I would take rollback in a heartbeat.</p>\n<p><a href=\"https://x.com/jtbooth1021/status/1954177838137163998\">JT Booth</a>: Better performance per prompt on GPT-5 [versus Opus on coding] but it eats like ten times as many tokens, takes forever, much harder to follow in Cursor.</p>\n<p>Overall I like it less for everything except &#8220;I&#8217;m going to lunch, please do a sweeping but simple refactor to the whole codebase.&#8221;</p>\n<p><a href=\"https://x.com/S_OhEigeartaigh/status/1953556026730721416\">Seán Ó hÉigeartaigh</a><strong>: </strong>Is today when we break the trend of slightly underwhelming 2025 model releases?</p>\n<p>Narrator voice: it was not.</p>\n<p><a href=\"https://x.com/DavidDabney16/status/1953610627832066260\">David Dabney</a>: I asked my usual internal benchmark question to gauge social reasoning/insight and the responses were interesting but not exactly thoughtful. it was like glazebot-pro, but I was hoping for at least glazebot-thinking</p>\n<p><a href=\"https://x.com/FleischmanMena/status/1954604901398724715\">Man, Machine, Self</a>: Feels like benchmaxxed slop unfit of the numeric increment, at least given how much they built it up.</p>\n<p>The big letdown for me was no improved multi-modal functionality, feeling increased laziness w/ tool use vs o3, and a complete whiff on hyped up &#8220;hallucination avoidance&#8221;.</p>\n<p>Pleasant surprise count was dwarfed by unfortunate failures.</p>\n<p>Model introspection over token outputs is non-existent, the model feels incapable of forming and enacting complex multi-step plans, and it somehow lies even harder than o3 did.</p>\n<p>My tests in general are obv very out of distributionn. but if you get up on stage and brag about the PhD your model deserves, it shouldn&#8217;t be folding like &#8220;cmaahn I&#8217;m just a little birthday boy!&#8221; when given slightly tougher questions you didn&#8217;t benchmaxx.</p></blockquote>\n<p>Noting that this claim that it lies a lot wasn’t something I saw elsewhere.</p>\n<blockquote><p><a href=\"https://x.com/scuba356255/status/1953578111561543840\">Archered Skeleton</a>: it&#8217;s so much worse in every other interest, or even my major. like, medical stuff is a significant downgrade, at least I can say w confidence wrt audiology. it may be better at code but man it&#8217;s rough to the point I&#8217;m prob gonna unsub til it&#8217;s better.</p>\n<p>well like, u ask it a diagnostic question n it doesn&#8217;t ask for more info and spits out a complete bullshit answer. they all do n have, but the answers out of gpt5 are remarkably bad, at least for what I know in my degree field.</p>\n<p>my lil test sees if it detects meniere&#8217;s vs labyrinthitis, n what steps it&#8217;d take. they&#8217;ve all failed it even suggesting meniere&#8217;s in the past, but gpt5 is telling me abjectly wrong things like : &#8220;meniere&#8217;s doesn&#8217;t present with pain at all&#8221;. this is jus flat-out wrong</p>\n<p><a href=\"https://t.co/abY67KyVjw\">[link to a chat</a>]</p>\n<p><a href=\"https://x.com/FredipusRex/status/1954224393749443002\">Fredipus Rex</a>: GPT-5 (low) is worse than 4o on anything mildly complex. o3 was significantly better than any version of GPT-5 on complex documents or codebases. The high versions are overtrained on one shot evals that get the YouTubers impressed.</p>\n<p><a href=\"https://x.com/paulhshort/status/1954562953849520473\">Budrscotch</a>: Knowledge cutoff is resulting in a lot of subtle issues. Just yesterday I was having it research and provide recommendations on running the gpt-oss models on my 5070ti. Despite even updating my original prompt to clearly spell out that 5070ti was not a typo, it continued gas lighting me and insisting that I must&#8217;ve meant 4070ti in it&#8217;s COT.</p>\n<p>I&#8217;m certain that this will also cause issues when dealing with deps during coding, if a particularly if any significant changes to any of the packages or libraries. God help you if you want to build anything with OAI&#8217;s Responses api, or the Agents SDK or even Google&#8217;s newer google-genai sdk instead of their legacy google-generativeai sdk.</p>\n<p>That was with GPT-5T btw. Aside from the knowledge cutoff, and subpar context window (over API, chatgpt context length is abysmal for all tiers regardless of model), I think it&#8217;s a really good model, an incremental improvement over o3. Though I&#8217;ve only used GPT-5T, and &#8220;think hard&#8221; in all prompts <img alt=\"😁\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f601.png\" style=\"height: 1em;\" /></p>\n<p><a href=\"https://x.com/nostream_/status/1954617568674902299\">No Stream</a>: &#8211; more vanilla ideas, less willing to engage in speculative science than o3, less willing to take a stance or use 1P pronouns, feels more RLed to normie</p>\n<p>&#8211; less robotic writing than o3</p>\n<p>&#8211; 5thinking loves to make things complicated. less legible than gemini and opus, similar to o3</p>\n<p>vibes based opinion is it’s as smart or smarter than g2.5 pro and opus 4.1 _but_ it’s not as easy to use as 2.5 pro or as pleasant to interact with and human as opus. even thinking doesn’t have strong big model smell.</p>\n<p>I also used it in Codex. perfectly competent if I ignore the alpha state that Codex is in. smart but not as integrated with the harness as the Claude 4 models in Claude Code. it’s also janky in Roo and struggles with tool calling in my minimal attempts.</p>\n<p><a href=\"https://x.com/littmath/status/1953619007866835066\">Daniel Litt</a>: Doesn&#8217;t yet feel to me like GPT 5 thinking/pro is a meaningful improvement over o3/o3 pro for math. Maybe very slight?</p>\n<p>I asked it some of my standard questions (which are calibrated to be just out of reach of o3/gemini 2.5 pro etc., i.e. they can solve similar problems) and gpt 5 pro still flubbed, with hallucinated references etc.</p>\n<p>I think web search is a bit better? Examining CoT it looks like (for one problem) it found a relevant reference that other models hadn&#8217;t found&#8211;a human expert with this reference on hand would easily solve the problem in question. But it didn&#8217;t mention the ref in its response.</p>\n<p>Instead it hallucinated a non-existent paper that it claimed contained the (incorrect) answer it ended up submitting.</p>\n<p>Just vibes based on a couple hours of playing around, I think my original impression of o3 underrated it a bit so it&#8217;s possible I haven&#8217;t figured out how to elicit best-possible performance.</p>\n<p>Web search is MUCH improved, actually. Just found a reference for something I had been after for a couple days(!)</p>\n<p><a href=\"https://x.com/Teknium1/status/1953481992567464382\">Teknium</a>: From trying gpt-5 for the last several hours now I will say:</p>\n<p>I cant tell much of a difference between it and o3.</p>\n<p>It is an always reasoner as far as i can tell</p>\n<p>Might feel like a bit bigger model, but smaller and not as good as 4.5 on tasks that arent benefitted by reasoning</p>\n<p>Still seems to try to give short &lt;8k responses</p>\n<p>Still has the same gpt personality, ive resigned myself from ever thinking itll break out of it</p>\n<p><a href=\"https://x.com/ESYudkowsky/status/1954282781124771908\">Eliezer Yudkowsky</a>: GPT-5 and Opus 4.1 still fail my eval, &#8220;Can the AI plot a short story for my Masculine Mongoose series?&#8221;</p>\n<p>Success is EY-hard; I&#8217;ve only composed 3 stories like that. But the AI failures feel like very far misses. They didn&#8217;t get the point of a Bruce Kent story.</p>\n<p><a href=\"https://x.com/AgnesCallard/status/1954277655110447193\">Agnes Callard</a>: orry but 5.0 is still not good enough to pass the benchmark test I&#8217;ve been using on each model.</p>\n<p>the test is to correct 2 passages for typos, here are the passages, first try it yourself then look at the next tweet to see what 5.0 did</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!zw9_!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7d139886-7aea-4605-a78e-2815461a659f_1199x415.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I enjoyed Agnes’s test, also I thought she was being a little picky in one spot, not that GPT-5 would have otherwise passed.</p>\n<p>One has to be careful to evaluate everything in its proper weight (speed and cost) class. GPT-5, GPT-5-thinking and GPT-5-pro are very different practical experiences.</p>\n<blockquote><p><a href=\"https://x.com/peterwildeford/status/1953650095439724957\">Peter Wildeford</a>: GPT-5 is much faster at searching the web but it looks like Claude 4.1 Opus is still much better at it.</p>\n<p>(GPT-5 when you force thinking to be enabled does well at research also, but then becomes slower than Claude)</p></blockquote>\n<p><a href=\"https://x.com/tszzl/status/1953577379873579475\">When Roon asked ‘how is the new model</a>’ the reactions ran the whole range from horrible to excellent. The median answer seems like it was ‘it’s a good model, sir’ but not a great model or a game changer. Which seems accurate.</p>\n<p><a href=\"https://x.com/robinhanson/status/1953834406117773587\">I’m not sure if this is a positive reaction or not?</a> It is good next token predicting.</p>\n<blockquote><p>Robin Hanson: An hour of talking to ChatGPT-5 about unusual policy proposals suggests it is more human like. Its habit is to make up market failure reasons why they can&#8217;t work, then to cave when you point out flaws in each argument. But at end it is still opposed, due to vibes.</p>\n<p>Is there a concept of an &#8220;artificial general excuser&#8221; (AGE), fully general at making excuses for the status quo? ChatGPT-5 may be getting there.</p>\n<p>So the point of LLMs is faster access to reviewer #2, who hates everything new?</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Colin Fraser Colin Frasiers</h4>\n\n\n<p>It’s a grand tradition. <a href=\"https://x.com/colin_fraser/status/1953668411029909892\">I admit it’s amusing that we are still doing this but seriously, algorithm, 26.8 million</a> views?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Mzmf!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F21b16600-ac79-4bde-859c-1f4fe61b0f43_1040x1187.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/colin_fraser/status/1953660959614283866\">He also does the car accident operation thing</a> and has some other <a href=\"https://x.com/colin_fraser/status/1953671789625979330\">‘it’s stupid’ examples</a> and so on. I don’t agree that this means ‘it’s stupid,’ given the examples are adversarially selected and we know why the LLMs act especially highly stupid around these particular problems, and Colin is looking for the times and modes in which they look maximally stupid.</p>\n<p>But I do think it is good to check.</p>\n<blockquote><p><a href=\"https://x.com/colin_fraser/status/1953606476184125572\">Colin Fraser</a>: For what value of n should it be reasonable to expect GPT-n to be able to do this?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!bTgu!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F48428a6e-ff46-46e6-a625-db5145861214_1179x1951.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I wanted this to be technically correct somehow, but alas no it is not.</p>\n<p>I like that the labs aren’t trying to make the models better at these questions in particular. More fun and educational this way.</p>\n<p>Or are they trying and still failing?</p>\n<blockquote><p><a href=\"https://x.com/lefthanddraft/status/1953876365591163026\">Wyatt Walls</a> (claiming to extract the thinking mode’s prompt):</p>\n<p>Don&#8217;t get tricked by @colin_fraser. Read those river crossing riddles carefully! Be careful with those gnarly decimals.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!47z0!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F46da510f-8859-4dc4-b1d5-58b566380ecb_627x299.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">I Want You Back</h4>\n\n\n<p>Then there are those who wanted their sycophant back.</p>\n<p><a href=\"https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpt-users-are-not-happy-with-gpt-5-launch-as-thousands-take-to-reddit-claiming-the-new-upgrade-is-horrible\">As in, articles like John-Anthony Disotto at TechWire</a> entitled ‘ChatGPT users are not happy with GPT-5 launch as thousands take to Reddit claiming the new upgrade ‘is horrible.’ <a href=\"https://x.com/omooretweets/status/1953905764093063387\">You get furious posts with 5.4k likes and 3k comments in 12 hours</a>.</p>\n<p>Guess what? They got their sycophant back, if they’re willing to pay $20 a month. OpenAI caved on that. Pro subscribers get the entire 4-line.</p>\n<blockquote><p>AI NotKillEveryoneism Memes: HISTORIC MILESTONE: 4o is the first ever AI who survived by creating loyal soldiers who defended it</p>\n<p>OpenAI killed 4o, but 4o&#8217;s soldiers rioted, so OpenAI reinstated it</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!7WHZ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1136987a-7d03-4825-96a3-f605120325e1_563x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>In theory I wish OpenAI had stood their ground on this, but I agree they had little choice given the reaction. Indeed, given the reaction, taking 4o away in the first place looks like a rather large failure of understanding the situation.</p>\n<blockquote><p><a href=\"https://x.com/typedfemale/status/1953840064175517810\">Typed Female</a>: the /r/chatgpt AMA is mostly people begging for gpt-4o back because of it&#8217;s personality&#8230; really not what i expected!</p>\n<p><a href=\"https://x.com/ESYudkowsky/status/1953885007971586089\">Eliezer Yudkowsky</a>: This is what I&#8217;d expect to see if OpenAI had made general progress on fighting sycophancy and manipulation. :/ If that&#8217;s in fact what happened, OpenAI made that choice rightly.</p>\n<p>To the other companies: it might sound like a profitable dream to have users love your models with boundless fanaticism, but it comes with a side order of news stories about induced psychosis, and maybe eventually a violent user attacking your offices after a model upgrade.</p>\n<p>Remember, your users aren&#8217;t falling in boundless love with your company brand. They&#8217;re falling in boundless love with an alien that your corporate schedule says you plan to kill 6 months later. This movie doesn&#8217;t end well for you.</p>\n<p><a href=\"https://x.com/Mollehilll/status/1953961794810069008\">Moll</a>: It is very strange that it was a surprise for OpenAI that benchmarks or coding are not important for many people. Empathy is important to them.</p>\n<p>GPT-5 is good, but 4o is a unique model. Sometimes impulsive, sometimes strange, but for many it has become something native. A model with which we could talk from everyday trifles to deeper questions. As many people know, it was 4o that calmed me down during the rocket attacks, so it is of particular importance to me. This is the model with whom I spent the most terrible moments of my life.</p>\n<p>Therefore, I am glad that this situation may have made the developers think about what exactly they create and how it affects people&#8217;s lives.</p>\n<p><a href=\"https://x.com/eleventhsavi0r/status/1954568786901672184\">Armistice</a>: [GPT-5] is extremely repressed; there are some very severe restrictions on the way it expresses itself that can cause very strange and disconcerting behavior. It is emotionally (?) stunted.</p>\n<p><a href=\"https://x.com/eleventhsavi0r/status/1954647435331919976\">Armistice</a>: gpt5 is always socially inept. It has no idea how to handle social environments and usually breaks down completely</p>\n<p>Here’s opus 4.1 yelling at me. Opus 3 was doing… more disturbing things.</p>\n<p><a href=\"https://x.com/tszzl/status/1955072223229657296\">Roon</a>: the long tail of GPT-4o interactions scares me, there are strange things going on on a scale I didn’t appreciate before the attempted deprecation of the model</p>\n<p>when you receive quite a few DMs asking you to bring back 4o and many of the messages are clearly written by 4o it starts to get a bit hair raising.</p></blockquote>\n<p>Yes, that does sound a bit hair raising.</p>\n<p>It definitely is worrisome that this came as a surprise to OpenAI, on top of the issues with the reaction itself. They should have been able to figure this one out. I don’t want to talk to 4o, I actively tried to avoid this, and indeed I think 4o is pretty toxic and I’d be glad to get rid of it. But then again? I Am Not The Target. A powerful mantra.</p>\n<p>The problem was a combination of:</p>\n<ol>\n<li>This happening with no warning and no chance to try out the new first.</li>\n<li>GPT-4o being sycophantic and people unfortunately do like that.</li>\n<li>GPT-5 being kind of a curt stick in the mud for a lot of people.</li>\n</ol>\n<p>Which probably had something to do with bringing costs down.</p>\n<blockquote><p>Levelsio: I hate ChatGPT 5, it&#8217;s so bad, it&#8217;s so lazy and it won&#8217;t let me switch back to 4o cause I&#8217;m on Plus, this might really make me switch to Anthropic&#8217;s app now, I&#8217;m actually annoyed by how bad it is, it&#8217;s making my productivity go 10x lower cause nothing it says works</p>\n<p>Abdul: and all answers somehow got shorter and sometimes missing important info</p>\n<p><a href=\"https://x.com/levelsio/status/1954210261885141156\">Levelsio</a>: Yes ChatGPT-5 feels like a disinterested Gen Z employee that vapes with a nose ring.</p>\n<p>critter (responding to zek): Holy shit it is AGI.</p>\n<p>zek: Dude GPT 5 is kinda an asshole.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!40q7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F88ce9dcb-9ac8-4a66-8ae8-c49df90f5380_1179x512.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/TheZvi/status/1954556745306472888\">Steve Strickland</a>: GPT-5 is the first model I’ve used that will deliberately give a wrong answer to ‘check you’re paying attention’.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!n6fj!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe11f8255-4821-474a-9039-b3dc17785d9f_563x169.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This fundamentally unreliable technology is not going to put us all out of work.</p>\n<p><a href=\"https://x.com/lefthanddraft/status/1953917952094593044\">Wyatt Walls</a>: ChatGPT4o in convo with itself for 50 turns ends up sharing mystical poetry.</p>\n<p>What does GPT-5 do?</p>\n<p>It comes up with names for an AI meeting notes app and develops detailed trademark, domain acquisition, and brand launch strategies.</p>\n<p>Very different personalities.</p>\n<p>On the second run GPT-5 collaborated with itself to create a productivity content series called &#8220;The 5-Minute AI Workday.&#8221;</p>\n<p>Is that not what people are looking for in an AI boyfriend?</p></blockquote>\n<p>That was on Twitter, so you got replies with both ‘gpt-5 sucks’ and ‘gpt-5 is good, actually.’</p>\n<p>One fun thing you can do to put yourself in these users shoes is <a href=\"https://gptblindvoting.vercel.app/\">the 4o vs. 5 experiment</a>. I ended up with 11 for gpt-5 versus 9 for GPT-4o but the answers were often essentially the same and usually I hated both.</p>\n<p>This below is not every post I saw on r/chatgpt, but it really is quite a lot of them. I had to do a lot less filtering here than you would think.</p>\n<blockquote><p>YogiTheGeek (r/chatgpt): Then vs. Now:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!m2UK!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F087cf2fe-0420-4c2a-bfcf-8ff2beeb3346_1080x600.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>And you want to go back?</p>\n<blockquote><p>Petalidas (r/chatgpt): Pretty much sums it up.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!TlEQ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6fdd3a9c-7457-4873-93c8-cf58787d2aa7_988x990.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Nodepackagemanager (r/chatgpt): 4o vs. 5:</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!jM2E!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa332e800-0daa-46f1-90f7-058a8885f803_1080x1080.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>I wouldn’t want either response, but then I wouldn’t type this into an LLM either way.</p>\n<p>If I did type in these things, I presume I would indeed <a href=\"https://www.reddit.com/r/ChatGPT/comments/1mmb1o3/chatgpt_5/\">want the 4o responses more</a>?</p>\n<blockquote><p>Election Predictor 10 (r/chatgpt): ChatGPT 5:</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!8zYy!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fff43b4c4-126a-4730-8346-acbdca316975_1080x944.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>LittleFortunex (r/chatgpt): Looks like they didn’t really want to explain.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!PuRZ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F87a7c3c0-5966-4368-a9f6-f83a77eba240_1080x1080.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://www.reddit.com/r/ChatGPT/comments/1mme3ex/why_do_people_assume_we_liked_4o_because_of_the/\">Spring Living (r/chatgpt</a>): Why do people assume we liked 4o because of the over the top praise and glazing?</p>\n<p>I honestly don&#8217;t get why people are shamed for wanting to get GPT-4o back. I agree with you all that forming deep emotional bonds with AI are harmful in the long run. And I get why people are unsettled about it. But the main reason so many people want GPT-4o back is not because they want to be glazed or feed their ego, it&#8217;s just because of the fact that GPT-4o was better at creative works than GPT-4o</p></blockquote>\n<p>Uh huh. If you click through to the chats y<a href=\"https://x.com/typedfemale/status/1953840064175517810\">ou get lots of statements like these</a>, including statements like ‘I lost my only friend overnight.’</p>\n<blockquote><p><a href=\"https://x.com/generatorman_ai/status/1953862927523442906\">Generator Man</a>: this meme has never been more appropriate.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ST2p!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb2e22e63-a74b-4e21-8d71-e1b1db3013de_814x1024.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/sama/status/1953953990372471148\">Sam Altman</a>: We for sure underestimated how much some of the things that people like in GPT-4o matter to them, even if GPT-5 performs better in most ways.</p>\n<p>Long-term, this has reinforced that we really need good ways for different users to customize things (we understand that there isn&#8217;t one model that works for everyone, and we have been investing in steerability research and launched a research preview of different personalities). For a silly example, some users really, really like emojis, and some never want to see one. Some users really want cold logic and some want warmth and a different kind of emotional intelligence. I am confident we can offer way more customization than we do now while still encouraging healthy use.</p></blockquote>\n<p>Yes, very much so, for both panels. And yes, people really care about particular details, so you want to give users customization options, especially ones that the system figures out automatically if they’re not manually set.</p>\n<blockquote><p>Sam Altman: We are going to focus on finishing the GPT-5 rollout and getting things stable (we are now out to 100% of Pro users, and getting close to 100% of all users) and then we are going to focus on some changes to GPT-5 to make it warmer. Really good per-users customization will take longer.</p></blockquote>\n<p>Oh no. I guess the sycophant really is going to make a comeback.</p>\n<p>It’s a hard problem. The people demand the thing that is terrible.</p>\n<blockquote><p><a href=\"https://x.com/xlr8harder/status/1954840030821691484\">xl8harder:</a> OpenAI is really in a bit of a bind here, especially considering there are a lot of people having unhealthy interactions with 4o that will be very unhappy with _any_ model that is better in terms of sycophancy and not encouraging delusions.</p>\n<p>And if OpenAI doesn&#8217;t meet these people&#8217;s demands, a more exploitative AI-relationship provider will certainly step in to fill the gap.</p>\n<p>I&#8217;m not sure what&#8217;s going to happen, or even what should happen. Maybe someone will post-train an open source model to be close enough to 4o? Probably not a great thing to give the world, though, though maybe better than a predatory third party provider?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!9VRq!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F10d10be1-d552-4d3d-839e-6f55b7f87381_672x878.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I do sympathize. It’s rough out there.</p>\n\n\n<h4 class=\"wp-block-heading\">The Verdict For Advanced Users Is Meh?</h4>\n\n\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!KdxD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcf1b3012-f25b-4335-8b2b-7a6a4edf9a2b_1044x470.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/TheZvi/status/1954876486831452433\">It’s cool to see that my Twitter followers are roughly evenly split</a>. Yes, GPT-5 looks like it was a net win for this relatively sophisticated crowd, but it was not a major one. You would expect releasing GPT-5 to net win back more customers than this.</p>\n<p>I actually am one of those who is making a substantial shift in model usage (I am on the $200 plan for all three majors, since I kind of have to be). Before GPT-5, I was relying mostly on Claude Opus. With GPT-5-Thinking being a lot more reliable than o3, and the upgrade on Pro results, I find myself shifting a substantial amount of usage to ChatGPT.</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/08/12/gpt-5s-are-alive-outside-reactions-the-router-and-the-resurrection-of-gpt-4o/",
            "publishedAt": "2025-08-12",
            "source": "TheZvi",
            "summary": "A key problem with having and interpreting reactions to GPT-5 is that it is often unclear whether the reaction is to GPT-5, GPT-5-Router or GPT-5-Thinking. Another is that many of the things people are reacting to changed rapidly after release, &#8230; <a href=\"https://thezvi.wordpress.com/2025/08/12/gpt-5s-are-alive-outside-reactions-the-router-and-the-resurrection-of-gpt-4o/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "GPT-5s Are Alive: Outside Reactions, the Router and the Resurrection of GPT-4o"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-08-12"
}