{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>I still remember how the car industry got all excited back in 2017 about how steering wheels would soon be obsolete. Every concept car then was a living room on wheels, <a href=\"https://www.youtube.com/watch?v=4TAoqHwRi9k\">seats facing inwards</a>. The self-driving revolution was imminent, they said. Well, it wasn't... but now it actually is!<br /><br /></div><div>Humans have a hard time with scenarios like this. If you promise them the moon in eight months, but don't end up delivering until eight years later, most will justifiably be skeptical that it's actually here — even in the face of gushing anecdotes and video evidence. That's the problem with delayed promises.</div><div><br />So when Jason told me Tesla's self-driving tech was finally ready and real, I was indeed skeptical. I tried FSD as late as last year, and I didn't enjoy it much. Impressive in many ways, but too jerky. Too many interventions. How much could it really have improved in nine months or so? A lot, it turns out.</div><div><br />We started the drive from Jason's house, and I watched him not once touch the pedals or steering wheel while we drove half an hour to the other end of town. Then repeated the feat on the way back. But that wasn't even the most impressive part. What really blew my mind was how dramatically better the fluidity of driving with FSD has become.<br /><br /></div><div>His new Model Y anticipated the red light with the manners of a drives-for-the-queen-level chauffeur. And the way it knew exactly how to slow down to prevent a jerky movement when taking an incline into an elevated parking lot? Sublime.</div><div><br />Elon, that son of a bitch, seems to have done it again! Proven everyone wrong. Proven me wrong. The self-driving dream has flipped from vaporware to credible near-term reality. All without LiDAR. AI really delivering on this one.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/self-driving-is-finally-happening-1d973fdd",
            "publishedAt": "2025-06-27",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>I still remember how the car industry got all excited back in 2017 about how steering wheels would soon be obsolete. Every concept car then was a living room on wheels, <a href=\"https://www.youtube.com/watch?v=4TAoqHwRi9k\">seats facing inwards</a>. The self-driving revolution was imminent, they said. Well, it wasn't... but now it actually is!<br /><br /></div><div>Humans have a hard time with scenarios like this. If you promise them the moon in eight months, but don't end up delivering until eight years later, most will justifiably be skeptical that it's actually here — even in the face of gushing anecdotes and video evidence. That's the problem with delayed promises.</div><div><br />So when Jason told me Tesla's self-driving tech was finally ready and real, I was indeed skeptical. I tried FSD as late as last year, and I didn't enjoy it much. Impressive in many ways, but too jerky. Too many interventions. How much could it really have improved in nine months or so? A lot, it turns out.</div><div><br />We started the drive from Jason's house, and I watched him not once touch the pedals or steering wheel while we drove half an hour to the other end of town. Then repeated the feat on",
            "title": "Self-driving is finally happening"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3875\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3875",
            "publishedAt": "2025-06-27",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3875\"> Read more </a> </p>",
            "title": "Hidden Open Thread 387.5"
        },
        {
            "content": [
                "<p>[<em>This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked</em>]</p><div><hr /></div><blockquote><p>&#8220;Just as we don&#8217;t accept students using AI to write their essays, we will not accept districts using AI to supplant the critical role of teachers.&#8221;</p></blockquote><p><em>&#8212; Arthur&#8239;Steinberg, American Federation of Teachers&#8209;PA, reacting to Alpha&#8217;s cyber&#8209;charter bid, January 2025</em>&#8239;</p><p>In January 2025, the charter school application of &#8220;<a href=\"https://www.unbound.school/\">Unbound Academy</a>&#8221;, a subsidiary of &#8220;<a href=\"https://2hourlearning.com/\">2 Hour Learning, Inc</a>&#8221;, lit up the education press: two hours of &#8220;AI&#8209;powered&#8221; academics, 2.6x learning velocity, and zero teachers. Sympathetic reporters repeated the slogans; union leaders reached for pitchforks; Reddit muttered &#8220;<a href=\"https://www.reddit.com/r/Austin/comments/17feoeu/a_school_with_no_teachers_alpha_private_school_in/\">another rich&#8209;kid scam</a>.&#8221; More sophisticated critics dismissed the pitch as &#8220;selective data from expensive private schools&#8221;.</p><p>But there is nowhere on the internet that provides a detailed, non-partisan, description of what the &#8220;2 hour learning&#8221; program actually is, let alone an objective third party analysis to back up its claims.</p><p>2-Hour Learning&#8217;s flagship school is the &#8220;Alpha School&#8221; in Austin Texas. The <a href=\"https://alpha.school/\">Alpha homepage</a> makes three claims:</p><ol><li><p>Love School</p></li><li><p>Learn 2X in two-hours per day</p></li><li><p>Learn Life Skills</p></li></ol><p>Only the second claim seems to be controversial, which may be exactly why that is the claim the Alpha PR team focuses on. That PR campaign makes three more sub-claims on what the two-hour, 2x learning really means:</p><ol><li><p>&#8220;Learn 2.6X faster.&#8221; (on average)</p></li><li><p>&#8220;Only two hours of academics per day.&#8221;</p></li><li><p>&#8220;Powered by &#8239;AI (not teachers).&#8221;</p></li></ol><p>If all of this makes your inner Bayesian flinch, you&#8217;re in good company. After twenty&#8209;odd years of watching shiny education fixes wobble and crash&#8212;KIPP, AltSchool, Summit Learning, One-laptop-per-child, No child left behind, MOOCs, Khan&#8209;for&#8209;Everything&#8212;you <em>should</em> be skeptical. Either Alpha is (a) another program for the affluent propped up by selection effects, or (b) a clever way to turn children into joyless speed&#8209;reading calculators. Those were, more or less, the two critical camps that emerged when Alpha&#8217;s parent company was approved to launch the tuition&#8209;free Arizona charter school this past January.</p><p>Unfortunately, the public evidence base on whether this is &#8220;real&#8221; is thin in both directions. Alpha&#8217;s own material is glossy and elliptical; mainstream coverage either repeats Alpha&#8217;s talking points, or attacks the premise that kids should even be <em>allowed</em> to learn faster than their peers. Until Raj Chetty installs himself in the hallway with a clipboard counting MAP percentiles it is hard to get real information on what exactly Alpha is doing, whether it is actually working beyond selection effects, and if there is anyway it could scale in a way that all the other education initiatives seemed to fail to do.</p><p>I first heard about Alpha in May 2024, and in the absence of randomized&#8209;controlled clarity, I did what any moderately obsessive parent with three elementary-aged kids and an itch for data would do: I moved the family across the country to Austin for a year and ran the experiment myself (unfortunately, despite trying my best we never managed to have identical twins, so I stopped short of running a proper control group. My wife was less disappointed than I was).</p><p>Since last autumn I&#8217;ve collected the sort of on&#8209;the&#8209;ground detail that doesn&#8217;t surface in press releases, or is available anywhere online: long chats with founders, curriculum leads, &#8220;guides&#8221; (not teachers), Brazilian Zoom coaches, sceptical parents, ecstatic parents, and the kids who live inside the Alpha dashboard &#8211; including my own. I hope this seven-part review can help share what the program actually is and that this review is more open minded than the critics, but is something that would never get past an Alpha public relations gatekeeper:</p><ol><li><p><strong>Starting Point: My Assumptions:</strong> how my views on elite private schools, tutoring and acceleration shaped the experiment (and this essay). <strong>WHAT</strong> is the existing education environment.</p></li><li><p><strong>A Short History of Alpha:</strong> from billionaire&#8209;funded microschool to charter aspirations. <strong>HOW</strong> Alpha came to be.</p></li><li><p><strong>How Alpha Works Part 1: Under the Hood:</strong> What does &#8220;2&#8209;hour learning&#8221; actually look like &#8211; what is the product and the science behind the product? <strong>HOW</strong> is Alpha getting kids to learn faster (Spoiler: &#8220;Two hour learning AI learning&#8221; closer to three hours, with a 5:1 teacher:student ratio and zero &#8220;generative AI&#8221;).</p></li><li><p><strong>How Alpha Works Part 2: Incentives &amp; Motivation:</strong> The secret sauce that doesn&#8217;t get mentioned in the PR copy, but I have discovered is at least as important as the fancy technology. The &#8220;<strong>other</strong> <strong>HOW</strong>&#8221; that no one is talking about.</p></li><li><p><strong>How Alpha is Measured: Effectiveness:</strong> The science says it <em>should</em> work, but how do you measure if it <em>is</em> working? How is the vaunted &#8220;2.6x&#8221; number calculated? <strong>WHAT</strong> data is Alpha using to make its claims and what does that data actually say?</p></li><li><p><strong>Why this time might be different: </strong>Most promising educational initiatives fail to have impact when expanded beyond their initial studies. Bryan Caplan might argue this is because most education education is just signaling anyway (&#8220;<a href=\"https://www.amazon.com/Case-against-Education-System-Waste/dp/0691174652\">The Case Against Education</a>&#8221;). He also argues that most parental interventions have no impact (&#8220;<a href=\"https://www.amazon.com/Selfish-Reasons-Have-More-Kids/dp/0465028616\">Selfish Reasons to Have More Kids</a>&#8221;) &#8211; He claims that how kids turn out is a combination of genetics and non-shared environment (randomness; nothing to do with parenting choices). How can we reconcile Caplan&#8217;s buttoned-up data with the idea that the &#8220;parenting choice&#8221; to educate your kids differently (like with Alpha) might result in different outcomes than would be expected from genetics alone? <strong>WHY</strong> could Alpha work?</p></li><li><p><strong>What Comes Next? The Scaling Problem:</strong> The Alpha founders have a vision of completely re-inventing the way the world serves education. But even if Alpha works, it is up against a history of education programs that were never able to scale. It is also going to face resistance for being &#8220;weird&#8221;. <strong>WHAT</strong> comes next?</p></li></ol><p>After twelve months I&#8217;m persuaded that Alpha is doing something remarkable&#8212;but that almost everyone, including Alpha&#8217;s own copywriting team, is describing it wrong:</p><ul><li><p><strong>It isn&#8217;t</strong> <strong>genuine two&#8209;hour learning</strong>: most kids start school at 8:30am, start working on the &#8220;two-hour platform&#8221; sometime between 9am-930am and are occupied with academics until noon-1230pm. They also blend in &#8220;surges&#8221; from time to time to squeeze in more hours on the platform.</p></li><li><p><strong>It isn&#8217;t</strong> <strong>AI</strong> in the way we have been thinking about it since the &#8220;<a href=\"https://arxiv.org/abs/1706.03762\">Attention is all you need</a>&#8221; paper. There is no &#8220;generative AI&#8221; powered by OpenAI, Gemini or Claude in the platform the kids use &#8211; it is closer to &#8220;turbocharged spreadsheet checklist with a spaced&#8209;repetition algorithm&#8221;</p></li><li><p><strong>It definitely isn&#8217;t</strong> <strong>teacher&#8209;free</strong>: Teachers have been rebranded &#8220;guides&#8221;, and while their workload is different than a traditional school, they are very important &#8211; and both the quantity and quality are much higher than traditional schools.</p></li><li><p><strong>The bundle matters</strong>: it&#8217;s not just the learning platform on its own. A big part of the product&#8217;s success is how the school has set up student incentives and the culture they have built to make everything work together</p></li></ul><p>&#8230;Yet the core claim survives: Since they started in October my children have been marching through and mastering material roughly <em>three times</em> faster than their age&#8209;matched peers (and their own speed prior to the program). I am NOT convinced that an Alpha-like program would work for every child, but I expect, for roughly 30-70% of children it could radically change how fast they learn, and dramatically change their lives and potential.</p><h2>Part One: Starting Assumptions</h2><p>In November 2020 we had a meeting with the head of our kids&#8217; original elite private school for the gifted. Her un-blinking eyes stared at us down through the Zoom screen as we listened compliantly, &#8220;My job is to keep everyone a little unhappy,&#8221;</p><p>I resisted the urge to mention <a href=\"https://en.wikipedia.org/wiki/Vilfredo_Pareto\">Vilfredo Pareto</a>.</p><p>We had just spent a month working with a team of kindergarten parents drafting potential constructive fixes to the COVID mess our kids were experiencing. We were not happy with the status quo. While much has been written about how private schools generally handled COVID better than their public counterparts, our school was an exception. While other private schools in the area had moved back to full time in-person learning on campus, ours continued to stream YouTube yoga for P.E. To their credit, other teachers tried harder, but none had experience trying to teach five-year olds over Zoom, and frankly the Youtube videos were sometimes the most engaging content the kids experienced in a given day.</p><p>We paid $35,000/year so instructors could curate videos for our kids &#8211; and that didn&#8217;t even include babysitting (I set up my &#8220;office&#8221; in the closet of her room so I could help when she needed it. You could imagine how productive I was that year).</p><p>A friend who had had kids graduate from the school recommended I speak with the head of the board. He in turn suggested we get a group of parents together to write a proposal and get it in front of the head of the school. That was exactly what we did. We summarized the academic data breakdowns on the risk of COVID to children including spreading rates at schools with different policies. We provided examples of what other schools around the world were doing both to mitigate risk of spread, but also to ensure more engaged learning from the kids &#8211; options for better ventilation, outdoor pods options &#8211; anything but more Zoom yoga for our five&#8209;year&#8209;olds. She did not respond the way the head of the board led us to expect she would. The response wasn&#8217;t gratitude or appreciation &#8211; or even interest; it was an invitation to grovel so our kindergartener could remain enrolled &#8211; &#8220;This meeting is not about your proposal or changing anything. This meeting is to decide if you are still a good fit for our school&#8221;. That was the moment the shine of the school&#8217;s claim to be a &#8220;inspiration for gifted children&#8221; had completely vanished. We were no longer enrolled either emotionally or analytically. We were enrolled because we didn&#8217;t see any better alternatives.</p><p>Voice clearly wasn&#8217;t an option; <a href=\"https://en.wikipedia.org/wiki/Exit,_Voice,_and_Loyalty\">Hirschman&#8217;s trilemma</a> left us with &#8220;loyalty or exit.&#8221; We chose loyalty, mostly because in the short term there was no way to switch to the few schools that were allowing in-person learning during COVID, and in the longer term, we just hoped the school would &#8220;fix itself&#8221; once things got back to normal, and switching would mean either moving or accepting much longer commutes. Hopefully COVID would be over soon.</p><h4>What selective private schools do well</h4><p>In order to get into this school our kids needed to score in the top 3% on an <a href=\"https://en.wikipedia.org/wiki/Wechsler_Intelligence_Scale_for_Children\">IQ-test</a> they took when they were four-years old. As parents we needed to complete a college-style application with a dozen short essays (&#8220;How will your family contribute to the DEI goals of our school?&#8221;). The most promising of the high-IQ preschoolers whose parents did not screw-up the essay questions were given an opportunity to experience an in-person day of group assessments. Roughly half of those kids were offered admittance.</p><p>Now, after four years with three kids at this ultra-selective school, I can name exactly four genuine upgrades over our neighborhood public school:</p><ul><li><p><strong>Tiny classes</strong>&#8239;&#8211; teacher&#8209;to&#8209;student ratio hovered around&#8239;10&#8239;:&#8239;1 versus 25:1 or worse at the public school</p></li><li><p><strong>Exceptional peers</strong>&#8239;&#8211; classroom disruption was rare, they were surrounded by incredibly bright and motivated classmates &#8211; kids enthralled by learning rather than make-up and crop tops (yes, even in elementary schools)</p></li><li><p><strong>Deep pockets</strong>&#8239;&#8211; music rooms, tech labs, theatre programs &#8211; even ski trips</p></li><li><p><strong>No bottom&#8209;quartile teachers</strong>&#8239;&#8211; there were weak teachers, but nothing like the worst duds you hear about, or that I had experienced as a child. No one was &#8220;phoning it in&#8221;.</p></li></ul><p>But&#8230; for many other characteristics I did not see any difference from the free, local, public schools:</p><ul><li><p><strong>Median teacher skill </strong>&#8776; public median. Our friends in the public schools had lots of great teachers.</p></li><li><p><strong>Best teacher skill </strong>&#8776; public best. Some of the best teachers at our school left to teach in the public schools</p></li><li><p>Same state curriculum, same worksheets, <strong>same pace.</strong></p></li></ul><p>The school philosophy was &#8220;no acceleration&#8212;just go deep.&#8221; We knew this was the philosophy going in. The pitch was that instead of accelerating through the state curriculum the teachers would take their time with the kids and allow them to fully explore and master the content of each grade. When we asked for examples of what that meant in practice we were told things like: &#8220;Instead of reading more advanced vocabulary, the students will learn to read out loud and use emotion and character impressions. They will learn how to vary the timing of their reading like where and when to pause to create emotion in the listener&#8221;. That sounded reasonable! It sounded like more learning, but just <em>different</em> learning than what the state had mandated.</p><p>In practice that was not what happened.</p><p>In practice &#8220;deep&#8221; just meant &#8220;un&#8209;measured.&#8221;</p><h4>Smart kids + small classes &#8800; accountability.</h4><p>The kids had time to do music, lego building, theatre and Friday ski trips because they were all really bright. They didn&#8217;t need 6+ hours a day to learn the limited math required by the state, and since the school did not feel the need to advance faster than the state, there was no pressure to push learning at all &#8211; on anything really.</p><p>There was no overall school curriculum. Every teacher did their own thing. While one first grade class had weekly spelling bees, the teacher in the other classroom did not believe in learning spelling at all. But it didn&#8217;t matter. The metrics they measured the kids on in both classes advanced &#8220;enough&#8221; that no one was concerned.</p><p>Most time wasn&#8217;t spent on math or language anyway. Beyond the brochure activities like skiing and theater and the four hours of foreign language per week they split between Spanish and Mandarin (which was really a great opportunity for the kids who already spoke Spanish and Mandarin to have their egos flattered. I did not see any <em>learning</em> in either language class. I don&#8217;t see how you can teach a language a couple of hours a week to a group of 18 kids with skill levels from zero to fluency and expect to have any impact), a lot of time was spent on DEI.</p><p>DEI was pitched as helping kids handle the emotions that often come from being sensitive gifted children (they called it &#8220;Synapse&#8221;). In practice my oldest daughter got four years of learning about the basic ideas of Martin Luther King Junior and Rosa Parks, a rough understanding that some people are non-binary, and a great deal of anxiety every time I left the water running while I was brushing my teeth.</p><h4>The talent drain</h4><p>In Spring &#8239;2024 the &#8220;intermediate-school&#8221; head resigned, as did the 40+ year veteran science teacher we had been looking forward to our daughter having, the beloved tech teacher who had built a her own proprietary &#8220;learn to type&#8221; software, plus half the lower&#8209;school faculty. Our oldest was going to be entering fourth grade; her incoming roster read like a rebuilding year for a professional sports team. It was possible we could get her into a middle school that would feed into a top tier high school, but those did not start until 5th grade. Our best option looked like &#8220;suck it up and accept whatever we had for at least a year&#8221;.</p><p>One option was to do something radical. We considered taking a GAP year and traveling the world with an organization called &#8220;<a href=\"https://boundless.life/\">Boundless</a>&#8221; but decided the timing wasn&#8217;t right. Earlier in the year we had started exploring moving to the charter city of <a href=\"https://www.prospera.co/en\">Prospera</a>. There is a Montessori school there that seemed like it might be alright. And we could surround the kids with an interesting group of people (and live on the beach!). But by the spring we had ruled it out. There did not seem to be many families as part of the community and we were not comfortable with the risk profile based on what was happening with the conflict between Honduras and their charter cities.</p><p>Then I stumbled across Alpha: Two&#8209;hour mornings, life&#8209;skills afternoons, claims of 2x learning. Marketing copy is cheap; still, the promise was different enough to warrant due diligence. The initial plan was to fly some of the kids to Austin for an Alpha summer camp for a week in June &#8211; just to try it out. But once we started exploring more my wife asked me: &#8220;Could we actually move to Austin and try it for a year? Based on what is happening at the kids' school, this might be the year to try it.&#8221;</p><p>So over eight weeks we flew to Austin five times &#8211; conversations with admissions and school heads, real estate searches, kids doing shadow&#8209;days. Every parent we spoke to was very impressed with the school. Their kids really were advancing at 2x+ speed &#8211; and no one believed it was just a &#8220;selection effect&#8221;. And every guide I spoke to was extremely impressive themselves. They reminded me of the staff you run into when visiting Disney World. They all seemed &#8220;full faced&#8221; and fully-engaged. When I asked the head of admissions how they found such good staff he told me their compensation was fully transparent. &#8220;Associate Guides&#8221; were paid $60,000/year (vs the $40,000 average for Austin teachers), &#8220;Full Guides&#8221; made $100,000 and the five &#8220;Head Guides&#8221; in the school each made $150,000. They were able to both poach the best teachers from other schools, but also bring exceptional people into teaching that would not have considered it otherwise. It also let them have very high expectations for teachers once they were hired.</p><p>We pulled the trigger in July.</p><p>New house. Admissions letter signed. Moving truck (plus car-mover) scheduled for October.</p><p>Worst case, it would be a one&#8209;year sabbatical from stagnation.</p><h4>The hypothesis I carried south</h4><p>Elite private school attendance buys you smaller classes, brighter kids, and fancier field trips &#8211; not academic acceleration. If Alpha was real, we&#8217;d see that differential, measurable impact by Christmas &#8211; that was when we would need to decide if we would cut bait and re-apply to schools back home (and sign the kids up for more IQ-tests. The school would not accept old ones). That prior&#8212;<em>show me velocity, not polish</em>&#8212;is the lens through which the rest of this review should be read.</p><h2>Part Two: A History of Alpha</h2><p><em>Note: This is my best attempt at piecing together the history of the school based on conversations with co&#8209;founder MacKenzie&#8239;Price, high school head Chris&#8239;Locke, Alpha staff, and Alpha parents; All dates are estimates and I am SURE I have gotten some details wrong. I will come back after the fact in the comments and make corrections as I hear from the people involved with corrections.</em></p><h4>2013&#8239;&#8211;&#8239;2017&#8194;|&#8194;Garage&#8209;School to &#8220;Alpha&#8221;</h4><p><a href=\"https://www.linkedin.com/in/mackenzielprice/\">MacKenzie&#8239;Price</a>, then a mortgage broker in Austin, wasn&#8217;t impressed by the city&#8217;s gifted programs. She invited a small number of neighbourhood kids (including her two) into a makeshift microschool that ran two intense, teacher&#8209;led academic &#8220;sprints&#8221; each morning, then &#8220;life&#8209;skills&#8221; projects after lunch. <a href=\"https://en.wikipedia.org/wiki/Joe_Liemandt\">Joe&#8239;Liemandt</a>&#8239;&#8212; Founder of Trinity Technology, &#8239;ESW Capital billionaire and family friend&#8239;(MacKenzie&#8217;s husband worked for him) &#8212;&#8239;kept his own children in conventional private school until he saw the qualitative improvement in the life skills of MacKenzie&#8217;s kids. He decided he wanted his kids to join MacKenzie&#8217;s but he wanted to take the project to the next level. Sometime around 2014-2017 he joined MacKenzie as a co-founder and started writing checks. Alpha recruited more students and guides and the operation jumped from location-to-location looking for a larger permanent home.</p><h4>2017&#8239;&#8211;&#8239;2020&#8194;|&#8194;K-8 Expansion and 2-hour focus</h4><p>Alpha grew to roughly 90&#8239;students from K&#8209;8 and stabilized. Morning &#8220;core blocks&#8221; were still teacher&#8209;driven (20&#8209;minute bursts, 5&#8209;minute breaks, rinse, repeat), but focused on students engaged in exercises with rapid feedback (not lectures). Afternoon workshops covered &#8220;life skills&#8221; like how to give and receive feedback or public speaking. I have not seen academic data from this time period, but when I spoke to Chris Locke, head of Alpha&#8217;s high school (which launched around 2020), he told me the kids coming into his 9th grade program were &#8220;fine,&#8221; academically &#8211; it was their life skills, confidence, and ability to engage with adults and their peers were exceptional. At this stage no AI, no dashboard, no 2x learning, no portal&#8239;&#8212;&#8239;just better ratios and focused pacing and the result was well balanced kids who were enjoying their education experience (even if they were unexceptional academically).</p><h4>2020&#8239;&#8211;&#8239;2022&#8194;|&#8194;Platform Era Begins</h4><p>Somewhere along the way Liemandt hired a small engineering team to stitch together edtech learning tools. Many schools use tools like iXL, Beast Academy and Amira. Those tools fit in well with the 2-hour structured approach Alpha was using. The &#8220;platform&#8221; Liemandt&#8217;s team built was meant as a tool to free up guide time so that students could be more self-directed. The dev team stitched together the preferred off&#8209;the&#8209;shelf apps behind a single login, and built out tracking and dashboards so guides (and students) could easily see how they were progressing. This also gave the curriculum team (there was a curriculum team now) data to understand where students were spending their time, what tools were working, and which weren&#8217;t as effective.</p><p>The Alpha Portal was born.</p><p>Not only did it increase efficiency, it provided data to iterate with.</p><p>Chris&#8239;Locke saw the curve change incrementally: each new cohort of ninth&#8209;graders under the new tech-enabled learning platform came in a little stronger academically. The &#8220;life skills&#8221; were now being matched by the &#8220;academic skills&#8221;.</p><h4>2022&#8194;|&#8194;Expansion and Iteration</h4><p>By having access to Alpha kids post-graduation in the high school, Locke could send feedback back to the elementary school.The kids coming out of the new program were now killing it academically on Math, Language, and Science, but they were still weak on things like History and Geography. He fed that type of information back to the curriculum designers, who iterated and improved the program. Soon, in addition to the core platform that directed students to third-party tools, the tech team was building proprietary &#8220;Alpha&#8221; tools themselves. The flagship of the in-house tools was &#8220;AlphaReads&#8221;. AlphaReads requires students to read progressively more complicated passages, followed by answering reading comprehension questions. In addition to helping the kids improve reading skills, Alpha uses it to push types of content. Instead of classes in history, geography, economics and political science, some of the reading passages will cover that material (in addition to learning how to read and understand Shakespeare and Proust).</p><p>The success of the 2-hour learning platform was giving the Alpha founders confidence. Liemandt in particular wanted to see if the program had legs beyond the elite group of students being educated in Austin. Alpha&#8217;s first external test in August 2022 in Brownsville,&#8239;TX &#8211; a small community on the Mexico border with less than half the per capita income of Austin. SpaceX had recently launched Starbase in Brownsville in 2014 and the employees there were not happy with the existing school options. Someone at SpaceX approached Alpha and asked if they could launch a new campus for their employees. It is unclear if any money changed hands, but when Alpha launched their Brownsville campus (available to SpaceX employees and any other locals who are interested) tuition was only $10,000 (vs $40,000 at the main Austin campus); incoming students trailed national academic standards by over a year. But after nine months on the Alpha program the first cohort of students had caught up and surpassed the national average, and they kept accelerating, achieving an average learning velocity of ~2&#215; the national average (see section four for what that means). Brownsville was Alpha&#8217;s attempt to show that their model wasn&#8217;t just rich&#8209;kid selection effects.</p><h4>Spring&#8239;2024&#8194;|&#8194;Field Pilots &amp; Ukraine Trip</h4><p>Alpha tuition is high for the Austin area ($40,000 vs average private school ~$10,000-$15,000), but unlike most private schools tuition is all-inclusive. There are no extra fees for computers or field trips. There are no silent auctions or appeals for donations. This &#8220;no extra fees&#8221; allows the school to do some pretty ridiculous things.</p><p>In the first half of 2024 Alpha sent a group of students to Poland to help launch a 2-hour learning pilot among Ukrainian refugees. Students did not pay to go on the trip. But students also did not have a &#8220;right&#8221; to go on the trip. They had to earn it. In addition to being on top of academic and non-academic expectations, students who wanted to participate had to learn basic Ukrainian so they could interact with the students in Poland they were meant to be helping. By not linking the opportunity to payment, the school could instead link it to behavior and achievement.</p><p>This year a group of kids who learned to sail during the school year are going on a sailing trip through the Caribbean &#8211; for no additional fees to the parents.</p><p>I also heard that around this time Alpha began testing the 2-hour learning platform at a facility for juvenile delinquents in Florida. I heard that from one individual who was not directly involved and I have not found any written documentation on it, so unclear if it worked, it was a one off, or if it even happened. But it fits into the pattern of Alpha at this stage: &#8220;We know this program works for a specific type of kid. Let&#8217;s find out how broadly it is applicable. Can it work for everyone? Is it the solution for learning and education for the world?&#8221;</p><h4>Fall&#8239;2024&#8194;|&#8194;&#8220;Pick&#8209;Your&#8209;Afternoon&#8221; Specialist Schools</h4><p>MacKenzie told me that there was consensus among the current parents of Alpha that the 2-hour learning program was exceptional and was making a huge difference with their kids. Their kids were all learning at breathtaking speed in a very condensed period of time. But there was NOT consensus about what the kids should be doing in the other 22-hours of the day. Some parents wanted to utilize the platform&#8217;s capabilities to go even faster. Some wanted their kids to just chill out and enjoy the rest of their day &#8211; let kids be kids. Others wanted their kids to use the freed up time to do sports, or study music.</p><p>It was clear to her that &#8220;learn more faster in a short period of time&#8221; was a universal desire. But beyond that it was unclear what the &#8220;right&#8221; solution for the rest of her program was. You can make the morning ultra-personalized, but if the goal of the afternoon is socialization that you are missing in the morning, you need to have some sort of alignment on how to spend that afternoon.</p><p>That challenge led to Alpha&#8217;s 2024 expansion into specialty schools.</p><p>Three micro&#8209;campuses opened August&#8239;2024:</p><ul><li><p><strong><a href=\"https://gt.school/\">GT&#8239;School</a> (Georgetown, TX)</strong>&#8194;&#8212;&#8194;Alpha&#8217;s &#8220;Gifted and Talented&#8221; School. Higher admissions bar; higher academic expectations; Afternoon programming focused on excelling in &#8220;academic competitions&#8221; like chess, go, debate, public speaking, robotics, programming and Quiz Bowl.</p></li><li><p><strong><a href=\"https://sportsacademy.school/\">Lake&#8239;Travis Sports Academy</a></strong>&#8194;&#8212;&#8194;Alpha&#8217;s &#8220;Sports school&#8221;. Kids who get through their academics in the morning spend the afternoon on sport skills, strength &amp; conditioning, tactics, strategy, and sports psychology.</p></li><li><p><strong><a href=\"https://nextgenacademy.school/\">NextGen&#8239;Academy </a>(Austin)</strong>&#8194;&#8212;Perhaps the most radical experiment. Afternoons are spent training in competitive esports &amp; game design.</p></li></ul><p>Each new campus launched with &lt;10 students, two or more local guides, and the same two&#8209;hour core.</p><p>Simultaneously Alpha opened a Miami elementary campus, promoted the idea that cities could launch &#8220;micro schools&#8221; if they had enough local demand (unless you count Miami, none actually launched) and piloted a beta-test of a Home&#8209;School version<strong> </strong>of the platform. Early homeschool data showed that kids were using it for ~2 hours/day as planned, but only seeing a 1x learning growth &#8212; still a fine result for only doing 2-hours of academics per day, but a long way from what Alpha was delivering on their own campuses, so the program has stayed in beta.</p><h4>Jan&#8239;2025&#8194;|&#8194;Charter &amp; Licence Play</h4><p>Alpha now had a parent company, &#8220;<a href=\"https://2hourlearning.com/\">2-hour Learning</a>&#8221;, which sat above all of the schools, the home school product, and the platform itself (that they now offer to license out to third parties). The parent company filed under &#8220;Unbound Academy&#8221; to launch charter schools in Arizona and Pennsylvania. The Pennsylvania school was rejected, but the Arizona school will launch in fall 2025. There are more applications pending in at least Utah, Arkansa, North Carolina, South Carolina (and likely more).</p><p>While the PR spin around these schools is &#8220;AI-driven, no teachers&#8221; in practice they use 20:1 <s>teacher</s> guide:student ratios (vs the 5:1 ratio at the Alpha private schools)</p><p>Generally states subsidize charter schools in the neighborhood of $10,000 per student &#8211; which is a lot lower than what Alpha charges. They should be able to make those economics work by using fewer, less expensive teachers, not having an expensive campus (or no campus at all for the online schools), skimming on the extras (no trips to Poland), avoiding teaching the youngest kids (Arizona is 4th-8th grade), and being willing to accept smaller or even negligible margin on their learning platform.</p><p>The goal of these schools does not seem to be making money or profit &#8211; at least not right away. The goal seems to be rapidly expanding the program to have more influence, and to see if they can make it work with &#8220;non-selected kids at a low price point&#8221;.</p><h3>Fall 2025 and Beyond |&#8194;The Future</h3><p>The Alpha website claims the following <a href=\"https://alpha.school/locations/\">locations</a> are launching in Fall 2025:</p><ul><li><p>Houston, TX</p></li><li><p>Fort Worth, TX</p></li><li><p>Santa Barbara, CA</p></li><li><p>Phoenix, AR</p></li><li><p>Orlando, FL</p></li><li><p>Tampa, FL</p></li><li><p>Palm Beach, FL</p></li><li><p>New York City, NY</p></li></ul><p>I also know that there is a physical location selected for Fort Lauderdale. While it is possible they launch eight (or nine) new campuses in the fall (they did pull off four last year), I expect that is more about &#8220;putting it out there&#8221; and then launching the campuses that get enough commitment. It is hard to launch a new school. Parents are risk averse, and many who are willing to take risks may not do it if they don&#8217;t think the school is even likely to happen. Better to say you are going to launch in Fort Worth, and then see what demand looks like. You can pull the trigger or pull the shoot depending on which markets are getting natural traction.</p><p>In the Fall of 2024 in addition to the four campuses they did launch, they said they were going to go live with a campus in Denver, ten micro schools and the (non-beta) home school program &#8211; none of which happened. My guess is that four of the eight schools they announced will have guides working and kids attending in September 2025.</p><p>Now: What do these schools actually do? What does a day at Alpha really look like? How are they getting the 2x+ results they are claiming?</p><h2>Part Three: How Alpha Works (Part 1)</h2><p>Like most schools, Alpha is a bundle of products. In Alpha&#8217;s case I would break them out as:</p><ul><li><p>The 2-hour learning platform and tools</p></li><li><p>The afternoon program (workshops and check chart)</p></li><li><p>The incentive system</p></li><li><p>The school itself (guides, building, day care)</p></li></ul><p>Almost all the discourse about Alpha is about the 2-hour learning program, and that is what I want to dive into most in this section, but I will also touch on the afternoon program (which I think is important). The incentive system &#8211; a very important, undiscussed part of the secret sauce &#8211; will get its own section in Part Four.</p><h4>The Two-Hour Platform</h4><p>Every Alpha &#8220;flavor&#8221; &#8211; the core school, the home school, the Gifted School, the sports school &#8211; uses the same 2-hour learning platform.</p><p>We drop our kids off around 8:30am. After a morning kick-off (some sort of group activity) they put on (optional) headphones, find a place to work (the school is a bit like a start-up office), and log in to their personal 2-hour learning platform. The platform informs each student what their specific required lessons are for the day (usually between 8-12 lessons). Those &#8220;required&#8221; lessons are called &#8220;minimums&#8221; and the kids talk about it that way:</p><ul><li><p>&#8220;Did you hit your minimums?&#8221;</p></li><li><p>&#8220;I missed my minimums by one lesson today but it wasn&#8217;t my fault&#8221;</p></li><li><p>&#8220;We got to skip our minimums today to do MAP testing&#8221;</p></li><li><p>&#8220;Guess what dad! I did my minimums plus two today!&#8221; (i.e., two additional lessons beyond her &#8220;minimums&#8221;)</p></li></ul><p>While hitting the &#8220;minimums&#8221; are required, the students can choose the order they work through those requirements. Depending on the kid subjects covered in the platform could include:</p><ul><li><p>Math (learning new math; mostly on iXL)</p></li><li><p>&#8220;Fast Math&#8221; (doing simple math they already know how to do faster and more accurately; mostly on &#8220;Rocket Math&#8221; or &#8220;FastMath Pro&#8221;)</p></li><li><p>Language (Spelling and grammar; mostly on iXL)</p></li><li><p>Foreign Language (mostly on duolingo)</p></li><li><p>Science (mostly on iXL)</p></li><li><p>Social Studies (mostly on iXL)</p></li><li><p>Reading (Older kids are on &#8220;Alpha Reads&#8221;; younger kids use Amira and Lalio)</p></li><li><p>Writing (Mostly on AlphaWrite)</p></li></ul><p>If a student gets all their lessons done in the allotted time they can choose which subjects to work ahead on &#8211; they can try and balance subjects, work on the ones they are struggling on the most, or just push ahead in the ones they are already excelling in (They do get coaching on this from guides on a regular basis, but the kids make their own choices).</p><p>A typical lesson involves watching a curated YouTube video followed by specifically selected problem sets within the third party tools. After every question the student is given feedback &#8211; either &#8220;Great Job!&#8221; (with the option to click and learn more) or &#8220;Incorrect&#8221; followed by explanations on why the question was wrong and a mini-remedial lesson to fill in the knowledge gap.</p><p>If a pattern of stumbles appears the system will automatically task the student to book a &#8220;coaching call&#8221; with a remote teacher (most of these teachers seem to be based in Brazil). Kids can also choose to self-book calls with the &#8220;coaches&#8221; at any time (my daughter told me today that she was having trouble with a math problem set and she booked a coaching call. I asked her how long it took between when she booked it and when she had the call and she said it depends on how busy the coaches are. Today she booked it at 11:10 and had the call at 11:15, but she said once it took her two days to get the meeting. I asked her how often she has a call and she said less than once a day, but more than once a week). The kids also automatically do a coaching call before they can schedule a &#8220;mastery test&#8221; which covers all the grade level material in a subject (like a final exam).</p><p>At the end of the day the students get a report on their achievements that day, as well as overall feedback (this is potentially where the &#8220;AI&#8221; comes in. The computers track both clicks and eye tracking. It can tell both what the student clicked, but also if they were paying attention or distracted, or how much effort they put into reading the feedback when they got questions wrong).</p><p>All of this is shared with the parents on our own dashboard. Here is what that dashboard looks like for a couple of recent classes for one of my kids:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!1AbF!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f81f4e2-0b80-40a3-926e-a486ac11d666_473x356.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"356\" src=\"https://substackcdn.com/image/fetch/$s_!1AbF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f81f4e2-0b80-40a3-926e-a486ac11d666_473x356.png\" width=\"473\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>In this example, on this particular day, my daughter spent 13-minutes on Language Arts during her 2-hour learning time. She got 100% of the problems correct (when you scroll over the blue circle it reads 16/16) and completed &#8220;one mastery&#8221; (meaning she got credit for the lesson because she got more than 80% correct on the mastery test). She also spent 19-minutes on Math (not during the standard 2-hour learning block, hence &#8220;non-2h session&#8221;), getting 60% of the questions correct (6/10), so she did not earn a math &#8220;mastery&#8221; that day. For both subjects there is a &#8220;Coaching button&#8221; (not every subject on every day has coaching).</p><p>Here is what the Language Arts feedback looks like (where she killed it that day):</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!2bzu!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd91f1a06-93ad-4b36-b903-c09c91478df7_747x293.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"293\" src=\"https://substackcdn.com/image/fetch/$s_!2bzu!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd91f1a06-93ad-4b36-b903-c09c91478df7_747x293.png\" width=\"747\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Clicking on the example &#8220;here&#8221; hyperlinks takes you to a live stream of the moment the system believes backs up the feedback it provided. You can see her face on video and watch what she is doing on the screen.</p><p>Here is the feedback for math that day (that did not go as well):</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!faJ9!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F13b6b02c-db96-49c1-80c5-4dec89fab5d9_744x249.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"249\" src=\"https://substackcdn.com/image/fetch/$s_!faJ9!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F13b6b02c-db96-49c1-80c5-4dec89fab5d9_744x249.png\" width=\"744\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>The constructive feedback to save eye strain:</p><ul><li><p>Not spending enough time on the subject</p></li><li><p>Ignoring explanations after mistakes</p></li><li><p>Rushing questions</p></li></ul><p>No wonder she only got 60% correct.</p><p>When they actually listen, the immediate impact is powerful. Normally in school you do your work, submit it, have it graded, and get it back some time in the future &#8211; if you are lucky after you finish a full problem set, if unlucky a week or two later. With Alpha 100% of the time you get feedback immediately after you answer each question. If you are wrong you both get to find out right away and find out what you did wrong so you won&#8217;t repeat the mistake on the next question.</p><p>In addition to the daily report, parents also have access to a weekly summary and an overall progress report. The latter is the most interesting. It tells you how many lessons your kid has completed at each grade level difficulty, how many more lessons they need to master to move on to the next grade, and how long that is likely to take at the rate they are progressing. Here is my 2nd grader&#8217;s recent report:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!65gC!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffadc0f01-7400-4a09-8da7-697447b89191_1188x406.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"406\" src=\"https://substackcdn.com/image/fetch/$s_!65gC!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffadc0f01-7400-4a09-8da7-697447b89191_1188x406.png\" width=\"1188\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>She has &#8220;mastered&#8221; 81/113 lessons for 3rd grade language, 141/157 3rd grade math, and 62/80 3rd grade science. If she stays on track doing 25-minutes in each subject per day for five days per week, she will complete 3rd grade in Language in three weeks, math in one week and science in four weeks. And if she decides to push harder and do an additional 35 minutes in a subject every day she will be finished 3rd grade within the week.</p><p>When a student finishes all the lessons they need for a grade level subject they take a grade-level mastery test that covers all the material they were supposed to learn. If they get a high enough score on that test they move on to the next grade level (all of the questions they missed will still come back for later review though so they don&#8217;t move on with gaps). If they do not pass that test then they keep working on more lessons on the grade they are currently on with a focus on closing the gaps they need to pass next time.</p><p>During these morning sessions every 20-30 minutes the kids get what is called a &#8220;Q-break&#8221; where they leave their computers for 5-10 minutes and go run around outside. The culture is one of &#8220;focus hard for short bursts, then relax, then go back and focus again&#8221;</p><p>Most schools are set up in traditional ways, and then adjust the best they can within that structure to serve the needs of their unique students the best they can. What is impressive about the Alpha program is that is seems to be built from the ground-up around three of the most powerful learning principles:</p><ol><li><p><strong>1:1 learning:</strong> It&#8217;s not really 1:1, but in practice every kids is working on stuff at the edge of their ability, rather than the median of a group</p></li><li><p><strong>Spaced Repetition: </strong>The system brings back topics on a regular basis &#8220;just before&#8221; the student forgets, so it is more likely to encode in long term memory</p></li><li><p><strong>Mastery:</strong> In most education settings school students learn some percentage of the material and then move on. This can work for a while, but eventually students who missed something will struggle because they don&#8217;t have the tools to learn the next thing on the ladder. This is particularly noticeable in mathematics, but it can be a problem anywhere. With &#8220;mastery learning&#8221; the kids are not allowed to move on without mastering the subject. If there is something they miss, the system will bring it back again and again until they have mastered it. Liemandt in particular thinks this is a very big deal, and believes it is a significant driver of Alpha&#8217;s success (and the reason many kids are failing in traditional schools)</p></li></ol><p>The morning &#8220;2-hour learning&#8221; session wraps up around noon. For those tracking at home that is &#8220;drop off at 830am, finish 2-hour learning 3.5 hours later&#8221;. They really are spending roughly 2 hours learning, it just takes half the day to get that 2-hours of focus in.</p><p>Then the afternoon begins.</p><h4>Alpha Afternoons</h4><p>Afternoons are where the Alpha family of schools diverge. The Sports Academy is doing very different things in the afternoon than the GT school. But all the schools use a similar structure of breaking the afternoon into two types of work:</p><ol><li><p>Workshops</p></li><li><p>Check Chart Time</p></li></ol><p>Workshops were the &#8220;life skills&#8221; program at the original Alpha School. Some of the workshops at the core school have included:</p><ul><li><p><strong>Thanksgiving Dinner: </strong>The Kinders and 1st graders learned to make a dinner for their parents</p></li><li><p><strong>Time Traveler Tea: </strong>The K-1&#8217;s learned about customs at different countries in different time periods and then had to pass a test where they had to &#8220;infiltrate&#8221; that culture without making any mistakes</p></li><li><p><strong>Ice Skating: </strong>The kids all went ice skating. The idea was to teach resilience since none of the kids in Texas knew how to skate</p></li><li><p><strong>Airbnb: </strong>Maybe the most impressive one. The 5th graders learned about the economics of property management - from property sourcing, mortgages, interior design, taxes, marketing, photo shoots, etc. And then they actually bought and managed a small property as a class (yes, the 5th grade class manages an actual property with a P&amp;L)</p></li></ul><p>Those are a select list of the coolest ones (in my opinion). Some friends who go to the main campus complained to us that the workshops in general are &#8220;not academic enough&#8221;. They say most are either &#8220;sports&#8221; (they mentioned sailing, golf, and running), or &#8220;entrepreneurship&#8221;. When they pushed the administration on potentially doing more academic-minded workshops (writing, history seminars, economics, psychology, chemistry) they were told, &#8220;you sound like GT parents. Have you considered that school?&#8221;</p><p>Our kids go to the GT School &#8211; the gifted and talented version of Alpha. All of our kids&#8217; workshops are built around &#8220;competitive academics&#8221;. So far this year their workshops have included:</p><p><strong>Younger Kids (K-2nd grade):</strong></p><ul><li><p>&#8220;Teamwork&#8221; (made competitive by having the kids compete in adult escape rooms)</p></li><li><p>Go (the game)</p></li><li><p>Competitive Debate</p></li><li><p>Piano (they all learned a level-one conservatory piece. I was impressed!)</p></li><li><p>Chemistry (The stuff I learned in 10th grade high school combined with using lego-type materials to actually build each element)</p></li><li><p>&#8220;Rock Band&#8221; (they are each learning an instrument. They are also using AI tools to write their own songs)</p></li><li><p>Magnets (building tracks and racing electric cars)</p></li></ul><p><strong>Older Kids (3rd-8th grade):</strong></p><ul><li><p>Chess</p></li><li><p>Competitive Speech</p></li><li><p>Competitive Debate</p></li><li><p>Competitive Robotics</p></li><li><p>Programming (not competitive so far, but potentially building that way)</p></li><li><p>Quiz Bowl</p></li></ul><p>All of the GT Workshops are focused on a measurable, legible output. They don&#8217;t learn &#8220;public speaking&#8221;, they learn how to craft and deliver a speech and then submit the performance to the Moth to be judged by external parties. The school&#8217;s &#8220;<a href=\"https://gt.school/\">100% Money Back guarantee</a>&#8221; is that every student who attends will be in the top 1% academically and win at least one national academic competition (for kids who start in kindergarten they guarantee 1350+ SAT and 5s on APs by 8th grade). This past year four kids placed in the top-8 in a global debate with more than 1000 entries, and two kids are competing at national championships in chess and an academic bee respectively, but not national champions yet.</p><p>The second part of the afternoon is roughly 45-minutes per day to work on individual &#8220;Check Charts&#8221;<strong>. </strong>Check Charts are an assigned series of tasks each student needs to complete before they can move to the next &#8220;level&#8221;. Levels are mostly broken into two-year cohorts of kids. Roughly:</p><ul><li><p>Learning Lab = Kindergarten and 1st grade</p></li><li><p>Linc = 2nd grade</p></li><li><p>L1 = 3/4th grade</p></li><li><p>L2 = 5/6th grade</p></li><li><p>L3 = 7/8th grade</p></li></ul><p>Kids advance academically at their own speed and could, in theory, finish all of elementary school content long before they get to 8th grade (more on that in section four), but they don&#8217;t advance from level-to-level based on academics (or at least not academics alone). Instead the kids are required to &#8220;complete their check chart&#8221;. When they do, they move up, and that can happen at five different points in the year (they don&#8217;t need to wait until the fall).</p><p>The check chart provides two benefits:</p><ol><li><p><strong>It gives the kids autonomy. </strong>Every week they have time where they can choose what to do with it. They decide which check items they want to work on next</p></li><li><p><strong>It gives the kids goals</strong> beyond the academic platform, and shows that they don&#8217;t advance &#8220;automatically&#8221; based on just &#8220;aging up&#8221;. If their friend moves up before they do, they need to double down so they can catch up.</p></li></ol><p>Check Chart items vary considerably. Some items on my kids&#8217; charts this year:</p><ul><li><p>Give a tour of the school to visiting parents</p></li><li><p>Build a paper airplane that flies more than 30 feet</p></li><li><p>Complete a 1000-piece puzzle</p></li><li><p>Assemble a piece of IKEA furniture on your own (with a time limit)</p></li><li><p>Give a TED-type talk to 300+ people</p></li><li><p>Identify all 50 states on a map without any errors</p></li><li><p>Come top-10% in a local chess tournament</p></li><li><p>Write a letter in cursive at least 20 sentences long</p></li><li><p>Type 30-words per minute with 95% accuracy</p></li><li><p>Compete in a local Quizbowl tournament and qualify for nationals</p></li><li><p>Take 10% off your time to run a mile</p></li></ul><p>Workshops in the afternoons are the &#8220;fun&#8221; part of school. They are the equivalent of the music, theater and art classes that fill in a traditional school schedule (just more focused, measurable and creative). The check charts both exist to fill in the gaps on important things that are missing from the academic program (like public speaking and typing) and to teach the students the importance of agency &#8211; there is no one standing over them with deadlines on the check chart. They just won&#8217;t move on to the next level with their friends if they don&#8217;t get everything on the list done.</p><p>All of these elements are held together by the thing that the PR program does not mention &#8211; the thing that, when most parents hear about it, they recoil in horror: Incentives (aka, bribes)</p><h2>Part Four: How Alpha Works (Part 2): Incentives</h2><p>People REALLY don&#8217;t like the idea of incentivizing kids to learn.</p><p>Roland Fryer, who has done extensive work on what works in incentivizing students, <a href=\"https://scholar.harvard.edu/files/fryer/files/092011_incentives_fryer_allen_paper2.pdf\">quotes a 2010 Gallup poll</a> that found that only 23% of American parents support the &#8220;idea of school districts paying small amount of money to students to, for example, read books, attend school or to get good grades&#8221; (76% opposed the idea with only 1% undecided).</p><p>There are not many things that 76% of Americans agree on. Only <a href=\"https://www.cbsnews.com/pictures/surprising-things-americans-actually-agree-on/18/\">69% of Americans believe another Civil War</a> would be a bad thing. Only <a href=\"https://docs.cdn.yougov.com/crjq3mojm5/toplines_Views%20on%20Britain%20and%20the%20Monarchy.pdf\">78% agree that American independence from Britain</a> was the right choice. People REALLY don&#8217;t like paying kids to read books.</p><p>So what do these parents think we should do instead? Mostly they believe that kids should just be &#8220;intrinsically motivated&#8221; and school should be about inspiring that internal motivation. Their concern is that if we provide external motivation for learning it will crowd out internal motivation. They worry that when the external motivation goes away (no one is going to pay a 30-year-old to read books), there is no internal motivation to keep learning happening. In this model &#8220;education&#8221; is not about educating per se, or even about teaching habits, it is about inspiring character.</p><p>The other option is that rather than use the carrot, you could use the stick. Fryer shares another poll from 2008 where 26% of parents think grade-school teachers should be allowed to spank kids<strong> </strong>(35% in the Southern US states!). As Fryer summarizes: &#8220;The concept of paying students in school is less palatable than the concept of spanking students in school&#8221;.</p><p>I am less interested in the philosophy of &#8220;what is right&#8221; and more interested in &#8220;what works&#8221;. If bribing kids gets them to learn more while they are kids that seems good. If it causes them long term motivation issues, that seems bad. My instinct is to try and quantify both effects and then understand what the trade-off is to make a decision on what we should do (and my ingoing hypothesis is that it likely depends on the kid, so you need a big enough &#8220;n&#8221; to distinguish different types of kids).</p><p>Fryer is the leading researcher in this field, at least in the short term impact of these programs. This <a href=\"https://scholar.harvard.edu/files/fryer/files/092011_incentives_fryer_allen_paper2.pdf\">paper</a> has a nice summary of his studies where he finds that providing direct monetary incentives to kids works to drive behavior if that behavior is easy for the kid to understand and execute on. When he paid kids $2 for each book they read, they read a lot more books (+40%). When he paid kids to show up to class and not be late, tardiness dropped 22% versus the control group. But when he tried targeting the end goal and paying students more for higher test scores he saw no effect. Tell a kid to read a book or show up on time and they know what they need to do to get the money. Tell them to get higher scores on tests and, while they have a rough idea how to do that (pay more attention in class, study longer and more efficiently), the actual things they need to do are not entirely clear and the inputs they put in (studying) are not directly tied to the outputs (test scores) &#8211; and the incentives have no impact.</p><p>As far as I know Fryer has not done any super-long-term studies of the impact of his experiments, but he did look at the mid-term effects. After the &#8220;read books for $$s&#8221; study ended he followed the test and control group for what happened to their reading habits when they were not getting paid. He found, in contradiction to concerns about loss of internal motivation, that the test group continued to read more than the control group.</p><h4>When we pay kids to take on new habits, the habits tend to stick after the incentives go away.</h4><p>Is this that different from incentivizing your kids to eat their vegetables and then rewarding them with dessert? The hope is that they will build the habit of eating vegetables and will eat them without external rewards when they are older and understand the value of the habit you have built for them as children.</p><p>None of this should not be too surprising for people who have read Anders Ericsson&#8217;s work on building expertise.</p><p>Ericsson is most famous for being the source of Malcolm Gladwell&#8217;s &#8220;10,000 hours of practice to become an expert&#8221; meme. Ericsson was not impressed by Gladwell&#8217;s simplification of his findings and he wrote an <a href=\"https://www.amazon.com/Peak-Secrets-New-Science-Expertise/dp/1531864880\">excellent book</a> detailing what his findings really meant. That book describes the study Gladwell used to get to 10,000 hours.</p><p>At the elite music school in Berlin, the Hochschule f&#252;r Musik, Ericsson sorted students into three groups by ability: future soloists, future orchestra professionals, and future teachers. He found that the three groups did not differ systematically in most characteristics. As groups they had the same IQs, the same age of starting music, and the same quality and quantity of instruction. The only measurable difference he found between the groups was the number of lifetime hours they had committed to &#8220;deliberate practice&#8221;. From age&#8239;eight onward the future soloists logged almost three times more practice hours per week than the future teachers. On average the soloists had clocked in 10,000 hours of practice by the time they started at their elite music college.</p><p>That was where Gladwell got his 10,000 hour rule.</p><p>(One of Ericsson&#8217;s problems with Gladwell&#8217;s simplification is that he saw nothing special about 10,000 hours. There was a significant range among the elite students &#8211; 10,000 was just the average; Also the elite students were still just &#8216;students&#8217; and while they were on track to become world class, none of them were world class yet. Ericsson estimates that would take another ten years of practice putting most of their total practice time to achieve world class performance well over 20,000 hours)</p><p>Ericsson&#8217;s next question was WHY did some students practice more than others? All of these kids wanted to be great musicians and have careers as musicians and all had dedicated large parts of their life to the craft, so why did some choose to practice more than others? His initial hypothesis is that some people just enjoyed practicing more than others. He dismissed the idea that some kids were just more talented than others, and replaced it with some kids, whether for genetic or environmental reasons, were just more &#8220;into practice&#8221; than others. But when he questioned the students he found that was not true at all.</p><p>The future elite soloists of the music world all <em>hated</em> practicing.</p><p>And so did everyone else.</p><p>All of the musicians at the school did not like the process of practicing. They enjoyed playing. They enjoyed being good musicians. They just hated the process of practicing to get good.</p><p>So why did they do it?</p><p>Because they wanted to be great musicians and they knew that they needed to practice to become great musicians.</p><p>According to Ericsson, the key to being great is deliberate practice. The key to deliberate practice is motivation.</p><p>Ericsson dug further to figure out where the motivation came from and he found it grew over three stages:</p><ol><li><p><strong>Parental and authority approval: </strong>Initially kids practice because they are given praise and attention from their parents when they do so, and are reprimanded when they don&#8217;t. He gives examples of mom saying &#8220;if you don&#8217;t practice an hour per day on piano I am going to stop paying for your music instructor&#8221;.</p></li><li><p><strong>Peer approval: </strong>At some point the young musicians begin to care less about what their parents think, and more about their relative status among their peers. Part of this is that they can perform music for their classmates, which is very impressive, but a bigger motivation is that their skills are recognized by other young musicians &#8211; their true peers.</p></li><li><p><strong>Self Actualization:</strong> Eventually the best musicians stop caring about their peers and start internalizing the desire to be great. They see themselves as musicians, and they do the hard, uncomfortable work of practicing because &#8220;that is what a great musician does&#8221;. </p></li></ol><p>Ericsson found every musician followed the same path (and he repeated it with other adult experts and came to the same conclusion).</p><p>When we look at adult &#8220;experts&#8221; or even adults who are still learning by reading books, we see people who have internal motivation and self actualization. Why do you read books as an adult? I expect most people who read books do it because they <em>like</em> reading books &#8211; and the reason they enjoy reading books is that they have read enough books in their lifetime that they are pretty good at reading books. For most people who read books, reading books is not &#8220;difficult&#8221; (if it is I expect most people put down that book and choose a less challenging one). And yes, many people read books to &#8220;learn things,&#8221; but almost everyone combines &#8220;learning things&#8221; with enjoyment. They enjoy the feeling of learning and they often retain parts of what they read, but it is a rare reader who takes notes while they are reading to review afterwards, or picks up a textbook after they have graduated from school. Many people want to learn, as long as the learning is enjoyable and not too much work. If retaining more of the learning takes extra effort, most people, most of the time, will not put in that effort.</p><p>If you are the type of person who reads challenging books at the edge of your ability and takes detailed notes to review afterwards in a space repetition tool, I expect you do it because you feel you are &#8220;the type of person who reads challenging books&#8221; &#8211; you have achieved self-actualization in book reading and learning. You are not the majority. You aren&#8217;t even the majority of the minority of people who read a lot of books.</p><p>Self actualization is where we want all our kids to reach (or at least &#8220;become a strong enough reader that they enjoy reading books and will do it for pleasure&#8221;). The question is how to get there. Ericsson has mapped out that path:</p><ul><li><p>Start with adult-generated incentives</p></li><li><p>Surround the children with peers who will raise their status for being &#8220;learners&#8221;</p></li><li><p>Hope at some point they self-actualize</p></li></ul><p>Clearly not every kid will get to stage three (and no one will get to stage three in every endeavor), but Ericsson&#8217;s point is that EVERYONE who gets to stage three starts at stage one. And we know how to motivate kids in stage one &#8211; or at least Roland Fryer does.</p><p>Combining Ericsson and Fryer we get the success equation:</p><p>Incentives &#8594; Motivation</p><p>Motivation &#8594; Time spent on deliberate practice</p><p>Time spent on deliberate practice &#8594; Mastery</p><p>Unfortunately we have an education system that doesn&#8217;t &#8220;follow the data&#8221; on how to best educate, and the general population hates the idea of incentives, so no one is pushing the education system to change in that dimension.</p><p>Alpha HAS followed the data. They have built deliberate and extensive incentive systems. But Alpha also knows what the general population thinks of incentives, so they don&#8217;t talk about it. There are lots of parents that are against throwing kids learning in front of screens and lots of educators against &#8220;too rapidly accelerating learning&#8221;, but there are even more parents and educators against <em>bribing</em> kids. When you see the complaints about Alpha on Reddit they criticize the AI and the screen time and the lack of teachers and the tuition and the &#8220;funded by billionaires&#8221; but no one complains about the incentive/bribery system. Because unless you go to Alpha you don&#8217;t even know about the incentive system.</p><p>Alpha believes in the incentive system, and it is a very important part of their program, but they don&#8217;t brag about it.</p><h4>Alpha&#8217;s Incentive Programs</h4><p>Alpha schools have their own in-house currency. Alpha has &#8220;Alpha bucks&#8221;; GT School has &#8220;GT bucks&#8221;. My understanding is that they work a little differently on each campus, but the overall philosophy is the same. This review will focus on the details of the GT system since it is what I know best.</p><p>If the students complete their 2-hour learning &#8220;minimums&#8221; each day they earn about 10 GT Bucks. They get additional bonuses for every lesson they complete beyond their minimums. They also get a bonus if they finish their minimums within the scheduled time (vs going home and doing them later), additional bonuses if the entire class completes their minimums during the allotted time, and weekly bonuses for hitting longer term targets.</p><p>They only get credit if they both complete their lessons AND get 80% or higher on the problem sets within the lesson. If they get 79% they still move on (with the questions they missed coming back later for review), but they don&#8217;t get the GT bucks associated with the lesson (this stops gaming where the kids rush through the lessons just to get &#8220;bucks&#8221;)</p><p>A GT buck is worth 10-cents. So if they are really pushing a kid could be earning roughly $2 per day.</p><p>Fryer paid kids to read books, GT pays kids to do lessons.</p><p>Once a kid has earned a collection of GT bucks they can spend those bucks at the GT-store. The Alpha store has a wide selection of offerings. The GT store, because it is a much smaller school, is more like a catalog. The kids can select what they want and the school will order it so it is ready when they earn enough &#8220;bucks&#8221;. Every kid has their own personalized incentive &#8211; do the school work and they will get their personalized prize.</p><p>Different kids respond to this differently.</p><p>My youngest spends his GT-bucks as he earns them &#8211; coming home most weeks with a bouncy ball or a protein bar.</p><p>My middle daughter has ambitions to save for things (she really wants a lego chess set), but often gives in and buys something before she saves enough (she has built an impressive collection of stuffies).</p><p>My older daughter likes to save. She really wanted a Taylor Swift sweater and saved her points for months to buy it, but then, when she had enough bucks, she decided she didn&#8217;t want to spend them &#8211; so no sweater but a record number of points in her balance statement (then my middle daughter used <em>her</em> points to buy the sweater&#8230; You can imagine how that went&#8230;).</p><p>My kids are gifted. They love learning. They compete in academic bees and chess tournaments and musical productions for fun. But the GT incentive system has turbo-charged their academic learning well beyond that inborn desire to learn.</p><p>We decided to join the GT school in July, but, for logistical reasons, we could not start until October. For the 3.5 months I signed the kids up to iXL &#8211; the tool that Alpha students use for 80% of their academic work &#8211; including almost all of their Language, Math and Science lessons. I wanted to get the kids used to using it over the summer before they started school.</p><p>It did not go well.</p><p>We tried getting the kids to work on it for about an hour per day, but it was a fight every time. It was the same content they would be doing at GT, but without the GT structure, and it did not work.</p><p>But once the kids started at GT, those same iXL lessons became a game for them. I remember taking the kids to the park one day after school. They asked me, &#8220;Instead of playing can you set up a hotspot so we can do a few more lessons? I want to earn more GT-Bucks!&#8221;.</p><p>Was it bad that they were being bribed to do lessons? 76% of Americans would think so. But it definitely worked.</p><p>My middle daughter &#8211; who is the most driven by money &#8211; has completed more than two full grades of school in ~20-weeks (60% of the school year), and shows no signs of slowing down.</p><p>I have not noticed any reduced interest in learning outside of school. My oldest daughter does not like the idea of incentives at all. She doesn&#8217;t need the incentives and she thinks other kids shouldn&#8217;t need to be incentivized either. But the incentives <em>are</em> helping with her younger siblings, and, even if they aren&#8217;t pushing her to go harder, they definitely don&#8217;t seem to be <em>hurting</em> her internal drive.</p><h4>Incentives, Incentives Everywhere</h4><p>In addition to the core incentive system, the schools have been testing two new ones.</p><p>Part way through the school year at the GT school they created an incentive system to drive non-academic behavior.</p><p>In this system, called &#8220;Dojo Points&#8221;, kids earn Dojo Points by being pleasant, respectful team-players. The guides give out the points in qualitative ways when the kids demonstrate perseverance, teamwork, respect, autonomy, and when they give and receive feedback to each other. More so than the GT bucks, my kids will come home and tell me how many Dojo Points they earned that day. A high day is somewhere around six points.</p><p>The kid in each &#8220;section&#8221; (split between the older and the younger kids) who earns the most Dojo Points in a day becomes the daily &#8220;Dojo Master&#8221; and gets a &#8220;key&#8221;. At the end of the week, assuming no ties, there are five keys divided among the kids in each group. On Friday the kids are presented with a bunch of locked boxes. One of the boxes has a prize in it. The kids with keys check the boxes to see if their key opens the box with a prize.</p><p>The system seems to work.</p><p>My 6-year old can often be disruptive in many settings, including at school, but lately he has turned a corner at school and has been winning the daily Dojo Master (this week he has won four of the five days so far, and almost has a lock on the Friday prize).</p><p>Will he start mis-behaving more as soon as he loses access to the incentive? Maybe. He definitely misbehaves at home from time-to-time and has trouble regulating when things don&#8217;t go his way. Is his regulation now better than it was before he was put on the incentive program at school? I think so? But maybe that is just a function of him getting older and he would have been getting better anyway? Another example where it would have been nice to have a twin brother we could have experimented on I guess.</p><p>While GT was focused on non-academic behavior Alpha set their sites on another problem that schools face: Summer regression.</p><p>Educators have long known about the summer regression problem &#8211; kids tend to atrophy or regress over the summer break (this is worse for less privileged children, but true for all kids). We have not had our summer with GT yet, but last summer the Alpha school ran an experiment where kids who completed lessons in the summer were paid real money (US dollars &#8211; not &#8220;Alpha bucks&#8221;). They were given $1 per lesson completed over the summer (effectively 10x what they make during the school year). Recall that generally during the school day kids who &#8220;hit their minimums&#8221; complete about 10 lessons per day over 2-hours. So any kid who kept that up on their own over the summer could earn $10/day for 2-hours of work ($5/hour). Not bad for a 6-year old.</p><h4>The Public Relations challenge</h4><p>As Alpha is expanding its program beyond its own school it has, understandably, focused on the &#8220;AI-powered 2-hour learning&#8221; product. It is that tool that <em>seems</em> to be what differentiates Alpha from all the other schools in America. The tool lets kids learn 2.6x faster. But from my experience the tool is necessary but not sufficient. The tool provides the means for kids to advance and learn quickly, but it does not provide the motivation. The rest of the school has been built around providing the gaps that the tool misses &#8211; both the need to increase student motivation, but also any other gaps that come up. If the 2-hour learning tool is the self-driving car, the incentives are the fuel, and the rest of the school is the human behind the wheel who makes sure the self-driving car isn&#8217;t caught in a loop.</p><p>So what happens when Alpha takes their core product and pushes it somewhere without the infrastructure that goes around it? It still works, but just not as well.</p><p>In the way that Alpha measures effectiveness (see next section) students in the Alpha school advance 2.6x faster. Kids at the GT-school advance ~5x faster (mostly due to the selection effect of the kids they bring into that program). In the homeschool program the school is piloting with the exact same software (but without the supporting infrastructure, guides and incentives) the students are advancing at ~1x speed. That doesn&#8217;t seem awesome, but remember that is with just 2-hours of academics per day, not a full day of classes. Good but not great.</p><p>The Alpha team is trying to figure out how to improve the performance of the kids in the home school pilot before they expand it beyond the beta testers. I expect the answer will be related to the incentives.</p><h2>Part Five: Does it work?</h2><p>Alpha claims 2.6x average learning speed versus traditional schools, but what does &#8220;learning speed&#8221; mean?</p><p>Even the Alpha guides get confused sometimes. There are two learning concepts that get entangled:</p><ol><li><p>How fast students are learning and mastering the content &#8211;<strong> &#8220;Lesson Clock Speed&#8221;</strong></p></li><li><p>How high students are scoring on standardized tests that measure content understanding &#8211; <strong>&#8220;MAP Growth Speed&#8221;</strong></p></li></ol><p><strong>Lesson Clock Speed (LCS) </strong>can be measured by how many lessons the students are completing at &#8220;mastery&#8221; level and how long it takes them to complete those lessons. My 8-year old started 2nd grade content in mid-October 2025. She &#8220;mastered&#8221; all of 2nd grade by March 31st, 2025 (Reading: March 31st, Math: February 5th, Language: January 20th). She is now working her way through 3rd grade and the system estimated she will master all 3rd grade content before the end of May (Language: May 23rd, Math: May 9th, Science: May 7th). When she completes this content she will start on 4th grade material for the remainder of this year, and will start next school year part-way through that 4th grade content (assuming she doesn&#8217;t finish 4th grade over the summer). Since she missed the first 20% of the school year, we could say she is &#8220;learning&#8221; at (2.1/0.8) ~2.6x speed.</p><p>But that is NOT where the 2.6x number comes from.</p><p>Instead Alpha defines 2x learning as improvements in students MAP scores - <strong>MAP Growth Speed (MGS)</strong></p><p>For those who are not deep in academic terminology (I know I wasn&#8217;t), MAP stands for <strong>&#8220;<a href=\"https://www.nwea.org/map-growth/\">Measures of Academic Progress</a>&#8221;</strong>. MAP is a set of standardized, computer-adaptive tests built by the Northwest Evaluation Association given to millions of students across America three times per year (fall, winter and spring). The adaptive nature of the test means that, while the &#8220;starting point&#8221; of the test depends on the student's age/grade level, the test questions increase or decrease in difficulty (of both concepts and expected knowledge) as students answer questions correctly or incorrectly. This means that not only can you compare scores across students in the same grade, you can compare scores of the same student over time, and of students across different grades. A 12th grader scoring a &#8220;238&#8221; has about the same knowledge as a 5th grader scoring &#8220;238&#8221;. If that score was a MAP math test taken in the fall, the 12th grader would be at the 60th percentile for his grade and the 5th grader would be at the 97th percentile for hers &#8211; but their knowledge and current capabilities would be about equivalent to each other.</p><p>Alpha has their students take the MAP tests three times per year. This testing can help the program adapt to understand if students who are &#8220;getting through the material&#8221; are actually retaining it and conceptualizing it, but it also helps measure progress. If a student is at 95th percentile in math in the fall, the MAP test will tell us if they are still at 95th percentile in the spring (or if they have advanced slower or faster than other 95th percentile students across the country).</p><p>You can see all of the <a href=\"https://teach.mapnwea.org/impl/NormsTables.pdf\">MAP percentile charts here</a> for all the kids who take it across America. For our purposes let&#8217;s look at the MAP percentile scores for math tests taken in the spring for the top 50% of kids in the country:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!ARFd!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8e48e322-0a3d-4603-998e-c90a552f2fd6_439x798.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"798\" src=\"https://substackcdn.com/image/fetch/$s_!ARFd!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8e48e322-0a3d-4603-998e-c90a552f2fd6_439x798.png\" width=\"439\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p><strong>A few things worth pointing out:</strong></p><ol><li><p><strong>Everyone gets better.</strong> Whether due to education or not, the scores of any given percentile increase with each passing year</p></li><li><p><strong>Everyone slows down. </strong>Students get rapidly better on the test in the early years of school, and that progress slows down as they get older. Kindergarten to 1st grade sees increases of ~20 points at most percentile ranks. 11th to 12th grade improvements are minimal. Even the best students at that age are only getting ~6 points better on the test, and the median student sees no improvement at all over 12th grade.</p></li><li><p><strong>The best kids slow down the least.</strong> From Kindergarten to first grade everyone is advancing at about 20-points on the test, so the more average kids are actually improving faster on a percentage basis than the top-1% kids. But around middle school something happens. From 7th to 8th grade the top percentile kids gain 7-points on the test. The 50th percentile kids gain 3-points. The lowest percentile kids (not shown in that image) only improve by a single point (from a much lower base)</p></li><li><p><strong>The top performing kids are WAY ahead of the average and the lower tier kids.</strong> The kids at the top percentile achieve the median score of a graduating senior by the end of 3rd grade! And recall this is not an IQ test &#8211; this is a content test. The top 1% of 3rd graders have more content knowledge and comprehension than the median high school graduate.</p></li></ol><p>When Alpha says their kids are learning 2.6x faster than kids in traditional schools, what they mean is that Alpha kids are increasing their MAP scores 2.6-times faster than similar kids at traditional schools.</p><p>What that means in practice is that kids at Alpha improve their percentile ranking on MAP results every time they take the test. If a 3rd-grader at Alpha scores a &#8220;209&#8221; on Math in the Spring (71st percentile), you can expect she will achieve (on average) a 235 the following spring when she is in 4th grade (traditional 71st-percentile 3rd graders improve ~10 points, so her experience at Alpha should have her improve 10 x 2.6 = 26 points). That would jump her from 71st-percentile to 94th-percentile. Keep it up and by 5th grade she moves beyond the 99th percentile (if you are lost with the math, don&#8217;t worry. The point is just that Alpha kids are learning faster, and increasing their &#8220;relative rank&#8221; with the rest of the country as they spend more time at Alpha)</p><p>Note that because of the base rates, it is a lot easier to improve versus your peers at traditional schools when you are &#8220;average&#8221; and when you are older. Median kids do not advance as fast, and older kids do not advance as fast &#8211; so getting a 2.6x improvement is easier in absolute magnitude when you start low.</p><p>So we should expect that the GT school &#8211; where kids enter the program scoring in the 90th+ percentile &#8211; might have faster overall improvement, but a smaller delta from traditional schools where the top percentile kids are still advancing very quickly. That would have been my ingoing hypothesis.</p><p>What is surprising is that, with the caveat that the GT-school is both new and small (only five kids took both the fall 2024 and the winter 2025 tests), those few data points are pointing in the opposite direction: on average those five kids&#8217; MAP scores improved <strong>5x faster </strong>than other kids who started the year at those base levels. The absurdity of those numbers makes me think that that rate will not hold, but it makes me optimistic that the program might actually speed up bright kids&#8217; academics even more than it helps the average kid. Since my kids started the school year late in October (rather than mid-August when the standard school year started), they missed the fall MAP testing and we only have a single data point for each of them &#8211; the Winter MAP. They will be taking the Spring MAP in the next few weeks and I will be happy to share how they have progressed when I have that data back. I think they will have improved, but I am skeptical it will be at 5x faster than other similarly bright kids across the country.</p><p>There are at least three other objections to using MAP scores to measure progress or &#8220;success&#8221; of academic programs:</p><ol><li><p>Do MAP scores actually correlate to anything important later in life?</p></li><li><p>Is this all just &#8220;teaching to the test&#8221;? Are the kids just learning knowledge to pass multiple-choice tests? What about critical thinking, formulating long-form thoughts through essays, and other types of learning?</p></li><li><p>How effective are other elite-schools and learning programs at increasing MAP scores?</p></li></ol><p>I do not want to get bogged down in any of those questions, but all deserve at least courtesy answers.</p><h4>Do MAP scores correlate with anything important?</h4><p>I am not aware of any studies that look at MAP score correlations to lifetime income or other adult measures of &#8220;success&#8221;, but MAP scores are highly correlated with <a href=\"https://www.nwea.org/uploads/2020/10/MAP-SAT-College-Readiness-Benchmarks_NWEA_linkingstudy.pdf\">SAT scores</a>, <a href=\"https://fordhaminstitute.org/national/commentary/roadmap-success-using-state-assessment-data-predict-postsecondary-success\">post-secondary success</a>, and likelihood to attend an <a href=\"https://www.elmbrookschools.org/uploaded/SSMigration/data/files/gallery/ContentGallery/NWEAcollegereadinessindicator.pdf\">elite college</a>. MAP is not trying to measure the same thing as SAT, but it's not surprising they are correlated. It begs the question of whether improving a MAP score will improve other things you care about (SAT scores, getting in a good college, having a happy life), but it is at least indicative that it is not measuring something meaningless.</p><h4>Are scores inflated because of teaching to the test?</h4><p>I believe there is something to the concern about &#8220;teaching to the test&#8221;. The kids doing the Alpha program spend a lot of time learning how to take multiple choice tests based on the content they have learned, and the content they are learning is the same content that is being tested on MAP. The best way to get better at a thing, is to practice doing that thing. To the first level of approximation this is fine as long as you are testing the right thing.</p><p>You see this effect in competitions.</p><p>If you want to get a high score in a diving competition, the first step is learning how to dive and how to dive better. You don&#8217;t need to worry about what the final test will evaluate you on, because no matter what it is evaluating you on, you need to be able to enter the water head first without making a splash and there are some fundamental skills you need to learn in order to do that.</p><p>But once you get to be a very good diver, then you may find the judging criteria starts to influence what you practice, how you practice, and what you choose to demonstrate in competition. Does one type of dive tend to score higher for any given level of skill? If so, you should focus your practice on that style.</p><p>That type of &#8220;over-optimization&#8221; tends to only happen at the highest levels of competition (if you want to get good at Jeopardy, start by having a large knowledge base. Once you are very good, THEN you may want to use frequency charts to fill in likely gaps (do you know all your alcoholic drink ingredients?), learn &#8220;pavlovs&#8221; (Pop art = Warhol; Aguinaldo = Philippines; two fathoms = Mark Twain) and study bidding strategies for daily doubles &#8211; things that will get you better at the &#8220;Jeopardy test&#8221;, but not get you better at the underlying skill that Jeopardy is, in theory, testing you on).</p><p>It is possible that Alpha&#8217;s learning methods veer into &#8220;over-optimization&#8221; but I have not seen that in practice. Mostly they are in the &#8220;learn the material you are expected to learn, and then you will test higher when you are tested against that material&#8221;.</p><p>The remaining &#8220;teach to the test&#8221; concern is &#8220;are we testing for the correct things?&#8221;</p><p>There I <em>do </em>have some concerns.</p><p>The MAP tests seem to be very effective at assessing knowledge and ability to incorporate that knowledge in novel situations. What MAP is not testing are things like:</p><ul><li><p>Writing essays</p></li><li><p>Long form planning and strategy</p></li><li><p>Public speaking and persuasion</p></li><li><p>Making connections between two disparate concepts or ideas</p></li><li><p>Deep understanding of the drivers of history</p></li><li><p>Psychology</p></li><li><p>Economics</p></li><li><p>Leadership</p></li></ul><p>&#8230;and so many other things.</p><p>100% of MAP test questions are multiple choice. Where are the students learning deep thinking? What about the learning you get from small group discussions in a university seminar?</p><p>I think Alpha&#8217;s answer to that concern is &#8220;that is what we do in the afternoon workshops&#8221;. I think that is a fine answer. How well do most schools teach those things as a baseline? Maybe Alpha does as good a job as other schools teaching public speaking. Maybe they do a better job? But what is missing is an objective measure of how well they do it.</p><p>I can see that GT is making progress on the measurement of those softer skills by running workshops on &#8220;competitive academics&#8221; where the output is legible. The kids at that school don&#8217;t just learn to give talks, they give talks and then submit them to The Moth in an attempt to qualify for (and win) Storytelling Nights. They don&#8217;t just write persuasive essays graded by their teachers, they write persuasive essays and then submit them to national competitions. They don&#8217;t just learn the concepts of long term planning and strategy, they put them in practice playing go and chess and then compete against their peers and earn an elo ranking. I think it is a fair way to assess these things and leads to more accountability, but note that it is only happening at the GT school with ten kids, not the main Alpha campus, and the data points so far on whether it is working are very thin.</p><p>Our friends at the flagship school are less convinced that the climbing wall workshop is teaching those &#8220;non-state mandated&#8221; academics that the core program misses.</p><p>Another disappointment is &#8220;Alpha Writes&#8221;.</p><p>The school was not happy with the third-party reading and writing apps out there and built their own. Alpha Reads is excellent. Alpha Writes (which is newer and just launched about a month ago) is not. I believe the school (and Joe&#8239;Liemandt) understands that the product is not good enough, and they are taking it back to the drawing board, but for now I do not think the Alpha kids have any real edge versus traditional schools in their training on essay or creative writing skills.</p><h4>How do Alpha&#8217;s MAP score improvements compare to other selective private schools across the country?</h4><p>This is an important question for some parents. It is great if you can expect your 5th grader to advance 2.6x faster than they would at the local public school, but if you are planning to spend $40,000/year to send him to Alpha, your alternative is likely not the local public school. And if you are considering moving your family to Austin for the school, your alternative options are places like Horace Mann, Harvard-Westlake, and Lakeside. How does the 2.6x improvement that Alpha is delivering compare to those elite institutions?</p><p>I have no idea.</p><p>Unlike Alpha I have not found any elite school who has shared the MAP improvement rate for the students at their school.</p><p>I expect these elite schools are very good for all the reasons the selective private school I sent my kids to before GT was good: They have a select group of peers, they have great teacher:student ratios, and they have incredible resources. I also expect most of these schools do NOT accelerate (I could very well be wrong here and would be happy to be corrected). If they are like the schools I am familiar with they allow their students to advance through the material at the &#8220;normal&#8221; pace, with the normal pedagogy, but, because those kids are so bright, that leaves them plenty of time for enrichment.</p><p><a href=\"https://www.lakesideschool.org/uploaded/2024-2025_US_Curriculum_Guide.pdf\">Lakeside school </a>(where Bill Gates&#8217; children attended) has classes where students write and perform one-act plays at the school&#8217;s annual festival; advanced photography courses where students develop their own signature style and brand; Literature classes on Victorian novels, the Harlem Renaissance, and Chaos Theory; classes on abnormal psychology, architecture, blockchain, game theory and wilderness survival and leadership. I am sure by the time they graduate, students from Lakeside have learned much more than what is measured on a standardized MAP test.</p><p>The problem is that it is difficult to measure those &#8220;extra things&#8221;, so you are left making the decision on vibes and prestige and marketing materials. (and meanwhile the objective numbers are held under lock and key by the elite schools themselves who have no incentive to share them when they are already winning on vibes).</p><p>Is there any data on how different education programs are doing on improving MAP scores? I have not found any schools other than Alpha that share their data, but there are some &#8220;educational interventions&#8221; where the measured output was an improvement on MAP tests.</p><p><a href=\"https://margrady.com/tto/\">Teach to One: Math</a> is a math program used in some schools that is meant to be &#8220;personalized&#8221; using &#8220;technology-infused direct instruction&#8221;. Their studies find that students who follow their full program improve 23% faster on the math MAP scores, and students who are &#8220;exposed&#8221; to the program improve 12% faster.</p><p><a href=\"https://www.k12dive.com/news/individualized-math-program-helped-boost-scores-at-all-grades/629744/\">MAP Accelerator</a> is a tool developed by Khan Academy. It claims that students who use it consistently for 30-minutes per week improve their MAP scores 9-43% faster than a control group.</p><p>Both examples show that if you have technology-enabled personalized learning for extended periods of time improve MAP scores versus the norm. Both show that those results only happen when the students stick with the program. This shows that the &#8220;secret sauce&#8221; of Alpha&#8217;s 2-Hour Learning is not what and how they are teaching but rather:</p><ol><li><p>That they are using personalized technology-enhanced programing (when most schools aren&#8217;t)</p></li><li><p>They do it for 2-hours per day instead of 30-minutes per week</p></li><li><p>They keep the kids motivated so they put in the daily effort and don&#8217;t get burned out</p></li></ol><p>What Alpha is doing is not rocket science. They are just &#8220;following the science&#8221; for what has been proven to work, and then designing a school around the best way (or &#8220;a way&#8221;) to deliver that science - personalized instruction, mastery focus, spaced repetition and incentives.</p><p>It should not be <em>too</em> surprising that when it all comes together it spits out measurable results. But will it hold?</p><h2>Part Six: A Response to Bryan Caplan</h2><blockquote><p>\"When the data and anecdotes disagree, the anecdotes are usually right. It&#8217;s usually not that the data is being miscollected. It&#8217;s usually that you&#8217;re not measuring the right thing.\"</p></blockquote><p><em>&#8212; Jeff Bezos (on multiple occasions)</em></p><p>Not only does <a href=\"https://www.betonit.ai/\">Bryan Caplan</a> convincingly argue that education is mostly signalling in his book &#8220;<a href=\"https://www.amazon.com/Case-against-Education-System-Waste/dp/0691174652\">The Case Against Education</a>&#8221;, he goes even further to pour cold buckets of water on aspirational parents in his book &#8220;<a href=\"https://www.amazon.com/Selfish-Reasons-Have-More-Kids/dp/0465028616\">Selfish Reasons to have more Kids</a>&#8221;. In that latter book he makes a compelling case with unimpeachable data that how kids turn out is almost entirely due to their genes plus &#8220;non-shared environment&#8221; (i.e., random things not having to do with parenting).</p><p>According to Caplan helicopter-parenting does not <em>hurt</em> your kids, it is just a waste of everyone&#8217;s time (and maybe their enjoyment during their childhood). You might be able to influence some of your kids' behavior in the short term, but once they become an adult and move out of your house they will revert to the biases of their genes. As Caplan says, the most important parenting decision you can make that will affect how your kids turn out is your choice of spouse (or more accurately your choice of the genes you use to build your kids).</p><p>Caplan does put one caveat on his data: range restriction.</p><p>He admits that all of his adoption studies focus on middle class Americans (and Europeans). He is the first to admit that if you take a baby out of extreme poverty in the developing world and raise him in a middle class American family, he will have better economic outcomes than if you leave him in rural Mauritania (see his &#8220;<a href=\"https://www.amazon.com/Open-Borders-Science-Ethics-Immigration/dp/1250316960/\">Open Borders</a>&#8221; book). He may even grant that moving from the poorest broken families in America to the middle class also may make a difference &#8211; since all the data available comes from families who were approved by administrators as acceptable to raise adopted kids.</p><p>But is the same thing true when you move from the middle of the bell curve to the right?</p><h4>When the Data Set Gets Bigger</h4><p>Raj&#8239;Chetty&#8217;s <a href=\"https://opportunityinsights.org/paper/neighborhoodsi/\">neighbourhood-impact study </a>cracked the range challenge open. Chetty had access to all IRS filing data for generations. He was able to focus on families with multiple children that moved to significantly different zip codes, and follow those children over extended periods of time. By having millions of data points he could tease apart the impact of moving to a &#8220;better&#8221; zip code for older vs younger siblings. The younger sibling had the same family environment (and 50% of the same genes), but some number of more years in the &#8220;better&#8221; neighborhood.</p><p>Chetty found that better neighborhoods made a difference to long term outcomes.</p><p>But isn&#8217;t the neighborhood where a family lives in a &#8220;shared environment&#8221;? Clearly some adopted families lived in better neighborhoods than others? Why didn&#8217;t Caplan&#8217;s adoption studies pick that up?</p><p>I think part of the answer is noise. Chetty had millions of data points vs hundreds of thousands for the adoption studies. But mostly I think the reason Chetty found this impact while the adoption studies did not is that he was looking for different things. No one took the adoption studies and grouped the zip codes as the relevant input variable. As Bezos says, the data wasn&#8217;t miscollected, they were just looking at the wrong things.</p><p>So what does a good zip code look like?</p><p>Chetty summarizes a good zip code as:</p><ul><li><p>Short commutes</p></li><li><p>Low inequality</p></li><li><p>Low high school dropout rates</p></li><li><p>High voter turnout</p></li><li><p>Low single mother rate</p></li></ul><p><a href=\"https://www.econtalk.org/raj-chetty-on-economic-mobility/\">He summarizes that as a place of &#8220;economic connectedness&#8221; </a>&#8211; where adults are connected to each other and to the broader community. A lack of those five elements are not bad per se, but they are correlated with a community where people are not interacting with each other as much as they are in communities where the metrics are reversed.</p><p>Chetty frames it that kids are influenced by the other adults in the area they live in. But I have another hypothesis. Rather than:</p><p>Other parents &#8594; Your kids</p><p>Perhaps the causation runs from:</p><p>Other parents &#8594; You &#8594; Your kids</p><p>Maybe it&#8217;s not other parents' style of parenting that is influencing your kids (how?) but rather when you spend time around other parents their parenting style rubs off on you and how you parent your kids.</p><p>Influence like that will not get picked up in Caplan&#8217;s adoption studies (which focus almost on how parent characteristics get passed on to genetic vs adopted children&#8217;s characteristics), but it is a potential signal that maybe parenting choices do matter. Maybe we were just looking at the wrong data.</p><h4>Pre-registered Genius Experiment</h4><p>We now have two data sets that don&#8217;t contradict directly, but do point to opposing conclusions. It would be great if we could test this with a pre-registered randomized control trial. That is not going to happen in our current culture. But enter <a href=\"https://en.wikipedia.org/wiki/L%C3%A1szl%C3%B3_Polg%C3%A1r\">Laszlo Polg&#225;r</a>, who volunteered his own children as the test subjects. (<a href=\"https://slatestarcodex.com/2017/07/31/book-review-raise-a-genius/\">Scott&#8217;s 2017 review of Polgar&#8217;s book here</a>)</p><p>Before his children were born Polg&#225;r publicly announced he would raise them to be geniuses. He initially considered training them to be genius artists, writers or mathematicians, but decided those fields were not objective enough. It would be too easy for critics to dismiss his future children&#8217;s achievements and &#8220;not genius&#8221; no matter what they accomplished in those fields. So he chose a field that was considered both &#8220;driven by intelligence&#8221; that had clear, objective measures: chess.</p><p>Then he called his shot.</p><p>By 1989 all three girls received their first &#8220;GM norms&#8221; (a GM norm is finishing a tournament with a elo score of at least 2600; 27 norms are needed to make grandmaster). Two went on to become grandmasters - the 3rd and 4th women to ever achieve that title. One ranked in the top 100 (all genders) at age 12 &#8211; she peaked at #8 in the world. The other became the top-rated woman in the world at age 15.</p><p>Polgar showed that you could take kids, at least kids with &#8220;good enough genes&#8221;, and turn them into world champions through the right education methods.</p><p>One might think this would be &#8220;case closed&#8221;, but even as the Polgar sisters were achieving these feats people were saying that these girls must have been &#8220;naturally gifted&#8221;. They clearly had bright parents, but does anyone think that if they had been adopted into a random middle class American household they would have still become chess geniuses? Or world class in anything at all?</p><p>When Polgar was challenged on exactly that, he wanted to repeat the experiment by adopting a &#8220;black child&#8221; and doing it again. Unfortunately his wife talked him out of it.</p><p>Even if he had adopted a child and turned him into a genius, that would just be one data point &#8211; it would not show up in Caplan&#8217;s adoption studies. It would be a case of the anecdote and the data disagreeing. Which do you choose to believe?</p><h4>Aristocratic Tutoring</h4><p>It would be great if we could find more examples of Polgar&#8217;s model. While I could not find any other &#8220;called shots&#8221;, one could go back and look at the childhoods of geniuses to see if there is anything to find. That is what Erik Hoel did in his series of posts on &#8220;Why we stopped making Einsteins&#8221; (<a href=\"https://www.theintrinsicperspective.com/p/why-we-stopped-making-einsteins\">post 1</a>, <a href=\"https://www.theintrinsicperspective.com/p/follow-up-why-we-stopped-making-einsteins\">post 2</a>, <a href=\"https://www.theintrinsicperspective.com/p/how-geniuses-used-to-be-raised\">post 3</a>; <a href=\"https://www.astralcodexten.com/p/contra-hoel-on-aristocratic-tutoring\">Scott&#8217;s response</a>). Hoel argues persuasively that, when biographies of their childhoods exist, the geniuses of the past were almost all given 1:1 tutoring. There must have been many aristocrats in the past that were given 1:1 tutoring who never amounted to world-class genius, and many world-class geniuses who got there without 1:1 tutoring, but it does seem to put the thumb on the scale.</p><p><a href=\"https://en.wikipedia.org/wiki/Bloom%27s_2_sigma_problem\">Benjamin Bloom </a>would agree.</p><p>Benjamin Bloom quantified Polgar&#8217;s hunch in 1984, just eight years after Polgar&#8217;s last daughter was born. He ran a RCT where some students were taught normally and others given 1:1 tutoring. He found that the average tutored child improved by<strong> </strong>two standard deviations over the control: &#8220;The average tutored student was above 98% of the students in the control class&#8221; and &#8220;about 90% of the tutored students ... attained the level reached by only the highest 20% [of the control]&#8221;. He called his finding the &#8220;Bloom&#8217;s 2 sigma problem&#8221;</p><p>Why would this discovery of the secret sauce that could turn the average student into a genius be a <em>problem</em>?</p><p>Because Bloom saw no way to scale it.</p><p>Clearly we can&#8217;t give every kid in the world a personal 1:1 tutor.</p><p>We had the solution that would revolutionize everything, but it was just too expensive.</p><h4>Where does that leave us?</h4><p>Caplan showed that, within the normal range, nothing you do in education or parenting matters.</p><p>&#8230;But Chetty showed that how (or at least where) your kids are raised <em>can</em> matter.</p><p>&#8230;Polgar showed that intense 1:1 tutoring from a young age can create world-class geniuses</p><p>&#8230;And Bloom showed that 1:1 tutoring can work for almost everyone, improving performance, if not to world-class levels, still two standard deviations above the alternative.</p><p>Caplan is still mostly right&#8212;if you hover in the complacent middle of American schooling. But Chetty hints that context nudges outcomes, Polg&#225;r proves that deliberate, early, personalised instruction can manufacture prodigies, and Bloom tells us it lifts the average child by two sigmas. Alpha&#8217;s claim is that software&#8209;mediated, 5:1 tutoring narrows that two&#8209;sigma gap for a price mere mortals can (barely) contemplate. Whether that vision survives contact with budgets, regulators, and human nature is the question for section&#8239;seven.</p><h2>Part Seven: Scaling Weird</h2><p>A month into our experiment in Austin we were at a neighbor&#8217;s backyard pool party (a fringe benefit of moving to Austin: there were backyard pool parties in early November). I was in conversation with a couple that I had just been introduced to. He asked why we moved to Austin, &#8220;Was it for your job?&#8221;</p><p>&#8220;No. Actually we moved for a school for the kids.&#8221;</p><p>Their faces expressed a combination of confusion and shock.</p><p>It wasn&#8217;t the first nor the last time. Everyone is confused at why we would move across the country to send our kids to a new school, &#8220;They don&#8217;t have good schools where you come from? How much does this school cost?&#8221;</p><p>Those two questions frame Alpha&#8217;s biggest risks when it comes to scaling. Their biggest challenges going forward are not going to be pedagogical. They are going to be sociological and economic.</p><h4>The Economic Problem</h4><p>Alpha is much cheaper than a Victorian Governess, but it&#8217;s not cheap.</p><p>As mentioned in this review more than a few times, Alpha&#8217;s flagship campus charges $40,000 a year&#8212; roughly 3-4&#215; what the other top-tier private elementary schools in Austin ask. Yes, that figure is <em>all&#8209;in</em>: every Chromebook, every afternoon workshop, even the spring junket to Poland to beta&#8209;test the platform with Ukrainian refugees is baked into tuition. There are no gala auctions or booster fees waiting in tall grass. Still, $40k is a hard swallow when the local Christian school will take your child for eleven. Worse, the number almost certainly fails to cover costs. Recall that guides start at $60k, rise to $100k on promotion, and the five &#8220;head guides&#8221; each earn $150k. At the five&#8209;to&#8209;one student&#8209;to&#8209;teacher ratio Alpha runs, those salaries alone suck in half the revenue from a twenty&#8209;kid cohort before you&#8217;ve paid the rent, the head of school, the company executives, the curriculum designers, the engineers that are building the 2-hour platform and AlphaRead, the workshop costs (or the trip to Ukraine) or the marketing expenses (MacKenzie has a very well produced podcast, and I see a lot of ads for the school on Facebook now that we live locally).</p><p>Compared with aristocratic one&#8209;to&#8209;one tutoring, forty grand is a steal. But $40,000 is still Lamborghini kindergarten &#8211; and even at those prices it is still burning through Joe&#8239;Liemandt&#8217;s cash pile.</p><p>Alpha&#8217;s answer to eventually solving the economics seems to be two fold: (1) Get enough scale that the fixed costs (like the learning platform) become a rounding error on overall costs, and (2) pull out the &#8220;non-essentials&#8221; at many of the campuses to get the marginal cost well below $10,000 per student.</p><p>Whether they will be successful is still in early innings. The homeschool product beta is limping along with 1x learning, and the Arizona Charter doesn&#8217;t open until autumn 2025. Whether Alpha retains its magic without $150,000/year guides with 5:1 teacher:student ratios and generous <s>bribe</s> incentives programs, remains to be seen.</p><h4>The Weirdness Problem</h4><p>When Bryan Caplan writes about the signaling theory of education, he lists three signals that schools send to employers:</p><ol><li><p>Our students are smart</p></li><li><p>Our students are heard working</p></li><li><p>Our students are conformists</p></li></ol><p>Many people are surprised that anyone would want to signal conformity. Don&#8217;t most people and employers value &#8220;innovative thinking&#8221;? Maybe, but not in their new hires.</p><p>Elite employers generally want bright, diligent hires who will color inside the corporate lines for a few years before they start &#8220;thinking outside the box&#8221;. Most successful businesses are successful for a reason. They want new employees to enter and do what they are told to in order to understand their new business before they try to &#8220;do things differently&#8221; and change things.</p><p>Caplan explains that the need to signal conformity is the hardest hurdle to disrupting education. You can signal intelligence with an IQ test, and you can signal conscientiousness with any sort of time consuming long term task (Caplan gives the example of collecting the largest ball of string in the world). But by definition, if you do anything different from the norm of going to an existing well known school, you are signalling non-conformity.</p><p>Caplan himself homeschooled some of his kids, but only after he verified that homeschooling for high school wouldn&#8217;t hurt his kids chances of getting into good colleges. He was non-conformist, but only willing to act on the non-conformity if it wouldn&#8217;t be punished by the conformists.</p><p>Most people are not even going to go as far as Caplan. Most people are very happy to be conformists.</p><p>That conformity is one reason why humans surpassed chimps. We are really good at watching other high status members of our communities and copying their behavior. I believe that is a big part of why moving to a better neighborhood leads to better outcomes for kids &#8211; because both the kids and the parents take on the &#8220;better&#8221; lifestyles of that community.</p><p>But it also means that getting people to switch from the existing school system to something like Alpha will be difficult.</p><p>Once we, personally, got over the more pedestrian concerns about moving for a school, our next concern was whether our kids would even get into Alpha. We did not need to worry. Alpha does have a screening process. They won&#8217;t accept kids who are disruptive and can&#8217;t focus in front of a computer for 20 minutes at a time. But the bar is relatively low.</p><p>And yet the school is still, after more than a decade in operation, under-capacity.</p><p>When other elite schools have 20% or lower acceptance rates &#8211; and limited &#8220;entrance points&#8221; (i.e. get your kid in at kindergarten or you are likely out of luck), Alpha is taking almost everyone who applies and allows students to jump in at any point &#8211; even mid-year.</p><p>That reality replaced our first concern with another: Do we want to join a club that will so easily accept us as a member?</p><p>Both my wife and I came from a world where:</p><p>Low acceptance rate ~= quality</p><p>We had just assumed that if <em>we</em> believed Alpha was worth moving across the country for, the school would be oversubscribed with local families. But it&#8217;s not even close.</p><p>The hardest schools to get into in Austin are places like St Stevens and St Andrews &#8211; veritable institutions more than 70 years old. Those are the schools that the rich, old money families who have been in Austin for generations want to send their kids to. And if that is where the elite are sending their kids, why wouldn&#8217;t you want your kids in the same place? We already know that peers matter and that education differences are marginal at best &#8211; why not just optimize for the best peers (where best means the most exclusive club)? St Stevens and St Andrews are the best socially acceptable options: not this new weird Alpha school that uses AI to teach kids. Who would do that to their kids?</p><h4>What is the Alpha Target Audience?</h4><p>So who <em>is</em> going to Alpha?</p><p>Mostly elite non-conformists.</p><p>I think that broader group breaks down into three sub-segments (to use Marketing persona jargon):</p><ol><li><p><strong>David Disruptor:</strong> Tech employee who has moved from the Bay area to Austin. He was nonconformist to even get into tech, and even more non-conformist to leave California</p></li><li><p><strong>Arjun Academic: </strong>First generation immigrant family from India. Likely also works in tech, or maybe healthcare, or runs a small business. They want their kids to excel academically and they are fine doing it differently than the people around them</p></li><li><p><strong>Alex Amplifier:</strong> The smallest segment. Austin is home to a small group of non-conformist &#8220;new media&#8221; personalities. I can name a dozen off the top of my head: Joe Rogan, Tim Ferriss, Lex Fridman, Andrew Huberman, Byrne Hobart, Razib Khan, Peter Attia, Matt Bateman, Chris Williamson, Ryan Holiday, David Parell, Rob Henderson and the <em>Kill Tony</em> guys. At least 3-4 from that list have kids in one of the Alpha schools.</p></li></ol><p>That is a solid base to build an initial business from (especially in &#8220;Keep it Weird, Austin&#8221;), but they will need to find a way to break through that niche into the mainstream if they want to truly transform education more broadly &#8211; which is really the founders&#8217; goal.</p><p>To reach the masses Alpha may need to become &#8220;more normal&#8221;, but if it becomes &#8220;more normal&#8221;, won&#8217;t that just put it back into the middle of the bell curve and become just like all the other education initiatives that petered out as they tried to scale?</p><h4>So, Will Alpha Matter?</h4><p>I believe Alpha is the rare educational intervention that dramatically increases the speed that students can learn the required material. But that just begs the next question:</p><p>&#8220;So what?&#8221;</p><p>Does it matter if kids learn the full K-12 state curriculum in six years instead of thirteen? Then what?</p><p>For many the next questions become:</p><p>&#8220;Will this help my kid get into a great college?&#8221;</p><p>&#8220;Does knowing this material faster help them get a better job post-college?&#8221;</p><p>&#8220;Does learning this material faster make them happier and more fulfilled in life?&#8221;</p><p>For me, the real value that comes from Alpha is not the performance uplift. The most important feature of Alpha is that they have found a way to learn more <em>efficiently</em>. It allows students to condense all the &#8220;required&#8221; state-mandated material into half a day for ~6 years instead of a full day for ~13 years. Is that the right stuff to learn? Are they learning all they need from that platform? That almost doesn&#8217;t matter. The point is that the alternative is to spend more than twice the amount of time to get to the same (or worse) output.</p><p>Once you have freed up half a day for 6-years and a full day for the other seven, you open up a limitless number of possibilities.</p><p>Some kids will rush into college classes. Some will choose to use the time to play sports. Some will use the time to master chess or quiz bowl or programming. Some will take time to travel the world with their families.</p><p>I have some opinions on where I think <em>my</em> kids should spend the extra time that has been freed up, but those opinions are secondary to that much stronger opinion that it is good to give kids more time to do something other than sit in classrooms and learn state-mandated material.</p><p>I believe the most important gift I can give my children is the gift of my love and respect.</p><p>Once I have done that, I think the next most valuable thing I can give them is time.</p><p>The 2-hour learning platform is gifting them an additional ~9 years of childhood.</p><p>I just hope they use it wisely.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/your-review-alpha-school",
            "publishedAt": "2025-06-27",
            "source": "SlateStarCodex",
            "summary": "<p>[<em>This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked</em>]</p><div><hr /></div><blockquote><p>&#8220;Just as we don&#8217;t accept students using AI to write their essays, we will not accept districts using AI to supplant the critical role of teachers.&#8221;</p></blockquote><p><em>&#8212; Arthur&#8239;Steinberg, American Federation of Teachers&#8209;PA, reacting to Alpha&#8217;s cyber&#8209;charter bid, January 2025</em>&#8239;</p><p>In January 2025, the charter school application of &#8220;<a href=\"https://www.unbound.school/\">Unbound Academy</a>&#8221;, a subsidiary of &#8220;<a href=\"https://2hourlearning.com/\">2 Hour Learning, Inc</a>&#8221;, lit up the education press: two hours of &#8220;AI&#8209;powered&#8221; academics, 2.6x learning velocity, and zero teachers. Sympathetic reporters repeated the slogans; union leaders reached for pitchforks; Reddit muttered &#8220;<a href=\"https://www.reddit.com/r/Austin/comments/17feoeu/a_school_with_no_teachers_alpha_private_school_in/\">another rich&#8209;kid scam</a>.&#8221; More sophisticated critics dismissed the pitch as &#8220;selective data from expensive private schools&#8221;.</p><p>But there is nowhere on the internet that provides a detailed, non-partisan, description of what the &#8220;2 hour learning&#8221; program actually is, let alone an objective third party analysis to back up its claims.</p><p>2-Hour Learning&#8217;s flagship school is the &#8220;Alpha School&#8221; in Austin Texas.",
            "title": "Your Review: Alpha School"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3108/",
            "publishedAt": "2025-06-27",
            "source": "XKCD",
            "summary": "<img alt=\"To combat the threat, many airlines are installing wing-mounted spray bottles.\" src=\"https://imgs.xkcd.com/comics/laser_danger.png\" title=\"To combat the threat, many airlines are installing wing-mounted spray bottles.\" />",
            "title": "Laser Danger"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-27"
}