{
    "articles": [
        {
            "content": [
                "<p>I’ve never published an essay quite like this. I’ve written about my life before, reams of stuff actually, because that’s how I process what I think, but never for public consumption.</p>\n<p>I’ve been pushing myself to write more lately because my co-authors and I have a whole fucking book to write between now and October. After ten years, you’d think this would be getting easier, not harder.</p>\n<p>There’s something about putting out such memoiristic material that feels uncomfortably feminine to me. (Wow, <em>ok</em>.) I want to be known for my work, not for having a dramatic personal life. I love my family and don’t want to put them on display for the world to judge. And I never want the people I care about to feel like I am mining their experiences for clicks and content, whether that’s my family or my coworkers.</p>\n<p>Many of the writing exercises I’ve been doing lately have ended up pulling on threads from my backstory, and the reason I haven’t published them is because I find myself thinking, “this won’t make any sense to people unless they know where I’m coming from.”</p>\n<p>So hey, fuck it, let’s do this.</p>\n<h2>I went to college at the luckiest time</h2>\n<p>I left home when I was 15 years old. I left like a bottle rocket taking off – messy, explosive, a trail of destruction in my wake, and with absolutely zero targeting mechanisms.</p>\n<p>It tells you a lot about how sheltered I was that the only place I could think of to go was university. I had never watched TV or been to a sports game or listened to popular music. I had never been to a doctor, I was quite unvaccinated.</p>\n<p>I grew up in the backwoods of Idaho, the oldest of six, all of us homeschooled. I would go for weeks without seeing anyone other than my family. The only way to pass the time was by reading books or playing piano, so I did quite a lot of both. I called up the University of Idaho, asked for an admissions packet, hand wrote myself a transcript and gave myself all As, drove up and auditioned for the music department, and was offered a partial ride scholarship for classical piano performance.</p>\n<p>I told my parents I was leaving, with or without their blessing or financial support. I left with neither.</p>\n<p>My timing turned out to be flawless. I arrived on the cusp of the Internet age – they were wiring dorms for ethernet the year I enrolled. Maybe even more important, I arrived in the final, fading glory years of affordable state universities.<img alt=\"\" class=\"alignright wp-image-10007\" height=\"153\" src=\"https://i0.wp.com/charity.wtf/wp-content/uploads/2025/06/normal-rainbow.png?resize=153%2C153&#038;ssl=1\" width=\"153\" /></p>\n<p>I worked multiple minimum wage jobs to put myself through school; day care, front desk, laundry, night audit. It was grueling, round the clock labor, but it was possible, if you were stubborn enough. I didn’t have a Social Security number (long story), I wasn’t old enough to take out loans, I couldn’t get financial aid because my parents didn’t file income taxes (again, long story). There was no help coming, I sank or I swam.</p>\n<p>I found computers and the Internet around the same time as it dawned on me that everybody who studied music seemed to end up poor as an adult. I grew up too poor to buy canned vegetables or new underwear; we were like an 1800s family, growing our food, making our clothes, hand-me-downs til they fell apart.</p>\n<p>Fuck being poor. Fuck it so hard. I was out.</p>\n<p>I lost my music scholarship, but I started building websites and running systems for the university, then for local businesses. I dropped out and took a job in San Francisco. I went back, abortively; I dropped out again.</p>\n<p>By the time I was 20 I was back in SF for good, making a salary five times what my father had made.</p>\n<h2>I grew up with a very coherent belief system that did not work for me</h2>\n<p>A lot of young people who flee their fundamentalist upbringing do so because they were abused and/or lost their faith, usually due to the hypocrisy of their leaders. Not me. I left home still believing the whole package – that evolution was a fraud, that the earth was created in seven days, that woman was created from Adam’s rib to be a submissive helpmate for their husband, that birth control was a sin, that anyone who believed differently was going to hell.</p>\n<p>My parents loved us deeply and unshakably, and they were not hypocrites. In the places I grew up, the people who believed in God and went to church and lived a certain way were the ones who had their shit together, and the people who believed differently had broken lives. Reality seemed to confirm the truth of all we were taught, no matter how outlandish it sounds.</p>\n<p>So I fully believed it was all true. I also knew it <em>did not work</em> <em>for me</em>. I did not want a small life. I did not want to be the support system behind some godly dude. I wanted power, money, status, fame, autonomy, success. I wanted to leave a crater in the world.</p>\n<p>I was not a rebellious child, believe it or not. I loved my parents and wanted to make them proud. But as I entered my teens, I became severely depressed, and turned inward and hurt myself in all the ways young people do.</p>\n<p>I left because staying there was killing me, and ultimately, I think my parents let me go because they saw it too.</p>\n<h2>Running away from things worked until it didn’t</h2>\n<p>I didn’t know what I wanted out of life other than <em>all of it; right now</em>, and my first decade out on my own was a hoot. It was in my mid twenties that everything started to fall apart.</p>\n<p>I was an earnest kid who liked to study and think about the meaning of life, but when I bolted, I slammed the door to my conscience shut. I knew I was going to hell, but since I couldn’t live the other way, I made the very practical determination based on actuarial tables that I could to go my own way for a few decades, then repent and clean up my shit before I died. (Judgment Day was one variable that gave me heartburn, since it could come at any time.)</p>\n<p>I was not living in accordance with my personal values and ethics, to put it lightly. I compartmentalized; it didn’t bother me, until it did. It started leaking into my dreams every night, and then it took over my waking life. I was hanging on by a thread; something had to give.</p>\n<p>My way out, unexpectedly, started with politics. I started mainlining books about politics and economics during the Iraq War, which then expanded to history, biology, philosophy, other religious traditions, and everything else. (You can still find a remnant of <a href=\"http://www.hungry.com/~charity/books/2007/\">my reading list here</a>.)</p>\n<p>When I was 13, I had an ecstatic religious experience; I was sitting in church, stewing over going to hell, and was suddenly filled with a glowing sense of warmth and acceptance. It lasted for nearly two weeks, and that’s how I knew I was &#8220;saved&#8221;.</p>\n<p>In my late 20s, after a few years of intense study and research, I had a similar ecstatic experience walking up the stairs from the laundry room. I paused, I thought “maybe there is no God; maybe there is nobody out there judging me; maybe it all makes sense”, and it all clicked into place, and I felt <em>high for days</em>, suffused with peace and joy.<img alt=\"\" class=\"alignright wp-image-10018\" height=\"156\" src=\"https://i0.wp.com/charity.wtf/wp-content/uploads/2025/06/normal-sparkles.png?resize=156%2C156&#038;ssl=1\" width=\"156\" /></p>\n<p>My career didn’t really take off until after that. I always had a job, but I wasn’t thinking about tech after hours. At first I was desperately avoiding my problems and self-medicating, later I became obsessed with finding answers. What did I believe about taxation, public policy, voting systems, the gender binary, health care, the whole messy arc of American history? I was an angry, angry atheist for a while. I filled notebook after notebook with handwritten notes; if I wasn’t working, I was studying.</p>\n<p>And then, gradually, I wound down. The intensity, the high, tapered off. I started dating, realized I was poly and queer, and slowly chilled the fuck out. And that’s when I started being able to dedicate the creative, curious parts of my brain to my job in tech.</p>\n<h2>Why am I telling you all this?</h2>\n<p><a href=\"http://lethain.com\">Will Larson</a> has talked a lot about how his underlying motivation is “<a href=\"https://lethain.com/advancing-the-industry/\">advancing the industry</a>”. I love that for him. He is such a structured thinker and prolific writer, and the industry needs his help, very badly.</p>\n<p>For a while I thought that was my motivation too. And for sure, that’s a big part of it, particularly when it comes to observability and my day job. (Y’all, it does not need to be <em>this hard</em>. Modern observability is the cornerstone and prerequisite for high performing engineering teams, etc etc.)</p>\n<p>But when I think about what really gets me activated on a molecular level, it’s a little bit different. It’s about living a meaningful life, and acting with integrity, and building things of enduring value instead of tearing them down.</p>\n<p>When I say it that way, it sounds like sitting around on the mountain meditating on the meaning of life, and that is not remotely what I mean. Let me try again.</p>\n<h2>For me, work has been a source of liberation</h2>\n<p>It’s very uncool these days to love your job or talk about hard work. But work has always been a source of liberation for me. My work has brought me so much growth and development and community and friendship. It brings meaning to my life, and the joy of creation. I want this for myself. I want this for anyone else who wants it too.</p>\n<p>I understand why this particular tide has turned. So many people have had jobs where their employers demanded total commitment, but felt no responsibility to treat them well or fairly in return. So many people have never experienced work as anything but a depersonalizing grind, or an exercise in exploitation, and that is <em>heartbreaking</em>.<img alt=\"\" class=\"alignright wp-image-10009\" height=\"189\" src=\"https://i0.wp.com/charity.wtf/wp-content/uploads/2025/06/normal-rainbow-black.png?resize=189%2C189&#038;ssl=1\" width=\"189\" /></p>\n<p>I don’t think there’s anything morally superior about people who want their work to be a vehicle for personal growth instead of just a paycheck. I don’t think there’s anything wrong with just wanting a paycheck, or wanting to work the bare minimum to get by. But it’s not what I want for myself, and I don’t think I’m alone in this.</p>\n<p>I feel intense satisfaction and a sense of achievement when I look back on my career. On a practical level, I’ve been able to put family members through college, help with down payments, and support artists in my community. All of this would have been virtually unimaginable to me growing up.</p>\n<p>I worked a lot harder on the farm than I ever have in front of a keyboard, and got a hell of a lot less for my efforts.</p>\n<p>(People who glamorize things like farming, gardening, canning and freezing, taking care of animals, cooking and caretaking, and other forms of manual labor <em>really</em> get under my skin. All of these things make for lovely hobbies, but subsistence labor is neither fun nor meaningful. Trust me on this one.)</p>\n<h2>My engineer/manager pendulum days</h2>\n<p>I <em>loved</em> working as an engineer. I loved how fast the industry changes, and how hard you have to scramble to keep up. I loved the steady supply of problems to fix, systems to design, and endless novel catastrophes to debug. The whole Silicon Valley startup ecosystem felt like it could not have been more perfectly engineered to supply steady drips of dopamine to my brain.</p>\n<p>I <em>liked</em> working as an engineering manager. Eh, that might be an overstatement. But I have strong opinions and I like being in charge, and I really wanted more access to information and influence over decisions, so I pushed my way into the role more than once.</p>\n<p>If <a href=\"http://honeycomb.io\">Honeycomb</a> hadn’t happened, I am sure I would have <a href=\"https://charity.wtf/2017/05/11/the-engineer-manager-pendulum/\">bounced back and forth</a> between <a href=\"https://charity.wtf/2022/03/24/twin-anxieties-of-the-engineer-manager-pendulum/\">engineer and manager</a> for the rest of my career. I never dreamed about climbing the ladder or starting a company. My attitude towards middle management could best be described as <a href=\"https://charity.wtf/2022/01/20/how-engineering-driven-leads-to-engineering-supremacy/\">amiable contempt</a>, and my interest in the business side of things was nonexistent.</p>\n<p>I have always despised people who think they’re too good to work for other people, and that describes far too many of the founders I’ve met.</p>\n<h2>Operating a company draws on a different kind of meaning</h2>\n<p>I got the chance to start a company in 2016, so I took it, almost on a whim. Since then I have done so many things I never expected to do. I’ve been a founder, CEO, CTO, I’ve raised money, hired and fired other execs, run organizations, crafted strategy, and come to better understand and respect the critical role played by sales, marketing, HR, and other departments. No one is more astonished than I am to find me still here, still doing this.</p>\n<p>But there is joy to be found in solving systems problems, even the ones that are less purely technical. There is joy to be found in building a company, or competing in a marketplace.</p>\n<p>To be honest, this is not a joy that came to me swiftly or easily. I’ve been doing this for the past 9.5 years, and I&#8217;ve been <em>happy</em> doing it for maybe the past 2-3 years. But it has always felt like work worth doing. And ultimately, I think I’m less interested in my own happiness (whatever that means) than I am interested in doing<em> work that feels worth doing</em>.</p>\n<p>Work is one of the last remaining places where we are motivated to learn from people we don’t agree with and find common pursuit with people we are ideologically opposed to. I think that’s meaningful. I think it&#8217;s worth doing.</p>\n<h2>Reality doesn’t give a shit about ideology</h2>\n<p>I am a natural born extremist. But when you’re trying to operate a business and win in the marketplace, ideological certainty crashes hard into the rocks of reality. I actually find this deeply motivating.</p>\n<p>I spent years hammering out my own personal ontological beliefs about what is right and just, what makes a life worth living, what responsibilities we have to each another. I didn’t really draw on those beliefs very often as an engineer/manager, at least not consciously.<img alt=\"\" class=\"alignright wp-image-10009\" height=\"167\" src=\"https://i0.wp.com/charity.wtf/wp-content/uploads/2025/06/normal-rainbow-black.png?resize=167%2C167&#038;ssl=1\" width=\"167\" /> That all changed dramatically after starting a company.</p>\n<p>It’s one thing to stand off to the side and critique the way a company is structured and the decisions leaders make about compensation, structure, hiring/firing, etc. But <strong>creation is harder than critique</strong> (one of my favorite <a href=\"https://www.linkedin.com/in/jeffgray/\">Jeff Gray</a> quotes) — so, so, so much harder. And reality resists easy answers.</p>\n<p>Being an adult, to me, has meant making peace with a multiplicity of narratives. The world I was born into had a coherent story and a set of ideals that worked really well for a lot of people, but it was killing me. Not every system works for every person, and that’s okay. That’s life. Startups aren’t for everyone, either.</p>\n<h2>The struggle is what brings your ideals to life</h2>\n<p>Almost every decision you make running a company has some ethical dimension. Yet the foremost responsibility you have to your stakeholders, from investors to employees, is to make the business succeed, to win in the marketplace. Over-rotating on ethical repercussions of every move can easily cause you to get swamped in the details and fail at your prime directive.</p>\n<p>Sometimes you may have a strongly held belief that some mainstream business practice is awful, so you take a different path, and then you learn the hard way why it is that people don&#8217;t take that path. (This has happened to me more times than I can count. <img alt=\"🙈\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/15.1.0/72x72/1f648.png\" style=\"height: 1em;\" />)</p>\n<p>Ideals in a vacuum are just not that interesting. If I wrote an essay droning on and on about &#8220;leading with integrity&#8221;, no one would read it, and nor should they. That&#8217;s boring. What’s interesting is trying to win and do hard things, while honoring your ideals.</p>\n<p>Shooting for the stars and falling short, innovating, building on the frontier of what’s possible, trying but failing, doing exciting things that exceed your hopes and dreams with a team just as ambitious and driven as you are, <em>while also</em> holding your ideals to heart — <em>that’s fucking exciting</em>. That’s what brings your ideals to life.</p>\n<h2>We have lived through the golden age of tech</h2>\n<p>I recognize that I have been profoundly lucky to be employed through the golden age of tech. It’s getting tougher out there to enter the industry, change jobs, or lead with integrity.</p>\n<p>It’s a tough time to be alive, in general. There are macro scale political issues that I have no idea how to solve or fix. Wages used to rise in line with productivity, and now they don’t, and haven’t since the mid 70s. Capital is slurping up all the revenue and workers get an ever decreasing share, and I don’t know how to fix that, either.</p>\n<p>But I don’t buy the argument that just because something has been touched by capitalism or finance it is therefore irreversibly tainted, or that there is no point in making capitalist institutions better. The founding arguments of capitalism were profoundly moral ones, grounded in a keen understanding of human nature. (Adam Smith’s “<a href=\"https://www.goodreads.com/book/show/25698.An_Inquiry_into_the_Nature_and_Causes_of_the_Wealth_of_Nations\">Wealth of Nations</a>” gets all the attention, but his other book, “<a href=\"https://www.goodreads.com/book/show/25700.The_Theory_of_Moral_Sentiments\">Theory of Moral Sentiments</a>”, is even better, and you can’t read one without the other.)</p>\n<p>As a species we are both individualistic and communal, selfish and cooperative, and the miracle of capitalism is how effectively it channels the self-interested side of our nature into the common good.</p>\n<p>Late stage capitalism, however, along with regulatory capture, <a href=\"https://www.rawsignal.ca/newsletter-archive/the-enshittification-of-work/\">enshittification</a>, and the rest of it, has made the modern world brutally unkind to most people. Tech was, for a shining moment in time, a path out of poverty for smart kids who were willing to work their asses off. It’s been the only reliable growth industry of my lifetime.</p>\n<p>It remains, for my money, the best job in the world. <em>Or it can be</em>. It’s collaborative, creative, and fun; we get paid scads of money to sit in front of a computer and solve puzzles all day. So many people seem to be giving up on the idea that work can ever be a place of meaning and collaboration and joy. I think that sucks. It&#8217;s too soon to give up! If we prematurely abandon tech to its most exploitative elements, we guarantee its fate.</p>\n<h2>If you want to change the world, go into business</h2>\n<p>Once upon a time, if you had strongly held ideals and wanted to change the world, you went into government or nonprofit work.</p>\n<p>For better or for worse (okay, <a href=\"https://www.theatlantic.com/magazine/archive/2025/07/government-privatization-feudalism/682888/\">mostly worse</a>), we live in an age where corporate power dominates. If you want to change the world, go into business.</p>\n<p>The world needs, desperately, people with ethics and ideals who can win at business. We can’t let all the people who care about people go into academia or medicine or low wage service jobs. We can’t leave the ranks of middle and upper management to be filled by sycophants and sociopaths.</p>\n<p>There’s nothing sinister about wanting power; what matters is what you do with it. Power, like capitalism, is a tool, and can be bent to powerful ends both good and evil. If you care about people, you should be unashamed about wanting to amass power and climb the<img alt=\"\" class=\"alignright wp-image-10018\" height=\"176\" src=\"https://i0.wp.com/charity.wtf/wp-content/uploads/2025/06/normal-sparkles.png?resize=176%2C176&#038;ssl=1\" width=\"176\" /> ladder.</p>\n<p>There are a lot of so-called best practices in this industry that are utterly ineffective (cough, whiteboarding B-trees in an interview setting), yet they got cargo culted and copied around for years. Why? Because the company that originated the practice made a lot of money. This is stupid, but it also presents an opportunity. All you need to do is be a better company, then make a lot of money. <img alt=\"😉\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/15.1.0/72x72/1f609.png\" style=\"height: 1em;\" /></p>\n<h2>People need institutions</h2>\n<p>I am a fundamentalist at heart, just like my father. I was born to be a bomb thrower and a contrarian, a thorn in the side of the smug moderate establishment. Unfortunately, I was born in an era where literally everyone is a fucking fundamentalist and the establishment is holding on by a thread.</p>\n<p>I’ve come to believe that the most quietly radical, rebellious thing I can possibly do is to be an institutionalist, someone who builds instead of performatively tearing it all down.</p>\n<p>People <em>need</em> institutions. We crave the feeling of belonging to something much larger than ourselves. It’s one of the most universal experiences of our species.</p>\n<p>One of the reasons modern life feels so fragmented and hard is because so many of our institutions have broken down or betrayed the people they were supposed to serve. So many of the associations that used to frame our lives and identities — church, government, military, etc — have tolerated or covered up so much predatory behavior and corruption, it no longer surprises anyone.</p>\n<p>We’ve spent the past few decades ripping down institutions and drifting away from them. But we haven&#8217;t stopped wanting them, or needing them.</p>\n<p>I hope, perhaps naively, that we are entering into a new era of rebuilding, sadder but wiser. An era of building institutions with accountability and integrity, institutions with enduring value, that we can belong to and take pride in… not because we were coerced or deceived, not because they were the only option, but because they bring us joy and meaning. Because we freely choose them, because they are good for us.</p>\n<h2>The second half of your career is about purpose</h2>\n<p>It seems very normal to enter the second half of your <a href=\"https://lethain.com/forty-year-career/\">40 year career</a> thinking a lot about meaning and purpose. You spend the first decade or so hoovering up skill sets, the second finding your place and what feeds you, and then, inevitably, you start to think about what it all means and what your legacy will be.</p>\n<p>That’s definitely where I’m at, as I think about the second half of my career. I want to take risks. I want to play big and win bigger. I want to show that hard work isn’t just a scam inflicted on those who don’t know any better. If we win, I want the people I work with to earn lifechanging amounts of money, so they can buy homes and send their kids to college. I want to show that work can still be an avenue for liberation and community and personal growth, for those of us who still want that.</p>\n<p>I care about this industry and the people in it <em>so much</em>, because it’s been such a gift to me. I want to do what I can to make it a better place for generations to come. I want to build institutions worth belonging to.</p>\n<p>I want the ideals I care about to become associated with success. I want people to cargo cult them and spread them throughout the industry, even if they don’t necessarily understand why. I think that companies that practice transparency can be better companies. I think that leaders held accountable can be better leaders. Let&#8217;s go and prove it.</p>"
            ],
            "link": "https://charity.wtf/2025/07/09/thoughts-on-motivation-and-my-40-year-career/",
            "publishedAt": "2025-07-09",
            "source": "Charity Majors",
            "summary": "I’ve never published an essay quite like this. I’ve written about my life before, reams of stuff actually, because that’s how I process what I think, but never for public consumption. I’ve been pushing myself to write more lately because my co-authors and I have a whole fucking book to write between now and October. [&#8230;]",
            "title": "Thoughts on Motivation and My 40-Year Career"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-07-09_0ae3bce805f0_it-me-photo-by-clint/",
            "publishedAt": "2025-07-09",
            "source": "Harper Reed",
            "summary": "<p>It me. Photo by Clint</p> <figure> <img alt=\"image_1.jpg\" height=\"3203\" src=\"https://harper.blog/notes/2025-07-09_0ae3bce805f0_it-me-photo-by-clint/image_1.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #273"
        },
        {
            "content": [
                "<p>Steven Byrnes is a physicist/AI researcher/amateur neuroscientist; needless to say, he blogs on Less Wrong. I finally got around to reading <strong><a href=\"https://www.lesswrong.com/s/qhdHbCJ3PYesL9dde\">his 2024 series giving a predictive processing perspective on intuitive self-models</a></strong>. If that sounds boring, it shouldn&#8217;t: Byrnes charges head-on into some of the toughest subjects in psychology, including trance, amnesia, and multiple personalities. I found his perspective enlightening (no pun intended; meditation is another one of his topics) and thought I would share. </p><p>It all centers around this picture:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!v7ZB!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F39854132-188a-4637-9b79-99b055ea5e89_287x234.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"234\" src=\"https://substackcdn.com/image/fetch/$s_!v7ZB!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F39854132-188a-4637-9b79-99b055ea5e89_287x234.png\" width=\"287\" /><div></div></div></a></figure></div><p>But first: some excruciatingly obvious philosophical preliminaries.</p><p>We don&#8217;t directly perceive the external world. Every philosopher has their own way of saying exactly what it is we <em>do</em> perceive, but the predictive processing interpretation is that we perceive our models of the world. To be very naive and hand-wavey, lower-level brain centers get sense-data, make a guess about what produced that sense data, then &#8220;show&#8221; &#8220;us&#8221; that guess. If the guess is wrong, too bad - we see the incorrect guess, not the reality. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!_BX7!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86653208-6e50-41b1-aa6a-4372b0df3885_638x250.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"250\" src=\"https://substackcdn.com/image/fetch/$s_!_BX7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86653208-6e50-41b1-aa6a-4372b0df3885_638x250.png\" width=\"638\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Don&#8217;t @ me</figcaption></figure></div><p>So for example:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!8o3j!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9430f1c8-5828-4668-89f9-91ca64119742_1280x974.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"439.821875\" src=\"https://substackcdn.com/image/fetch/$s_!8o3j!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9430f1c8-5828-4668-89f9-91ca64119742_1280x974.png\" width=\"578\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>In the famous &#8220;checker shadow illusion&#8221;, Square A and Square B are the same color (<a href=\"https://en.wikipedia.org/wiki/Checker_shadow_illusion#/media/File:Grey_square_optical_illusion_proof2.svg\">see here if you disbelieve</a>). Our lower-level brain centers guess that, given the shadowing, our sense-data about Square A must &#8220;actually&#8221; be produced by a &#8220;really&#8221; black square, and our sense-data about Square B must &#8220;actually&#8221; be produced by a &#8220;really&#8221; white square. Therefore, they &#8220;show&#8221; &#8220;us&#8221; a &#8220;picture&#8221; of Square A being black and Square B being white, even though these aren&#8217;t the real colors.</p><p>The &#8220;blind spot&#8221; is an even more famous example. The place where the optic nerve meets the eye lacks photoreceptors, leading to a 5-10 degree hole in the middle of the visual field - there&#8217;s a medium-sized spot in your vision where you can&#8217;t see anything at all. But our lower-level brain centers guess that probably there&#8217;s just, you know, normal stuff there. Therefore, they &#8220;show&#8221; &#8220;us&#8221; a &#8220;picture&#8221; of an intact world with normal stuff in the blind spot area - safe enough, unless there&#8217;s really an oncoming car.</p><p>Why did we go through these excruciatingly obvious philosophical preliminaries? </p><p>Sometimes, two or more models can explain the same data about equally well. For example:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!v7ZB!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F39854132-188a-4637-9b79-99b055ea5e89_287x234.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"234\" src=\"https://substackcdn.com/image/fetch/$s_!v7ZB!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F39854132-188a-4637-9b79-99b055ea5e89_287x234.png\" title=\"\" width=\"287\" /><div></div></div></a></figure></div><p>This picture can be either a right-side-up staircase (with the blue side in front, and the green side as the back wall), or an upside-down staircase (with the green side in front, and the blue side as the back wall). </p><p>If you&#8217;re like most people, you probably don&#8217;t see it as ambiguous. You see one of these as immediately obviously and viscerally true - for me, it&#8217;s the right-side-up blue-in-front staircase. Then, if you stare at it enough and move your eyes in weird ways or whatever, it &#8220;flips&#8221;, so that it&#8217;s immediately obviously and viscerally an upside-down green-in-front staircase.</p><p>(if you can&#8217;t do this, try staring at the green part and imagining it gradually moving towards you, out of the computer, while thinking &#8220;this is in front, this is in front&#8221; really hard - I believe in you!)</p><p>This kind of picture is called a bi-stable image. You viscerally see your brain&#8217;s educated guesses as real. When your brain&#8217;s guess changes, your visceral perception changes too.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!xOJ4!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F45f662e8-aa19-45a8-89e6-eedb6eaebb3f_728x568.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"452.5274725274725\" src=\"https://substackcdn.com/image/fetch/$s_!xOJ4!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F45f662e8-aa19-45a8-89e6-eedb6eaebb3f_728x568.png\" width=\"580\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>This illusion is usually described as &#8220;all the plates are right-side-up except one - when you find it, they will all turn upside-down&#8221;. I think that might be fake - they&#8217;re all right-side-up, but something about the process of looking for &#8220;the upside-down one&#8221; can make your brain flip from one model to the other and cause the plates to change sides. I find this is easiest to do looking at the square one in the top center, or the round one just below, but I don&#8217;t think that&#8217;s because they&#8217;re the &#8220;actually upside-down one&#8221;. If that doesn&#8217;t work, try viewing it from about ten feet away from your computer screen, but be careful - you might not be able to get them to flip back to right-side-up again!</p><div class=\"youtube-wrap\" id=\"youtube2-HvssmFb1-0s\"><div class=\"youtube-inner\"></div></div><p>The train is either going into the tunnel, or coming out of the tunnel. You can make it switch by quickly moving your eyes either left-to-right or vice versa, or by thinking very hard about the train going in or out.</p><div class=\"youtube-wrap\" id=\"youtube2-k7ByqGTfLuk\"><div class=\"youtube-inner\"></div></div><p>This might be the toughest one to flip. If you start by seeing her spin clockwise, try focusing on her central foot to switch directions; if you start by seeing her spin counter-clockwise, try focusing on the <em>reflection</em> of her <em>outstretched</em> foot when it appears.</p><p>Which of these models - the clockwise dancer, or the counterclockwise dancer - is real? Trick question - neither is real. There is no dancer and no rotation; you&#8217;re actually viewing shifting pixels on a computer screen. </p><p>To belabor the excruciatingly obvious philosophical preliminaries: there is some sense in which our models of the world are very good. They usually correspond to reality exactly the way we think they do. The perception of world-models isn&#8217;t a reason for radical skepticism.</p><p>In another sense - not a very profound one - our models of the world are distorted. For example, they make us see rotation where there are really just shifting pixels. They&#8217;re also ambiguous enough to occasionally be bi-stable - sometimes, you can shift from one world-model to another, with an associated change in visceral perception.</p><h3>From Models To Self-Models</h3><p>Just as this is true for external senses like vision, Byrnes says this is true of our internal perceptions - perceptions of things like thoughts, desires, and conscious experience.</p><p>The &#8220;reality&#8221; of our inner experience is patterns of neurons firing in response to sensations or other neurons. This is a boring claim, like saying that the spinning dancer is &#8220;really&#8221; &#8220;just&#8221; &#8220;shifting&#8221; &#8220;pixels&#8221;, but let&#8217;s explore it a little more.</p><p>Sometimes, enough neurons representing similar concepts fire at the same time that they form some kind of temporarily stable pattern that takes over the global workspace. </p><p>Sometimes, a pattern like this knits together enough concepts to represent a world-state and give positive valence to that world-state.</p><p>Sometimes, those patterns reach a threshold where they cross over to the motor cortex and activate motor programs elsewhere in the body. </p><p>If this is the &#8220;shifting pixels&#8221; perspective, what&#8217;s the &#8220;looks like a dancer who is spinning around&#8221; perspective?</p><p><em>&#8220;Sometimes, enough neurons representing similar concepts fire at the same time that they form some kind of temporarily stable pattern that takes over the global workspace&#8221;</em> &#8594; <strong>I thought about X</strong></p><p><em>&#8220;Sometimes, a pattern like this knits together enough concepts to represent a world-state and give positive valence to that world-state.&#8221; &#8594; </em><strong>I want X</strong></p><p><em>&#8220;Sometimes, those patterns reach a threshold where they cross over to the motor cortex and activate motor programs elsewhere in the body.&#8220; &#8594; </em><strong>I decided to X</strong></p><p>The &#8220;model&#8221; that people come up with to explain their inner life is the internal feeling of a separate &#8220;self&#8221; who reviews and signs off on the decisions of &#8220;the brain&#8221;. Referring to the philosophical tradition and pictures like this&#8230;</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!xaFj!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb77e62d3-8ac6-4641-bc07-457b456bcfcf_1427x1233.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"454.4905395935529\" src=\"https://substackcdn.com/image/fetch/$s_!xaFj!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb77e62d3-8ac6-4641-bc07-457b456bcfcf_1427x1233.png\" width=\"526\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>&#8230;Byrnes calls it the &#8220;homunculus&#8221; (Latin: &#8220;little man&#8221;).</p><p>The homunculus (&#8220;self&#8221;/&#8221;me&#8221;) is a useful tool for organizing internal experience. For example, if you have a seizure and your arm moves, you can say &#8220;<strong>I</strong> didn&#8217;t <strong>choose</strong> to move my arm - it just moved of its own accord!&#8221; (ie the homunculus isn&#8217;t doing the moving). If you have some kind of OCD or rumination disorder, you can say &#8220;<strong>I </strong>don&#8217;t <strong>want</strong> to keep <strong>having</strong> these <strong>thoughts</strong> about death, they just pop <strong>unbidden</strong> into <strong>my</strong> mind&#8221; (ie the homunculus isn&#8217;t doing the thinking). To actually analyze these situations would require a PhD in neuroscience, but we all understand the visceral experience of being stuck with thoughts that &#8220;we&#8221; don&#8217;t &#8220;want&#8221; and didn&#8217;t &#8220;cause&#8221;. Overall it&#8217;s very similar to the way I described natural intuitive &#8220;theory of mind&#8221; <a href=\"https://slatestarcodex.com/2020/06/01/book-review-origin-of-consciousness-in-the-breakdown-of-the-bicameral-mind/\">here</a>:</p><blockquote><p>The mind is an imaginary space containing things like thoughts, emotions, and desires. I have mine and you have yours. I can see what&#8217;s inside my mind, but not what&#8217;s inside your mind, and vice versa. I mostly choose the things that are in my mind at any given time: I will thoughts to happen, and they happen; I will myself to make a decision, and it gets made. This needs a resource called willpower; if I don&#8217;t have enough willpower, sometimes the things that happen in my mind aren&#8217;t the ones I want. When important things happen, sometimes my mind gets strong emotions; this is natural, but I need to use lots of willpower to make sure I don&#8217;t get overwhelmed by them and make bad decisions.</p></blockquote><p>Byrnes makes this more concrete with a survey of homunculus beliefs across different cultures. We place the homunculus in the head, which happens to be correct (ie thoughts happen in the brain). But this is kind of a coincidence (or maybe downstream of knowing the real science); other cultures feel like the seat of consciousness is in the heart or the belly, and this feeling is about equally plausible and stable. Meditators say that with enough practice, they can imagine their consciousness being in their head, heart, belly, or outside their body entirely.</p><p>This is a subtle point (are you starting to see why we went through all the excruciatingly obvious philosophical preliminaries?) There is, in fact, a brain that has thoughts, located in your head. And your visceral experience includes a term for a self that has thoughts and is located in your head. But they&#8217;re not exactly the same thing. The trivial differences don&#8217;t matter in ordinary cases. But in edge cases, they can get pretty weird.</p><h3>Trance And Spirit Possession</h3><p>Okay, now the fun stuff.</p><p>Byrnes argues that &#8220;homunculus&#8221; vs. &#8220;trance&#8221; are two alternative bistable models for analyzing internal mental experience. The process of going into a trance (or being &#8220;possessed&#8221; by a spirit) is conceptually similar to the process of switching the dancer from clockwise to counterclockwise. The process goes:</p><ol><li><p>Start with a strong background belief that the new model is plausible.</p></li><li><p>Relax.</p></li><li><p>Suppress all evidence favoring the old model.</p></li><li><p>Gather evidence favoring the new model.</p></li></ol><p>First, start with a background belief that the new model is plausible. If you&#8217;re getting hypnotized, it helps to believe that hypnotism works. If you&#8217;re in a spirit possession ceremony, it helps to believe in spirits. Hypnotists and shamans should help this process along by being inherently believable - charismatic and confident, with lots of suggestive ritual that they perform correctly.</p><p>Second, relax. When you were trying to switch the direction of the dancer, you probably did this naturally - let your eyes get slightly out of focus, concentrated on the task in front of you.</p><p>Third, suppress all evidence favoring the old model. In the case of trance/possession, stop doing obvious voluntary actions. Watch a stage hypnotist show, and nobody is performing a running commentary: &#8220;Yeah, I&#8217;m focusing on the swinging pendulum . . . looks pretty normal . . . guess maybe I&#8217;m starting to feel sleepy . . . I wonder if this hypnotist is a fraud . . . &#8220;. They&#8217;re supposed to be quiet, immobile, and focus on the trance. Likewise, possession ceremonies often begin with hours of ritual dancing; by the end, it feels like your feet are moving of their own accord. Certainly you are not consciously choosing where to put your feet at each moment due to rational considerations.</p><p>Fourth, gather evidence favoring the new model. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!6MFL!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F040b6231-12ef-42ca-a04d-8696b31616e1_1170x538.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"252.9059829059829\" src=\"https://substackcdn.com/image/fetch/$s_!6MFL!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F040b6231-12ef-42ca-a04d-8696b31616e1_1170x538.png\" title=\"\" width=\"550\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">A bistable percept that switches form based on context and evidence. When the context provides evidence for &#8220;H&#8221;, the middle letter is automatically processed as an &#8220;H&#8221;; when the context provides evidence for &#8220;A&#8221;, it is processed as &#8220;A&#8221;.</figcaption></figure></div><p>In a typical stage hypnosis show, the hypnotist starts by making his subject watch a swinging pendulum (moving eyes back and forth tends to make people sleepy and exhaust their eye muscles). Then the hypnotist says &#8220;You are getting sleepy . . . your eyelids are getting heavy.&#8221; The subject is surprised! They <em>are</em> feeling unexpectedly sleepy! Their eyelids <em>are</em> getting unexpectedly heavy! It seems like the hypnotist is in control of their body!</p><p>Then the hypnotist asks them to do something simple, like hold their arm out. Is this part of the induction process? The first hypnotic suggestion? Hard to tell - in either case, the subject moves their arm out. Then the hypnotist might say something like &#8220;Raise your arm&#8221;. It&#8217;s a reasonable request - and also, when the arm is in a sufficiently unstable position, sometimes just <em>considering </em>movement will cause it to move a little, even without the mental motion that would usually be considered &#8220;volition&#8221;. Again, it seems like the hypnotist is in control and has creepy mind powers!</p><p>Then the hypnotist might ask the subject to do something simple, like jump. The hypnotist is a high-status person reputed to have creepy mind powers, giving a direct order. The audience is expecting the subject to jump. If the subject doesn&#8217;t jump, the show will be over and it will be awkward for everyone involved. So there are compelling reasons for the subject to jump, and no reason not to. The subject notices the amount of internal mental pressure that naturally corresponds to &#8220;there are compelling reasons to do this thing&#8221;. Why (they might unconsciously think to themselves) is there this mental pressure to jump? One answer is the story we just told - command from high-status person, not wanting to feel awkward, etc - but these are much more subtle and complicated than a simple alternative hypothesis - <em>the hypnotist has creepy mind powers and is giving me a compulsion to jump</em>. If all the previous steps have been completed correctly, there is a visceral flip in mental models, and the subject feels what was previously a working hypothesis as intuitive obvious ground truth - &#8220;I have lost control of my body and the hypnotist is puppeteering me&#8221;.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!qkp8!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F849df106-9aef-446f-b05d-5e42afd966cf_1600x900.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"317.25\" src=\"https://substackcdn.com/image/fetch/$s_!qkp8!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F849df106-9aef-446f-b05d-5e42afd966cf_1600x900.png\" width=\"564\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Byrnes gets much of his information from the book <em>Impro </em>by Keith Johnstone, an acting coach who uses spirit possession techniques to get his students &#8220;possessed&#8221; by their characters. In one case, Johnstone uses a particularly memorable technique to provide his student with &#8220;evidence&#8221;. The student is to be possessed by a god. Johnstone sets them an ESP task: they must pick which of three cups has a coin under it. Unbeknownst to them, Johnstone puts coins under all three cups, so the student guesses right every time. This creates a background of suspended reality that probably makes the &#8220;possessed by a god&#8221; hypothesis feel very compelling!</figcaption></figure></div><p>This flip itself reinforces the trance - my new evidence in favor of trance is not just background beliefs about possession, but the visceral feeling of losing control of my body, plus the undeniable fact that I just jumped when there was (seemingly) no reason to do so. The trance state is now a new attractor, not quite as strong as the old homunculus attractor (&#8220;I am in control of my mind&#8221; really does explain a lot, and has decades of experience/inertia behind it&#8221;), but strong enough to usually last for an hour-long hypnosis show without collapsing. </p><p>I couldn&#8217;t find that much about this in Byrnes, but the model flip itself must go back and affect ground-truth reality. &#8220;Hypnotist is compelling me&#8221; provides evidence for &#8220;I follow the hypnotist&#8217;s orders&#8221;, and therefore makes me slightly more likely to do so. It also frees me from some common reasons I wouldn&#8217;t follow the hypnotist&#8217;s orders - it&#8217;s too embarrassing, it would never work, it&#8217;s &#8216;not the kind of person I am&#8217;. Maybe the hypnotist orders me to do a silly dance on stage, and normally I&#8217;m too dignified, but since &#8220;the hypnotist is compelling me&#8221;, it doesn&#8217;t threaten my dignity and I can get away with it.</p><p>Byrnes also adds (we&#8217;ll see why later) a postulate that doesn&#8217;t really make sense to me on its own - something about the self-model assists in the formation of memory. Remembering &#8220;I did a silly dance on stage&#8221; is easier if there is an &#8220;I&#8221; concept active to &#8220;hang the memory&#8221; on. This could be related to the finding that people remember things better in the same context they learned it (eg you&#8217;ll do better on a test in the same classroom where you learned the material) or to the finding that emotions organize memory (eg when you&#8217;re angry at your spouse, it&#8217;s easy to remember all the times they&#8217;ve ever wronged you; when you&#8217;re happy with them, it&#8217;s easy to remember all the good times you&#8217;ve had together). &#8220;The self exists&#8221; is a pretty dramatic context cue, and maintaining memory between self-models is apparently a pretty tough task - hence the tendency for people to say they &#8220;don&#8217;t remember&#8221; what happened during a trance.</p><h3>From Trance To Everything Else</h3><p>Now we have the material we need to explain all sorts of weird mental phenomena:</p><p><strong>Dissociative Amnesia</strong></p><p>Someone with a desire that doesn&#8217;t make sense in the context of their normal personality eventually &#8220;flips&#8221; to an alternative personality that carries out the desire. When they recover, they have no memory of the incident.</p><p><strong>Dissociative Identity (IE Multiple Personality)</strong></p><p>If the homunculus-self is a mostly-accurate but not-directly-perceived-and-real model of mental processes, then a person whose mental processes often flip between two or more dramatically different states (for example, borderlines, who are notable for very strong emotional states and <a href=\"https://en.wikipedia.org/wiki/Splitting_(psychology)\">&#8220;splitting&#8221;</a>) may gather evidence for and eventually flip to a model of themselves as multiple different homunculi. This is especially true if they&#8217;re primed with the suggestion that this is a likely way for the inside of their mind to be (for example, by a psychotherapist who believes in multiple personalities).</p><p><strong>Ego Death (EG On Ketamine)</strong></p><p>Remember, the ego (homunculus) is a model of mental processes. which says that thoughts arise in the brain because &#8220;I&#8221; &#8220;choose&#8221; to &#8220;have&#8221; thoughts, or actions happen because &#8220;I&#8221; &#8220;voluntarily&#8221; &#8220;make&#8221; the decisions. </p><p>From a god&#8217;s eye view, outside of the homunculus model, we might picture a decision as looking like:</p><ul><li><p>A thought arises: &#8220;Maybe it would be a good idea to eat a taco&#8221;.</p></li><li><p>This thought spawns other thoughts: &#8220;Tacos are delicious&#8221;, &#8220;Tacos are expensive&#8221;, &#8220;I&#8217;m on a diet&#8221;.</p></li><li><p>All of these thoughts kind of battle it out until they turn into a unified analysis of the situation &#8220;Tacos are expensive, but I deserve a treat, so I&#8217;m going to have one&#8221;.</p></li><li><p>The basal ganglia and motor cortex implement an action program: I order a taco.</p></li></ul><p>Within the homunculus model, this orderly progression of events is what we interpret as &#8220;<em>I</em> <em>thought</em> about it and <em>decided</em> to order a taco&#8221;.</p><p>On sufficiently weird drugs like ketamine, mental order breaks down. The relationship between one thought and the next is completely chaotic, or at least too complicated to model. The expectations of the homunculus-model, where thoughts naturally lead to consequences according to stable personality features, are profoundly violated. Since the homunculus model no longer credibly describes the data, the brain ditches it, and the drug user viscerally feels like they have &#8220;lost sense of self&#8221; or &#8220;experienced ego death&#8221;.</p><p><strong>Buddhist Enlightenment</strong></p><p>If you watch your own mental processes very very hard for a long time, you notice subtle ways that the homunculus model is incorrect. For example, if you carefully watch thoughts form, it&#8217;s obvious that &#8220;you&#8221; didn&#8217;t &#8220;decide&#8221; to &#8220;think&#8221; them; they just arose out of the void (or out of casual antecedents like sense-data or previous thoughts). If you watch mental decision very very carefully for a long time, you notice the same things <a href=\"https://en.wikipedia.org/wiki/Neuroscience_of_free_will\">the Libet experiment</a> noticed, where they seem to often happen before &#8220;consciousness&#8221; is &#8220;aware&#8221; of the decision at all. These all provide evidence against the homunculus model. After enough evidence builds up, you suddenly flip from the homunculus model to some other model which is closer to the god&#8217;s-eye one mentioned above - there&#8217;s no self, thoughts arise on their own, you are part of the same nexus of causal processes which determine the rest of the world.</p><p>I like this because it explains something I&#8217;ve always found baffling - the claim that <em>satori</em> happens in a single instant (traditionally when you see a falling leaf, or your master hits you on the head with a stick, or something like that). Not many things in psychology happen instantaneously - but one of them is the flip in bistable perceptions!</p><p><strong>Julian Jaynes</strong></p><p>Jaynes was the psychologist and historian who gathered an exhaustive collection of sources suggesting that Bronze Age people didn&#8217;t experience consciousness the way we did - instead feeling like they were automata being commanded by the gods to do whatever they did.</p><p>Byrnes spends most of this section arguing against Jaynes (comparatively weak) claim that ancient people were incapable of deception and other basic theory-of-mind tasks, but seems mostly willing to grant the more sensational claim that they felt their actions more akin to a hypnotist&#8217;s compulsion than to self-motivated agency. None of this is especially surprising by the discussion of trance above - it&#8217;s just a whole civilization using the &#8220;spirit possession&#8221; model at scale. </p><p>See <a href=\"https://slatestarcodex.com/2020/06/01/book-review-origin-of-consciousness-in-the-breakdown-of-the-bicameral-mind/\">my previous review of Jaynes</a> for more.</p><p>I&#8217;ll spare you the discussion of free will - which tends to make people really mad, and which is basically what you would predict given the background assumptions - but I recommend reading the <a href=\"https://www.lesswrong.com/s/qhdHbCJ3PYesL9dde\">entire series of essays</a>, which goes into much more depth and belabors the excruciatingly obvious philosophical assumptions enough to make them really sink in on a deep level. </p><p>Byrnes also has a wide range of writing on <a href=\"https://www.lesswrong.com/s/6uDBPacS6zDipqbZ9\">other areas of neuroscience</a> and on <a href=\"https://sjbyrnes.com/agi.html\">AI alignment</a>.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/practically-a-book-review-byrnes",
            "publishedAt": "2025-07-09",
            "source": "SlateStarCodex",
            "summary": "<p>Steven Byrnes is a physicist/AI researcher/amateur neuroscientist; needless to say, he blogs on Less Wrong. I finally got around to reading <strong><a href=\"https://www.lesswrong.com/s/qhdHbCJ3PYesL9dde\">his 2024 series giving a predictive processing perspective on intuitive self-models</a></strong>. If that sounds boring, it shouldn&#8217;t: Byrnes charges head-on into some of the toughest subjects in psychology, including trance, amnesia, and multiple personalities. I found his perspective enlightening (no pun intended; meditation is another one of his topics) and thought I would share. </p><p>It all centers around this picture:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!v7ZB!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F39854132-188a-4637-9b79-99b055ea5e89_287x234.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"234\" src=\"https://substackcdn.com/image/fetch/$s_!v7ZB!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F39854132-188a-4637-9b79-99b055ea5e89_287x234.png\" width=\"287\" /><div></div></div></a></figure></div><p>But first: some excruciatingly obvious philosophical preliminaries.</p><p>We don&#8217;t directly perceive the external world. Every philosopher has their own way of saying exactly what it is we <em>do</em> perceive, but the predictive processing interpretation is that we perceive our models of the world. To be very naive and hand-wavey, lower-level brain centers get sense-data, make a guess about what produced that sense data, then &#8220;show&#8221; &#8220;us&#8221; that guess. If the guess is wrong, too bad - we see the incorrect guess, not the reality. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!_BX7!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86653208-6e50-41b1-aa6a-4372b0df3885_638x250.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"250\" src=\"https://substackcdn.com/image/fetch/$s_!_BX7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86653208-6e50-41b1-aa6a-4372b0df3885_638x250.png\" width=\"638\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft",
            "title": "Practically-A-Book Review: Byrnes on Trance"
        },
        {
            "content": [
                "<p>Techaro services were down for IPv4 traffic on July 9th, 2025. This blogpost is a report of what happened, what actions were taken to resolve the situation, and what actions are being done in the near future to prevent this problem. Enjoy this incident report!</p>\n        <div class=\"flex space-x-2 bg-bg-soft dark:bg-bgDark-soft mx-auto min-h-fit\n        lg:w-[80ch] sm:w-[65ch] w-full\n        lg:p-4 p-2\n        // Base styles for all messages\n        mt-0 mb-0 rounded-none\n        // First message styles\n        first:mt-4 first:rounded-t-lg first:pb-2\n        // Last message styles\n        last:mb-4 last:rounded-b-lg last:pt-1\n        // Middle message top/bottom adjustment\n        [&amp;:not(:first-child)]:-mt-[1px] [&amp;:not(:first-child)]:py-1\"><div class=\"h-16 not-prose\"><img alt=\"Numa is smug\" class=\"h-16 w-16 rounded-xs\" src=\"https://stickers.xeiaso.net/sticker/numa/smug\" /></div><div class=\"flex-1 min-w-0\"><span class=\"font-semibold text-sm block mb-1\"><a href=\"https://xeiaso.net/characters#numa\">Numa</a></span><span class=\"mx-auto\"></span><div class=\"text-fg-1 dark:text-fgDark-1 text-sm prose-p:my-2\"><p>In other companies, this kind of documentation would be kept internal. At Techaro, we believe that you deserve radical candor and the truth. As such, we are proving our lofty words with actions by publishing details about how things go wrong publicly.</p><p>Everything past this point follows my standard incident root cause meeting template.</p></div></div></div>\n        <p>This incident report will focus on the services affected, timeline of what happened at which stage of the incident, where we got lucky, the root cause analysis, and what action items are being planned or taken to prevent this from happening in the future.</p>\n        <h2>Timeline</h2>\n        <p>All events take place on July 9th, 2025.</p>\n        <table><thead><tr><th style=\"text-align: left;\">Time (UTC)</th><th style=\"text-align: left;\">Description</th></tr></thead><tbody><tr><td style=\"text-align: left;\">12:32</td><td style=\"text-align: left;\">Uptime Kuma reports that another unrelated website on the same cluster was timing out.</td></tr><tr><td style=\"text-align: left;\">12:33</td><td style=\"text-align: left;\">Uptime Kuma reports that Thoth's production endpoint is failing gRPC health checks.</td></tr><tr><td style=\"text-align: left;\">12:35</td><td style=\"text-align: left;\">Investigation begins, <a href=\"https://bsky.app/profile/xeiaso.net/post/3ltjtdczpwc2x\">announcement made on Xe's Bluesky</a> due to the impact including their personal blog.</td></tr><tr><td style=\"text-align: left;\">12:39</td><td style=\"text-align: left;\"><code>nginx-ingress</code> logs on the production cluster show IPv6 traffic but an abrupt cutoff in IPv4 traffic around 12:32 UTC. Ticket is opened with the hosting provider.</td></tr><tr><td style=\"text-align: left;\">12:41</td><td style=\"text-align: left;\">IPv4 traffic resumes long enough for Uptime Kuma to report uptime, but then immediately fails again.</td></tr><tr><td style=\"text-align: left;\">12:46</td><td style=\"text-align: left;\">IPv4 traffic resumes long enough for Uptime Kuma to report uptime, but then immediately fails again. (repeat instances of this have been scrubbed, but it happened about every 5-10 minutes)</td></tr><tr><td style=\"text-align: left;\">12:48</td><td style=\"text-align: left;\">First reply from the hosting provider.</td></tr><tr><td style=\"text-align: left;\">12:57</td><td style=\"text-align: left;\">Reply to hosting provider, ask to reboot the load balancer.</td></tr><tr><td style=\"text-align: left;\">13:00</td><td style=\"text-align: left;\">Incident responder because busy due to a meeting under the belief that the downtime was out of their control and that uptime monitoring software would let them know if it came back up.</td></tr><tr><td style=\"text-align: left;\">13:20</td><td style=\"text-align: left;\">Incident responder ended meeting and went back to monitoring downtime and preparing this document.</td></tr><tr><td style=\"text-align: left;\">13:34</td><td style=\"text-align: left;\">IPv4 traffic starts to show up in the <code>ingress-nginx</code> logs.</td></tr><tr><td style=\"text-align: left;\">13:35</td><td style=\"text-align: left;\">All services start to report healthy. Incident status changes to monitoring.</td></tr><tr><td style=\"text-align: left;\">13:48</td><td style=\"text-align: left;\">Incident closed.</td></tr><tr><td style=\"text-align: left;\">14:07</td><td style=\"text-align: left;\">Incident re-opened. Issues seem to be manifesting as BGP issues in the upstream provider.</td></tr><tr><td style=\"text-align: left;\">14:10</td><td style=\"text-align: left;\">IPv4 traffic resumes and then stops.</td></tr><tr><td style=\"text-align: left;\">14:18</td><td style=\"text-align: left;\">IPv4 traffic resumes again. Incident status changes to monitoring.</td></tr><tr><td style=\"text-align: left;\">14:40</td><td style=\"text-align: left;\">Incident closed.</td></tr></tbody></table>\n        <h2>Services affected</h2>\n        <table><thead><tr><th style=\"text-align: left;\">Service name</th><th style=\"text-align: left;\">User impact</th></tr></thead><tbody><tr><td style=\"text-align: left;\"><a href=\"https://anubis.techaro.lol/\">Anubis Docs</a> (IPv4)</td><td style=\"text-align: left;\">Connection timeout</td></tr><tr><td style=\"text-align: left;\"><a href=\"https://anubis.techaro.lol/\">Anubis Docs</a> (IPv6)</td><td style=\"text-align: left;\">None</td></tr><tr><td style=\"text-align: left;\"><a href=\"https://xeiaso.net/docs/admin/thoth/\">Thoth</a> (IPv4)</td><td style=\"text-align: left;\">Connection timeout</td></tr><tr><td style=\"text-align: left;\"><a href=\"https://xeiaso.net/docs/admin/thoth/\">Thoth</a> (IPv6)</td><td style=\"text-align: left;\">None</td></tr><tr><td style=\"text-align: left;\">Other websites colocated on the same cluster (IPv4)</td><td style=\"text-align: left;\">Connection timeout</td></tr><tr><td style=\"text-align: left;\">Other websites colocated on the same cluster (IPv6)</td><td style=\"text-align: left;\">None</td></tr></tbody></table>\n        <h2>Root cause analysis</h2>\n        <p>In simplify server management, Techaro runs a <a href=\"https://kubernetes.io/\">Kubernetes</a> cluster on <a href=\"https://www.vultr.com/kubernetes/\">Vultr VKE</a> (Vultr Kubernetes Engine). When you do this, Vultr needs to provision a <a href=\"https://docs.vultr.com/how-to-use-a-vultr-load-balancer-with-vke\">load balancer</a> to bridge the gap between the outside world and the Kubernetes world, kinda like this:</p>\n        <pre class=\"language-mermaid\"><code class=\"language-mermaid code-highlight\"><span class=\"code-line\"><span class=\"token arrow operator\">---</span>\n        </span><span class=\"code-line\">title<span class=\"token operator\">:</span> Overall architecture\n        </span><span class=\"code-line\"><span class=\"token arrow operator\">---</span>\n        </span><span class=\"code-line\">\n        </span><span class=\"code-line\"><span class=\"token keyword\">flowchart</span> LR\n        </span><span class=\"code-line\">    UT<span class=\"token text string\">(User Traffic)</span>\n        </span><span class=\"code-line\">    <span class=\"token keyword\">subgraph</span> Provider Infrastructure\n        </span><span class=\"code-line\">      LB<span class=\"token text string\">[Load Balancer]</span>\n        </span><span class=\"code-line\">    <span class=\"token keyword\">end</span>\n        </span><span class=\"code-line\">    <span class=\"token keyword\">subgraph</span> Kubernetes\n        </span><span class=\"code-line\">        IN<span class=\"token text string\">(ingress-nginx)</span>\n        </span><span class=\"code-line\">        TH<span class=\"token text string\">(Thoth)</span>\n        </span><span class=\"code-line\">        AN<span class=\"token text string\">(Anubis Docs)</span>\n        </span><span class=\"code-line\">        OS<span class=\"token text string\">(Other sites)</span>\n        </span><span class=\"code-line\">\n        </span><span class=\"code-line\">        IN <span class=\"token arrow operator\">--></span> TH\n        </span><span class=\"code-line\">        IN <span class=\"token arrow operator\">--></span> AN\n        </span><span class=\"code-line\">        IN <span class=\"token arrow operator\">--></span> OS\n        </span><span class=\"code-line\">    <span class=\"token keyword\">end</span>\n        </span><span class=\"code-line\">\n        </span><span class=\"code-line\">    UT <span class=\"token arrow operator\">--></span> LB <span class=\"token arrow operator\">--></span> IN\n        </span></code></pre>\n        <p>Techaro controls everything inside the Kubernetes side of that diagram. Anything else is out of our control. That load balancer is routed to the public internet via <a href=\"https://en.wikipedia.org/wiki/Border_Gateway_Protocol\">Border Gateway Protocol (BGP)</a>.</p>\n        <p>If there is an interruption with the BGP sessions in the upstream provider, this can manifest as things either not working or inconsistently working. This is made more difficult by the fact that the IPv4 and IPv6 internets are technically separate networks. With this in mind, it's very possible to have IPv4 traffic fail but not IPv6 traffic.</p>\n        <p>The root cause is that the hosting provider we use for production services had flapping IPv4 BGP sessions in its Toronto region. When this happens all we can do is open a ticket and wait for it to come back up.</p>\n        <h2>Where we got lucky</h2>\n        <p>The Uptime Kuma instance that caught this incident runs on an IPv4-only network. If it was dual stack, this would not have been caught as quickly.</p>\n        <p>The <code>ingress-nginx</code> logs print IP addresses of remote clients to the log feed. If this was not the case, it would be much more difficult to find this error.</p>\n        <h2>Action items</h2>\n        <ul>\n        <li>A single instance of downtime like this is not enough reason to move providers. Moving providers because of this is thus out of scope.</li>\n        <li>Techaro needs a status page hosted on a different cloud provider than is used for the production cluster (<code>TecharoHQ/TODO#6</code>).</li>\n        <li>Health checks for IPv4 and IPv6 traffic need to be created (<code>TecharoHQ/TODO#7</code>).</li>\n        <li>Remove the requirement for <a href=\"https://github.com/TecharoHQ/anubis/pull/794\">Anubis to pass Thoth health checks before it can start if Thoth is enabled</a>.</li>\n        </ul>"
            ],
            "link": "https://anubis.techaro.lol/blog/incident/TI-20250709-0001",
            "publishedAt": "2025-07-09",
            "source": "Xe Iaso",
            "summary": "<p>Techaro services were down for IPv4 traffic on July 9th, 2025. This blogpost is a report of what happened, what actions were taken to resolve the situation, and what actions are being done in the near future to prevent this problem. Enjoy this incident report!</p> <div class=\"flex space-x-2 bg-bg-soft dark:bg-bgDark-soft mx-auto min-h-fit lg:w-[80ch] sm:w-[65ch] w-full lg:p-4 p-2 // Base styles for all messages mt-0 mb-0 rounded-none // First message styles first:mt-4 first:rounded-t-lg first:pb-2 // Last message styles last:mb-4 last:rounded-b-lg last:pt-1 // Middle message top/bottom adjustment [&amp;:not(:first-child)]:-mt-[1px] [&amp;:not(:first-child)]:py-1\"><div class=\"h-16 not-prose\"><img alt=\"Numa is smug\" class=\"h-16 w-16 rounded-xs\" src=\"https://stickers.xeiaso.net/sticker/numa/smug\" /></div><div class=\"flex-1 min-w-0\"><span class=\"font-semibold text-sm block mb-1\"><a href=\"https://xeiaso.net/characters#numa\">Numa</a></span><span class=\"mx-auto\"></span><div class=\"text-fg-1 dark:text-fgDark-1 text-sm prose-p:my-2\"><p>In other companies, this kind of documentation would be kept internal. At Techaro, we believe that you deserve radical candor and the truth. As such, we are proving our lofty words with actions by publishing details about how things go wrong publicly.</p><p>Everything past this point follows my standard incident root cause meeting template.</p></div></div></div> <p>This incident report will focus on the services affected, timeline of what happened at which stage of the incident, where we got lucky, the root cause analysis, and what action items are being planned or taken to prevent this",
            "title": "TI-20250709-0001: IPv4 traffic failures for Techaro services"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3113/",
            "publishedAt": "2025-07-09",
            "source": "XKCD",
            "summary": "<img alt=\"We're building on our earlier success getting web developers to pay to change the backslashes in our displayed payment URL to forward slashes.\" src=\"https://imgs.xkcd.com/comics/fix_this_sign.png\" title=\"We're building on our earlier success getting web developers to pay to change the backslashes in our displayed payment URL to forward slashes.\" />",
            "title": "Fix This Sign"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-09"
}