{
    "articles": [
        {
            "content": [
                "<p>Me <a href=\"https://www.overcomingbias.com/p/futarchy-for-fundraising\">April 2</a>:</p><blockquote><p>Most CEOs are not at all eager for futarchy to advise on the decisions they feel they &#8220;own&#8221;. But it should be easier to get CEO support for futarchy advising decisions that they often cannot make on their own, but must instead make together with boards and investors. For example, futarchy could advise whether to keep or dump the CEO. Another promising application is decisions on when and how to raise more capital.</p></blockquote><p>Another way to make decision markets more appealing to executives wary of ceding control is to make markets advisory. One need be less confident in the value or reliability of markets that only make suggestions. Decision makers could initially mostly ignore such advice, and then slowly put more weight on them as the proved themselves via concrete track records.</p><p>Yes, advisory markets do require that the decisions to be advised be made visible to market participants, who need to know which options will be considered, what outcome metrics are seen as relevant, and roughly when those decisions will be made.</p><p>Such markets would be seen as less valuable than markets which directly decide, and would thus justify smaller budgets and attention, at least at first. And it would be a bit harder to judge how much to reward those who propose options that markets approve.</p><p>But the biggest problem is likely to be <a href=\"https://www.overcomingbias.com/p/decision-selection-bias\">decision selection biases</a>. However, those can be mostly eliminated if decision makers will agree to two key conditions:</p><p><strong>A)</strong> Declare at time T1 that the decision time T5 will fall within a particular period [T3,T6], with price averages over [T2,T5] offered as advice. The shorter is duration T6-T3 and the longer is T2-T1 the better, though 48 and 24 hours seem sufficient.</p><p><strong>B) </strong>Allow and encourage key decision makers and advisors who have access to inside info relevant to the decision to trade in the markets during [T1,T5]. Or at least allow associates of theirs to whom they can reveal such info.</p><p>Decision selection bias is caused by fears of traders at T4 that the decision will be made at T5 based on info unavailable them at T4. Including key informed parties should ensure that they reveal their info to the markets at some point, subsidizing to ensure these markers are thicker during [T1,T2] than [T2,T5] should induce all to reveal what they know by T2, and a short duration [T2,T6] should insure that little new info appears during that period. (Manipulation attempts would thicken markets during [T2,T6]; make the extra [T1,T2] subsidy big enough to compensate.)</p><p>Yes, another approach is to get executives to make decisions randomly some small X% of the time, and make decision markets condition on such random decisions. Alas, I fear that will be seen as a much bigger ask. </p>"
            ],
            "link": "https://www.overcomingbias.com/p/advisory-futarchy",
            "publishedAt": "2025-05-11",
            "source": "Robin Hanson",
            "summary": "<p>Me <a href=\"https://www.overcomingbias.com/p/futarchy-for-fundraising\">April 2</a>:</p><blockquote><p>Most CEOs are not at all eager for futarchy to advise on the decisions they feel they &#8220;own&#8221;. But it should be easier to get CEO support for futarchy advising decisions that they often cannot make on their own, but must instead make together with boards and investors. For example, futarchy could advise whether to keep or dump the CEO. Another promising application is decisions on when and how to raise more capital.</p></blockquote><p>Another way to make decision markets more appealing to executives wary of ceding control is to make markets advisory. One need be less confident in the value or reliability of markets that only make suggestions. Decision makers could initially mostly ignore such advice, and then slowly put more weight on them as the proved themselves via concrete track records.</p><p>Yes, advisory markets do require that the decisions to be advised be made visible to market participants, who need to know which options will be considered, what outcome metrics are seen as relevant, and roughly when those decisions will be made.</p><p>Such markets would be seen as less valuable than markets which directly decide, and would thus justify smaller budgets and attention, at least at first. And it",
            "title": "Advisory Futarchy"
        },
        {
            "content": [],
            "link": "https://buttondown.com/thesephist/archive/handmade-wonder/",
            "publishedAt": "2025-05-11",
            "source": "The Sephist",
            "summary": "<p>Hi friends,</p> <p><em>(welcome to my dispatch! You can sign up for these or read the archive at <a href=\"https://buttondown.email/thesephist?utm_source=thesephist&amp;utm_medium=email&amp;utm_campaign=handmade-wonder\" target=\"_blank\">buttondown.email/thesephist</a> 💌)</em></p> <p>I don't work on as many public side projects these days as I <a href=\"https://thesephist.com/projects/?utm_source=thesephist&amp;utm_medium=email&amp;utm_campaign=handmade-wonder\" target=\"_blank\">used to</a> because I get to bring in many of my weirder engineering and interface ideas into my work at Thrive. But yesterday I took advantage of a rare free evening to go back to my roots a bit, and write a little website. (Don't get your hopes up, it's very tiny.)</p> <p>Every few years there's a word or phrase that seems to capture my subconscious and color the way I look at every part of my life. For the last few, these words were \"thought\" and \"craft\". <em>Thought</em>, as in the stuff that drives our civilization forward, and <em>craft</em>, as in the way we create things with care and the signs thereof that are left on what we create.</p> <p>The <a href=\"https://interconnected.org/home/2022/03/11/saeculum?utm_source=thesephist&amp;utm_medium=email&amp;utm_campaign=handmade-wonder\" target=\"_blank\">vibe has shifted lately</a> in my life, and while thinking about thinking and focus on craft still permeate my work, I've become more drawn to the idea of how humans explore. Curiosity and wonder. Asking good questions, not just finding good",
            "title": "Handmade wonder"
        },
        {
            "content": [],
            "link": "https://lethain.com/systems-mcp/",
            "publishedAt": "2025-05-11",
            "source": "Will Larson",
            "summary": "<p>Back in 2018, I wrote <a href=\"https://github.com/lethain/systems\"><code>lethain/systems</code></a> as a domain-specific language for writing runnable systems models, and introduced it with <a href=\"https://lethain.com/modeling-hiring-funnel-systems/\">this blog post modeling a hiring funnel</a>. While it&rsquo;s far from a perfect system, I&rsquo;ve gotten a lot of value out of it over the last seven years, because it allows me to maintain systems models in version control.</p> <p>As I&rsquo;ve been playing with writing <a href=\"https://modelcontextprotocol.io/introduction\">Model Context Protocol</a> (MCP) servers, one I&rsquo;ve been thinking about frequently is one to help writing <code>systems</code> syntax, and I finally put that together in the <a href=\"https://github.com/lethain/systems-mcp/\"><code>lethain/systems-mcp</code></a> repository.</p> <p>More detailed installation and usage instructions are in the GitHub repository, so I&rsquo;ll just share a couple of screenshots and comments here. Starting with the <code>load_systems_documentation</code> tool which loads a copy of <code>lethain/systems/README.md</code> and <a href=\"https://raw.githubusercontent.com/lethain/systems-mcp/refs/heads/main/docs/examples.md\">a file with example systems</a> into the context window.</p> <p><img alt=\"The image contains text and code snippets related to creating a systems model for user acquisition in a social network. It includes a brief description of systems modeling tools and a specification for modeling user flow from initial discovery to active contribution within the network.\" src=\"https://lethain.com/static/blog/strategy/sys-mcp-load-prompt.png\" /></p> <p>The biggest challenge of properly writing DSLs with an LLM is providing",
            "title": "systems-mcp: generate systems models via LLM"
        },
        {
            "content": [],
            "link": "https://lethain.com/providing-feedback-on-writing/",
            "publishedAt": "2025-05-11",
            "source": "Will Larson",
            "summary": "<p>At Carta, we recently ran a reading group for <a href=\"https://www.amazon.com/Facilitating-Software-Architecture-Empowering-Architectural-ebook/dp/B0DMHGWCPN/\"><em>Facilitating Software Architecture</em></a> by Andrew Harmel-Law. We already <em>loosely</em> followed the ideas of an architectural advice process (from this <a href=\"https://martinfowler.com/articles/scaling-architecture-conversationally.html\">2021 article</a> by the same Andrew Harmel-Law), but in practice we found that internal tech spec and architecture decision record (ADR) authors tended to exclusively share their documents locally within their team rather than more widely.</p> <p>As we asked authors why they preferred sharing locally, the most common answer was that they got enough feedback from their team that they didn&rsquo;t want to pay the time overhead of sharing widely. The wider feedback wasn&rsquo;t necessarily bad or combative. It just wasn&rsquo;t good enough to compensate for the additional time it cost to process. This made sense from the authors&rsquo; perspectives, but didn&rsquo;t work well for me from the executive perspective, as I was seeing teams make misaligned decisions due to lack of cross-team communication.</p> <p>As one step in reducing the overhead of sharing documents widely, I wrote up and shared this recommended process for providing feedback on documents:</p> <ol> <li> <p>Before starting, remember that the goal of providing feedback on a document is to help the author. Optimizing for anything",
            "title": "How to provide feedback on documents."
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-11"
}