{
    "articles": [
        {
            "content": [
                "<p>Paper is good. Somehow, a blank page and a pen makes the universe open up before you. Why paper has this unique power is a mystery to me, but I think we should all stop trying to resist this reality and just accept it.</p>\n\n<p>Also, the world needs way more mundane blogging.</p>\n\n<p>So let me offer a few observations about paper. These all seem quite obvious. But it took me years to find them, and they’ve led me to a non-traditional lifestyle, paper-wise.</p>\n\n<h2 id=\"observation-1-the-primary-value-of-paper-is-to-facilitate-thinking\">Observation 1: The primary value of paper is to facilitate thinking.</h2>\n\n<p>For a huge percentage of tasks that involve thinking, getting some paper and writing / drawing / scribbling on it makes the task easier. I think most people agree with that. So why don’t we act on it? If paper came as a pill, everyone would take it. Paper, somehow, is underrated.</p>\n\n<p>But note, paper isn’t that great as a store of information. You can’t search, cross-references are iffy, and it’s hard to copy or modify. Nobody I know really looks at their old paper notes very often. So don’t optimize for storage. Optimize for thinking.</p>\n\n<h2 id=\"observation-2-if-you-dont-have-a-system-you-wont-get-much-benefit-from-paper\">Observation 2: If you don’t have a “system”, you won’t get much benefit from paper.</h2>\n\n<p>Say you want to do some thinking with paper right now. How would you do it? If you have no system in place, you’ve got some problems: What paper should you write on? Where does it go when you’re done? These are small problems, but they add friction. If you have to solve them, maybe you won’t bother using paper.</p>\n\n<p>So solve them. Your “system” could be, “write on a notepad and throw the pages out at the end of the week.” Fine! At least you’re using paper now.</p>\n\n<h2 id=\"observation-3-user-experience-matters\">Observation 3: User experience matters.</h2>\n\n<p>Some pens and paper spark more joy than others. Use them. This is not frivolous. When more joy is sparked when you scribble, better thinking follows.</p>\n\n<p>There are many other dimensions of user experience. Personally, I find paper with lines to be crushing and dehumanizing. But I recognize this is not a human universal.</p>\n\n<p>Or, say you decide to write in a notebook. Good. But have you noticed that most notebooks either (a) close if left alone on a table or (b) have spirals or wires that are wider than the notebook itself and get crushed if the notebook is left in a bag between two books, meaning the pages don’t turn right, diminishing joy and therefore thinking?</p>\n\n<h2 id=\"observation-4-categorization-is-hard\">Observation 4: Categorization is hard.</h2>\n\n<p>Probably somewhere in the world there’s someone with three notebooks labeled “work”, “hobby”, and “journal” and every time they want to write something it’s obvious which notebook they should use. But I’ve never met such a person and one imagines they spend their time sorting their underwear drawer or whatever rather than reading pseudonymous existential angst/science blogs.</p>\n\n<p>I’ve tried many times to have different notebooks dedicated to different subjects. But I <em>always</em> find things run together and endless edge cases come up requiring new notebooks and I end up carrying multiple notebooks around and the whole thing is such a hassle that paper sparks no joy at all.</p>\n\n<h2 id=\"paper-systems-ive-used\">Paper systems I’ve used</h2>\n\n<p>In college, my “system” was to steal paper from printers (justified as “printing blank documents”), scribble on it, and then leave unstapled stacks of paper everywhere to get lost or crumpled in bags. Looking back, this wasn’t <em>that</em> bad.</p>\n\n<p>Later on, I tried notebooks. Many kinds of notebooks. All the notebooks. But none made me happy. Besides the categorization and crushed wires problems, I sometimes (often) write things and later decide they are wrong and cross them out and write, “dynomight why are you so dumb and bad? why?” It drove me crazy to have this “trash” sitting around in the notebook. I tried having separate scratch paper and only copying the good stuff into the notebook, but this was too much work. I never found a solution.</p>\n\n<p>Also, I loooooove having lots of paper all visible at once. (As I write these words, seven sheets are splayed before me.) Loose-leaf paper makes this easy, but notebooks make it impossible.</p>\n\n<p>Then I decided to go all-in on notecards. The idea was that I could quickly try things, move the cards around, throw away stuff that was wrong, etc. And I could keep a stack of them in my jacket pocket, helpfully decreasing my social status.</p>\n\n<p>This <em>is</em> something wonderful about notecards. The fact that they’re so small somehow reduces the mental threshold to start writing, which leads to more paper usage and more thinking. And unlike a notepad, they’re durable and “permanent”.</p>\n\n<p>Still, they’re <em>small</em>. It’s annoying to write/draw anything substantial. Worse, I found my life was gradually filling with stacks of notecards. I tried buying photo albums and stuffing the cards into them, but this was a huge chore and those albums are expensive and gigantic and heavy. The piles kept accumulating. I couldn’t beat them.</p>\n\n<p>My current system, the first one I actually like, is this:</p>\n\n<ol>\n  <li>\n    <p>Buy three-hole punched printer paper.</p>\n  </li>\n  <li>\n    <p>Write on it.</p>\n  </li>\n  <li>\n    <p>Everything goes into a single-three ringed notebook in chronological order, no exceptions.</p>\n  </li>\n  <li>\n    <p>When that notebook is full, take the paper out, put a sheet of brown cardstock on each end, and put brass fasteners through the holes.</p>\n  </li>\n  <li>\n    <p>That “book” then goes on a bookshelf, never to be looked at again.</p>\n  </li>\n</ol>"
            ],
            "link": "https://dynomight.net/paper/",
            "publishedAt": "2025-04-10",
            "source": "Dynomight",
            "summary": "<p>Paper is good. Somehow, a blank page and a pen makes the universe open up before you. Why paper has this unique power is a mystery to me, but I think we should all stop trying to resist this reality and just accept it.</p> <p>Also, the world needs way more mundane blogging.</p> <p>So let me offer a few observations about paper. These all seem quite obvious. But it took me years to find them, and they’ve led me to a non-traditional lifestyle, paper-wise.</p> <h2 id=\"observation-1-the-primary-value-of-paper-is-to-facilitate-thinking\">Observation 1: The primary value of paper is to facilitate thinking.</h2> <p>For a huge percentage of tasks that involve thinking, getting some paper and writing / drawing / scribbling on it makes the task easier. I think most people agree with that. So why don’t we act on it? If paper came as a pill, everyone would take it. Paper, somehow, is underrated.</p> <p>But note, paper isn’t that great as a store of information. You can’t search, cross-references are iffy, and it’s hard to copy or modify. Nobody I know really looks at their old paper notes very often. So don’t optimize for storage. Optimize for thinking.</p> <h2 id=\"observation-2-if-you-dont-have-a-system-you-wont-get-much-benefit-from-paper\">Observation 2: If you don’t have a “system”,",
            "title": "Paper"
        },
        {
            "content": [],
            "link": "https://harper.blog/2025/04/10/waterfall-in-15-minutes-or-your-money-back/",
            "publishedAt": "2025-04-10",
            "source": "Harper Reed",
            "summary": "<p>I recently had a conversation with a friend that started out as a casual catch-up and spiraled into a deep exploration of AI-assisted coding and what it&rsquo;s doing to our workflows, teams, and sense of &ldquo;craft.&rdquo; It spanned everything from rewriting old codebases to how automated test coverage changes the nature of programming.</p> <p>I took the transcript from granola, popped it into o1-pro, and asked it to write this blog post. Not terrible. Representative of my beliefs.</p> <p>I sent it to a few friends, and they all were interested in sending it to a few more friends. That means I gotta publish it. So here goes!</p> <blockquote> <p>this is a good reminder that if you get an email from someone and the writing is perfect and has no affectation - an AI probably wrote it. lol.</p> </blockquote> <hr /> <h2 id=\"waterfall-in-15-minutes-or-your-money-back\">Waterfall in 15 Minutes or Your Money Back</h2> <h3 id=\"the-new-normal-why-does-code-quality-even-matter\">The New Normal: &ldquo;Why Does Code Quality Even Matter?&rdquo;</h3> <p>For years, we&rsquo;ve talked about code as craft—how we get into that precious flow state, sculpt a piece of logic, and emerge victorious, artisanal bug fixes in hand. But there&rsquo;s a new paradigm creeping in where code generation tools (think large language",
            "title": "Waterfall in 15 Minutes or Your Money Back"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/twilight-of-the-edgelords\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/twilight-of-the-edgelords",
            "publishedAt": "2025-04-10",
            "source": "SlateStarCodex",
            "summary": "Should edgy heterodox centrists accept some of the blame for Trump?",
            "title": "Twilight Of The Edgelords"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3765\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3765",
            "publishedAt": "2025-04-10",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3765\"> Read more </a> </p>",
            "title": "Hidden Open Thread 376.5"
        },
        {
            "content": [],
            "link": "https://lethain.com/how-to-get-better-at-strategy/",
            "publishedAt": "2025-04-10",
            "source": "Will Larson",
            "summary": "<p>One of the most memorable quotes in Arthur Miller&rsquo;s <em>The Death of a Salesman</em> comes from Uncle Ben, who describes his path to becoming wealthy as, &ldquo;When I was seventeen, I walked into the jungle, and when I was twenty-one I walked out. And by God I was rich.&rdquo; I wish I could describe the path to learning engineering strategy in similar terms, but by all accounts it&rsquo;s a much slower path. Two decades in, I am still learning more from each project I work on. This book has aimed to accelerate your learning path, but my experience is that there&rsquo;s still a great deal left to learn, despite what this book has hoped to accomplish.</p> <p>This final chapter is focused on the remaining advice I have to give on how you can continue to improve at strategy long after reading this book&rsquo;s final page. Inescapably, this chapter has become advice on writing your own strategy for improving at strategy. You are already familiar with my general suggestions on creating strategy, so this chapter provides focused advice on creating your own plan to get better at strategy.</p> <p>It covers:</p> <ul> <li>Exploring strategy creation to find strategies you can learn from",
            "title": "How to get better at strategy?"
        },
        {
            "content": [],
            "link": "https://lethain.com/wardley-compute-ecosystem/",
            "publishedAt": "2025-04-10",
            "source": "Will Larson",
            "summary": "<p><img src=\"https://lethain.com/static/blog/strategy/wardley-compute-v2.png\" /></p>&lt;p&gt;In &lt;a href=\"https://lethain.com/uber-service-migration-strategy/\"&gt;Uber&amp;rsquo;s 2014 service migration strategy&lt;/a&gt;, we explore how to navigate the move from a Python monolith to a services-oriented architecture while also scaling with user traffic that doubled every six months.&lt;/p&gt; &lt;p&gt;This &lt;a href=\"https://lethain.com/wardley-mapping/\"&gt;Wardley map&lt;/a&gt; explores how orchestration frameworks were evolving during that period, to be used as an input into determining the most effective path forward for Uber&amp;rsquo;s Infrastructure Engineering team.&lt;/p&gt; &lt;div class=\"bg-light-gray br4 ph3 pv1\"&gt; &lt;p&gt;&lt;em&gt;This is an exploratory, draft chapter for a book on engineering strategy that I&amp;rsquo;m brainstorming in &lt;a href=\"https://lethain.com/tags/eng-strategy-book/\"&gt;#eng-strategy-book&lt;/a&gt;.&lt;/em&gt; &lt;em&gt;As such, some of the links go to other draft chapters, both published drafts and very early, unpublished drafts.&lt;/em&gt;&lt;/p&gt; &lt;/div&gt; &lt;h2 id=\"reading-this-map\"&gt;Reading this map&lt;/h2&gt; &lt;p&gt;To quickly understand this Wardley Map, read from top to bottom. If you want to review how this map was &lt;em&gt;written&lt;/em&gt;, then you should read section by section from the bottom up, starting with Users, then Value Chains, and so on.&lt;/p&gt; &lt;p&gt;More detail on this structure in &lt;a href=\"https://lethain.com/wardley-mapping/\"&gt;Refining strategy with Wardley Mapping&lt;/a&gt;.&lt;/p&gt; &lt;h2 id=\"how-things-work-today\"&gt;How things work today&lt;/h2&gt; &lt;p&gt;There are three primary internal teams involved in service provisioning. The Service Provisioning Team abstracts applications developed by Product Engineering from servers managed by the Server Operations Team. As",
            "title": "Wardley mapping the service orchestration ecosystem (2014)."
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-04-10"
}