{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>The <a href=\"https://frame.work/products/laptop13-diy-amd-ai300/configuration/new\">new AMD HX370 option</a> in the Framework 13 is a good step forward in performance for developers. It runs our HEY test suite in 2m7s, compared to 2m43s for the 7840U (and 2m49s for a M4 Pro!). It's also about 20% faster in most single-core tasks than the 7840U.</div><div><br />But is that enough to warrant the jump in price? AMD's latest, best chips have suddenly gotten pretty expensive. The F13 w/ HX370 now costs $1,992 with 32GB RAM / 1TB. Almost the same an M4 Pro MBP14 w/ 24GB / 1TB ($2,199). I'd pick the Framework any day for its better keyboard, 3:2 matte screen, repairability, and superb Linux compatibility, but it won't be because the top option is \"cheaper\" any more.&nbsp;</div><div><br />Of course you could also just go with the budget 6-core Ryzen AI 5 340 in same spec for $1,362. I'm sure that's a great machine too. But maybe the sweet spot is actually the Ryzen AI 7 350. It \"only\" has 8 cores (vs 12 on the 370), but four of those are performance cores -- the same as the 370. And it's $300 cheaper. So ~$1,600 gets you out the door. I haven't actually tried the 350, though, so that's just speculation. I've been running the 370 for the last few months.<br /><br /></div><div>Whichever chip you choose, the rest of the Framework 13 package is as good as it ever was. This remains my favorite laptop of at least the last decade. I've been <a href=\"https://world.hey.com/dhh/the-year-on-linux-7f30279e\">running one for over a year now</a>, and combined with <a href=\"https://omakub.org/\">Omakub</a> + <a href=\"https://www.youtube.com/watch?v=c4OyfL5o7DU\">Neovim</a>, it's the first machine in forever where I've actually enjoyed programming on a 13\" screen. The 3:2 aspect ratio combined with Linux's superb multiple desktops that switch with 0ms lag and no animations means I barely miss the trusted 6K Apple XDR screen when working away from the desk.<br /><br /></div><div>The HX370 gives me about 6 hours of battery life in mixed use. About the same as the old 7840U. Though if all I'm doing is writing, I can squeeze that to 8-10 hours. That's good enough for me, but not as good as a Qualcomm machine or an Apple M-chip machine. For some people, those extra hours really make the difference.</div><div><br />What does make a difference, of course, is Linux. I've written repeatedly about how much of a joy it's been to rediscover Linux on the desktop, and it's a joy that keeps on giving. For web work, it's so good. And for any work that requires even a minimum of Docker, it's so fast (as the HEY suite run time attests).</div><div><br />Apple still has a strong hardware game, but their software story is falling apart. I haven't heard many people sing the praises of new iOS or macOS releases in a long while. It seems like <a href=\"https://world.hey.com/dhh/apple-needs-a-new-asshole-in-charge-0bf46b94\">without an asshole in charge</a>, both have move towards more bloat, more ads, more gimmicks, more control. Linux is an incredible antidote to this nonsense these days.</div><div><br />It's also just fun! Seeing <a href=\"https://world.hey.com/dhh/amd-in-everything-0ec0cc6e\">AMD catch up in outright performance</a> if not efficiency has been a delight. Watching Framework perfect their 13\" laptop while remaining 100% backwards compatible in terms of upgrades with the first versions is heartwarming. And getting to test the new <a href=\"https://frame.work/desktop\">Framework Desktop</a> in advance of its Q3 release has only affirmed my commitment to both.<br /><br /></div><div>But on the new HX370, it's in my opinion the best Linux laptop you can buy today, which by extension makes it the best web developer laptop too. The top spec might have gotten a bit pricey, but there are options all along the budget spectrum, which retains all the key ingredients any way. Hard to go wrong.</div><div><br />Forza Framework!<br /><br /></div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/the-new-framework-13-hx370-68675e0e",
            "publishedAt": "2025-04-17",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>The <a href=\"https://frame.work/products/laptop13-diy-amd-ai300/configuration/new\">new AMD HX370 option</a> in the Framework 13 is a good step forward in performance for developers. It runs our HEY test suite in 2m7s, compared to 2m43s for the 7840U (and 2m49s for a M4 Pro!). It's also about 20% faster in most single-core tasks than the 7840U.</div><div><br />But is that enough to warrant the jump in price? AMD's latest, best chips have suddenly gotten pretty expensive. The F13 w/ HX370 now costs $1,992 with 32GB RAM / 1TB. Almost the same an M4 Pro MBP14 w/ 24GB / 1TB ($2,199). I'd pick the Framework any day for its better keyboard, 3:2 matte screen, repairability, and superb Linux compatibility, but it won't be because the top option is \"cheaper\" any more.&nbsp;</div><div><br />Of course you could also just go with the budget 6-core Ryzen AI 5 340 in same spec for $1,362. I'm sure that's a great machine too. But maybe the sweet spot is actually the Ryzen AI 7 350. It \"only\" has 8 cores (vs 12 on the 370), but four of those are performance cores -- the same as the 370. And it's $300 cheaper. So ~$1,600 gets you out the door. I",
            "title": "The new Framework 13 HX370"
        },
        {
            "content": [
                "<p>(1) <a href=\"https://en.wikipedia.org/wiki/Romulus,_Remus,_and_Khaleesi\">Romulus, Remus, and Khaleesi</a></p>\n\n<p>You probably heard that Colossal Biosciences recently reconstructed the DNA of dire wolves and created live dire wolves, bringing them back from extinction. But have you heard that also they did no such thing and you’re a bunch of chumps?</p>\n\n<p><a href=\"https://www.sciencealert.com/did-dire-wolves-just-come-back-from-extinction-heres-the-truth\">Jeremy Austin</a>, Director of the Australian Center for Ancient DNA:</p>\n\n<blockquote>\n  <p>I think a lot of scientists are going to be scratching their heads, saying, “Look, you’ve got a white, gray wolf.” That’s not a dire wolf under any definition of a species ever…</p>\n</blockquote>\n\n<p><a href=\"https://www.bbc.com/news/articles/c4g9ejy3gdvo\">Nic Rawlence</a> of Otago University:</p>\n\n<blockquote>\n  <p>So what Colossal has produced is a grey wolf, but it has some dire wolf-like characteristics, like a larger skull and white fur.</p>\n</blockquote>\n\n<p>They extracted fragments of dire wolf DNA from fossilized remains, and then found 20 gene edits they could do to make gray wolves look more like dire wolves. (Five of those were apparently needed just to make their fur white.) That is cool. It’s a step towards bringing a species back from extinction. But it’s not bringing a species back from extinction. Save your applause for someone who actually does that.</p>\n\n<p><br />\n(2) <a href=\"https://en.wikipedia.org/wiki/Aspergillus_niger\">Aspergillus niger</a> (h/t <a href=\"https://panpharmacon.substack.com/\">Parsimony’s Panpharmacon </a>)</p>\n\n<p>Citric acid is what makes lemon juice taste like lemon juice. It’s used as a flavoring or preservative in lots of food. So when you drink your delicious lemon seltzer, it’s comforting to remember that what you’re tasting came from <strong>black mold</strong>.</p>\n\n<blockquote>\n  <p>Aspergillus niger is a mold […] found throughout the environment within soil and water, on vegetation, in fecal matter, on decomposing matter, and suspended in the air.</p>\n\n  <p>[…]</p>\n\n  <p><em>A. niger</em> causes a disease known as “black mold” on certain fruits and vegetables such as grapes, apricots, onions, and peanuts, and is a common contaminant of food. […] <em>A. niger</em> is classified as <a href=\"https://en.wikipedia.org/wiki/Generally_recognized_as_safe\" title=\"Generally recognized as safe\">generally recognized as safe</a> (GRAS) by the US <a href=\"https://en.wikipedia.org/wiki/Food_and_Drug_Administration\" title=\"Food and Drug Administration\">Food and Drug Administration</a> for use in food production, although the microbe is capable of producing toxins that affect human health.</p>\n\n  <p>[…]</p>\n\n  <p>The production of citric acid (CA) is achieved by growing strains of <em>A. niger</em> in a nutrient rich medium that includes high concentrations of sugar and mineral salts and an acidic pH of 2.5-3.5. Many microorganisms produce CA, but <em>Aspergillus niger</em> produces more than 1 million metric tons of CA annually via a fungal fermentation process.</p>\n</blockquote>\n\n<p>(It’s fine.)</p>\n\n<p><br />\n(3) <a href=\"https://www.herbertsmithfreehills.com/insights/2019-06/landmark-ruling-on-the-wto-national-security-exception\">Landmark ruling on the WTO national security exception</a></p>\n\n<p>Tariffs are in the news. These raise many questions, but what I want to know is: Aren’t there treaties? What about the treaties?</p>\n\n<p>Well, The legal pretext for the American tariffs is that they are being done for “national security”. In some cases, this pretext seems quite thin. The US put equal tariffs on Mexico and Canada, supposedly in response to fentanyl coming over the border from those countries. But here are the amounts of fentanyl intercepted at the border from these countries in 2024:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>country</th>\n      <th>fentanyl</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Mexico</td>\n      <td>9500 kg</td>\n    </tr>\n    <tr>\n      <td>Canada</td>\n      <td>19 kg</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Still, it doesn’t seem crazy to argue that you need to maintain some industrial base for the sake of national security. Recent history unfortunately shows that brutal land wars between rich countries still happen and still require enormous quantities of <em>matériel</em>. According to some sources, Russia is using around <a href=\"https://jeffjacksonnc.substack.com/p/10000-artillery-shells-per-day\">10k shells per day</a> in Ukraine, while after several years of ramping up production, the EU hopes to produce <a href=\"https://kyivindependent.com/eu-to-produce-2-million-artillery-shells-in-2025-new-defense-commissioner-tells-media/\">5.5k shells per day</a> in 2025 and the US <a href=\"https://en.defence-ua.com/industries/us_official_reveals_the_monthly_production_of_155mm_shells_implications_for_ukraine-11677.html\">2.5k</a>. In 1995, the US could make <a href=\"https://www.gao.gov/assets/nsiad-95-89.pdf#page=7\">22k shells per day</a>.</p>\n\n<p>Anyway, to make weapons, you need a long supporting supply chain. And in WWII, all sorts of peacetime manufacturing was converted to making weapons. And what about trucks? Or food? You need food for war, right? If you make exceptions for anything related to national security, that seems to make existing treaties meaningless.</p>\n\n<p>Well here’s a story most people haven’t heard: In 2014, Russia started blocking the transit of various goods from Ukraine through Russia. Ukraine protested to the WTO that this violated the commitments Russia had made to join the WTO. Russia responded that they were doing this for national security, and so the WTO didn’t even have the authority to review their actions. \nMany countries filed opinions.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Opposing Russia’s position</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Australia</td>\n    </tr>\n    <tr>\n      <td>Brazil</td>\n    </tr>\n    <tr>\n      <td>Canada</td>\n    </tr>\n    <tr>\n      <td>China</td>\n    </tr>\n    <tr>\n      <td>The European Union</td>\n    </tr>\n    <tr>\n      <td>Japan</td>\n    </tr>\n    <tr>\n      <td>Moldova</td>\n    </tr>\n    <tr>\n      <td>Singapore</td>\n    </tr>\n    <tr>\n      <td>Turkey</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <thead>\n    <tr>\n      <th>Supporting Russia’s position</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>The United States</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>The WTO finally <a href=\"https://docs.wto.org/dol2fe/Pages/FE_Search/DDFDocuments/252975/q/WT/DS/512R.pdf\">held</a> in 2019 that it could review the decision, meaning countries can’t totally “self-judge” what counts as national security. But they also said Russia’s actions were fine.</p>\n\n<p>Apparently, the the national security exception exists because the United States <a href=\"https://repository.law.umich.edu/cgi/viewcontent.cgi?article=1965&amp;context=mjil\">insisted on it</a> during negotiations for the <a href=\"https://en.wikipedia.org/wiki/General_Agreement_on_Tariffs_and_Trade\">General Agreement on Tariffs and Trade</a> back in 1947.</p>\n\n<p>As far as I can tell, the only countries that have filed WTO complaints against the US for the recent tariffs are <a href=\"https://www.wto.org/english/news_e/news25_e/ds637rfc_07apr25_e.htm\">Canada</a> and <a href=\"https://www.wto.org/english/news_e/news25_e/dsrfc_08apr25_e.htm\">China</a>.</p>\n\n<p><br />\n(4) In 1982, John Mellencamp released <a href=\"https://en.wikipedia.org/wiki/Jack_%26_Diane\">Jack &amp; Diane</a>.</p>\n\n<blockquote>\n  <p>A little ditty ‘bout Jack &amp; Diane\n<br /> Two American kids growing up in the heart land\n<br />Jack, he’s gonna be a football star\n<br />Diane’s debutante, back seat of Jacky’s car\n<br />Suckin’ on chili dog outside the Tastee Freez</p>\n</blockquote>\n\n<p>And in 2021 Tom McGovern presented <a href=\"https://www.youtube.com/watch?v=6QX57aIDbDU\">a version</a> with these lyrics.</p>\n\n<blockquote>\n  <p>A little ditty ‘bout Jack &amp; Diane\n<br />Two American kids growing up in the heart land\n<br />Jack, he’s gonna be a football star\n<br />Diane’s debutante, back seat of Jacky’s car\n<br />Suckin’ on chili dog\n<br />Suckin’ on chili dog\n<br />Suckin’ on chili dog\n<br />Suckin’ on chili dog\n<br />Suckin’ on chili dog\n<br />Suckin’ on chili dog\n<br />Suckin’ on chili dog\n<br />Suckin’ on chili dog</p>\n</blockquote>\n\n<p>Some people noticed that as early as 2012, <a href=\"https://en.wikipedia.org/wiki/Clownvis_Presley\">Clownvis Presley</a> had been performing a <a href=\"https://www.youtube.com/watch?v=QQrxIlGsMNQ\">version</a> of this song with most of the lyrics chili-dogged. In the comments, Tom says:</p>\n\n<blockquote>\n  <p>I’ve gotten a handful of comments blaming me for stealing this bit from a performer named Clownvis. I hadn’t even known who he was before I shared this video, it gained traction, and the accusatory comments started coming in.</p>\n\n  <p>[…]</p>\n\n  <p>I would never, EVER intentionally steal another artist’s bit. Rather than leaving more angry comments, I ask you to consider that two creators can arrive at similar (dumb) ideas independently.</p>\n</blockquote>\n\n<p>Really? I won’t say it’s <em>impossible</em>, but that’s… quite a coincidence.</p>\n\n<p>I think this kind of borrowing could happen by accident. Maybe someone saw Clownvis in 2012. And they repeated it to Tom at a party in 2017 without attribution. And then Tom forgot hearing it, but the idea lurked somewhere in his brain to be “discovered” anew. I follow a <em>lot</em> of blogs, and I’m constantly paranoid that I might be unintentionally stealing things.</p>\n\n<p><br />\n(5) <a href=\"https://nosetgauge.substack.com/p/capital-agi-and-human-ambition\">Capital, AGI, and human ambition</a> and <a href=\"https://lukedrago.substack.com/p/the-intelligence-curse\">The Intelligence Curse</a></p>\n\n<p>The <a href=\"https://en.wikipedia.org/wiki/Resource_curse\">resource curse</a> is the observation that countries with lots of natural resources often end up paradoxically poor. Say you live in a small poor country with lots of diamonds, and say you want money. Then you can do this:</p>\n\n<ol>\n  <li>\n    <p>Get a bunch of guys with guns.</p>\n  </li>\n  <li>\n    <p>Go to the capital and shoot anyone who doesn’t do what you say.</p>\n  </li>\n  <li>\n    <p>Go to the diamond mines and shoot anyone who doesn’t do what you say.</p>\n  </li>\n  <li>\n    <p>Take the diamonds from the mines, sell them.</p>\n  </li>\n  <li>\n    <p>Use the money to buy more guys with guns, leave the rest of the country to rot.</p>\n  </li>\n</ol>\n\n<p>That’s checkmate. Everyone else is too immiserated to do anything. You have all the money and power, forever.</p>\n\n<p>On the other hand, take a country that’s rich because it has a modern diversified economy. If you send guys with guns to take over Apple and Goldman Sachs and kill everyone else, you will soon find that Apple and Goldman Sachs aren’t worth very much.</p>\n\n<p>So maybe <em>that</em> is why governments are relatively friendly to their populations. Not because of democracy, but because you can’t steal the money without strangling the money printer.</p>\n\n<p>The idea advanced in these posts is that maybe AI will be like oil or diamonds: Maybe it will create incredible amounts of wealth, but do so in a way that doesn’t require the cooperation of a large educated workforce. If so, then power and wealth may end up in the hands of a small number of people (entities?) who have little incentive to use them for the common good.</p>\n\n<p>But hey, Norway has lots of oil.</p>\n\n<p><br />\n(6) <a href=\"https://maartenboudry.substack.com/p/the-selfish-machine\">The Selfish Machine</a> (h/t Steven Pinker)</p>\n\n<p>This post argues that AI by default has no reason to try to take over the world. Why would it? It has no reason to do anything other than what it’s programmed to do. Danger only arises if AI is allowed to “evolve”. If that happens then it would—almost by definition—make the AI aggressive and expansionary and “grabby”.</p>\n\n<p>I find this insightful and helpful. But I find myself more worried, not less. How is “evolution” different from “recursive self-improvement”? It seems like there will be strong incentives to allow recursive self-improvement. If even a little “evolution” accidentally creeps in, won’t it get amplified?</p>\n\n<p><br />\n(7) <a href=\"https://d-lab.mit.edu/sites/default/files/inline-files/D-Lab_Learn-It_Adhesives_Jul13.pdf\">Which adhesive should I use?</a></p>\n\n<p>As a fan of redneck engineering and “stuff with high ROI”, I feel like this chart is an <a href=\"https://dynomight.net/thanks-3/#:~:text=glue\">underrated</a> triumph of civilization:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/links-2/glue.svg\" /></p>\n\n<p>(That’s just a small part.) I used to have a mental model where “glue is easy but weak”. Glue is <em>strong</em>. But you must use the right kind, and you must follow the instructions, because atoms are weird and the universe has a lot of detail. For example, wood glue is <em>insanely</em> strong and can fix approximately all broken wooden things, but you must use a clamp, and you must glue long grain to long grain.</p>\n\n<p><br />\n(8) <a href=\"https://trevorklee.substack.com/p/do-taurine-and-glycine-provide-answers\">Do taurine and glycine provide answers to the mammalian gallbladder and kidney mysteries?</a></p>\n\n<p>This is my kind of blog-post. Ultra obscure question, tangled and triple-caveated discussion, no clear resolution. If writing reflected real life, this is what 90% of science blogging would look like.</p>\n\n<p><br />\n(9) <a href=\"https://dynomight.net/danger.html\">Dynomight dangerous typing app</a></p>\n\n<p>Sometimes, when I have an idea for a post, I want to write a rapid prototype to sort of see what it looks like, expose weaknesses in my argument, etc. But I have perfectionist tendencies. (That sentence was re-written 19 times.) These make it hard to write quickly.</p>\n\n<p>So—this is embarrassing to admit—I sometimes resort to using a <a href=\"https://en.wikipedia.org/wiki/The_Most_Dangerous_Writing_App\">webpage</a> where if you ever stop typing for more than a few seconds, everything is permanently deleted. This is very effective. Make an outline, set the app for 15 minutes, and viola: Prototype done.</p>\n\n<p>But I recently wondered what happens to the text I type. The page has no privacy policy and the code is unintelligible. So I thought: Why don’t I ask an AI to create my own <em>better</em> version?</p>\n\n<details>\n  (Prompt)\n\n  <blockquote>\n    <p>create a single-page HTML+javascript application</p>\n\n    <p>at the top, I should be able to enter a number of minutes N, and a number of seconds M. then there is a “start” button</p>\n\n    <p>below that there is a large textbox that goes on indefinitely</p>\n\n    <p>after i press start, there should be a timer in the upper right that counts down N minutes. this should hover over the screen</p>\n\n    <p>if at any point i stop typing for M seconds all the text should be permanently deleted</p>\n\n    <p>as I get close to M seconds without typing, the interface should warn me by gradually turning the background closer to red. as soon as I start typing, it should become white again</p>\n\n    <p>after the N minutes are over, the counter stop counting down and you can wait forever</p>\n\n    <p>do it all as a single file of HTML+CSS+Javascript. do not use any external libraries / services / fonts / etc.</p>\n  </blockquote>\n\n</details>\n\n<p>The result is <a href=\"https://dynomight.net/danger.html\">here</a>. It has a pleasing brutalist design, and <em>definitely</em> doesn’t steal your precious gibberish typing. This took like 5 minutes.</p>\n\n<p>Obviously, I’ve seen many people show off similar things before. But I didn’t really <em>appreciate</em> it before trying it myself. So if you haven’t done so, I encourage you to try something similar. You need no programming skills, just ask for a “single file of HTML+CSS+Javascript” doing whatever you want, paste the code in a file named <code class=\"language-plaintext highlighter-rouge\">i♡dynomight.html</code> and then open it in a web browser.</p>\n\n<p>Anyway. LLMs are text models. So how do you use them to create text? Do you have them write for you? No! Boring. What you do is you train them to follow instructions and write code and then ask for a program to manipulate your ape-brain so you’ll keep physically hitting keys on your keyboard. There’s some kind of lesson here.</p>\n\n<p><img alt=\"picture of Odysseus on a ship, strapped to the front of a giant robot\" src=\"https://dynomight.net/img/links-2/odysseus.jpg\" /></p>\n\n<p>(Picture courtesy of <a href=\"https://thebsdetector.substack.com/\">The BS Detector</a>)</p>\n\n<p><br />\n(10)</p>\n\n<p>I was actually <em>so</em> impressed by that AI-generated app that I went and bought a Google Play card with cash so I could subscribe to Gemini without linking my identity/banking details/etc. But when I added it, Google said “we need more information” and demanded pictures of the physical card and purchase receipt. And when I sent <em>those</em>, Google waited several days, and then said, “Thanks for doing everything we asked, according to our systems, something is wrong, go fuck yourself.” I guess they’re keeping my $25.</p>\n\n<p><br />\n(11) <a href=\"https://bsky.app/profile/kevinh-phd.bsky.social/post/3lmxicyeu2k2w\">Kevin Hall is retiring from the NIH</a></p>\n\n<p>Kevin Hall has worked at the NIH for 21 years. He was first author on what I consider possibly the <a href=\"https://doi.org/10.1016/j.cmet.2019.05.008\">best ever</a> nutrition study, published in 2019. This found that ultra-processed food causes weight gain even when energy density and macronutrients are matched. Since then, he’s <a href=\"https://www.nytimes.com/2024/07/30/well/eat/ultraprocessed-foods-diet-study.html\">continued</a> to work on the subject and I’ve eagerly awaited the results.</p>\n\n<p>Hall is a real scientist who does real science, which means sometimes getting results that don’t fit with your preconceptions. In recent work, Hall tested if ultra-processed milkshakes might cause addiction through a dopamine response. Surprisingly, they <a href=\"https://doi.org/10.1016/j.cmet.2025.02.002\">did not</a>.</p>\n\n<p>Because this didn’t support the new <a href=\"https://en.wikipedia.org/wiki/Robert_F._Kennedy_Jr.\">Secretary of Health and Human Services’</a> theories about addiction and unprocessed food, he was apparently <a href=\"https://archive.is/oF3EH\">barred from speaking with reporters</a> and worried that officials might soon interfere with his experiments. If he resigned later, he would lose health insurance for his family, so he decided to accept early retirement now. Not encouraging.</p>\n\n<p><br />\n(12) <a href=\"https://en.wikipedia.org/wiki/Lise_Meitner\">Lise Meitner</a></p>\n\n<p>Lise Meitner was born in 1878 in Vienna. She was the second woman to earn a doctorate in physics at the University of Vienna. After this, she moved to Germany and began a long collaboration with Otto Hahn. She later became the first female professor of physics at the University of Berlin. Following the Nazis rise to power, she fled to Sweden, but continued to collaborate with Hahn and in 1939 was instrumental in the discovery of nuclear fission.</p>\n\n<p>Hahn won the Nobel prize in chemistry in 1944, without Meitner. This is now widely considered one of the Nobel committee’s biggest mistakes. Many people offer tidy narratives: Sexism, antisemitism, etc. After the records were made public 50 years later, it appears to have been a mixture of many things, summarized as, “disciplinary bias, political obtuseness, ignorance, and haste”.</p>\n\n<p>Meitner famously refused to have anything to do with the making of the atomic bomb.</p>\n\n<p>What I find cool is: 1939 - 1878 = 61. She was 61.</p>\n\n<p><img alt=\"meitner\" src=\"https://dynomight.net/img/links-2/meitner.jpg\" /></p>"
            ],
            "link": "https://dynomight.net/links-2/",
            "publishedAt": "2025-04-17",
            "source": "Dynomight",
            "summary": "<p>(1) <a href=\"https://en.wikipedia.org/wiki/Romulus,_Remus,_and_Khaleesi\">Romulus, Remus, and Khaleesi</a></p> <p>You probably heard that Colossal Biosciences recently reconstructed the DNA of dire wolves and created live dire wolves, bringing them back from extinction. But have you heard that also they did no such thing and you’re a bunch of chumps?</p> <p><a href=\"https://www.sciencealert.com/did-dire-wolves-just-come-back-from-extinction-heres-the-truth\">Jeremy Austin</a>, Director of the Australian Center for Ancient DNA:</p> <blockquote> <p>I think a lot of scientists are going to be scratching their heads, saying, “Look, you’ve got a white, gray wolf.” That’s not a dire wolf under any definition of a species ever…</p> </blockquote> <p><a href=\"https://www.bbc.com/news/articles/c4g9ejy3gdvo\">Nic Rawlence</a> of Otago University:</p> <blockquote> <p>So what Colossal has produced is a grey wolf, but it has some dire wolf-like characteristics, like a larger skull and white fur.</p> </blockquote> <p>They extracted fragments of dire wolf DNA from fossilized remains, and then found 20 gene edits they could do to make gray wolves look more like dire wolves. (Five of those were apparently needed just to make their fur white.) That is cool. It’s a step towards bringing a species back from extinction. But it’s not bringing a species back from extinction. Save your applause for someone who actually does that.</p> <p><br /> (2) <a href=\"https://en.wikipedia.org/wiki/Aspergillus_niger\">Aspergillus niger</a>",
            "title": "Links for April"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-04-17_9754fb83ad69_hanging-with-some-old-friends-/",
            "publishedAt": "2025-04-17",
            "source": "Harper Reed",
            "summary": "<p>Hanging with some old friends while in L.A.</p> <figure> <img alt=\"image_1.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-04-17_9754fb83ad69_hanging-with-some-old-friends-/image_1.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_2.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-04-17_9754fb83ad69_hanging-with-some-old-friends-/image_2.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #188"
        },
        {
            "content": [],
            "link": "https://harper.blog/2025/04/17/an-llm-codegen-heros-journey/",
            "publishedAt": "2025-04-17",
            "source": "Harper Reed",
            "summary": "<p>I have spent a lot of time since my <a href=\"https://harper.blog/2025/02/16/my-llm-codegen-workflow-atm/\">blog post</a> about my LLM workflow talking to folks about codegen and how to get started, get better, and why it is interesting.</p> <p>There has been an incredible amount of energy and interest in this topic. I have received a ton of emails from people who are working to figure all of this out. I started to notice that many people are struggling to figure out how to start, and how it all fits together. Then I realized that I have been hacking on this process since 2023 and I have seen some shit. Lol.</p> <p>I was talking about this with friends (Fisaconites&rsquo;s represent) and I sent this message in response to a thread about AI assisted agents, and editors:</p> <blockquote> <p>if i were starting out, i don&rsquo;t know if it is helpful to jump right into the &ldquo;agent&rdquo; coders. It is annoying and weird. having walked a few people through this (successfully, and not successfully) I find that the &ldquo;hero&rsquo;s journey&rdquo; of starting with the Copilot, moving to the copy and paste from Claude web, to the Cursor/continue, to the fully automated &ldquo;agents&rdquo; seems to be a successful way",
            "title": "An LLM Codegen Hero's Journey"
        },
        {
            "content": [],
            "link": "https://harper.blog/now/2025-04-17/",
            "publishedAt": "2025-04-17",
            "source": "Harper Reed",
            "summary": "<h2 id=\"and-we-are-off\">And we are off..</h2> <ul> <li>This company is started.</li> <li>We have raised some money from amazing people.</li> <li>I am excited to be building things again.</li> <li>Thinking a lot about what I want <a href=\"https://2389.ai\">2389 Research</a> to turn into.</li> <li>I can&rsquo;t wait to show you what we are building.</li> </ul> <h3 id=\"the-weird\">The weird</h3> <ul> <li>I am still feeling a deep sense of uncertainty.</li> <li>AI is coming for us faster than we thought.</li> <li>I don&rsquo;t think people my age who are being laid off now are going to be able to find jobs equivalent to what they had before.</li> <li>The state of the US is very concerning at the moment.</li> </ul> <img alt=\"\" class=\"img \" height=\"\" src=\"https://harper.blog/images/posts/worse.jpg\" title=\"\" width=\"\" /> <h3 id=\"the-normal\">The normal</h3> <ul> <li>Reading a lot of books. Send me your recs.</li> <li>Started bringing my camera everywhere, again. Come get your photo taken.</li> <li>Trying to meet people out and about. HMU. let&rsquo;s get lunch</li> <li>Running is fun. Ugh. Very much type 2 fun.</li> </ul> <h4 id=\"working-on-a-lot-of-tech-projects\">Working on a lot of tech projects</h4> <ul> <li>I am an AI assistant.</li> <li>Trying to blog a lot more and at a regular cadence. Now with <a href=\"https://harper.blog/notes/\">notes</a>.</li> <li>Pretty excited about Bluesky and atproto specifically.",
            "title": "Now @ 04-17-2025"
        },
        {
            "content": [
                "<p>This is the irregular classifieds thread. Advertise whatever you want in the comments.</p><p>To keep things organized, please respond to the appropriate top-level comment:<strong> Employment, Dating, Read My Blog </strong>(also includes podcasts, books, etc)<strong>, Consume My Product/Service, Meetup, </strong>or <strong>Other. </strong>Don&#8217;t post new top-level comments; I will delete anything that&#8217;s not in the appropriate category.</p><p>Remember that posting dating ads is hard and scary. Please refrain from commenting too negatively on anyone&#8217;s value as a human being. I&#8217;ll be less strict about employers, bloggers, etc.</p><p>Potentially related links:</p><p>&#8212; <a href=\"https://jobs.80000hours.org/\">EA job board</a><br />&#8212; <a href=\"https://ea-internships.pory.app/\">EA internships</a><br />&#8212; <a href=\"https://www.lesswrong.com/community\">Find a Less Wrong/ACX meetup</a></p>"
            ],
            "link": "https://www.astralcodexten.com/p/acx-classifieds-425",
            "publishedAt": "2025-04-17",
            "source": "SlateStarCodex",
            "summary": "<p>This is the irregular classifieds thread. Advertise whatever you want in the comments.</p><p>To keep things organized, please respond to the appropriate top-level comment:<strong> Employment, Dating, Read My Blog </strong>(also includes podcasts, books, etc)<strong>, Consume My Product/Service, Meetup, </strong>or <strong>Other. </strong>Don&#8217;t post new top-level comments; I will delete anything that&#8217;s not in the appropriate category.</p><p>Remember that posting dating ads is hard and scary. Please refrain from commenting too negatively on anyone&#8217;s value as a human being. I&#8217;ll be less strict about employers, bloggers, etc.</p><p>Potentially related links:</p><p>&#8212; <a href=\"https://jobs.80000hours.org/\">EA job board</a><br />&#8212; <a href=\"https://ea-internships.pory.app/\">EA internships</a><br />&#8212; <a href=\"https://www.lesswrong.com/community\">Find a Less Wrong/ACX meetup</a></p>",
            "title": "ACX Classifieds 4/25"
        },
        {
            "content": [],
            "link": "https://lethain.com/stripe-sorbet/",
            "publishedAt": "2025-04-17",
            "source": "Will Larson",
            "summary": "<p>Many hypergrowth companies of the 2010s battled increasing complexity in their codebase by <a href=\"https://lethain.com/decompose-monolith-strategy/\">decomposing their monoliths</a>. Stripe was somewhat of an exception, largely delaying decomposition until it had grown beyond three thousand engineers and had accumulated a decade of development in its core Ruby monolith. Even now, significant portions of their product are maintained in the monolithic repository, and it&rsquo;s safe to say this was only possible because of Sorbet&rsquo;s impact.</p> <p>Sorbet is a custom static type checker for Ruby that was initially designed and implemented by Stripe engineers on their Product Infrastructure team. Stripe&rsquo;s Product Infrastructure had similar goals to other companies&rsquo; Developer Experience or Developer Productivity teams, but it focused on improving productivity through changes in the internal architecture of the codebase itself, rather than relying solely on external tooling or processes.</p> <p>This strategy explains why Stripe chose to delay decomposition for so long, and how the Product Infrastructure team invested in developer productivity to deal with the challenges of a large Ruby codebase managed by a large software engineering team with low average tenure caused by rapid hiring.</p> <p>Before wrapping this introduction, I want to explicitly acknowledge that this strategy was spearheaded by Stripe&rsquo;s Product Infrastructure",
            "title": "Why did Stripe build Sorbet? (~2017)."
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-04-17"
}