{
    "articles": [
        {
            "content": [
                "<p><em>[This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked]</em></p><h1>Introduction</h1><p>The Astral Codex Ten (ACX) Commentariat is defined as the 24,485 individuals other than Scott who have contributed to the corpus of work of Scott&#8217;s blog posts, chiefly by leaving comments at the bottom of those posts. It is well understood (by the Commentariat themselves) that they are the best comments section anywhere on the internet, and have been for some time. This review takes it as a given that the ACX Commentariat outclasses all of its pale imitators across the web, so I won&#8217;t compare the ACX Commentariat to e.g. reddit. The real question is whether our glory days are behind us &#8211; specifically whether the ACX Commentariat of today has lost its edge compared to the SSC Commentariat of pre-2021.</p><p>A couple of years ago Scott asked, <em><a href=\"https://www.astralcodexten.com/p/why-do-i-suck\">Why Do I Suck?</a></em>. This was a largely tongue-in-cheek springboard to discuss a substantive criticism he regularly received - that his earlier writing was better than his writing now. How far back do we need to go before his writing was &#8216;good&#8217;? Accounts seemed to differ; Scott said that the feedback he got was of two sorts:</p><ul><li><p>&#8220;I loved your articles from about 2013 - 2016 so much! Why don&#8217;t you write articles like that any more?&#8221;, which dates the decline to 2016</p></li><li><p>&#8220;Do you feel like you&#8217;ve shifted to less ambitious forms of writing with the new Substack?&#8221;, which dates the decline to 2021</p></li></ul><p>Quite a few people responded in the comments that Scott&#8217;s writing hadn&#8217;t changed, but it was the experience of being a commentor which had worsened. For example, David Friedman, a prolific commentor on the blog in the SSC-era, <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4845801\">writes</a>:</p><blockquote><p><em>A lot of what I liked about SSC was the commenting community, and <strong>I find the comments here less interesting than they were on SSC</strong>, fewer interesting arguments, which is probably why I spend more time on [an alternative forum] than on ACX.</em></p></blockquote><p>Similarly, kfix seems to be a long-time lurker (from as early as 2016) who has become more active in the ACX-era, <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4867404\">writes</a>:</p><blockquote><p><em>I would definitely agree that <strong>the commenting community here is 'worse' than at SSC</strong> along the lines you describe, along with the also unwelcome hurt feelings post whenever Scott makes an offhand joke about a political/cultural topic.</em></p></blockquote><p>And of course, this position wasn&#8217;t unanimous. Verbamundi Consulting is a true lurker who has only ever made one post on the blog &#8211; <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4840676\">this one</a>:</p><blockquote><p><em>Ok, I've been lurking for a while, but I have to say: I don't think you suck&#8230; You have a good variety of topics, <strong>your commenting community remains excellent</strong>, and you're one of the few bloggers I continue to follow.</em></p></blockquote><p>The ACX Commentariat is somewhat unique in that it self-styles itself as a major reason to come and read Scott&#8217;s writing &#8211; Scott offers up some insights on an issue, and then the comments section engages unusually open and unusually respectful discussion of the theme, and the total becomes greater than the sum of the parts. Therefore, if the Commentariat has declined in quality it may disproportionately affect people&#8217;s experience of Scott&#8217;s posts. The joint value of each Scott-plus-Commentariat offering declines if the Commentariat are not pulling their weight, even if Scott himself remains just as good as ever. In <em>Why Do I Suck?</em> Scott suggests that there is weak to no evidence of a decline in his writing quality, so I propose this review as something of a companion piece; is the (alleged) problem with the blog, in fact, staring at us in the mirror?</p><p>My personal view aligns with Verbamundi Consulting and many other commentors - I&#8217;ve enjoyed participating in both the SSC and ACX comments, and I haven&#8217;t noticed any decline in Commentariat quality. So, I was extremely surprised to find the data totally contradicted my anecdotal experience, and indicated a very clear dropoff in a number of markers of quality at almost exactly the points Scott mentioned in <em>Why Do I Suck?</em> &#8211; one in mid-2016 and one in early 2021 during the switch from SSC to ACX.</p><h1>Setting Out the Case for Decline</h1><p>There&#8217;s a pretty basic question that needs to be answered before we compare the Commentariat today to that of yesteryear. That question is - does &#8216;the Commentariat&#8217; actually exist?</p><p>It is easy to understand what it means for Scott&#8217;s writing to have got better or worse over time, or to track the evolution of a specific commentor&#8217;s engagement with the blog. But in order to review &#8216;the Commentariat&#8217; as a whole we would have to treat it as a single entity with discernible patterns and tendencies. I believe this approach is justified; the Commentariat has a distinct culture, voice and its own unique animal spirits that react to both Scott&#8217;s interests and the interests of the external world. Since it is not just generating random noise, it is possible to explore the Commentariat over time to build a case that its overall quality is declining (or not).</p><p>To demonstrate this, I have displayed below a graph of comments per post across the lifetime of the blogs. It may not be quite fair to say that &#8216;engagement&#8217; is the same thing as &#8216;quality&#8217;, but I certainly think it raises a question that needs to be answered; something massively affects comment engagement in 2016 and then again in 2021.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!04Ny!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F67ab1e15-6e36-4500-8980-ad652af543c6_745x421.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"421\" src=\"https://substackcdn.com/image/fetch/$s_!04Ny!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F67ab1e15-6e36-4500-8980-ad652af543c6_745x421.png\" width=\"745\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>In this graph, each datapoint represents a month that Scott has been blogging. A typical month will have between 15-20 posts, of which around half will be authored by Scott and half will be &#8216;authored&#8217; in some way by the Commentariat, which are mostly Open Threads. I&#8217;ve averaged by month because certain types of post get much less engagement than others, and so looking at individual posts ended up too noisy to make attractive graphs (the true goal of any honest statistician).</p><ul><li><p>The SSC-era is highlighted in blue. You can see that it shows something a bit like a classic sigmoidal adoption curve (but wearing a top hat). Post engagement starts low, before rapidly shooting up in 2014-15. It peaks in April 2016 &#8211; which is highlighted in red in this and all subsequent graphs so you can track peak engagement - before dropping back to a steady level of around 400-600 comments per post for the next three years. Notably, the run of posts that most people regard as being the &#8216;Golden Age&#8217;<em> </em>for Scott&#8217;s writing happens much <strong>earlier</strong> than peak engagement with the comments section. People disagree about where this run of exceptionally good posts in quick succession start and ends, but I think you could safely say it has definitely begun by the time of <em><a href=\"https://slatestarcodex.com/2014/04/28/the-control-group-is-out-of-control/\">The Control Group is Out of Control</a> </em>(although I would date it a little earlier, personally) and ends with either <em>The <a href=\"https://slatestarcodex.com/2014/12/17/the-toxoplasma-of-rage/\">Toxoplasmosa of Rage</a> </em>or <em><a href=\"https://slatestarcodex.com/2015/01/01/untitled/\">Untitled</a></em> &#8211; basically 2014 has a high density of &#8216;important&#8217; posts.</p></li></ul><ul><li><p>There&#8217;s then a white band representing the NYT unpleasantness where the blog was briefly on a hiatus, and the posts in that period were very weird (statistically speaking). I won&#8217;t say much about this period in my review.</p></li></ul><ul><li><p>The ACX-era begins in 2021 and is highlighted in green. You can see engagement starts lower than the SSC steady-state of 400-600 comments per post (maybe more like 300-400 per post) but increases over time to at least that level by 2024, getting close to the peak engagement era. In one of life&#8217;s small ironies, Scott wrote <em>Why Do I Suck?</em> at close to the lowest period of engagement the blog had experienced for nearly a decade.</p></li></ul><p>My key conclusion is that someone who says they preferred what the comments section used to be like is not (necessarily) just being curmudgeonly &#8211; something really did happen between pre-2016 SSC and post-2016 SSC, and then again between SSC as a whole and ACX as a whole, which caused a lot of people to disengage from the comments section. Furthermore, we would expect engagement to track quality quite closely (because people don&#8217;t want to engage with a bad comment section), and so a very strong hypothesis for an otherwise unexplained drop in comment engagement is a corresponding drop in Commentariat quality.</p><p>Interestingly, after a few years of lower engagement than steady-state SSC, engagement with ACX is trending upwards at the moment. If you were optimistic, you might even say that the early signs are that 2025 is showing the first bit of the fast-growth section of a sigmoidal adoption curve. If this initial trend continues, the ACX Commentariat will surpass the peak of SSC Commentariat around lunchtime on the 27<sup>th</sup> July this year, so mark that in your calendars.</p><h1>Commentariat Quality &#8211; A Deep Dive</h1><p>&#8216;Professional&#8217; reviewers &#8211; a thousand curses heaped upon their name &#8211; often rely on vague and idiosyncratic measures of quality. This may be appropriate for trivialities like literature and music, but when it comes to important things like the ACX Commentariat I&#8217;d prefer to follow good Commentariat norms and use clearly defined objective criteria in my review. I&#8217;ve therefore broken down comment quality into four key factors that, in my view, define the Commentariat&#8217;s unique character:</p><ul><li><p><strong>Depth of engagement with a topic</strong> &#8211; When the comment section is good, it is characterised by people taking time to uncover each other&#8217;s views and identify genuine disagreement, rather than just rehearsing tribally-coded talking points or making incendiary &#8216;drive-by&#8217; comments and disappearing.</p></li><li><p><strong>Freedom of intellectual engagement</strong> &#8211; A feature which many people appreciate about the SSC/ACX comments section is the freedom to discuss socially or professionally sensitive ideas (i.e. ideas which could get you sacked from a University if you expressed them publicly). If the Commentariat are censored or self-censoring they lose this unique feature making ACX better than other blogs.</p></li><li><p><strong>Politeness </strong>&#8211; Perhaps more than any other blog, the Commentariat considers itself to be a &#8216;polite&#8217; place, where people are afforded a fair opportunity to discuss ideas. There are strong community norms towards politeness, even when engaging with very emotive topics. Other websites have free speech norms (such as 4Chan or early-days reddit), but ACX is unique in having strong norms both for free speech <strong>and </strong>politeness.</p></li><li><p><strong>Complexity of thought </strong>&#8211; Perhaps the most important feature distinguishing the ACX Commentariat from other, lesser, blogs is that some really smart people comment here and give novel and well-nuanced takes on a topic. If this ever disappeared it would not matter about any of the other three features, because the Commentariat would effectively be dead anyway.</p></li></ul><p>To me, these broad categories represent the unique and positive features of the SSC/ACX Commentariat, and the extent to which they are present is a reasonable indicator of comment section quality, especially if they are all present at the same timepoint and that timepoint happens to line up with peak engagement in 2016 (this is foreshadowing).</p><p>To generate data on the ACX Commentariat, I scraped the comments section of every post Scott has made since 2013. The Old Ones whisper of a blog that existed before even Slate Star Codex, but since I&#8217;m not 100% certain we&#8217;re encouraged to talk about the older blog (and nobody dates the golden era of Scott&#8217;s writing to pre-2013 anyway) I kept my scraping to just the two websites we&#8217;re definitely allowed to talk about; Slate Star Codex (SSC) and Astral Codex Ten (ACX). The main points of failure with my scraping were Subscriber-only threads (which my algorithm virtuously refused to read as it wasn&#8217;t a subscriber) and battling with the Substack UI to get all the comments to load for me simultaneously on larger threads. Nevertheless, between my incompetent code and the jaunty Substack UI I only dropped a few comments on even very long threads, so I figured the data scrape would be adequate for the use-case I had for it. I then used a bunch more janky code (some written by me, some written by ChatGPT) to try and quantify the levels of depth, freedom, politeness and complexity of each comment.</p><p>I captured 2460 individual posts, and approximately 1.8m comments. Of the 24,486 unique comment authors, around 40% have made only one comment to the blog. The most prolific poster is the irrepressible Deiseach, at 20,685 contributions. Deiseach is also the only commentor to have made a comment on both the <a href=\"https://slatestarcodex.com/2013/02/12/youre-probably-wondering-why-ive-called-you-here-today/\">first post</a> in my sample and <a href=\"https://www.astralcodexten.com/p/open-thread-374\">the last</a>, so has been with the blog a very long time! Only one other commentor has made more contributions than Scott (11,249), and this is John Schilling (11,607). The quality of data on individual users is not great for the ACX era (Substack seems to record missing author data in a few different ways, and sometimes swallow data for no reason) but I&#8217;m happy to give the rank ordering of anyone else who cares to know their specific level of clout in this niche community - I myself am the 799<sup>th</sup> most prolific contributor to the comments section (225 comments).</p><p>I&#8217;m also delighted to share my raw data with anyone interested &#8211; the summary statistics per post are <a href=\"https://www.dropbox.com/scl/fi/d9k5baawey2gmijbafdli/ACX_Commentariat_Summary-Public.xlsx?rlkey=d916a5hexf9xflcmsyb7ob0iw&amp;dl=0\">here</a>. The scraped comments themselves are about 2Gb so I don&#8217;t know where I can host them but if anyone has any ideas (and Scott doesn&#8217;t mind) I&#8217;ll share them too. I know that some of the post titles seem to have turned into hieroglyphics, but as far as I can tell it is cosmetic only and won&#8217;t affect any of the actual data &#8211; it is a symptom of a cool hidden feature of Microsoft Excel where it open UTF-8 encoded CSVs in a way that garbles special characters for no particular reason.</p><p>Considering each of these factors in turn:</p><ol><li><p><strong>Depth of engagement with a topic</strong></p></li></ol><p>Depth of engagement matters for several reasons, but the most important is simply that it shows people are getting enough out of a discussion to keep participating - a strong marker of a high-quality Commentariat. This is especially relevant in the ACX context, where many commentors don&#8217;t fit neatly into predefined categories like &#8216;Democrat&#8217; or &#8216;Republican.&#8217; As a result, discussions often require more time to clarify positions and establish common ground before real debate can begin. In that sense, depth also serves as a proxy for the number of interesting and non-standard voices present, which is itself a sign of a healthy and valuable comment section.</p><p>To operationalise this idea, I looked at the average depth of a comment chain (that is, suppose you took a random comment from anywhere within the comment section of a particular month &#8211; how many parent comments would that comment have?). Apparently professional data scientists sniff at this measure because it over-weights very deep back-and-forth between two people, vs many shallow engagements with a top-level post (which I guess is optimal for brand engagement or something) but in an SSC/ACX context deep discussion between two people is actually desirable, so I kept the simple approach. I have also considered the number of top-level comments which get no responses as a marker of &#8216;drive-by&#8217; posting &#8211; commentors who just fling low-effort comments off into the void with no expectation of adding constructively to the discussion.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!1PlY!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F643b3041-4efd-4aa4-ae3f-59cca580793d_770x388.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"388\" src=\"https://substackcdn.com/image/fetch/$s_!1PlY!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F643b3041-4efd-4aa4-ae3f-59cca580793d_770x388.png\" width=\"770\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>The average depth of a comment chain is actually highest now, in 2025. However, the proportion of comments with zero replies was lowest during 2016, and has been creeping up steadily since &#8211; meaning that the proportion of commentors who find themselves just screaming into the void with no response has increased since 2016. I don&#8217;t precisely know how to weight &#8216;discussions are good when they get going&#8217; vs &#8216;discussions are easy to get going&#8217;, but we could try and capture some of the intuition here with a compound &#8216;engagement score&#8217; (for example below I show the sum of all comment depth in a thread). Regardless of exactly how you operationalise it, it is reasonable to say 2016 was a strong period for depth of engagement, and that engagement markers have been trending upwards since the start of ACX, reversing a decline seen in the later SSC-period.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!vLoU!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d793b9-0c8b-4061-bbf3-a467ee5aeffe_744x406.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"406\" src=\"https://substackcdn.com/image/fetch/$s_!vLoU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d793b9-0c8b-4061-bbf3-a467ee5aeffe_744x406.png\" width=\"744\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>I treat more engagement as an unalloyed good, but this might actually not be true. A recurring discussion which occurs in the Commentariat is whether it has become too big to have a reasonable conversation.</p><p>For example, benwave <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4840323\">writes</a>:</p><blockquote><p><em>One thing I do think has seriously gone downhill for me personally is the participation aspect, and that's just because the comments section has just gotten tooooo biiiiiig. Getting your comment noticed is hard, keeping up with the others is hard and lately I've just given up trying. The comments here used to feel a lot like an epistemic little league, and I adored that.</em></p></blockquote><p>I raise this because it is easy to see how too much free speech could be polarising, or too much politeness stifling &#8211; but I wanted to flag that a good comment section seems to lie in a Goldilocks zone of pretty much <strong>every</strong> dimension. I also love the idea of an &#8216;epistemic little league&#8217; happening below the primetime event of Scott&#8217;s posts.</p><ol start=\"2\"><li><p><strong>Freedom of intellectual engagement</strong></p></li></ol><p>Freedom of intellectual engagement matters because people describe the SSC/ACX forum as one of the only places they can go to get honest critique of prevailing intellectual orthodoxy. Respectful discussion of highly emotive topics is a unique feature of the Commentariat which is not replicated in heavily censored spaces (especially in meatspaces where you can suffer very real harm for expressing a view which is seen as locally unacceptable).</p><p>For example, bruce <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4842430\">writes</a>:</p><blockquote><p><em>I don't think Scott's quality has changed much, but the comments section used to be a lot more right-left confrontational. If that comes back the place will probably be purged.</em></p></blockquote><p>This captures two main ideas very neatly (thank you, bruce) &#8211; that the ACX Commentariat was good in the past because it was honest and confrontational about major political cleavages in the Anglosphere world, and is not so good now because it has to be heavily censored to avoid cancel culture.</p><p>To operationalise a test of whether this was true, I built a dictionary of phrases which I will euphemistically describe as &#8216;socially or professionally sensitive&#8217;. I then searched the comments I had scraped for occurrences of any word in my dictionary, and counted the proportion of comments which contained a &#8216;sensitive&#8217; token. To give a sample of some of the words in my dictionary, around half of all &#8216;sensitive&#8217; tokens in the comments ended up being one of either &#8216;trans*&#8217;, &#8216;feminis*&#8217;, &#8216;immigra*&#8217;, &#8216;race&#8217; / &#8216;racis*&#8217; or &#8216;climate change&#8217; (the * means I didn&#8217;t care about what followed that set of letters, so for example &#8216;transgender&#8217; and &#8216;transsexual&#8217; are both covered, but also &#8211; annoyingly &#8211; &#8216;transparent&#8217; and &#8216;transport&#8217; would also be captured which I only spotted just now). The graph of my output is below.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!nwHk!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F041925e0-49be-430b-9930-429ebfb16859_694x399.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"399\" src=\"https://substackcdn.com/image/fetch/$s_!nwHk!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F041925e0-49be-430b-9930-429ebfb16859_694x399.png\" width=\"694\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>This graph shows that around 9% of comments will contain at least one token indicating the comment is discussing a sensitive topic, with a range of about 6% to 14%, disregarding the very early years where small sample size made the data more variable. There wasn&#8217;t any one &#8216;sensitive&#8217; token in particular which correlated exceptionally well with the rise and fall of this 6% to 14%, which implies to me that we have correctly identified a general factor of &#8216;willingness to discuss sensitive topics&#8217; (or possibly that the peaks and troughs correspond to peaks and troughs in the external landscape &#8211; ie specific touchpoints and lulls in the Culture War &#8211; which would also be fine for the purpose we&#8217;re putting it to).</p><p>This is an imperfect measure because it only tracks if someone is using a sensitive phrase and not whether they are using it in a heretical way (cf. &#8216;fifty Stalins&#8217; <a href=\"https://slatestarcodex.com/2013/03/03/reactionary-philosophy-in-an-enormous-planet-sized-nutshell/\">here</a>). However, I thought in the context of ACX posts the approach was probably reasonable &#8211; sensitive phrases are only likely to appear if they are being discussed a lot, and we know from the previous section that discussion depth is high both now and during the 2016 peak engagement period. It isn&#8217;t <em>necessarily</em> true that deep discussion implies spirited debate - some political discussions on reddit can go into the thousands of comments without anyone ever actually expressing a counter-orthodoxy view &#8211; but I think in the specific context of ACX it is reasonable, because we don&#8217;t generally have norms of expressing substanceless agreement. Hopefully, therefore, the changing ratio of socially or professionally sensitive phrases to phrases not included in my dictionary would tell us something about the willingness of the comment section to engage in potentially emotive discussions at any point in time.</p><p>The relationship of occurrence of these tokens to engagement with the comment section is hard to draw clear conclusions from &#8211; although the peak does indeed look to be about 2016 or 2017 the data are noisy, and strongly affected by the choice of words to include in my dictionary. I picked the dictionary before I saw the data, but perhaps a different set of words would have given a different result, especially if I had a better way of identifying sensitive discussions around COVID (&#8216;ivermectin&#8217; was the only COVID-related word I could think of that became politicised in the same way &#8216;microaggression&#8217; or &#8216;misgender&#8217; did). Nevertheless, I would say this gives some weak support to the idea that 2016 was a turning point in SSC Commentariat free speech norms (and strong support to the idea that the start of ACX was a low point for discussion of sensitive topics)</p><p>I include below a few specific sensitive phrases which I thought were interesting. Do note the different scales on each graph. Of particular interest to me is the &#8216;SJW&#8217; graph, which has a really clear peak at exactly the high point of Commentariat engagement. I will return to this graph later in the review.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!DD3w!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd75c3c55-0fc8-4c3e-bd67-7d1f406d2df5_723x428.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"428\" src=\"https://substackcdn.com/image/fetch/$s_!DD3w!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd75c3c55-0fc8-4c3e-bd67-7d1f406d2df5_723x428.png\" width=\"723\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><ol start=\"3\"><li><p><strong>Politeness</strong></p></li></ol><p>One of the most appealing aspects of the ACX Commentariat, to me, is that ideas respectfully presented are respectfully engaged with &#8211; even when mainstream cultural commentors use this as a stick to beat ACX with. Strong community norms for <a href=\"https://slatestarcodex.com/2014/02/23/in-favor-of-niceness-community-and-civilization/\">niceness, community and civilisation</a> are very rare in online spaces, so the ACX Commentariat may be especially sensitive to fluctuating levels of politeness.</p><p>To operationalise this, I used a preweighted neural network trained to identify &#8216;toxicity&#8217; in comment sections. The model, produced by the online safety company Unitary, is named &#8216;toxic-bert&#8217; and identifies potentially impolite comments along a few axes of inappropriateness, for example; general toxicity, profanity and threats. I wasn&#8217;t quite sure if some of the routine discussions SSC/ACX has on socially or professionally sensitive ideas might trip the &#8216;toxicity&#8217; filter even when they were respectful and polite, so to test for this, I included a sense check of occurrences of some words which are very rarely uttered in constructive contexts &#8211; specifically; &#8216;dumbass&#8217;, &#8216;fuck you&#8217;, &#8216;fucking&#8217; and &#8216;retard&#8217;. I&#8217;ve called these &#8216;obvious insults&#8217; even though in hindsight that&#8217;s a bit strong, and they have all been used in non-toxic contexts at some point or the other by the Commentariat. For example, <a href=\"https://slatestarcodex.com/2019/02/19/gpt-2-as-step-toward-general-intelligence/#comment-722482\">here</a> is an entirely non-toxic comment by Paperclip Minimiser using the word &#8216;retard&#8217; in the sense of &#8216;to slow down progress&#8217; (toxicity score &lt; 0.001) and <a href=\"https://slatestarcodex.com/2015/12/08/links-1215-maoz-tz-url/#comment-278443\">here</a> is a comment by nydwracu which uses the word &#8216;retarded&#8217; as a slur but which is nevertheless so insightful that it was awarded &#8216;Comment of the Week&#8217; status by Scott, suggesting that a little bit of toxicity as a literary device can sometimes be overlooked by both toxic-bert and Scott (toxicity score = 0.01).</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!Hktd!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd5541524-dcce-4bb9-a6dd-8481fc696769_817x417.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"417\" src=\"https://substackcdn.com/image/fetch/$s_!Hktd!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd5541524-dcce-4bb9-a6dd-8481fc696769_817x417.png\" width=\"817\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>The graph above shows the output of these two approaches. This is a really weird result, which defies easy explanation. Toxicity goes down over the whole SSC era, then starts ticking back up again from the ACX era. If you allow for a bit more variability in the simpler measure, the fancy neural network closely tracks the number of times we call each other &#8216;retards&#8217; or &#8216;dumbasses&#8217;, which you would expect to track overall toxicity quite closely. This suggests the neural network is keying in on actual toxicity, rather than polite discussions which happen to involve contested or sensitive concepts.</p><p>One caveat is that the ACX Commentariat is not very toxic to begin with, so the &#8216;toxicity&#8217; metric may not be sensitive enough to capture the sort of politeness which the Commentariat values. In 2013, at peak toxicity, the toxicity score maxed out at 0.04 (the spike in October 2013 seems to be related to attracting some external neo-reactionaries (very roughly the precursor ideology to the modern alt-right) to comment on this <a href=\"https://slatestarcodex.com/2013/10/24/some-preliminary-responses-to-responses-to-the-anti-reactionary-faq/\">post</a>. In 2021, the lowest toxicity ever was reached at around 0.01. This means that a typical comment would be around 4% likely to be perceived as toxic by a human reader in 2013, but by 2021 this has fallen to 1%. Here is a snippet of a comment which is rated as having a 1% chance of being perceived as toxic by a human, written by John Schilling:</p><blockquote><p><em>The purpose of war is, roughly speaking, to settle the question of whose police get to enforce which laws in a region, and since Catalonia isn&#8217;t going to do anything more than say, &#8220;We&#8217;re going to make you look like Evil Meanies on TV and Youtube if you don&#8217;t pull back your policemen and let us have our own&#8221;, that point is moot. [<a href=\"https://slatestarcodex.com/2017/09/27/open-thread-85-25/#comment-551869\">Link</a>]</em></p></blockquote><p>By contrast, if you promise to draw your fainting couch nearby, here is a snippet of a comment which is rated as having a 4% chance of being perceived as toxic by a human, written by Maximum Limelihood:</p><blockquote><p><em>Being fired means nothing about the speed you&#8217;re learning at. It means that the employer overestimated how much you *already* knew. &#8230;. Unfortunately, it doesn&#8217;t matter how great you&#8217;ll be at coding in a year when you&#8217;re costing me time and training effort today [<a href=\"https://www.astralcodexten.com/p/open-thread-234/comment/8012912\">Link</a>]</em></p></blockquote><p>The most toxic the comments section has ever got (beyond the very early days) was on the post <em><a href=\"https://slatestarcodex.com/2018/04/19/gupta-on-enlightenment/\">Gupta on Enlightenment</a></em>. I feel like the comments section on this post should be part of the ACX main canon because it is so cosmically hilarious. It concerns a man name Vinay Gupta (founder of a blockchain-based dating website) and his claims to have reached enlightenment. Some people in the comments are sceptical that Vinay Gupta is indeed an enlightened being, citing that enlightened people don&#8217;t typically found blockchain-based dating websites. A new forum poster with the handle &#8216;Vinay Gupta&#8217;, claiming to be Vinay Gupta and writing in a very similar style to the actual Vinay Gupta, turns up and starts arguing with everyone in an extremely toxic way (in the objective sense that his comments score very highly on the toxic-bert scoring system), which provokes more merriment that a self-described enlightened being would deploy such classic internet tough-guy approaches as &#8216;I don&#8217;t think much of a four-on-one face off against untrained opponents&#8217; (<a href=\"https://slatestarcodex.com/2018/04/19/gupta-on-enlightenment/#comment-621226\">link</a>) and &#8216;this board is filled with self-satisfied assholes who feel free to hold forth on whatever subject crosses their minds, with the absolute certainty that they&#8217;re the smartest people in the room&#8217; (<a href=\"https://slatestarcodex.com/2018/04/19/gupta-on-enlightenment/#comment-621335\">link</a>, no further comment&#8230;). More prosaically, this is a great example of what I was discussing earlier &#8211; the comment section is usually so civilised that a single individual turning up and acting out of the Commentariat norms is enough to make it the most toxic discussion which has ever taken place.</p><p>Of Scott&#8217;s classic posts, the most toxic the comment section has ever become was on <a href=\"https://slatestarcodex.com/2014/08/31/radicalizing-the-romanceless/\">Radicalising the Romanceless</a>. The least toxic the comments section has ever been are the posts on Scott&#8217;s conworld, <a href=\"https://slatestarcodex.com/2013/05/15/index-posts-on-raikoth/\">Raikoth</a> (technically the Raikoth post on history and religion specifically, but the whole series is so good I&#8217;ve linked to the index).</p><ol start=\"4\"><li><p><strong>Complexity of thought</strong></p></li></ol><p>Complexity of thought is important because it indicates the effort being spent on each comment. Effort being spent on comments indicates that the Commentariat is treating each other with respect and thoughtfulness (or at least that&#8217;s my hypothesis).</p><p>This is a very hard one to rigorously quantify, but so help me we&#8217;re going to hold hands and give it our best shot together. Defining the complexity of thought is something which has defied philosophers for millennia, so instead I will look at the complexity of <em>language</em>, assuming this is a proxy for the care and attention (not to mention intellectual calibre) being put into a comment. I have looked at a few features of language which I thought might capture this idea.</p><p><strong>Complexity Approach 1 &#8211; Length of comment</strong></p><p>First and most importantly, I looked at how long a typical comment was. A long comment, I reasoned, was a good sign someone had spent some time thinking about what they wanted to say and took some time to actually say it. It is a running joke that Scott is extremely wordy, but this is also true of the Commentariat, for the most part &#8211; a typical comment is around 110 words, or slightly longer than this paragraph. In the graph below, we do see a clear peak, but the peak occurs in 2017 (so about a year later than the period of maximum engagement).</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!Ds9J!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff49a24fc-623a-40a4-8f85-fc7a22b30b14_687x398.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"398\" src=\"https://substackcdn.com/image/fetch/$s_!Ds9J!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff49a24fc-623a-40a4-8f85-fc7a22b30b14_687x398.png\" width=\"687\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p><strong>Complexity Approach 2 &#8211; Occurrence of complex words</strong></p><p>Second, I looked at the occurrence of complex words &#8211; both via a test of individual word length and through the use of the &#8216;SMOG Index&#8217; metric (<a href=\"https://readable.com/readability/smog-index/\">detail</a>), which basically tracks multisyllabic words &#8211; it is a <strong>S</strong>imple <strong>M</strong>easure <strong>o</strong>f <strong>G</strong>obbledygook. I figured both of these would show more complex comments, which required the use of jargon and compound phrases to express properly. This shows a longstanding trend towards shorter words over time (the effect is slight, but it seems to be speeding up since moving to ACX) and a clear peak in multisyllabic word usage at around 2017 &#8211; basically exactly the same time as comments reached their maximum length.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!vT-F!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F79d2748c-136d-4d82-bd43-2040349077ee_771x386.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"386\" src=\"https://substackcdn.com/image/fetch/$s_!vT-F!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F79d2748c-136d-4d82-bd43-2040349077ee_771x386.png\" width=\"771\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p><strong>Complexity Approach 3 &#8211; Lexical diversity</strong></p><p>Third, I looked at sentence construction. The type-token ratio is a simple measure of vocabulary richness, calculated by dividing the number of unique words (types) by the total number of words (tokens) in a text. This measure has a very specific problem in the context of the Commentariat in that it becomes less useful as comments become longer (because the chance of repeating a word increases). Therefore, I&#8217;ve also used the &#8216;Brunet Index&#8217;, which I know nothing about but which Google tells me fixes this problem. The two measures have an inverse relationship to each other &#8211; type/token ratio measures lexical variety, Brunet Index measures lexical staleness. Weirdly, we <strong>do</strong> see a clear trend for a peak occurring in 2017 like the other complexity measures, but this trend is in the opposite direction than we might expect &#8211; the time of maximum comment length / word complexity was also the time of maximally stale vocabulary.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!Xeth!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F72c21d7a-d377-46df-ab7f-cf7989fbbd38_785x406.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"406\" src=\"https://substackcdn.com/image/fetch/$s_!Xeth!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F72c21d7a-d377-46df-ab7f-cf7989fbbd38_785x406.png\" width=\"785\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>I think, in hindsight, that this is reflecting a unique characteristic of the ACX Commentariat, which is that it is unusually likely to develop an idea or conceptual schema rather than just asserting something and moving on. For example, <a href=\"https://slatestarcodex.com/2014/09/01/book-review-and-highlights-quantum-computing-since-democritus/#comment-141698\">here&#8217;s</a> a Comment of the Week where Anatoly spends a very long time explaining the different meanings of &#8216;infinite&#8217; and &#8216;finite&#8217; in the context of explaining why P=NP is a difficult problem. It has a Brunet Index of 14.3 (so a little less than double the local average) because it repeats the words &#8216;infinite&#8217;, &#8216;finite&#8217; and &#8216;algorithm&#8217; many times. But I agree with the responses that this is a <strong>great</strong> comment, and exactly the sort of thing which only the ACX Commentariat seems to produce with any regularity. For a more recent example, <a href=\"https://www.astralcodexten.com/p/the-compounding-loophole/comment/66427471\">here&#8217;s</a> another comment of the week by Benjamin Jolley which adds some details to Scott&#8217;s post <em><a href=\"https://www.astralcodexten.com/p/the-compounding-loophole\">The Compounding Loophole</a></em>, and is also clearly a great post which fits very well into the Commentariat corpus. So my conclusion here is that documentation for these tests assumes that stale vocabulary is always bad, because it expects you to be using the tests on &#8211; for example - novels. However, stale vocabulary isn&#8217;t inherently good or bad, and in this case it serves as a marker for something the Commentariat like or value. Anecdotally, it looks like what the Commentariat value is something like &#8216;well defined terms&#8217;. Even if this doesn&#8217;t map cleanly to something we can point to, there&#8217;s no accounting for taste - if the Commentariat just happen to prefer lengthy stale sentences there&#8217;s nothing actually wrong with that. Therefore, this measure is consistent with the other measures of complexity even though it very clearly shows the opposite relationship than I expected.</p><p>Just for fun, I thought I would show the most repetitive comment ever written. This was actually slightly difficult as there are a lot of things which are both comments and repetitive but which would be uninteresting to count (spam, code snippets, pasted text from early LLMs where the model hangs and repeats the same text to infinity). The most repetitive non-spam comment which I reckon was generated by humans alone is <a href=\"https://www.astralcodexten.com/p/why-im-less-than-infinitely-hostile/comment/11040080\">this</a> comment by Deiseach, which quotes extensively from an early Irish law book (Brunet = 16.9). The most repetitive non-spam comment which I reckon has a single human author is <a href=\"https://slatestarcodex.com/2018/03/04/open-thread-96-5/#comment-608023\">this</a> comment by Fahundo (Brunet = 16.5), giving the answer to a logic problem in ROT13 (so actually possibly breaks the rule about not using a computer in the writing, but not in the way I meant!)</p><p><strong>Complexity Approach 4 &#8211; Reading age</strong></p><p>Finally, I looked at reading age, although this approach was largely unsuccessful. &#8216;Reading age&#8217; is an approximate composite measure of the complexity of language and sentence construction in a piece of text. There are quite a few different measures of reading age, which all show roughly the same outcome in my data. The one I have depicted below is the Flesh-Kincaid Grade level, which roughly tracks how many years of continuous schooling you would theoretically need to read and understand the text. The Commentariat is a largely very intellectual bunch and so a typical reading age of around 10.5 is unsurprising (a <em>typical</em> SSC/ACX comment is just barely less complex than an academic article in terms of vocabulary and construction, and the most complex comments significantly exceed this). The graph shows that comment complexity jumps by approximately half a grade level when SSC becomes ACX, but I&#8217;m a bit sceptical this is a &#8216;real&#8217; effect. Most reading age formulae track sentence length very closely, and for some reason sentence length also changes significantly around this time. I could genuinely believe that sentence length changes on the switch to ACX, but I don&#8217;t think measures of reading age are designed to be valid if sentence length is changing for reasons unrelated to the complexity of text, so I don&#8217;t think you can confidently conclude the ACX comments are more sophisticated from this measure alone.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!EIYh!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff6ac85e8-5bee-420c-8c36-205ae697484c_749x394.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"394\" src=\"https://substackcdn.com/image/fetch/$s_!EIYh!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff6ac85e8-5bee-420c-8c36-205ae697484c_749x394.png\" width=\"749\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p><strong>Complexity - Conclusions</strong></p><p>Overall, it is appropriate to discover that my measure of &#8216;complexity of thought&#8217; is itself complex. We do see very clear peaks in the SSC era, but not actually quite in the place we expected to see them. Similarly, we don&#8217;t always see the peak in the direction we expect (sentences are long and stale in the peak SSC years, which doesn&#8217;t seem like a recipe to promote engagement). Finally, we have a puzzle about how the Substack UI/UX causes significantly fewer sentences per comment.</p><p>My conclusion here is that these data are completely consistent with a Commentariat who have a particular thing that they like, which peaked in 2017. This thing quantitively <strong>looks like</strong> long stale sentences, but actually might qualitatively feel different &#8211; like for example careful definitions of words which are then used repeatedly. As for why the peak sentence length is after peak engagement, my best guess is that people didn&#8217;t stop engaging at random; the people with the strongest commitment to the Commentariat stuck around longest, and these are also the people with the most respect for SSC cultural norms (leave long, thoughtful comments) and willingness to dedicate time to commenting. I have heard this described as &#8216;<a href=\"https://www.lesswrong.com/posts/ZQG9cwKbct2LtmL3p/evaporative-cooling-of-group-beliefs\">evaporative cooling&#8217;</a> before. This group of &#8216;fanatics&#8217; hung around for a bit longer than everyone else, but eventually either they mostly left too or their influence on discussion norms was not strong enough to prevent a reversion towards the comment section mean (which tends towards shorter and less rigorous comments)</p><h1>What happened in 2016?</h1><p>From the data I extracted, it is clear <strong>something</strong> happened to the Commentariat in 2016(ish) and again in 2021 with the switch to ACX. Of the four measures I presented:</p><ul><li><p>Depth of engagement shows two clear directional reversals in 2016 and 2021</p></li><li><p>Freedom of expression shows a scruffy directional reversal in 2016 and a clearer one in 2021, and also looking at individual kinds of expression reveals very sharp peaks in 2016 for &#8216;SJW&#8217; and related phrases</p></li><li><p>Toxicity scores show a clear directional reversal in 2021 (but nothing in 2016)</p></li><li><p>Complexity of thought measures show clear directional reversals on every measure except average word length (which has been steadily declining) in both 2017 and 2021. This would be great confirmation for the theory that quality declined in 2016 except you&#8217;ll notice that 2017 is a bit too late to explain that!</p></li></ul><p>Overall, I&#8217;d say that all four of these measures point to a change which occurred when the Commentariat moved to Substack, and two-and-a-half point to a change which occurred in 2016.</p><p>To me, the ACX change is somewhat understandable &#8211; Substack has a different userbase, different UI and Scott started blogging there after nearly a year hiatus so he lost some of the momentum and norms established from SSC. The start of ACX also coincided with another wave of COVID cases, which in some countries at least will have significantly altered the &#8216;online-ness&#8217; of the general population. So, I don&#8217;t think we need to look especially hard for why ACX comments are a bit different to SSC comments. I also don&#8217;t think we need to look especially hard for why the ACX comments seem gradually moving more towards looking like peak-SSC; it took three years for SSC to reach peak quality, so we could tentatively propose that there is some sort of inherent &#8216;bedding in&#8217; time for new comment sections to feel out and formalise the norms they want to establish. Speculatively, perhaps Substack has a different mechanism for attracting readers to WordPress so the beginning of ACX featured a mix of SSC old guard and Substack newcomers, and it is taking some time for the community norms of the SSC old guard to assert themselves onto ACX.</p><p>The Commentariat seems capable of self-diagnosing the many ways in which the ACX change might have contributed to a decline in quality. For example, Moon Moth <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4839485\">writes</a>:</p><blockquote><p><em>I would posit that, for all of Substack's good qualities, the commenting experience is worse here. Which may be coloring commenters' overall impressions. [Expanding on this in another comment they write] Substack comments take too long to load, especially on mobile. And on mobile, they reload and lose my place whenever I switch tabs or apps &#8230; Which makes me reluctant to do anything but skim on mobile.</em></p></blockquote><p>And teddytruther <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4839300\">writes</a>:</p><blockquote><p><em>I also expect that this selection effect took a huge bump from the NYT controversy, which drew people primarily interested in Woke War Punditry and not a long series of guest posts on Georgist land taxes.</em></p></blockquote><p>The change which occurred in 2016 (and very specifically <strong>April</strong> 2016) is much less understandable to me. After some thought, I&#8217;ve come up with three possible hypotheses:</p><ul><li><p>Scott&#8217;s writing got worse in April 2016, causing mass disengagement, which changed the makeup of the comments section</p></li><li><p>The user experience of the blog unrelated to Scott&#8217;s writing changed in April 2016, which changed the way in which the Commentariat engaged with the comments section (in basically an exact parallel to the ACX switch)</p></li><li><p>The ACX Commentariat has a very specific set of hyperfixations, and world events around that time meant they weren&#8217;t able to satisfy that hyperfixation through commenting, so their commenting got lazier / worse and never really recovered.</p></li></ul><p>Considering each in turn:</p><ol><li><p><strong>Scott&#8217;s writing got worse</strong></p></li></ol><p>I kicked off this essay by referencing <em>Why Do I Suck?</em>, in which Scott presents some evidence that his writing has not got worse, replicated below:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!-p8E!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5b9cdf7f-2785-4552-9fa3-1ac861ccb7e1_746x293.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"293\" src=\"https://substackcdn.com/image/fetch/$s_!-p8E!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5b9cdf7f-2785-4552-9fa3-1ac861ccb7e1_746x293.png\" width=\"746\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>However, this pie chart only considers ACX vs SSC, not pre-2016 SSC vs post-2016-SSC. It is therefore still maybe consistent with Scott&#8217;s writing getting worse in April 2016 and never recovering. This could straightforwardly explain the drop in Commentariat quality in 2016 (but not 2021), but the evidence for a decline in writing quality centred on this period is anyway very mixed.</p><p>April 2016 has some great posts (including the &#8216;classic&#8217; <em><a href=\"https://slatestarcodex.com/2016/04/04/the-ideology-is-not-the-movement/\">The Ideology is Not the Movement</a></em>), but there were a lot of good posts around that time - the very start of May 2016 includes another &#8216;classic&#8217; in the form of <em><a href=\"https://slatestarcodex.com/2016/05/02/be-nice-at-least-until-you-can-coordinate-meanness/\">Be Nice, At Least Until you can Coordinate Meanness</a></em>. Nor can it be that readers somehow intuit that Scott has nothing more valuable to say on any topic going forward, because 2017 contains classics like <em><a href=\"https://slatestarcodex.com/2017/03/24/guided-by-the-beauty-of-our-weapons/\">Guided by the Beauty of our Weapons</a></em>, or my personal favourite SSC-era post, <em><a href=\"https://slatestarcodex.com/2017/02/09/considerations-on-cost-disease/\">Considerations on Cost Disease</a></em>. Not to mention, of course, there are some cracking ACX-era posts which are nearly a decade away at this point.</p><p>In my head, the cleanest story is that a bunch of people became regular readers of the blog because they read <em><a href=\"https://slatestarcodex.com/2014/07/30/meditations-on-moloch/\">Meditations on Moloch</a></em> or another of the universally-loved posts that were linked everywhere and then left when they realised the median post was &#8216;merely&#8217; as good as <em>The Ideology is Not the Movemen</em>t, but this story doesn&#8217;t make sense &#8211; you could certainly argue the toss about when &#8216;peak&#8217; SSC was, but if you believe it exists you&#8217;d surely have to put it centred somewhere around 2014. This would mean that the group of people who are disappointed by Scott&#8217;s output would have to get interested in the blog in 2014, stick around through the whole of 2015, and then leave <em>en masse</em> in April 2016 despite 2016 (in my subjective opinion) being better than 2015 for &#8216;important&#8217; posts.</p><p>Another point to consider is that the &#8216;Scott&#8217;s writing sucks now&#8217; hypothesis needs not only to explain why engagement fell off in 2016, but also why multisyllabic words and type/token ratio also peaked around that time. I think you can maybe tell a story where Scott&#8217;s writing gets worse in 2016 so people engage less with the comments (producing less comment depth and more zero-length comment chains) but it is very difficult to imagine how Scott&#8217;s writing getting worse produces more multisyllabic words. If Scott&#8217;s writing drives the disengagement, you have to start loading up the &#8216;evaporative cooling&#8217; hypothesis with a lot of weird epicycles in order for everything to all make sense at once.</p><p>In summary, I&#8217;m agnostic on the question of whether Scott&#8217;s writing has got worse. I personally don&#8217;t think it has (although the frequency of &#8216;hits&#8217; was remarkable in 2014) but perhaps it has changed a bit over time. However, I&#8217;m reasonably certain that nothing Scott writes is the reason for the dropoff in engagement around 2016, because there&#8217;s no coherent story you can tell that fits that hypothesis. I think this is an unproductive sidetrack to consider in a review of the Commentariat specifically.</p><ol start=\"2\"><li><p><strong>The user experience of the blog got worse</strong></p></li></ol><p>If Scott&#8217;s writing did not get worse, perhaps some other element of the blog did, which led to significant disengagement. For example, perhaps the moderation of SSC got more restrictive around this time or an incredibly obnoxious autoplay advert was introduced to the sidebar. We actually know that the Commentariat are quite sensitive to user experience changes, because Scott <a href=\"https://www.astralcodexten.com/p/open-thread-197\">notes</a> that Open Threads with an announcement get between 2-4x less engagement than those without. This theory seems very strong to me &#8211; the UX was one of the major complaints about early-days ACX, and it seems like you can explain the initial Commentariat stagnation and then flourishing for ACX with reference to the UX specifically.</p><p>For example, Vladimir <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4858680\">writes</a>:</p><blockquote><p><em>My personal theory is that the ACX website itself is less enjoyable. SSC had it's personal charms: I had to pinch and zoom slightly to read the small text better on my phone, and the blue decorations were comforting, and the comments felt like early internet forums for some reason. Now, everything feels more bland.</em></p></blockquote><p>And DinoNerd <a href=\"https://www.astralcodexten.com/p/why-do-i-suck/comment/4842157\">writes</a>:</p><blockquote><p><em>Personally, I find the ACX experience less good than that of SSC, but I can't disentangle how much of that is the substandard user interface.</em></p></blockquote><p>However, there are no corresponding comments for some massive change that occurred in April 2016, and I know because I read thousands of comments from that period trying to find one to quote here. SSC has always had a fairly loose <a href=\"https://slatestarcodex.com/2014/03/02/the-comment-policy-is-victorian-sufi-buddha-lite/\">moderation policy</a> (notwithstanding the occasional &#8216;reign of terror&#8217; when Scott clamped down on bad commentors) and has worked hard to keep adverts unobtrusive. I remember the only major change to SSC UX was the highlighting of comments you hadn&#8217;t read yet (which was an excellent change but I think came later than 2016).</p><p>The best explanation I have found for a massive change in UX which occurred in April 2016 is that April 2016 was the lowest ever posts per month, probably driven by Scott travelling at during this period and so having less time to post (<a href=\"https://slatestarcodex.com/2016/04/24/ot48-open-your-heart/\">link</a>)</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!fKsT!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F869c53f2-7631-46ba-986d-deb110f379f3_719x410.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"410\" src=\"https://substackcdn.com/image/fetch/$s_!fKsT!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F869c53f2-7631-46ba-986d-deb110f379f3_719x410.png\" width=\"719\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Following April 2016, posts per month spike sharply because Scott changes the frequency of Open Threads from biweekly to biweekly (or fortnightly to twice-weekly if you are going to insist on spoiling my joke). You can see an immediate impact on the proportion of each month&#8217;s posts which are Open Threads in the graph below. Note that the actual proportion of Open Threads in the ACX era is probably more like the later SSC era, it is just that my scraping algorithm didn&#8217;t catch the paid Subscriber-only Open Threads.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!PUC3!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc2d88bee-4abf-4ac2-aabf-d52eb707e220_727x405.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"405\" src=\"https://substackcdn.com/image/fetch/$s_!PUC3!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc2d88bee-4abf-4ac2-aabf-d52eb707e220_727x405.png\" width=\"727\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>So, on this theory, the Commentariat have an approximately fixed amount of time they want to devote to interacting with the comments section each week. The more posts there are, the more thinly they spread themselves across those posts &#8211; even if the posts are not core Scott-generated blogposts but rather Open Threads. Perhaps this also explains the changing complexity of language too &#8211; quantity and quality of engagement are somewhat substitutes for each other, so in a world where there are more posts than time available to engage with them, the response is to cut back a little on both quantity and quality of engagement. This process could be self-reinforcing; if the community norms become for lower-quality engagement, then this could lead to people trading off quality for quantity even further.</p><p>This leads to quite an interesting corollary, which is if true then to some extent Scott&#8217;s posts are irrelevant to the Commentariat&#8217;s enjoyment of Scott&#8217;s writing. The value of Scott&#8217;s writing is to act as a sort of butterfly net to catch the sort of people interested in Scott&#8217;s writing, and then once captured those people interact with each other in the comments section basically a fixed amount basically regardless of how often Scott posts. I don&#8217;t know how fully I endorse this theory, but it is interesting to think about how long the Commentariat would remain good <strong>even if</strong> Scott&#8217;s writing genuinely did drop in quality.</p><ol start=\"3\"><li><p><strong>The real world intruded on the Commentariat&#8217;s hyperfixations</strong></p></li></ol><p>In <em><a href=\"https://www.astralcodexten.com/p/the-rise-and-fall-of-online-culture\">The Rise and Fall of Online Culture Wars</a></em>, Scott notes that online feminism was absolutely everywhere from around 2014-16 and then just sort of&#8230; disappeared one day. This has some parallels (down to the timing) for engagement with the SSC Comments section &#8211; from 2014-16 engagement with the comments section seems to be on an unstoppable upward trajectory and then in April 2016 it just sort of&#8230; reverses.</p><p>I have already mentioned that April 2016 marked an extreme high-water mark for usage of the term &#8216;SJW&#8217;. From what I can see, there&#8217;s no particular reason for this specific to SSC &#8211; April 2016 has two threads with significant usage of the token, but they are completely random threads &#8211; <a href=\"https://slatestarcodex.com/2016/04/11/ot47-openai/\">OT47</a> and <a href=\"https://slatestarcodex.com/2016/04/15/links-416-they-cant-link-our-dick/\">Links 4/16</a> (Links 4/16 does have a link about social justice warriors so that makes some sense, but OT47 doesn&#8217;t, so my conclusion is that there is just something that was in the water around that time). This theory says that the Commentariat really liked talking about SJWs, and when they were prevented from talking about SJWs they just stopped engaging with the blog altogether.</p><p>The problem with this theory is that there is nobody really preventing the Commentariat from talking about SJWs to their heart&#8217;s content after April 2016. In February 2016, Scott requested that all Culture Wars topics be quarantined to a single Culture Wars thread on the r/slatestarcodex subreddit (<a href=\"https://slatestarcodex.com/2016/02/14/ot43-roses-are-thread/\">link</a>). This seems like the most common-sense explanation for the observation that the comment section changes dramatically around this time - <em>of course</em> engagement and usage of the term &#8216;SJW&#8217; falls off when usage of the term &#8216;SJW&#8217; is quarantined to a single thread in an offsite forum. However, the major problem with this explanation is that it doesn&#8217;t fit the data &#8211; comment section engagement <strong>increases</strong> throughout February &#8211; April 2016 and only starts dropping in May, when as far as I can see there is no specific events occurring in the r/slatestarcodex subreddit to explain it. Also, in February 2019 the Culture Wars Thread was euthanised (<a href=\"https://slatestarcodex.com/2019/02/22/rip-culture-war-thread/\">link</a>) but there is no corresponding uptick in comment section engagement as people migrated back from the Culture Wars thread to the SSC comments section.</p><p>I thought perhaps discussion of SJWs might have been drowned out by discussions of something else, such that it became pass&#233; to be discussing SJWs when there was some other Culture Wars issue at stake. This would mirror what happened to online feminism, where it became pass&#233; to discuss women specifically and more trendy to discuss intersectionality / race issues from about 2016 onwards. The obvious candidate for this switch is Trump and the rise of the MAGA movement. March 2016 was probably the last period where you could kind of convince yourself Trump wasn&#8217;t going to win the Republican Primary. In March 2016 it was just about possible Cruz could have won, but by April 2016 Trump was winning every Primary with decisive majorities. If you are slightly younger you may not have been online during that period, but I can attest that it was completely crazy commenting in political spaces around that time; I&#8217;d argue a strong candidate for the most toxic comments section ever is <em><a href=\"https://slatestarcodex.com/2016/11/16/you-are-still-crying-wolf/\">You Are Still Crying Wolf</a></em>, where Scott offers some extremely guarded non-criticism of Trump, arguing that he was not unusually racist by American Presidential standards. This didn&#8217;t make my database because Scott nuked the comments for being too toxic, so we will never know <em>mathematically </em>how bad the comments were, but anecdotally they were pretty standout &#8211; closer to 4Chan than ACX in places.</p><p>The evidence for this hypothesis is kind of mixed &#8211; if you abandon all sense of statistical appropriateness you can freehand draw a line which kind of looks like the decline in &#8216;SJW&#8217; tokens is mirrored by a rise in &#8216;Trump&#8217; tokens when you normalise the two terms, but you can also do that with any other word that was trending in April 2016, like &#8216;Snowden&#8217; or &#8216;Wikileaks&#8217; (or &#8216;Harambe&#8217; as per the graph below). Looking just at the data it isn&#8217;t really a very impressive correlation to draw.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!6J8h!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Faea86860-bafc-41c3-94f3-76f3b7424e18_863x331.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"331\" src=\"https://substackcdn.com/image/fetch/$s_!6J8h!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Faea86860-bafc-41c3-94f3-76f3b7424e18_863x331.png\" width=\"863\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>I appreciate it is so <em>boring</em> to conclude that Trump is the Great Satan for the millionth time. However, I do think if you add in contextual factors there is reason to be cautiously supportive of a &#8216;Donald Trump killed the AXC Comments Section&#8217; theory:</p><ul><li><p>The volume of &#8216;Trump&#8217; comments is absolutely massive - around 11% of all comments were about Trump in January 2017, which is greater than comments about Russia during their invasion of Ukraine (10%) and comments about COVID during the first few months of the pandemic (7%). Even a topic like SJWs, which the Commentariat really liked talking about, could only manage a peak of around 1.2% (although eg &#8216;gender&#8217; peaks at 5.5% and &#8216;feminis*&#8217; peaks at 3.7%). Concepts like &#8216;Harambe&#8217; and &#8216;Wikileaks&#8217; barely register on this scale, at 0.3% and 0.5% peaks respectively. So even though the shape of the two curves looks similar when you normalise them, it is reasonable to believe Trump could have had a significant enough impact on the comments section to dislodge forum norms, in a way Harambe did not.</p></li><li><p>Looking at the data for related terms makes it clear that a massive shift in discourse occurred around the time of Trump&#8217;s election &#8211; terms which were somewhat common before (like SJW) died out basically overnight, whereas terms which arose in the alt-right ecosystem spring up basically at the same time. Also of importance, there is no clear term that replaces &#8216;SJW&#8217; until early 2017 (with &#8216;antifa&#8217;), and no equivalent term that sticks until &#8216;woke&#8217; enters common parlance.</p></li></ul><p>s</p><p>So this theory says something like: the Commentariat was uniquely well suited to discussing Culture War issues in 2016. These largely revolved around gender debates &#8211; men vs women, creeps and niceguys etc. The Commentariat developed very virtuous norms around Culture War issues, which was self-reinforcing as SSC developed a reputation as a place you could come to have interesting and nuanced discussion about Culture Wars topics. This virtuous Commentariat was fuelled by Scott, who would write thoughtful takes on concepts like <a href=\"https://slatestarcodex.com/2014/05/30/the-wonderful-thing-about-triggers/\">trigger warnings</a>, <a href=\"https://slatestarcodex.com/2013/04/19/i-do-not-understand-rape-culture/\">rape culture</a>, <a href=\"https://slatestarcodex.com/2017/12/04/against-overgendering-harassment/\">harassment</a>, <a href=\"https://slatestarcodex.com/2014/07/07/social-justice-and-words-words-words/\">etc</a>, and who set the standard for what this sort of debate could look like.</p><p>Trump&#8217;s success fundamentally changed things; first, Culture Wars arguments became a lot more mainstream, because the President of the United States had made Culture Wars arguments a major part of his policy platform. So you didn&#8217;t have to come to SSC to see arguments about Culture Wars, you could just turn on the news. Second, a bunch of people who wanted to discuss gender norms specifically found their arguments hijacked to be about Trump (&#8220;How can you talk about X when Trump is doing Y?!&#8221;). Scott also blogged less about Trump (because he was travelling, and because I guess Trump didn&#8217;t interest him so much) so there was less guidance on what norms around Trump should look like, although admittedly <a href=\"https://slatestarcodex.com/2015/10/23/a-whiter-shade-of-candidate/\">not</a> <a href=\"https://slatestarcodex.com/2018/12/13/trump-a-setback-for-trumpism/\">none</a> <em>[EDIT: This was true at the time I wrote it, but Scott has recently been blogging about Trump / MAGA movement a bit more. So we&#8217;ll have to see how that shakes out]</em>. Therefore, it became harder to adopt virtuous discussion norms around Trump (which &#8211; parenthetically - seems to be a general effect Trump has on people, both pro and anti). However, as these virtuous norms were something people actually liked, losing them hurt the Commentariat.</p><p>Of the three arguments I have considered, I am mostly taken with a story where the change to Open Thread frequency led to a significant shift in engagement, and during the period Trump caused a massive external shock to the ecosystem containing SSC (something like &#8216;longform political discussion forums&#8217;). Both of these factors individually shifted commenting norms in a way people didn&#8217;t like, but both of these factors together meant that the norms didn&#8217;t recover as they might have done in the past &#8211; influential posters who might have previously guided community norms through an emotive period were burning out on the Open Thread frequency, while newer commentors were excited to use all the airtime available to them in Open Threads to discuss Trump and his platform to the exclusion of the rest of the Commentariat&#8217;s hyperfixations. After the discourse moved on from Trump about a year later (September 2017-ish) the Commentariat that remained had become stuck in a situation of &#8216;shoot from the hip&#8217; commenting, where politeness was preserved by accepting less complex or divisive discussion, on average.</p><p>If true, this would be a very optimistic story to tell, because you don&#8217;t really see similar markers in 2024 when Trump II was elected, suggesting the Commentariat has worked out how to have mature discussions about Trump without swamping other topics they want to discuss. Similarly, Scott made no major changes to the comment section during that period, so it was able to adjust to post-Trump norms more naturally. Together, that suggests that the green shoots of improving comment quality we see in 2024 and early 2025 have no natural reason to reverse, and we could easily be seeing a Commentariat renaissance in progress.</p><h1>Conclusions</h1><p>I want to end with two concluding thoughts.</p><p>First, although I have meandered at times, this is supposed to be a review &#8211; I therefore reckon I need to come down on one side of the fence or the other on the question of whether the Commentariat now is better or worse than the Commentariat of 2016. I have constructed a composite measure of &#8216;Commentariat Quality&#8217; from the list of four measures I described earlier &#8211; each measure given equal weighting - and applied them to every comment section.</p><p>If we believe that I&#8217;ve captured the four essential characteristics of the Commentariat well, then the best comment section there has ever been is on an ACC entry from 2018, <em><a href=\"https://slatestarcodex.com/2018/09/08/acc-entry-should-transgender-children-transition/\">Should Transgender Children Transition?</a> </em>(the best comment section on a Scott-authored post is also on <a href=\"https://slatestarcodex.com/2020/02/10/autogenderphilia-is-common-and-not-especially-related-to-transgender/\">trans issues</a>, interestingly). The best individual comment which has ever been made is apparently <a href=\"https://slatestarcodex.com/2016/09/25/ot59-comment-sutra/#comment-415884\">this</a> comment by neonwattagelimit. There&#8217;s nothing really <em>wrong</em> with this comment, and I can see why it scored highly on my algorithm - however I think it shows the limits of defining quality algorithmically, because I wouldn&#8217;t say it has the indefinable features that would make it a good candidate for (for example) Comment of the Week status.</p><p>The output of this scoring algorithm is recorded below. A score of zero means a perfectly average month, and positive scores indicate higher Commentariat Quality as defined by my algorithm. The cells are colour-coded so that stronger months are greener and weaker months are redder (grey cells are the blog&#8217;s hiatus, and don&#8217;t count towards the averages).</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!yxRF!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5680d4e0-2d0b-498b-a74c-5282af54b278_547x293.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"293\" src=\"https://substackcdn.com/image/fetch/$s_!yxRF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5680d4e0-2d0b-498b-a74c-5282af54b278_547x293.png\" width=\"547\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>My review of the overall Commentariat is that there was indeed a &#8216;Golden Age&#8217; of comments from around 2016-2018, which occurs slightly later than the period of peak engagement (April 2016). We are currently slightly above average in terms of quality, which I believe means we would rate a solid B, or perhaps even a B+. I&#8217;ve decided we deserve the B+ because signs are that the Commentariat is improving on most measures of quality so the trend is in the right direction, plus I love the Commentariat so I&#8217;m biased towards higher scores.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!h_5-!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fba8dcf14-0c2b-4edd-ac43-dcb88164f195_392x268.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"268\" src=\"https://substackcdn.com/image/fetch/$s_!h_5-!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fba8dcf14-0c2b-4edd-ac43-dcb88164f195_392x268.png\" width=\"392\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Second, in preparing the data for this essay I did some rudimentary sentiment analysis as a precursor to looking at &#8216;toxicity&#8217; as its own thing. The results are not especially interesting (all expressions of emotion have been dropping in a linear fashion since 2013) but I came across a very interesting outlier I thought I would share. The graph below shows the frequency of comments which display positive emotional content &#8211; joy, excitement, anticipation etc. The massive outlier during the COVID era is <a href=\"https://slatestarcodex.com/2020/09/11/update-on-my-situation/\">this</a> post where Scott announces he will begin blogging again after a several-month stretch where that did not look at all certain. For all that the Commentariat may have had some teething problems with the switch to ACX, I think this datapoint does more than the entire preceding essay at expressing how much I value the ACX Commentariat (and Scott himself) as providing a unique culture of lively, frank and polite discussion. I am looking forward to another decade of following the Commentariat, wherever they happen to be hosted.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!CaOy!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F67a614d5-53e6-473d-8aa6-97aeaa5ad0cf_762x428.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"428\" src=\"https://substackcdn.com/image/fetch/$s_!CaOy!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F67a614d5-53e6-473d-8aa6-97aeaa5ad0cf_762x428.png\" width=\"762\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p></p><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/your-review-the-astral-codex-ten",
            "publishedAt": "2025-07-26",
            "source": "SlateStarCodex",
            "summary": "<p><em>[This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked]</em></p><h1>Introduction</h1><p>The Astral Codex Ten (ACX) Commentariat is defined as the 24,485 individuals other than Scott who have contributed to the corpus of work of Scott&#8217;s blog posts, chiefly by leaving comments at the bottom of those posts. It is well understood (by the Commentariat themselves) that they are the best comments section anywhere on the internet, and have been for some time. This review takes it as a given that the ACX Commentariat outclasses all of its pale imitators across the web, so I won&#8217;t compare the ACX Commentariat to e.g. reddit. The real question is whether our glory days are behind us &#8211; specifically whether the ACX Commentariat of today has lost its edge compared to the SSC Commentariat of pre-2021.</p><p>A couple of years ago Scott asked, <em><a href=\"https://www.astralcodexten.com/p/why-do-i-suck\">Why Do I Suck?</a></em>. This was a largely tongue-in-cheek springboard to discuss a substantive criticism he",
            "title": "Your Review: The Astral Codex Ten Commentariat (“Why Do We Suck?”)"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-26"
}