{
    "articles": [
        {
            "content": [
                "<p>By averaging estimates of ChatGPT 3, 4.5, I find that in these years typical people spent these hours per week consuming fiction and music:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!bf_Y!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd8c02abd-ebb3-41b5-8cf8-7def7a14ede4_469x121.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"121\" src=\"https://substackcdn.com/image/fetch/$s_!bf_Y!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd8c02abd-ebb3-41b5-8cf8-7def7a14ede4_469x121.png\" width=\"469\" /><div></div></div></a></figure></div><p>(Yes, I&#8217;d love to get more reliable estimates.) Note the huge increase over time. As US adults now average ~21 hours a week at jobs, and ~14 at housework, adults now spend substantially more hours on both fiction and music than they do on either jobs or housework. So it seems fair to wonder: is this behavior adaptive?</p><p>Let&#8217;s focus on fiction in this post. On average in fiction, protagonists find themselves in <a href=\"https://x.com/robinhanson/status/1937877632302923866\">worse</a> than typical situations, and make a <a href=\"https://x.com/robinhanson/status/1937877624128209326\">better</a> than typical showing of themselves there. The proximate cause for our enjoying such stories is <a href=\"https://x.com/robinhanson/status/1937884590351286444\">plausibly</a> that we like the fantasy of identifying with protagonists who prove themselves well in tough situations.</p><p>Now we do plausibly gain some from thinking about what to do in tough situations, seeing the world from the view of others, affirming shared norms, and showing off fiction understanding abilities. Getting out of our own heads and troubles together may relax us and bond. But the time costs are now large, as may also be the distortions in our expectations about reality.</p><p>Clearly both stories and music are ancient things, robustly persistent in a wide range of cultures. So obviously some amount of them must be adaptive. So the question is how much. Poll respondents <a href=\"https://x.com/robinhanson/status/1937888866821660682\">say</a> almost 2-1 that marginal fiction is adaptive, but I have doubts.</p><p>If the hour estimates from 1500 are remotely accurate, and if behavior then was roughly adaptive, then we&#8217;d need the value we get from fiction to be <em>far</em> larger today, to justify spending eight times as many hours on it. Which seems hard to believe. And as the most plausible direct reason we consume fiction, enjoying the fantasy, doesn&#8217;t seem tired to adaption, that leans me toward guessing that we have too much fiction.</p><p>Now it does make sense to here distinguish individual from community adaptiveness. If everyone around you is playing fiction mastery signaling games, it can make sense for you to play those games as well. But at the level of a shared culture, that culture might be more adaptive if it diverted such efforts to different signaling games with more adaptive side effects. </p><p>I suspect that this generalizes to other kinds of leisure as well. Even in times of peace, health, and plenty, where you don&#8217;t need to work that many hours to stay safe, comfy and fed, I expect that the most adaptive behaviors are pretty strongly aligned with  more clearly adaptive effects. Like collecting skills, wealth, allies, power, kids, something. I find it hard to see how spending this much of our time mostly relaxing and chilling could be max adaptive.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/how-adaptive-modern-fiction",
            "publishedAt": "2025-06-25",
            "source": "Robin Hanson",
            "summary": "By averaging estimates of ChatGPT 3, 4.5, I find that in these years typical people spent these hours per week consuming fiction and music:",
            "title": "How Adaptive Modern Fiction?"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3107/",
            "publishedAt": "2025-06-25",
            "source": "XKCD",
            "summary": "<img alt=\"Once you add the balloons into the model, it makes forecasting easier overall--the forecast is always 'cold and dark, with minimal solar-driven convection.'\" src=\"https://imgs.xkcd.com/comics/weather_balloons.png\" title=\"Once you add the balloons into the model, it makes forecasting easier overall--the forecast is always 'cold and dark, with minimal solar-driven convection.'\" />",
            "title": "Weather Balloons"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-25"
}