{
    "articles": [
        {
            "content": [
                "<img alt=\"from Luddites to AI: the Overton Window of disruption\" src=\"https://ghuntley.com/content/images/2025/05/download.jpeg\" /><p>I&apos;ve been thinking about <a href=\"https://en.wikipedia.org/wiki/Overton_window?ref=ghuntley.com\">Overton Windows</a> lately, but not of the political variety.</p><figure class=\"kg-card kg-image-card\"><img alt=\"from Luddites to AI: the Overton Window of disruption\" class=\"kg-image\" height=\"703\" src=\"https://ghuntley.com/content/images/2025/05/Unthinkable-1.png\" width=\"1039\" /></figure><p>You see, the Overton window can be adapted to model disruptive innovation by framing the acceptance of novel technologies, business models, or ideas within a market or society. So I&apos;ve been pondering about where, when and how AI can be framed. </p><p>Perhaps, the change we are going through right now in the software development industry has a lot of similarities to the year 1404 when another disruptive innovation -  <a href=\"https://en.wikipedia.org/wiki/Loom?ref=ghuntley.com\">the loom</a> - sat in the &quot;unthinkable&quot; or &quot;radical&quot; zones of the window, facing skepticism or resistance from incumbents and consumers. </p><blockquote>The&#xa0;<strong>Luddites</strong>&#xa0;were members of a 19th-century movement of English textile workers who opposed the use of certain types of automated machinery due to concerns relating to worker pay and output quality. They often destroyed the machines in organised raids.</blockquote><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://en.wikipedia.org/wiki/Luddite?ref=ghuntley.com\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">Luddite - Wikipedia</div><div class=\"kg-bookmark-description\"></div><div class=\"kg-bookmark-metadata\"><img alt=\"from Luddites to AI: the Overton Window of disruption\" class=\"kg-bookmark-icon\" src=\"https://ghuntley.com/content/images/icon/wikipedia-1.png\" /><span class=\"kg-bookmark-author\">Wikimedia Foundation, Inc.</span><span class=\"kg-bookmark-publisher\">Contributors to Wikimedia projects</span></div></div><div class=\"kg-bookmark-thumbnail\"><img alt=\"from Luddites to AI: the Overton Window of disruption\" src=\"https://ghuntley.com/content/images/thumbnail/1200px-Luddite.jpg\" /></div></a></figure><p>and I&apos;ve been pondering perhaps that the current generation of AI as an assistant pane within the IDE is a deliberate go-to-market framing by vendors as it&apos;s within what the software engineering community <a href=\"https://ghuntley.com/multi-boxing\">has been using since 1982</a> as the majority of software engineers are still coming to grips with the erasure of their core identity function. </p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"from Luddites to AI: the Overton Window of disruption\" class=\"kg-image\" height=\"703\" src=\"https://ghuntley.com/content/images/2025/05/Unthinkable-2.png\" width=\"1039\" /><figcaption><span style=\"white-space: pre-wrap;\">people buy what they know and understand even if it means purchasing a semi automatic carriage with a small motor for a horse</span></figcaption></figure><p>As innovators advocate, demonstrate value, or leverage external triggers (e.g., economic shifts), these ideas which were once unthinkable or radical gradually shift toward &quot;acceptable&quot; and &quot;sensible&quot; within the window. </p><p>There are now seven major players in the space producing AI enabled developer tooling but the frame is changing fast - two months ago Claude Code was the only non-IDE primitive but as of last week <a href=\"https://ampcode.com/?ref=ghuntley.com\" rel=\"noreferrer\">Amp</a> is now generally available as a command line primitive (as well as a Visual Studio Code Extension). </p><figure class=\"kg-card kg-image-card\"><img alt=\"from Luddites to AI: the Overton Window of disruption\" class=\"kg-image\" height=\"1216\" src=\"https://ghuntley.com/content/images/2025/05/Unthinkable-3.png\" width=\"1039\" /></figure><p>When Claude Code came out, I didn&apos;t quite understand why it even existed as it seemed like a marketing gimmick but now I do. Anthropic were already living in unthinkable/radical territory back then and Claude Code is their internal tool which they published alongside of Sonnet 3.7 to nudge the Overton window. </p><figure class=\"kg-card kg-embed-card\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">this is so validating; saw it six months back and coworkers thought I was mad.  <a href=\"https://t.co/d0vXPmgL4N?ref=ghuntley.com\">pic.twitter.com/d0vXPmgL4N</a></p>&#x2014; geoff (@GeoffreyHuntley) <a href=\"https://twitter.com/GeoffreyHuntley/status/1925874450857107861?ref_src=twsrc%5Etfw&amp;ref=ghuntley.com\">May 23, 2025</a></blockquote>\n</figure><p>Since then, I&apos;ve been pretty busy with pushing boundaries and applying all of the knowledge shared on this blog. The resulting outcome can be seen in this livestream where a supervisor is managing four headless agents, building software from <a href=\"https://ghuntley.com/specs\" rel=\"noreferrer\">specs</a> whilst I was sleep...</p><figure class=\"kg-card kg-embed-card\"></figure><p>Everything is changing, fast. Both in the industry and at work - last week I departed Canva and joined Sourcegraph to help nudge the Overton window.</p><figure class=\"kg-card kg-embed-card\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Folks, there&#x2019;s been a slight change of plans. <br /><br />I&#x2019;m departing <a href=\"https://twitter.com/canva?ref_src=twsrc%5Etfw&amp;ref=ghuntley.com\">@canva</a> on Friday. <br /><br />From Monday I&apos;ll be joining the <a href=\"https://twitter.com/AmpCode?ref_src=twsrc%5Etfw&amp;ref=ghuntley.com\">@AmpCode</a> team to help make the damn best suite of vibecoding tools for business. <a href=\"https://t.co/5SRmzHWanI?ref=ghuntley.com\">https://t.co/5SRmzHWanI</a> <a href=\"https://t.co/BW0DkvhGAp?ref=ghuntley.com\">pic.twitter.com/BW0DkvhGAp</a></p>&#x2014; geoff (@GeoffreyHuntley) <a href=\"https://twitter.com/GeoffreyHuntley/status/1924660488333566393?ref_src=twsrc%5Etfw&amp;ref=ghuntley.com\">May 20, 2025</a></blockquote>\n</figure><p>but as I&apos;m about to head down for sleep, I can&apos;t help but notice another Overton window...</p><figure class=\"kg-card kg-image-card\"><img alt=\"from Luddites to AI: the Overton Window of disruption\" class=\"kg-image\" height=\"1082\" src=\"https://ghuntley.com/content/images/2025/05/Unthinkable-5.png\" width=\"1039\" /></figure><h2 id=\"ps-socials\">ps. socials</h2><ul><li>LinkedIn: <a href=\"https://www.linkedin.com/posts/geoffreyhuntley_from-luddites-to-ai-the-overton-window-of-activity-7333588766743269379-n-Y-?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAABQKuUB2AJ059keUcRUVLbtmoa6miLVlTI\">https://www.linkedin.com/posts/geoffreyhuntley_from-luddites-to-ai-the-overton-window-of-activity-7333588766743269379-n-Y-</a></li><li>BlueSky: <a href=\"https://bsky.app/profile/ghuntley.com/post/3lqazhxjqwx2i?ref=ghuntley.com\">https://bsky.app/profile/ghuntley.com/post/3lqazhxjqwx2i</a></li><li>X: <a href=\"https://x.com/GeoffreyHuntley/status/1927822364860899822?ref=ghuntley.com\">https://x.com/GeoffreyHuntley/status/1927822364860899822</a></li></ul>"
            ],
            "link": "https://ghuntley.com/overton/",
            "publishedAt": "2025-05-28",
            "source": "Geoffrey Huntley",
            "summary": "<p>I&apos;ve been thinking about <a href=\"https://en.wikipedia.org/wiki/Overton_window?ref=ghuntley.com\">Overton Windows</a> lately, but not of the political variety.</p><figure class=\"kg-card kg-image-card\"><img alt=\"alt\" class=\"kg-image\" height=\"703\" src=\"https://ghuntley.com/content/images/2025/05/Unthinkable-1.png\" width=\"1039\" /></figure><p>You see, the Overton window can be adapted to model disruptive innovation by framing the acceptance of novel technologies, business models, or ideas within a market or society. So I&apos;ve been pondering about</p>",
            "title": "from Luddites to AI: the Overton Window of disruption"
        },
        {
            "content": [
                "<p>The weather in Cape Town is slowly descending into a cold, wet winter (except for today, which is a beautiful). I've brought the heater up from the garage, doubled up the duvets on the bed, and have started wearing long pyjamas to sleep.</p>\n<p>Generally at this time of year Emma and I are making plans to head somewhere warm, but this year we've decided to stick it out in South Africa with a month-long road-trip to the North West for some proper time in the bushveld, and then a wedding in Joburg.</p>\n<p>For people not from South Africa, it does get cold here. Not in the same way it gets cold in Canada or Northern Europe, but in some ways it gets colder. Let me explain:</p>\n<p>In Canada the Canadians <em>know</em> that it's going to get very, very cold. Unbelievably cold. Because of this they do a whole bunch of reasonable things like insulate their homes, ensure they have a robust heating system, and purchase proper winter attire. But not in South Africa. Our weather is great most of the year, with only about 2 to 3 months of cold weather.</p>\n<p>It can get down to 5 degrees Celcius on a cold day; and while that may not seem cold to people where the weather gets to -20, we're always completely unprepared for it. Because of our good weather the rest of the year, we forget. We forget to insulate our houses. We forget to get winter sheets. And so when the time comes even the insides of our homes are cold.</p>\n<p>I've had Polish and German friends suffer in the South African winter due to a lack of good heating and insulation. And that brings me to my topic of interest today: Heaters.</p>\n<p>There are so many different kinds of heaters on the market. Everything from wood fireplaces to under-floor hot water heating. Now, unless you're lucky and your house or apartment has built in heating or a fireplace of some sort, you're stuck purchasing a heater from a store (or layering up, or both).</p>\n<p>At the end of the day there are only have 3 different kinds of heating (for the purposes of this write-up):</p>\n<p>Conduction - where you physically touch the heated surface and that heat is transferred to you via the conductivity of the surface and the body in contact.</p>\n<p>Radiation - where infrared light is radiated from a heating element and absorbed by our skin (or the surrounding objects) over a distance.</p>\n<p>Convection - where the heated surface warms the surrounding air, which in turn warms us. While convection involves conduction at a molecular level (heat transfer between particles), it’s distinct from conduction because it relies on the movement of a fluid (air in this case).</p>\n<p>Most heaters rely on a combination of these mechanisms. Wood fireplaces predominately rely on radiation (infrared from the fire) and convection (warming up the surrounding air). Under-floor heating relies on conduction (direct contact with the floor) and some convection, although this isn't the main mechanism. Electric quartz heaters (those pretty glowing bars) are predominately radiation, and the oil-filled space heaters are predominately convection.</p>\n<p>Store bought heaters come in a variety of shapes, sizes, and price points. But I noticed that by-and-large they all have the same max wattage of 2000 watts (I believe in the US it's 1500 watts due to their 120 volt power supply). Now, theoretically energy is energy is energy. Therefore, if you have a sealed room each one of these heaters will emit the same amount of heat into the room at the same rate, regardless of whether this is an expensive heater or one of those cheapie blower types you put under your desk. And since every 2000 watt heater will cause the same amount of heating and draw the same amount of power, then the mechanism of action shouldn't be that important. Or is it?</p>\n<p>We have 3 heaters in our apartment. A quartz bar heater, a fin space heater, and an electric blanket. And they each have their own strengths and weaknesses.</p>\n<p>The quartz bar heater is by far my favourite. As soon as I turn it on it starts radiating a gentle warmth directly onto me. This is lovely since I don't sleep with the heater on, so when the apartment is cold in the morning I can sit in front of it with my coffee and be all toasty without having to warm up the entire space. It also warms up the couch I'm sitting on, which provides conductive heating as well. Warming up the entire space is also not easily (or cheaply) done due to South African building's lack of insulation.</p>\n<p><img alt=\"Bar heater\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman/bar-heater.webp\" /></p>\n<p>Left on for long enough and it does gradually increase the temperature of the room, since that same number of wattage is being radiated into the space where it's absorbed by the floor and furniture, heating them up. Those objects inevitably heat up the air around them, and boom! You have convection.</p>\n<p>The fin space heater is no-where near as nice. Due to it relying on convection to heat up the entire space it isn't very efficient (again, no insulation). Instead we use this exclusively in the home office which is a smaller space, has slightly better insulation, and a carpet which I wouldn't like to rest the bar heater on due to the localised heat.</p>\n<p>It is a great example of how <em>doing something useful with the heat first</em> is important. With the bar heater it warms me and the objects I interact with up before trying to warm up the surrounding air. Again, in the end it's 2000 watts regardless of method, so may as well make use of that energy locally before trying to warm up the room.</p>\n<p>My third heater is the electric blanket. If I put this on 10 minutes before getting into bed it warms it up so well that it's such a toasty pleasure to get into. This is also by far the most efficient form of heating since it is insulated by default, and relies entirely on conduction. It warms up the specific area that I will inhabit without losing much heat to the surrounding area. Due to this the power draw of an electric blanket is negligible compared to actual space heaters (about 7-10%). This is a great example of super localised heat. There's no way that I'm going to use my electric blanket to heat up the apartment.</p>\n<p>I grew up with gas heaters (and briefly an anthracite stove heater) and have spent a decent amount of time with wood-fired stoves and fireplaces, and I can honestly say that electricity is just so much subjectively better. No having to leave the window open to vent the carbon dioxide (meaning more gas needs to be burnt to compensate). No ash coating surfaces around the fireplace, no smell of smoke in the house. No having to constantly replenish stocks of wood or haul around gas canisters.</p>\n<p>Also, being able to flick the bar heater on and off as needed is great when compared to starting and maintaining a fire in a wood-burning stove. I only spend 45 minutes having coffee before heading to gym in the morning and really couldn't be bothered to make a fire. I'm also a fan of consistent heat instead of the fluctuations of burning hydrocarbons. But that's personal preference and relegated to indoors. I love a good campfire and the ambiance of fire in general.</p>\n<p>There are many other heater designs, but when narrowed down to wattage and mechanism, it helps me reason about it better. I guess what can be taken away from this writeup is that if you're stuck deciding between heaters, just know that they'll probably all heat up your space at the same rate, but finding a way to use that heat locally first is good practise. Also, save your money. Expensive heaters are not better by default.</p>"
            ],
            "link": "https://herman.bearblog.dev/heaters/",
            "publishedAt": "2025-05-28",
            "source": "Herman Martinus",
            "summary": "<p>The weather in Cape Town is slowly descending into a cold, wet winter (except for today, which is a beautiful). I've brought the heater up from the garage, doubled up the duvets on the bed, and have started wearing long pyjamas to sleep.</p> <p>Generally at this time of year Emma and I are making plans to head somewhere warm, but this year we've decided to stick it out in South Africa with a month-long road-trip to the North West for some proper time in the bushveld, and then a wedding in Joburg.</p> <p>For people not from South Africa, it does get cold here. Not in the same way it gets cold in Canada or Northern Europe, but in some ways it gets colder. Let me explain:</p> <p>In Canada the Canadians <em>know</em> that it's going to get very, very cold. Unbelievably cold. Because of this they do a whole bunch of reasonable things like insulate their homes, ensure they have a robust heating system, and purchase proper winter attire. But not in South Africa. Our weather is great most of the year, with only about 2 to 3 months of cold weather.</p> <p>It can get down to 5 degrees Celcius on",
            "title": "Nerding out about heaters"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/what-does-undecidable-mean-anyway/",
            "publishedAt": "2025-05-28",
            "source": "Hillel Wayne",
            "summary": "<h3>Systems Distributed</h3> <p>I'll be speaking at <a href=\"https://systemsdistributed.com/\" target=\"_blank\">Systems Distributed</a> next month! The talk is brand new and will aim to showcase some of the formal methods mental models that would be useful in mainstream software development. It has added some extra stress on my schedule, though, so expect the next two monthly releases of <em>Logic for Programmers</em> to be mostly minor changes.</p> <h2>What does \"Undecidable\" mean, anyway</h2> <p>Last week I read <a href=\"https://liamoc.net/forest/loc-000S/index.xml\" target=\"_blank\">Against Curry-Howard Mysticism</a>, which is a solid article I recommend reading. But this newsletter is actually about <a href=\"https://lobste.rs/s/n0whur/against_curry_howard_mysticism#c_lbts57\" target=\"_blank\">one comment</a>:</p> <blockquote> <p>I like to see posts like this because I often feel like I can’t tell the difference between BS and a point I’m missing. Can we get one for questions like “Isn’t XYZ (Undecidable|NP-Complete|PSPACE-Complete)?” </p> </blockquote> <p>I've already written one of these for <a href=\"https://www.hillelwayne.com/post/np-hard/\" target=\"_blank\">NP-complete</a>, so let's do one for \"undecidable\". Step one is to pull a technical definition from the book <a href=\"https://link.springer.com/book/10.1007/978-1-4612-1844-9\" target=\"_blank\"><em>Automata and Computability</em></a>:</p> <blockquote> <p>A property P of strings is said to be decidable if ... there is a total Turing machine that accepts input strings that have property P and rejects those that do not. (pg 220)</p> </blockquote>",
            "title": "What does \"Undecidable\" mean, anyway"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3095/",
            "publishedAt": "2025-05-28",
            "source": "XKCD",
            "summary": "<img alt=\"Under the two-domain system, anyone who punches you is technically an Archaean pathogen.\" src=\"https://imgs.xkcd.com/comics/archaea.png\" title=\"Under the two-domain system, anyone who punches you is technically an Archaean pathogen.\" />",
            "title": "Archaea"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-28"
}