{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>My latest love letter to Linux has been published. It's called <a href=\"https://omarchy.org/\">Omarchy</a>, and it's an opinionated setup of <a href=\"https://archlinux.org/\">the Arch Linux distribution</a> and <a href=\"https://hypr.land/\">the Hyprland tiling window manager</a>. With everything configured out-of-the-box to give you exactly the same setup that I now run every day. My Platonic ideal of what a developer environment should look like.</div><div><br />It's not for everyone, though. Arch has a reputation for being difficult, but while I think that's vastly overstated, I still think it's fair to say that Ubuntu is an easier landing for someone new to Linux. And that's why this exists as a sister project to <a href=\"https://omakub.org\">Omakub</a> — my opinionated setup for Ubuntu — and not a replacement of it.</div><div><br />Because I do think that Hyprland deserves its reputation of being difficult! Not because the core tiling window manager is hard, but because it comes incredibly bare-boned in the box. You have to figure out everything yourself. Even how to get a lock screen or idle timing or a menu bar or bluetooth setting or... you get the idea.<br /><br /></div><div>Omarchy is an attempt to solve for all that. To give you a default set of great, beautiful configurations for Hyprland, and installing all the common tooling you'd normally want. You could setup this, not change a thing, and you'll have exactly what I run every day.<br /><br /></div><div>But you can also just use this as a paved path into the glorious world of Linux ricing. The flip side of Hyprland being so atomized is that it's infinitely configurable. You can really, really make it yours. No wonder its the preferred platform for <a href=\"https://www.reddit.com/r/unixporn/\">r/unixporn</a>, and even <a href=\"https://www.youtube.com/watch?v=pVI_smLgTY0\">what PewDiePie picked up</a> for his amazing Russian nuclear core build.</div><div><br />I don't know when we'll literally get \"The Year of Linux on the Desktop\", but I've never been as convinced that its coming as I am now. There's enough dissent in the water. Enough dissatisfaction with both Apple and Microsoft.&nbsp;<br /><br /></div><div>And between Valve going all-in on Steam on Linux (the Steamdeck runs Arch!), major creators (like PewDiePie) switching to Linux, and incredible projects like Hyprland — which offer not just a cheap visual copy of the two major commercial operating systems, but something much more unique and compelling — I think all the factors are in place for a big switch. At least among developers.<br /><br /></div><div>But broad adoption or not, I'm in love with Linux, and thrilled to share my work to make it easier to enjoy.<br /><br /></div><div class=\"attachment-gallery attachment-gallery--2\">\n    <figure class=\"attachment attachment--preview attachment--lightboxable attachment--png\">\n      <a href=\"https://world.hey.com/dhh/4666dd31/blobs/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyODQxMywicHVyIjoiYmxvYl9pZCJ9fQ--e7af169ff03e28f13d4ebd1e85c7dbca861054b25abac92ef6fe562b708fbd22/image.png?disposition=attachment\" title=\"Download image.png\">\n        <img alt=\"image.png\" src=\"https://world.hey.com/dhh/4666dd31/representations/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyODQxMywicHVyIjoiYmxvYl9pZCJ9fQ--e7af169ff03e28f13d4ebd1e85c7dbca861054b25abac92ef6fe562b708fbd22/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemVfdG9fbGltaXQiOlsxNjAwLDEyMDBdLCJxdWFsaXR5Ijo2MCwibG9hZGVyIjp7InBhZ2UiOm51bGx9LCJjb2FsZXNjZSI6dHJ1ZX0sInB1ciI6InZhcmlhdGlvbiJ9fQ--8a4eadc39996b456981c13ce71a114e6d921a6725bb1a424222e8cbff9ed0cc8/image.png\" />\n</a>\n  </figure>  <figure class=\"attachment attachment--preview attachment--lightboxable attachment--png\">\n      <a href=\"https://world.hey.com/dhh/4666dd31/blobs/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyODkwOSwicHVyIjoiYmxvYl9pZCJ9fQ--4627d9d22d55a0606881ddc401e92d0c91e11f15238576c0c03ca136019bf248/image.png?disposition=attachment\" title=\"Download image.png\">\n        <img alt=\"image.png\" src=\"https://world.hey.com/dhh/4666dd31/representations/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyODkwOSwicHVyIjoiYmxvYl9pZCJ9fQ--4627d9d22d55a0606881ddc401e92d0c91e11f15238576c0c03ca136019bf248/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemVfdG9fbGltaXQiOlsxNjAwLDEyMDBdLCJxdWFsaXR5Ijo2MCwibG9hZGVyIjp7InBhZ2UiOm51bGx9LCJjb2FsZXNjZSI6dHJ1ZX0sInB1ciI6InZhcmlhdGlvbiJ9fQ--8a4eadc39996b456981c13ce71a114e6d921a6725bb1a424222e8cbff9ed0cc8/image.png\" />\n</a>\n  </figure>\n</div><div class=\"attachment-gallery attachment-gallery--2\">\n    <figure class=\"attachment attachment--preview attachment--lightboxable attachment--png\">\n      <a href=\"https://world.hey.com/dhh/4666dd31/blobs/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyOTEwNCwicHVyIjoiYmxvYl9pZCJ9fQ--60116de216c2c3ef09b3e55cf4a41a42258d2052ab452807fd70a757275dafdb/image.png?disposition=attachment\" title=\"Download image.png\">\n        <img alt=\"image.png\" src=\"https://world.hey.com/dhh/4666dd31/representations/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyOTEwNCwicHVyIjoiYmxvYl9pZCJ9fQ--60116de216c2c3ef09b3e55cf4a41a42258d2052ab452807fd70a757275dafdb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemVfdG9fbGltaXQiOlsxNjAwLDEyMDBdLCJxdWFsaXR5Ijo2MCwibG9hZGVyIjp7InBhZ2UiOm51bGx9LCJjb2FsZXNjZSI6dHJ1ZX0sInB1ciI6InZhcmlhdGlvbiJ9fQ--8a4eadc39996b456981c13ce71a114e6d921a6725bb1a424222e8cbff9ed0cc8/image.png\" />\n</a>\n  </figure>  <figure class=\"attachment attachment--preview attachment--lightboxable attachment--png\">\n      <a href=\"https://world.hey.com/dhh/4666dd31/blobs/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyOTMxMSwicHVyIjoiYmxvYl9pZCJ9fQ--913afad5b22f70898ac0f210b1cce18c37772207f51533e2f44dc20739b38fab/image.png?disposition=attachment\" title=\"Download image.png\">\n        <img alt=\"image.png\" src=\"https://world.hey.com/dhh/4666dd31/representations/eyJfcmFpbHMiOnsiZGF0YSI6MjE3MDQyOTMxMSwicHVyIjoiYmxvYl9pZCJ9fQ--913afad5b22f70898ac0f210b1cce18c37772207f51533e2f44dc20739b38fab/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemVfdG9fbGltaXQiOlsxNjAwLDEyMDBdLCJxdWFsaXR5Ijo2MCwibG9hZGVyIjp7InBhZ2UiOm51bGx9LCJjb2FsZXNjZSI6dHJ1ZX0sInB1ciI6InZhcmlhdGlvbiJ9fQ--8a4eadc39996b456981c13ce71a114e6d921a6725bb1a424222e8cbff9ed0cc8/image.png\" />\n</a>\n  </figure>\n</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/omarchy-is-out-4666dd31",
            "publishedAt": "2025-06-26",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>My latest love letter to Linux has been published. It's called <a href=\"https://omarchy.org/\">Omarchy</a>, and it's an opinionated setup of <a href=\"https://archlinux.org/\">the Arch Linux distribution</a> and <a href=\"https://hypr.land/\">the Hyprland tiling window manager</a>. With everything configured out-of-the-box to give you exactly the same setup that I now run every day. My Platonic ideal of what a developer environment should look like.</div><div><br />It's not for everyone, though. Arch has a reputation for being difficult, but while I think that's vastly overstated, I still think it's fair to say that Ubuntu is an easier landing for someone new to Linux. And that's why this exists as a sister project to <a href=\"https://omakub.org\">Omakub</a> — my opinionated setup for Ubuntu — and not a replacement of it.</div><div><br />Because I do think that Hyprland deserves its reputation of being difficult! Not because the core tiling window manager is hard, but because it comes incredibly bare-boned in the box. You have to figure out everything yourself. Even how to get a lock screen or idle timing or a menu bar or bluetooth setting or... you get the idea.<br /><br /></div><div>Omarchy is an attempt to solve for all that. To give you a default set of great,",
            "title": "Omarchy is out"
        },
        {
            "content": [
                "<p>I haven’t followed AI safety too closely. I tell myself that’s because tons of smart people are working on it and I wouldn’t move the needle. But I sometimes wonder, is that logic really unrelated to the fact that every time I hear about a new AI breakthrough, my chest tightens with a strange sense of dread?</p>\n\n<p>AI is one of the most important things happening in the world, and possibly <em>the</em> most important. If I’m hunkering in a bunker years from now listening to hypersonic kill-bots laser-cutting through the wall, will I really think, <em>boy am I glad I stuck to my comparative advantage</em>?</p>\n\n<p>So I thought I’d take a look.</p>\n\n<p>I stress that I am not an expert. But I thought I’d take some notes as I try to understand all this. Ostensibly, that’s because my outsider status frees me from the <a href=\"https://en.wikipedia.org/wiki/Curse_of_knowledge\">curse of knowledge</a> and might be helpful for other outsiders. But mostly, I like writing blog posts.</p>\n\n<p>So let’s start at the beginning. AI safety is the long-term problem of making AI be nice to us. The obvious first question is, what’s the hard part? Do we know? Can we say anything?</p>\n\n<p>To my surprise, I think we can: The hard part is making AI <em>want</em> to be nice to us. You can’t solve the problem without doing that. But if you <em>can</em> do that, then the rest is easier.</p>\n\n<p>This is not a new idea. Among experts, I think it’s somewhere between “the majority view” and “near-consensus”. But I haven’t found many explicit arguments or debates, meaning I’m not 100% sure <em>why</em> people believe it, or if it’s even correct. But instead of cursing the darkness, I thought I’d construct a legible argument. This may or may not reflect what other people think. But what is a blog, if not an exploit on <a href=\"https://en.wikipedia.org/wiki/Ward_Cunningham#%22Cunningham's_Law%22\">Cunningham’s Law</a>?</p>\n\n<h2 id=\"my-argument-at-a-high-level\">My argument, at a high level</h2>\n\n<p>Here’s my argument that the hard part of AI safety is making AI <em>want</em> to do what we want:</p>\n\n<ol>\n  <li>\n    <p>To make an AI be nice to you, you can either impose <em>restrictions</em>, so the AI is unable to do bad things, or you can <em>align</em> the AI, so it doesn’t <em>choose</em> to do bad things.</p>\n  </li>\n  <li>\n    <p>Restrictions will never work.</p>\n  </li>\n  <li>\n    <p>You can break down alignment into making the AI <em>know</em> what we want, making it <em>want</em> to do what we want, and making it <em>succeed</em> at what it tries to do.</p>\n  </li>\n  <li>\n    <p>Making an AI <em>want</em> to do what we want seems hard. But you can’t skip it, because then AI would have no reason to be nice.</p>\n  </li>\n  <li>\n    <p>Human values are a mess of heuristics, but a capable AI won’t have much trouble understanding them.</p>\n  </li>\n  <li>\n    <p>True, a super-intelligent AI would likely face weird “out of distribution” situations, where it’s hard to be confident it would correctly predict our values or the effects of its actions.</p>\n  </li>\n  <li>\n    <p>But that’s OK. If an AI wants to do what we want, it will try to draw a conservative boundary around its actions and never do anything outside the boundary.</p>\n  </li>\n  <li>\n    <p>Drawing that boundary is not that hard.</p>\n  </li>\n  <li>\n    <p>Thus, if an AI system <em>wants</em> to do what we want, the rest of alignment is not that hard.</p>\n  </li>\n  <li>\n    <p>Thus, making AI systems <em>want</em> to do what we want is necessary and sufficient-ish for AI safety.</p>\n  </li>\n</ol>\n\n<p>I am not confident in this argument. I give it a ~35% chance of being correct, with step 8 the most likely failure point. And I’d give another ~25% chance that my argument is wrong but the final conclusion is right.</p>\n\n<p>(Y’all agree that a low-confidence prediction for a surprising conclusion still contains lots of information, right? If we learned there was a 10% chance Earth would be swallowed by an alien squid tomorrow, that would be important, etc.? OK, sorry.)</p>\n\n<h2 id=\"my-argument-in-more-detail\">My argument, in more detail</h2>\n\n<p>I’ll go quickly through the parts that seem less controversial.</p>\n\n<h3 id=\"1-there-are-two-conceivable-paths-to-ai-safety\">1. There are two conceivable paths to AI safety.</h3>\n\n<p>Roughly speaking, to make AI safe you could either impose <em>restrictions</em> on AI so it’s not able to do bad things, or <em>align</em> AI so it doesn’t choose to do bad things. You can think of these as not giving AI access to nuclear weapons (restrictions) or making the AI choose not to launch nuclear weapons (alignment).</p>\n\n<h3 id=\"2-restrictions-will-never-work\">2. Restrictions will never work.</h3>\n\n<p>I advise against giving AI access to nuclear weapons. Still, if an AI is vastly smarter than us and <em>wants</em> to hurt us, we have to assume it will be able to jailbreak any restrictions we place on it. Given any way to interact with the world, it will eventually find some way to bootstrap towards larger and larger amounts of power. Restrictions are hopeless. So that leaves alignment.</p>\n\n<h3 id=\"3-you-can-break-down-alignment-into-three-parts\">3. You can break down alignment into three parts.</h3>\n\n<p>Here’s a simple-minded decomposition:</p>\n\n<ol>\n  <li><strong>The Knowing problem</strong>: Making AI know what we want.</li>\n  <li><strong>The Wanting problem</strong>: Making AI want to do what we want.</li>\n  <li><strong>The Success problem</strong>: Making AI succeed at what it tries to do.</li>\n</ol>\n\n<p>I sometimes wonder if that’s a <em>useful</em> decomposition. But let’s go with it.</p>\n\n<h3 id=\"4-wanting-is-necessary\">4. Wanting is necessary.</h3>\n\n<p>The Wanting problem seems hard, but there’s no way around it. Say an AI <em>knows</em> what we want and <em>succeeds</em> at everything it tries to do, but doesn’t care about what we want. Then, obviously, it has no reason to be nice. So we can’t skip Wanting.</p>\n\n<p>Also, notice that even if you solve the Knowing and Success problems <em>really</em> well, that doesn’t seem to make the Wanting problem any easier. (See also: <a href=\"https://arbital.greaterwrong.com/p/orthogonality/\">Orthogonality</a>)</p>\n\n<h3 id=\"5-human-values-are-a-shallow-mess\">5. Human values are a shallow mess.</h3>\n\n<p>My take on human values is that they’re a big ball of heuristics. When we say that some action is right (wrong) that sort of means that genetic and/or cultural evolution thinks that the reproductive fitness of our genes and/or cultural memes is advanced by rewarding (punishing) that behavior.</p>\n\n<p>Of course, evolution is far from perfect. Clearly our values aren’t remotely close to reproductively optimal right now, what with fertility rates crashing around the world. But still, values are the result of evolution <em>trying</em> to maximize reproductive fitness.</p>\n\n<p>Why do we get confused by <a href=\"https://en.wikipedia.org/wiki/Trolley_problem\">trolley problems</a> and <a href=\"https://en.wikipedia.org/wiki/Population_ethics\">population ethics</a>? I think because… our values are a messy ball of heuristics. We never faced evolutionary pressure to resolve trolley problems, so we never really formed coherent moral intuitions about them.</p>\n\n<p>So while our values have lots of quirks and puzzles, I don’t think there’s anything <em>deep</em> at the center of them, anything that would make learning them harder than learning to solve Math Olympiad problems or translating text between any pair of human languages. Current AI <a href=\"https://dynomight.net/puzzles-results/\">already</a> seems to understand our values fairly well.</p>\n\n<p>Arguably, it would be hard to <em>prevent</em> AI from understanding human values. If you train an AI to do any sufficiently difficult task, it needs a good world model. That’s why “predicting the next token” is so powerful—to do it well, you have to model the world. Human values are an important and not that complex part of that world.</p>\n\n<h3 id=\"6-distribution-shift-may-make-it-harder-for-ai-to-know-or-succeed\">6. Distribution shift may make it harder for AI to Know or Succeed.</h3>\n\n<p>The idea of “distribution shift” is that after super-intelligent AI arrives, the world may change quite a lot. Even if we train AI to be nice to us <em>now</em>, in that new world it will face novel situations where we haven’t provided any training data.</p>\n\n<p><img alt=\"learned values might diverge from training data\" src=\"https://dynomight.net/img/wanting/cartoon.svg\" /></p>\n\n<p>This could conceivably create problems both for AI <em>knowing</em> what we want, or for AI <em>succeeding</em> at what it tries to do.</p>\n\n<p>For example, maybe we teach an AI that it’s bad to kill people using lasers, and that it’s bad to kill people using viruses, and that it’s bad to kill people using radiation. But we forget to teach it that it’s bad to write culture-shifting novels that inspire people to live their best lives but also gradually increase political polarization and lead after a few decades to civilizational collapse and human extinction. So the AI <em>intentionally</em> writes that book and causes human extinction because it thinks that’s what we want, oops.</p>\n\n<p>Alternatively, maybe a super-powerful AI <em>knows</em> that we don’t like dying and it <em>wants</em> to help us not die, so it creates a retrovirus that spreads across the globe and inserts a new anti-cancer gene in our DNA. But it didn’t notice that this gene also makes us blind and deaf, and we all starve and die. In this case, the AI <em>accidentally</em> does something terrible, because it has so much power that it can’t correctly predict all the effects of its actions.</p>\n\n<h3 id=\"7-but-all-ai-needs-to-do-is-draw-a-conservative-boundary\">7. But all AI needs to do is draw a conservative boundary.</h3>\n\n<p>What are your values? Personally, very high on my list would be:</p>\n\n<blockquote>\n  <p>If an AI is considering doing anything and it’s not <em>very</em> sure that it aligns with human values, then it should not do it without checking <em>very</em> carefully with lots of humans and getting informed consent from world governments. Never <em>ever</em> do anything like that.</p>\n</blockquote>\n\n<p>And also:</p>\n\n<blockquote>\n  <p>AIs should never release retroviruses without being <em>very</em> sure it’s safe and checking <em>very</em> carefully with lots of humans and getting informed consent from world governments. Never ever, thanks.</p>\n</blockquote>\n\n<p>That is, AI safety doesn’t require AIs to figure out how to generalize human values to all weird and crazy situations. And it doesn’t need to correctly predict the effects of all possible weird and crazy actions. All that’s required is that AIs can <em>recognize</em> that something is weird/crazy and then be conservative.</p>\n\n<p>Clearly, just detecting that something is weird/crazy is easier than making correct predictions in all possible weird/crazy situations. But how <em>much</em> easier?</p>\n\n<h3 id=\"8-drawing-that-boundary-isnt-that-hard\">8. Drawing that boundary isn’t that hard.</h3>\n\n<p>(I think this is the weakest part of this argument. But here goes.)</p>\n\n<p>Would I trust an AI to correctly decide if human flourishing is more compatible with a universe where up quarks make up 3.1% of mass-energy and down quarks 1.9% versus one where up quarks make up 3.2% and down quarks 1.8%? Probably not. But I wouldn’t trust any particular human to decide that either. What I <em>would</em> trust a human to do is say, “Uhhh?” And I think we can also trust AI to know that’s what a human would say.</p>\n\n<p>Arguably, “human values” are a thing that only exist for some limited range of situations. As you get further from our evolutionary environment, our values sort of stop being meaningful. Do we prefer an Earth with 100 billion moderately happy people, or one with 30 billion very happy people? I think the correct answer is, “No”.</p>\n\n<p>When we <em>have</em> coherent answers, AI will know what they are. And otherwise, it will know that we don’t <em>have</em> coherent answers. So perhaps this is a better picture:</p>\n\n<p><img alt=\"values only exist in a limited range\" src=\"https://dynomight.net/img/wanting/limited.svg\" /></p>\n\n<p>And this seems… fine? AI doesn’t need to Solve Ethics, it just needs to understand the limited range of human values, such as they are.</p>\n\n<p>That argument (if correct) resolves the issue of distribution shift for <em>values</em>. But we still need to think about how distribution shift might make it harder for AI to succeed at what it tries to do.</p>\n\n<p>If AI attains godlike power, maybe it will be able to change planetary orbits or remake our cellular machinery. With this gigantic action space, it’s plausible that there would be many actions with bad but hard-to-predict effects. Even if AI only chooses actions that are 99.999% safe, if it makes 100 such actions per day, calamity is inevitable.</p>\n\n<p>Sure, but surely we want AI to take false discovery rates (“calamitous discovery rates”?) into account. It should choose a <em>set</em> of actions such that, taken together, they are 99.999% safe.</p>\n\n<p>Something that might work in our favor here is that verification is usually much easier than generation. Perhaps we could ask the AI to create a “proof” that all proposed actions are safe and run that proof by a panel of skeptical “red-team” AIs. If any of them find anything confusing at all, reject.</p>\n\n<p>I find the idea that “drawing a safe boundary is not that hard” fairly convincing for human values, but not only semi-convincing for predicting the effects of actions. So I’d like to see more debate on this point. (Did I mention that this is the weakest part of my argument?)</p>\n\n<h3 id=\"9-thus-if-an-ai-system-wants-to-do-what-we-want-the-rest-of-alignment-is-not-that-hard\">9. Thus, if an AI system <em>wants</em> to do what we want, the rest of alignment is not that hard.</h3>\n\n<p>It AI truly wants to do what we want, then the only thing it really needs to know about our values is “be conservative”. This makes the Knowing and Success problems much easier. Instead of needing to know how good all possible situations are for humans, it just needs to notice that it’s confused. Instead of needing to succeed at everything it tries, it just needs to notice that it’s unsure.</p>\n\n<h3 id=\"10-thus-making-ai-systems-want-to-do-what-we-want-is-necessary-and-sufficient-for-ai-safety\">10. Thus, making AI systems <em>want</em> to do what we want is necessary and sufficient for AI safety.</h3>\n\n<p>Since restrictions won’t work, you need to do alignment. Wanting is hard, but if you can solve Wanting, then you only need to solve easier version of Knowing and Success. So Wanting is the hard part.</p>\n\n<h2 id=\"consistency-with-other-views\">Consistency with other views</h2>\n\n<p>Again, I <em>think</em> the idea that “wanting is the hard part” is the majority view. Paul Christiano, for example, <a href=\"https://ai-alignment.com/clarifying-ai-alignment-cec47cd69dd6\">proposes</a> to call an AI “intent aligned” if it is <em>trying</em> to do what some operator wants it to do and states:</p>\n\n<blockquote>\n  <p>[The broader alignment problem] includes many subproblems that I think will involve totally different techniques than [intent alignment] (and which I personally expect to be less important over the long term).</p>\n</blockquote>\n\n<p>Richard Ngo also seems to <a href=\"https://www.alignmentforum.org/posts/PvA2gFMAaHCHfMXrw/agi-safety-from-first-principles-alignment#:~:text=the%20world.%5B1%5D%20Rather%2C-,my%20main%20concern,-is%20that%20AGIs\">explicitly endorse this view</a>:</p>\n\n<blockquote>\n  <p>Rather, my main concern is that AGIs will understand what we want, but just not care, because the motivations they acquired during training weren’t those we intended them to have.</p>\n</blockquote>\n\n<p>Many people have also told me this is the view of <a href=\"https://intelligence.org/\">MIRI</a>, the most famous AI-safety organization. As far as I can see, this is <em>compatible</em> with the MIRI worldview. But I don’t feel comfortable stating as a fact that MIRI agrees, because I’ve never seen any explicit endorsement, and I don’t fully understand how it fits together with other MIRI concepts like <a href=\"https://www.lesswrong.com/w/corrigibility-1\">corrigibility</a> or <a href=\"https://www.lesswrong.com/w/coherent-extrapolated-volition\">coherent extrapolated volition</a>.</p>\n\n<h2 id=\"counterarguments\">Counterarguments</h2>\n\n<p>Why might this argument be wrong?</p>\n\n<h3 id=\"maybe-restrictions-would-work\">Maybe restrictions would work.</h3>\n\n<p>(I don’t think so, but it’s good to be comprehensive.)</p>\n\n<h3 id=\"maybe-wanting-is-easy-for-some-reason\">Maybe Wanting is easy for some reason</h3>\n\n<p>Wanting <em>seems</em> hard, to me. And most experts seem to agree. But who knows, maybe it’s easy.</p>\n\n<p>Here’s one esoteric possibility. Above, I’ve implicitly assumed that an AI could in principle <a href=\"https://arbital.greaterwrong.com/p/orthogonality/\">want <em>anything</em></a>. But it’s conceivable that only <a href=\"https://arbital.greaterwrong.com/p/orthogonality/#:~:text=some%20subset%20of%20tractable%20utility%20functions\">certain kinds of wants</a> are stable. That might make Wanting harder or even quasi-impossible. But it could also conceivably make it easy. Maybe once you cross some threshold of intelligence, you become one with the universal mind and start treating all other beings as a part of yourself? I wouldn’t bet on it.</p>\n\n<h3 id=\"maybe-drawing-the-boundary-is-hard\">Maybe drawing the boundary is hard</h3>\n\n<p>A crucial part of my argument is the idea that it would be easy for AI to draw a conservative boundary when trying to predict human values or effects of actions. I find that reasonably convincing for values, but less so for actions. It’s certainly easi<em>er</em> than correctly generalizing to all situations, but it might still be very hard.</p>\n\n<p>It’s also conceivable that AI creates such a large action space that even if humans were allowed to make every single decision, we would destroy ourselves. For example, there <em>could</em> be an undiscovered law of physics that says that if you build a skyscraper taller than 900m, suddenly a black hole forms. But physics provides no “hints”. The only way to discover that is to build the skyscraper and create the black hole.</p>\n\n<p>More plausibly, maybe we do in fact live in a <a href=\"https://en.wikipedia.org/wiki/Vulnerable_world_hypothesis\">vulnerable world</a>, where it’s possible to create a planet-destroying weapon with stuff you can buy at the hardware store for $500, we just haven’t noticed yet. If some such horrible fact is lurking out there, AI might find it much sooner than we would.</p>\n\n<h3 id=\"maybe-these-are-the-wrong-abstractions\">Maybe these are the wrong abstractions</h3>\n\n<p>Finally, maybe the whole idea of an AI “wanting” things is bad. It seems like a useful abstraction when we think about people. But if you try to reduce the human concept of “wanting” to neuroscience, it’s extremely difficult. If an AI is a bunch of electrons/bits/numbers/arrays flying around, is it obvious that the same concept will emerge?</p>\n\n<h3 id=\"who-is-we\">Who is “we”?</h3>\n\n<p>I’ve been sloppy in this post in talking about AIs respecting “our” values or “human values”. That’s probably not going to happen. Absent some enormous cultural development, AIs will be trained to advance the interests of <em>particular human organizations</em>. So even if AI alignment is solved, it seems likely that different groups of humans will seek to create AIs that help them, even at some expense to other groups.</p>\n\n<p>That’s not technically a flaw in the argument, since it just means Wanting is even harder. But it could be a serious problem, because…</p>\n\n<h3 id=\"arms-races-might-destroy-conservatism\">Arms races might destroy conservatism</h3>\n\n<p>Suppose you live in Country A. Say you’ve successfully created a super-intelligent AI that’s very conservative and nice. But people in Country B don’t like you, so they create their own super-intelligent AI and ask it to hack into your critical systems, e.g. to disable your weapons or to prevent you from making an even-more-powerful AI.</p>\n\n<p>What happens now? Well, their AI is too smart to be stopped by the humans in Country A. So your only defense will be to ask your own AI to defend against the hacks. But then, Country B will probably notice that if they give their AI more leeway, it’s better at hacking. This forces you to give your AI more leeway so it can defend you. The equilibrium might be that both AIs are told that, actually, they don’t need to be very conservative at all.</p>\n\n<h2 id=\"things-i-read\">Things I read</h2>\n\n<p>Finally, here’s some stuff I found useful, from people who may or may not agree with the above argument:</p>\n\n<ul>\n  <li><a href=\"https://www.alignmentforum.org/posts/vMM6HmSQaKmKadvBi/the-core-of-the-alignment-problem-is-1\">The Core of the Alignment Problem is…</a>, by Thomas Larsen et al.</li>\n  <li><a href=\"https://www.thecompendium.ai/\">The Compendium</a>, by Connor Leahy et al.</li>\n  <li><a href=\"https://www.alignmentforum.org/posts/GNhMPAWcfBCASy8e6/a-central-ai-alignment-problem-capabilities-generalization\">A central AI alignment problem: capabilities generalization, and the sharp left turn</a>, by Nate Soares</li>\n  <li><a href=\"https://intelligence.org/files/Corrigibility.pdf\">Corrigibility</a>, by Nate Soares et al.</li>\n  <li><a href=\"https://www.alignmentforum.org/posts/uMQ3cqWDPHhjtiesc/agi-ruin-a-list-of-lethalities\">AGI Ruin: A List of Lethalities</a>, by Eliezer Yudkowsky</li>\n  <li><a href=\"https://www.alignmentforum.org/posts/CoZhXrhpQxpy9xw9y/where-i-agree-and-disagree-with-eliezer\">Where I agree and disagree with Eliezer</a>, by Paul Christiano</li>\n  <li><a href=\"https://www.lesswrong.com/posts/uMQ3cqWDPHhjtiesc/agi-ruin-a-list-of-lethalities?commentId=JL29PYktEvpd6fuQ5\">(Untitled comment)</a>, by Vanessa Kosoy</li>\n  <li><a href=\"https://www.lesswrong.com/posts/2NncxDQ3KBDCxiJiP/cosmopolitan-values-don-t-come-free?commentId=ofPTrG6wsq7CxuTXk\">(Untitled comment)</a>, by Paul Christiano</li>\n  <li><a href=\"https://goodjudgment.com/superforecasting-ai/\">Superforecasting AI</a>, by the Good Judgment project</li>\n  <li><a href=\"https://arxiv.org/pdf/2206.13353\">Is Power-Seeking AI an Existential Risk?</a>, by Joseph Carlsmith</li>\n  <li><a href=\"https://www.alignmentforum.org/posts/PvA2gFMAaHCHfMXrw/agi-safety-from-first-principles-alignment\">AGI safety from first principles</a>, by Richard Ngo</li>\n  <li><a href=\"https://gracekind.net/threefacets/\">A Three-Facet Framework for AI Alignment</a>, by Grace Kind</li>\n</ul>"
            ],
            "link": "https://dynomight.net/wanting/",
            "publishedAt": "2025-06-26",
            "source": "Dynomight",
            "summary": "<p>I haven’t followed AI safety too closely. I tell myself that’s because tons of smart people are working on it and I wouldn’t move the needle. But I sometimes wonder, is that logic really unrelated to the fact that every time I hear about a new AI breakthrough, my chest tightens with a strange sense of dread?</p> <p>AI is one of the most important things happening in the world, and possibly <em>the</em> most important. If I’m hunkering in a bunker years from now listening to hypersonic kill-bots laser-cutting through the wall, will I really think, <em>boy am I glad I stuck to my comparative advantage</em>?</p> <p>So I thought I’d take a look.</p> <p>I stress that I am not an expert. But I thought I’d take some notes as I try to understand all this. Ostensibly, that’s because my outsider status frees me from the <a href=\"https://en.wikipedia.org/wiki/Curse_of_knowledge\">curse of knowledge</a> and might be helpful for other outsiders. But mostly, I like writing blog posts.</p> <p>So let’s start at the beginning. AI safety is the long-term problem of making AI be nice to us. The obvious first question is, what’s the hard part? Do we know? Can we say anything?</p> <p>To my surprise,",
            "title": "The AI safety problem is wanting"
        },
        {
            "content": [
                "<img alt=\"AI coding tools are perhaps our new terminal emulators\" src=\"https://ghuntley.com/content/images/2025/06/An-epic-scene-depicting-a-massive--heroic-symbolic-traditional-tattoo-art-print-of-a-computer-terminal-on-a-white-background.--The-print-features-vibrant-colors--retro-flair--complex-ornamental-details--and-modern-future-aesthetics-with-ama.jpg\" /><p>So I&apos;m currently over in San Francisco. I&apos;ve been here for almost two weeks now. I&apos;ll be heading home to my family in a couple of days. But over the weekend, I had the opportunity to drop into the Computer History Museum. I&apos;m not gonna lie, being able to spend some time on a functioning PDP-1 is way up there on the bucket list.</p><figure class=\"kg-card kg-gallery-card kg-width-wide kg-card-hascaption\"><div class=\"kg-gallery-container\"><div class=\"kg-gallery-row\"><div class=\"kg-gallery-image\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" height=\"1920\" src=\"https://ghuntley.com/content/images/2025/06/IMG_0473-1.jpg\" width=\"1440\" /></div><div class=\"kg-gallery-image\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" height=\"1440\" src=\"https://ghuntley.com/content/images/2025/06/IMG_0529-1.jpg\" width=\"1920\" /></div></div><div class=\"kg-gallery-row\"><div class=\"kg-gallery-image\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" height=\"1920\" src=\"https://ghuntley.com/content/images/2025/06/IMG_0534-2-1.jpg\" width=\"1440\" /></div><div class=\"kg-gallery-image\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" height=\"1440\" src=\"https://ghuntley.com/content/images/2025/06/IMG_0540-1.jpg\" width=\"1920\" /></div></div></div><figcaption><p><span style=\"white-space: pre-wrap;\">The four classic icons of compute.</span></p></figcaption></figure><p>Now, something strange happened while I was down at the Computer History Museum. One of my mates I was with had an incident on their Kubernetes cluster. </p><p>Typically, if you&apos;re the on-call engineer in such a scenario, you would open your laptop, open a terminal, and then log on to the cluster manually. That&apos;s the usual way that people have been doing incident response as a site reliability engineer for a very long time.</p><p>Now, this engineer didn&apos;t pop open their terminal. Instead, they remotely controlled a command-line coding agent and issued a series of prompts, which made function calls into the cluster using standard command-line tools from their phone.</p><p>We were sitting outside the Computer History Museum, watching as the agent enumerated through the cluster in a read-only fashion and correctly diagnosed a corrupted ETCD database. Not only did it correctly diagnose the root cause of the cluster&apos;s issue, but it also automatically authored a 95% complete post-incident review document (a GitHub issue) with the necessary action steps for resolution before the incident was even over.</p><p>Previously, I had theorised (<a href=\"https://ghuntley.com/six-month-recap/\" rel=\"noreferrer\">see my talk</a>) that this type of thing is possible, but here we were with an SRE agent, a human in the loop, controlling an agent and automating their job function.</p><p>Throughout the day, I kept pondering the above, and then, while walking through the Computer History Museum, I stumbled upon this exhibit...</p><figure class=\"kg-card kg-image-card\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" class=\"kg-image\" height=\"1920\" src=\"https://ghuntley.com/content/images/2025/06/IMG_0535.jpg\" width=\"1440\" /></figure><p>The Compaq 386 and the introduction of AutoCAD. If you&apos;ve been following my writing, you should know by now of the analogies I like to draw between AutoCAD and software engineering. </p><p>Before AutoCAD, we used to have rooms full of architects, then CAD came along and completely changed how the architecture profession was done. Not only were they asked to do drafting, but they were also expected to do design. </p><p>I think there are a lot of analogues here that explain the transition that&apos;s happening now with our profession with AI. Software engineers are still needed, but the job has evolved.</p><p>These days, I spend a lot of time thinking about what is changing and what has changed. One thing I&apos;ve noticed that has changed is best illustrated in the chart below.</p><figure class=\"kg-card kg-image-card\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" class=\"kg-image\" height=\"574\" src=\"https://ghuntley.com/content/images/2025/06/bellcurve-1.png\" width=\"842\" /></figure><p>Now, the <a href=\"https://ampcode.com/?ref=ghuntley.com\" rel=\"noreferrer\">Amp team</a> is fortunate enough to be open to hiring senior curmudgeons like me, as well as juniors. And when I was having this conversation with the junior, who was about 20 years old and still in university, I remember discussing with him and another coworker that the junior should learn the CLI and learn the beauty of Unix POSIX and how to chain together commands.</p><blockquote>The junior challenged me and said, &quot;But why? All I need to do is prompt.&quot;</blockquote><p>I&apos;ve been working with Unix for a long time. I&apos;ve worked with various operating systems, including SunOS, HP-UX, IRIX, and Solaris, to name a few, using different shells, such as CSH, KSH, Bash, ZSH, and FISH. </p><p>In that moment, I realised that I was the person on top of the bell curve, and when I looked at how I&apos;d been using Amp over the last couple of weeks and other tools similar to it, I realised none of it matters anymore.</p><blockquote>All you need to do is prompt.</blockquote><p>These days, when I&apos;m in a terminal emulator, I&apos;m running a tool such as Claude Code or Amp and driving it via text-to-speech. I&apos;m finding myself using the classic terminal emulator experience less and less with each passing day.</p><p>For example, here&apos;s a prompt I do often...</p><blockquote>Run a production build of the VS Code extension, look at the PNPM targets, then install the compiled artifact into VS Code.</blockquote><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" class=\"kg-image\" height=\"1242\" src=\"https://ghuntley.com/content/images/2025/06/CleanShot-2025-06-25-at-15.02.47@2x.png\" width=\"1596\" /><figcaption><span style=\"white-space: pre-wrap;\">now imagine 10 of these sessions running concurrently and yourself switching between them with text-to-speech</span></figcaption></figure><p>Perhaps this is not the best use or demonstration, as it could be easily turned into a deterministic shell script. However, upon reflection, if I needed to build such a deterministic shell script, I would use a coding tool to generate it. I would no longer be creating it by hand...</p><figure class=\"kg-card kg-image-card\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" class=\"kg-image\" height=\"1480\" src=\"https://ghuntley.com/content/images/2025/06/CleanShot-2025-06-25-at-15.04.12@2x.png\" width=\"1824\" /></figure><p>So, I&apos;ve been thinking that perhaps the next form of the terminal emulator will be an agent with a library of standard prompts. These standard prompts essentially function as shell scripts because they can compose and execute commands or perform activities via MCP, and there&apos;s nearly no limit to what they can do.</p><p>It&apos;s also pretty impressive tbh for doing one-shot type activities. For example, the images at the top of this blog post were resized with the prompt below.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" class=\"kg-image\" height=\"1480\" src=\"https://ghuntley.com/content/images/2025/06/CleanShot-2025-06-25-at-17.14.50@2x.png\" width=\"1824\" /><figcaption><span style=\"white-space: pre-wrap;\">&quot;I&apos;ve got a bunch of images in this folder. They are HEICs. I want you to convert them to JPEGs that are 1920px and no bigger than 500 kilobytes.&quot;</span></figcaption></figure><p>You can see the audit trail of the execution of the above below &#x1f447;</p><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://ampcode.com/threads/T-c1a437af-3b3b-4ceb-9a1d-2106b368e93e?ref=ghuntley.com\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">Convert HEIC images to compressed JPEG</div><div class=\"kg-bookmark-description\"></div><div class=\"kg-bookmark-metadata\"><img alt=\"AI coding tools are perhaps our new terminal emulators\" class=\"kg-bookmark-icon\" src=\"https://ghuntley.com/content/images/icon/amp-mark-color-7.svg\" /><span class=\"kg-bookmark-author\">Amp</span></div></div></a></figure><h2 id=\"ps-socials\">ps. socials</h2><ul><li>LinkedIn - <a href=\"https://www.linkedin.com/posts/geoffreyhuntley_ai-coding-tools-are-perhaps-our-new-terminal-activity-7343802777376083969--t_d?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAABQKuUB2AJ059keUcRUVLbtmoa6miLVlTI\">https://www.linkedin.com/posts/geoffreyhuntley_ai-coding-tools-are-perhaps-our-new-terminal-activity-7343802777376083969--t_d</a></li><li>X - <a href=\"https://x.com/GeoffreyHuntley/status/1938036612958720493?ref=ghuntley.com\">https://x.com/GeoffreyHuntley/status/1938036612958720493</a></li><li>BlueSky - <a href=\"https://bsky.app/profile/ghuntley.com/post/3lshvuvrqms2l?ref=ghuntley.com\">https://bsky.app/profile/ghuntley.com/post/3lshvuvrqms2l</a></li></ul>"
            ],
            "link": "https://ghuntley.com/vt100/",
            "publishedAt": "2025-06-26",
            "source": "Geoffrey Huntley",
            "summary": "<p>So I&apos;m currently over in San Francisco. I&apos;ve been here for almost two weeks now. I&apos;ll be heading home to my family in a couple of days. But over the weekend, I had the opportunity to drop into the Computer History Museum. I&apos;</p>",
            "title": "AI coding tools are perhaps our new terminal emulators"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-06-26_3f3e803453d3_my-new-friend/",
            "publishedAt": "2025-06-26",
            "source": "Harper Reed",
            "summary": "<p>My new friend.</p> <figure> <img alt=\"image_1.jpg\" height=\"1536\" src=\"https://harper.blog/notes/2025-06-26_3f3e803453d3_my-new-friend/image_1.jpg\" width=\"1536\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #265"
        },
        {
            "content": [
                "<h3>The Story So Far</h3><p>The mid-20th century was the golden age of nurture. Psychoanalysis, behaviorism, and the spirit of the &#8216;60s convinced most experts that parents, peers, and propaganda were the most important causes of adult personality.</p><p>Starting in the 1970s, the pendulum swung the other way. Twin studies shocked the world by demonstrating that most behavioral traits - including socially relevant traits like IQ - were substantially genetic. Typical estimates for adult IQ found it was about 60% genetic, 40% unpredictable, and barely related at all to parenting or family environment.</p><p>By the early 2000s, genetic science reached a point where scientists could start pinpointing the particular genes behind any given trait. Early <em>candidate gene</em> <em>studies</em>, which hoped to find single genes with substantial contributions to IQ, depression, or crime, mostly failed. They were replaced with <em>genome wide association studies,</em> which accepted that most interesting traits were <em>polygenic </em>- controlled by hundreds or thousands of genes - and trawled the whole genome searching for variants that might explain 0.1% or even 0.01% of the pie. The goal shifted toward <em>polygenic scores</em> - algorithms that accepted thousands of genes as input and spit out predictions of IQ, heart disease risk, or some other outcome of interest.</p><p>The failed candidate gene studies had sample sizes in the three or four digits. The new genome-wide studies needed five or six digits to even get started. It was prohibitively difficult for individual studies to gather so many subjects, genotype them, and test them for the outcome of interest, so work shifted to big centralized genome repositories - most of all the UK Biobank - and easy-to-measure traits. Among the easiest of all was <em>educational attainment</em> (EA), ie how far someone had gotten in school. Were they a high school dropout? A PhD? Somewhere in between? This correlated with all the spicy outcomes of interest people wanted to debate - IQ, wealth, social class - while being objective and easy to ask about on a survey.</p><p>Twin studies suggested that IQ was about 60% genetic, and EA about 40%. This seemed to make sense at the time - how far someone gets in school depends partly on their intelligence, but partly on fuzzier social factors like class / culture / parenting. The first genome-wide studies and polygenic scores found enough genes to explain 2%pp<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a> of this 40% pie. The remaining 38%, which twin studies deemed genetic but where researchers couldn&#8217;t find the genes - became known as &#8220;the missing heritability&#8221; or &#8220;the heritability gap&#8221;.</p><p>Scientists came up with two hypothesis for the gap, which have been dueling ever since:</p><ol><li><p>Maybe twin studies are wrong.</p></li><li><p>Maybe there are genes we haven&#8217;t found yet</p></li></ol><p>For most of the 2010s, hypothesis 2 looked pretty good. Researchers gradually gathered bigger and bigger sample sizes, and found more and more of the missing heritability. A big 2018 study increased the predictive power of known genes from <strong>2%</strong> to <strong>10%</strong>. An even bigger 2022 study increased it to <strong>14%,</strong> and current state of the art is around <strong>17%</strong>. Seems like it was sample size after all! Once the samples get big enough we&#8217;ll reach 40% and finally close the gap, right?</p><p>This post is the story of how that didn&#8217;t happen, of the people trying to rehabilitate the twin-studies-are-wrong hypothesis, and of the current status of the debate. Its most important influence/foil is <strong><a href=\"http://gusevlab.org/\">Sasha Gusev</a></strong>, whose blog <a href=\"https://theinfinitesimal.substack.com/\">The Infintesimal</a> introduced me to the new anti-hereditarian movement and got me to research it further, but it&#8217;s also inspired by <strong><a href=\"https://ericturkheimer.substack.com/\">Eric Turkheimer</a></strong>, <strong><a href=\"https://alextisyoung.github.io/\">Alex Young</a></strong> (not himself an anti-hereditarian, but his research helped ignite interest in this area), and <strong><a href=\"https://www.psychiatrymargins.com/\">Awais Aftab</a></strong>. </p><p>(while I was working on this draft, the East Hunter Substack <a href=\"https://easthunter.substack.com/p/is-hereditarianism-wrong\">wrote a similar post</a>. Theirs is good and I recommend it, but I think this one adds enough that I&#8217;m publishing anyway. You can see Gusev&#8217;s response to East Hunter <a href=\"https://substack.com/@sashagusev/note/c-119431609?r=2izzlj\">here</a>)</p><p>In an interview with Aftab, Gusev explained his philosophy like so (I am excerpting heavily from a long interview and editing for flow/emphasis; completionists should <a href=\"https://www.psychiatrymargins.com/p/a-critical-introduction-to-behavioral\">read the whole thing</a>):</p><blockquote><p>For teacher-reported ADHD, the twin heritability estimate was 69% while the GWAS-based heritability estimate was just 5%; with similar gaps for other behavioral traits. These are huge differences!</p><p>If we believe the twin study estimates, then this gap implies that there is a lot of causal genetic variation out there that GWAS/molecular data is not picking up. One way to think about this is that traits that are under stronger natural selection will have more of their genetic variants driven to low frequency, and thus less detectable by GWAS. So a big gap between GWAS and twins could imply that rare variants are very important due to strong selection. On the other hand, if we are skeptical of the twin study estimates, then this gap implies a substantial contribution from those environmental complexities I talked about previously. For a long time, the field of molecular genetics was operating under the assumption that the missing heritability was largely in the rare variants we had not yet measured. But a number of recent advances have started to tip the scales against that argument. </p><p>First, some of the earlier molecular heritability estimates were found to be inflated by some mix of technical issues and cultural transmission, so the amount of missing heritability actually increased. </p><p>Second, a new model was developed that could estimate total direct heritability using molecular data from mother-father-child trios, with very few model assumptions (the title literally states &#8220;&#8230; without environmental bias&#8221;; <a href=\"https://pubmed.ncbi.nlm.nih.gov/30104764/\">Young et al. 2018</a>), and it too found estimates that were substantially lower than twins on average. </p><p>Third, several studies have now actually measured the influence of rare variants in various forms, and they are so far not adding up to explain as much as we would expect from twin heritability estimates. </p><p>Fourth, there is little evidence of the strong natural selection that would be needed to generate a massive trove of rare variants untagged by GWAS. I am a molecular geneticist, and <strong>this drumbeat of evidence from molecular data has convinced me that twin studies are either 2-3x inflated or estimate something fundamentally different from direct heritability.</strong></p></blockquote><p>We&#8217;ll start by looking at Gusev&#8217;s first claim: that &#8220;earlier molecular estimates&#8221; (ie polygenic scores) are significantly inflated, or at least don&#8217;t mean what we thought they meant. This won&#8217;t be directly relevant to our question - even our original number of 17% implies missing heritability<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-2\" id=\"footnote-anchor-2\" target=\"_self\">2</a>, so moving it down a bit to 5-10% or up a bit to 20% doesn&#8217;t add or subtract from the fundamental mystery. But this discussion has gotten a lot of people extremely confused, and we&#8217;ll need to deconfuse ourselves if we&#8217;re going to get any further.</p><h2>Are Most Current Polygenic Scores Confounded?</h2><p>A polygenic score is one possible result of a genome-wide association study. These scores are algorithms which take a person&#8217;s genes as input and return information about their traits as output. Better polygenic scores can predict a higher percent of variance in a certain trait. For example, the latest polygenic score on educational attainment can predict up to 17% of the variance in how much schooling someone completes. </p><p>Predictive power is different from causal efficacy. Consider a racist society where the government ensures that all white people get rich but all black people stay poor. In this society, the gene for lactose tolerance (which most white people have, but most black people lack) would do a great job <strong>predicting</strong> social class, but it wouldn&#8217;t <strong>cause</strong> social class<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-3\" id=\"footnote-anchor-3\" target=\"_self\">3</a>. It certainly wouldn&#8217;t be a &#8220;gene for social class&#8221; in the sense where it controls the part of your brain that helps you manage money, or where genetic engineering on this gene would make people richer. </p><p>Here are three common ways that not-directly-causal genes can show up as predicting a trait:</p><p><strong>Population stratification: </strong>genes are linked to culture, and culture determines the trait, as in the racism-lactose example above. Many studies naturally mitigate this concern by using the UK Biobank of mostly white British samples, and by correcting for &#8220;principal components&#8221; that correspond to ancestry (and there are other, even more complicated ways to correct for this). But ancestry variation is fractal; no matter how uniform your sample, there will still be micro-differences you didn&#8217;t consider. For example, if you&#8217;re analyzing the educational attainment of white British people, it&#8217;s very relevant that <a href=\"https://www.oxfordstudent.com/2013/11/07/normans-conquer-oxford-names/\">families with Norman surnames still outperform their Saxon peers at Oxbridge admissions</a> 900 years after William the Conqueror. If Britons with more Norman ancestry have non-education-related genes that their Saxon peers lack, these could be mistakenly classified as genes for education <a href=\"https://www.kiplingsociety.co.uk/poem/poems_normansaxon.htm\">or other behavioral differences between the two groups</a>.</p><p><strong>Assortative mating:</strong> Suppose that both height and wealth are desirable qualities in a mate. Then tall people will tend to marry rich people, and over generations, the same people will be both rich and tall. That means that even if wealth is 0% genetic, a study looking for &#8220;the gene for wealth&#8221; will be able to find genes that rich people have more often than poor people - namely, the genes for height.</p><p>Or suppose that smart people tend to marry other smart people - surely true, if only because so many couples meet at college. Then all the intelligence genes will concentrate in the same people. So any study that tries to determine how much Intelligence Gene ABC affects intelligence will get inflated<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-4\" id=\"footnote-anchor-4\" target=\"_self\">4</a> results, because everyone with Intelligence Gene ABC will also have many other intelligence genes - if the study naively asks &#8220;How much smarter are people with Gene ABC than people without it?&#8221;, it will find they are much smarter (because it&#8217;s accidentally including part of the effects of all the other intelligence genes that travel along with it).</p><p><strong>Parent-to-child transmission, aka &#8220;genetic nurture&#8221;: </strong>Children tend to share their parents&#8217; genes. So if there&#8217;s a gene that causes parents to create a certain kind of childrearing environment, and that childrearing environment affects a trait, it will falsely look like a gene that directly causes the trait.</p><p>Suppose Gene XYZ causes parents to read more books to their children, and reading books to children increases their IQ. Parents with Gene XYZ will tend to read books, so their kids will get high IQ. Those kids will also (probably) inherit Gene XYZ from their parents. So people with Gene XYZ will tend to have higher IQ. If you naively study which genes increase IQ, you&#8217;ll see Gene XYZ in more smart people than dumb people, and think it&#8217;s a &#8220;gene for IQ&#8221;. This is &#8220;causal&#8221; in a certain sense, but it&#8217;s not the one we traditionally think about, and it behaves importantly differently - for example, if you genetically engineer someone to have Gene XYZ, their IQ won&#8217;t go up (although their kids&#8217; IQs might).</p><p><strong>How</strong> can we tell if a polygenic predictor is &#8220;direct&#8221; vs. confounded by these non-causal pathways? The most common technique is within-family comparisons: do the traditional &#8220;check if people with the gene differ on a trait from people without the gene&#8221; study, but limit its focus to (for example) sibling pairs. Suppose a couple has two children; the first child inherits Gene ABC and the second one doesn&#8217;t. If the first child is smarter than the second child, that provides some infinitesimal evidence that Gene ABC is a gene for intelligence. Repeat this process over hundreds of thousands of sibling pairs, and the infinitesimal evidence can reach statistical significance. Since the family unit is a perfect natural experiment that isolates the variable of interest (genes) while holding everything else (culture and parenting) constant, within-family results are protected against stratification, assortative mating, and genetic nurture effects.</p><p>The culmination of this research program is <a href=\"https://www.medrxiv.org/content/10.1101/2024.10.01.24314703v1\">Tan et al 2024</a>, which finds that many polygenic predictors lose significant accuracy when retested among siblings. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!ioe2!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F05c5bec7-469c-40d2-b908-68d8583c9cca_766x766.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"766\" src=\"https://substackcdn.com/image/fetch/$s_!ioe2!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F05c5bec7-469c-40d2-b908-68d8583c9cca_766x766.png\" width=\"766\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\"></figcaption></figure></div><p>For example, educational attainment is 50% uncorrelated with direct genetic effects. You need to square this to figure out what percent is causal; when you do that, you find that the polygenic score that explained 14% of EA is only 4%pp direct genes, with the other 10%pp being nondirect<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-5\" id=\"footnote-anchor-5\" target=\"_self\">5</a> confounders.</p><p>So yes, it seems like most polygenic scores that don&#8217;t validate within families are confounded. However unhappy we previously were that we had only found 14% of genes for EA (vs. 40% expected), we should now be much more unhappy -  we really only know 4% of genes that directly cause EA.</p><p>On the other hand, you might say - so before we only knew 14%pp out of 40%. Now we only know 4%pp out of 40%. This is discouraging, but it doesn&#8217;t fundamentally change what we know about nature vs. nurture. Both 4%pp and 14%pp are less than 40% - with either number, we must be missing something or doing something wrong. Probably that&#8217;s insufficient sample size. We&#8217;ll keep working on sample size and other things, and eventually scrounge up the missing 26%pp or 36%pp or whatever of the variance, so this doesn&#8217;t change anything. All it means is that one predictive method that the average person never knew about in the first place doesn&#8217;t work as well as we thought. Who cares?</p><p>Not doctors. So far this research has only just barely begun to reach the clinic. But also, all doctors want to do is predict things (like heart attack risk). They don&#8217;t care if they use causal vs. nondirect genes. It doesn&#8217;t matter if you&#8217;re &#8220;only&#8221; at higher risk of heart attack because you&#8217;re black, or Norman, or because your parents read books to you - you still need more heart attack medication!</p><p><a href=\"https://www.astralcodexten.com/p/welcome-polygenically-screened-babies\">Polygenic embryo selection</a> companies should care. They offer polygenic scores that can be used to select healthier or smarter embryos. If the predictors they use rely partly on variants that aren&#8217;t causal within families, their real benefits could be far lower than advertised. I talked to one of these companies, who said they&#8217;d already adjusted for these effects and expected their competitors had too - the proper antidote to this problem, sibling controls, is a natural choice when you&#8217;re literally picking between siblings. </p><p>The biggest losers are the epidemiologists. They had started using polygenic predictors as a novel randomization method; suppose, for example, you wanted to study whether smoking causes Alzheimers. If you just checked how many smokers vs. nonsmokers got Alzheimers, your result would be vulnerable to bias; maybe poor people smoke more and get more Alzheimers. But (they hoped) you might be able to check whether people with <em>the genes for</em> smoking get more Alzheimers. Poverty can&#8217;t make you have more or fewer genes! This was a neat idea, but if the polygenic predictors are wrong about which genes cause smoking and what effect size they have, then the less careful among these results will <a href=\"https://academic.oup.com/ije/article/54/1/dyae179/8005356?login=false\">need </a>to be re-examined.</p><p>But the reason I spent so much time on the subject here is that this has confused a lot of people into thinking <em>heritability itself</em> was confounded and is actually just 4%. When I read my first few blog posts on these findings, I came away thinking they were claiming to have discredited twin studies and heritability. And although I take partial ownership of my own poor reading comprehension, I maintain that the way that the new anti-hereditarians discuss this is pretty bad. For example, Turkheimer&#8217;s treatment of the Tan study above is called <a href=\"https://ericturkheimer.substack.com/p/is-tan-et-al-the-end-of-social-science\">Is Tan Et Al The End Of Social Science Genomics?</a>, and includes passages like:</p><blockquote><p>The median [direct genomic effect] heritability for behavioral phenotypes is .048. Let that sink in for a second. How different would the modern history of behavior genetics be if back in the 80s one study after another had shown that the heritability of behavior was around .05? When Arthur Jensen wrote about IQ, he usually used a figure of .8 for the heritability of intelligence. I know that the relationship between twin heritabilities and SNP heritabilities is complicated, and in fact the DGE heritability of ability is one of the higher ones, at .233<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-6\" id=\"footnote-anchor-6\" target=\"_self\">6</a>. But still, it seems to me that the appropriate conclusion from these results is that among people who don&#8217;t have an identical twin, genomic information is a statistically non-zero but all in all relatively minor contributor to behavioral differences.</p></blockquote><p>And comments included things <a href=\"https://ericturkheimer.substack.com/p/is-tan-et-al-the-end-of-social-science/comment/105972815\">like</a>:</p><blockquote><p>I don&#8217;t know if [this study] is the end of social science genomics, but it should certainly be the end of attributing significant genetic influence to behavioral traits (despite the recent scientist-generated cartoons touting genes for &#8220;income&#8221;).</p></blockquote><p><a href=\"https://ericturkheimer.substack.com/p/is-tan-et-al-the-end-of-social-science/comment/106431494\">And</a>:</p><blockquote><p>There's no doubt that this reported findings have dealt a fatal blow to my conviction that behavioral traits are pre-eminently heritable&#8230;This is a remarkable example of an objective statistical fact mercilessly crushing the more subjective experiential sense of \"A looks and acts more like B than C because A and B have the same parents.\" This subjective evidence is almost unshakable and universal in its application as a tried and tested psychosocial heuristic. And yet, here we are.</p></blockquote><p>Turkheimer is either misstating the relationship between polygenic scores and narrow-sense heritability, or at least egging on some very confused people who are doing that, and the dynamic was bad enough that I got confused myself for a while.</p><p>But even more confusing, the new anti-hereditarians actually <em>are</em> saying that lots of behavioral traits have very low heritability! But this point requires different arguments, only tangentially related to these. So let&#8217;s move on to&#8230;</p><h2>Is Heritability Genuinely Low? (Part 1: GWAS &amp; GREML)</h2><p>In the mid 2010s, when genome-wide association studies (GWAS) based polygenic predictors were getting better every year, it was easy to hope they might reach 40% and close the &#8220;missing heritability&#8221;. But since then, progress has stalled. The second-to-last tripling of sample size, from <a href=\"https://www.frontiersin.org/journals/sociology/articles/10.3389/fsoc.2019.00074/full\">300K</a> to <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC6393768/?utm_source=chatgpt.com\">1M</a> between 2016 - 2018, increased predictive power from 6% &#8594; 12%. The last tripling, from <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC6393768/?utm_source=chatgpt.com\">1M</a> to <a href=\"https://www.nature.com/articles/s41588-022-01016-z\">3M</a> between 2018 - 2022, only increased predictive power from 12% &#8594; 14%. If you graph sample size vs. predictive power, it looks like there's an asymptote between 15 - 20% or so.</p><p>(of which - remember - only 5% is directly causal!)</p><p>Worse, a mid-2010s technique called GREML allowed researchers to estimate the percent of variance in a trait that comes from the sorts of common genes studied in GWAS, without having to identify the genes involved. <a href=\"https://www.nature.com/articles/mp201645\">A 2016 GREML paper</a> suggested that the maximum share of variance that GWASs of educational attainment could ever discover was about 21% (again, compared to 40% predicted genetic from twin studies). Since unavoidable methodological issues will prevent GWASs from reaching the literal maximum possible, this agrees with the evidence suggesting an asymptote between 15 - 20%.</p><p>So either twin studies are wrong and traits are less heritable than believed, or the heritability must lie somewhere other than the common genes identifiable by GWAS.</p><p>What about rare genes?</p><p>GWASs focus on genetic variation common enough to be worth including in a basic genetic test. Most of this is single nucleotide polymorphisms (&#8220;SNPs&#8221;). A single nucleotide is one letter of DNA - for example, a C or a G. Polymorphisms are genes that commonly vary in humans - sometimes across races (for example, some humans have a gene for light skin, and other humans have a gene for dark skin), and other times within races (for example, some white people have a gene that makes cilantro taste like soap, and others don&#8217;t). So SNPs are single-letter spots in DNA where different people often have different letters. How often? Some people say 1%, but the more practical definition is &#8220;often enough that someone has noticed and added it to the test panel&#8221;. There are three billion letters in the genome, of which only a few million are commonly-tested SNPs.</p><p>But these SNP studies have limited<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-7\" id=\"footnote-anchor-7\" target=\"_self\">7</a> ability to measure personal mutations and rare variants. Sometimes your parents&#8217; egg and sperm cells mess up copying a nucleotide of DNA, and you get a mutation that isn&#8217;t inherited from your ethnic group or even from your subgroup/family line - it&#8217;s just some idiosyncratic DNA change that you might be the first person in history to have. Since scientists have never seen this mutation before, they don&#8217;t know about it and can&#8217;t test for it without doing something more expensive than a simple SNP screen.</p><p>And SNP studies have limited ability to detect anything more complicated than a single letter changing to another single letter. But some mutations are more complicated <em>structural variants</em>. For example, some bits of DNA get stuck on repeat - one person might have GATGAT, another person might have GATGATGATGAT, and a third person might have fifty GATs in a row. Other bits come out backwards. Sometimes a whole chunk of DNA goes missing, or moves to the wrong place. Occasionally a gene reads <em>The Selfish Gene </em>by Richard Dawkins, takes it too seriously, and <a href=\"https://en.wikipedia.org/wiki/Selfish_genetic_element\">evolves some ridiculous trick</a> for spamming itself all over the genome.</p><p>So if even the best molecular studies seem to be asymptoting around 15-20% of variance in educational attainment, but twin studies suggest it&#8217;s 40% genetic, might rare variants and structural variants make up the missing 20-25%pp?</p><p>This remains a topic of bitter disagreement.</p><p>On the one side, hereditarians bring up <a href=\"https://sci-hub.st/https://link.springer.com/article/10.1007/s00439-019-02040-6\">a Darwinian argument</a>: imagine a genetic engineer who hopes to find the genes for educational attainment and edit them to make everyone smart and successful. She looks harder and harder, becoming more and more exasperated as they fail to materialize. Finally, she realizes she&#8217;s been scooped: evolution has been working on the same project, and has a 100,000 year head start. In the context of intense, recent selection for intelligence, we should expect evolution to have already found (and eliminated) the most straightforward, easy-to-find genes for low intelligence. Therefore, everything left should be convoluted or hidden or impossible to work with. So although this requires a sort of god-of-the-gaps argument - where we keep pushing heritability into whatever genes are too weird for existing techniques to detect - there are some reasons to think God really is in the gaps here. And <a href=\"https://www.biorxiv.org/content/10.1101/106203v1\">a 2017 paper</a> uses some clever techniques to estimate the share of intelligence variation lurking in hard-to-measure genes and finds it&#8217;s more than half: &#8220;By capturing these additional genetic effects, our models closely approximate the heritability estimates from twin studies for intelligence and education.&#8221; (see also <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9119698/\">Wainschtein 2022</a>, <a href=\"https://www.nature.com/articles/s41588-024-01940-2\">Sidorenko 2024</a>)</p><p>The anti-hereditarians disagree. They cite papers like <a href=\"https://www.nature.com/articles/s41467-021-21446-3\">Zeng </a>which measure the strength of selection on intelligence and suggest that it&#8217;s too weak to concentrate so much of the variation in rare genes<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-8\" id=\"footnote-anchor-8\" target=\"_self\">8</a>. And Sasha Gusev mentions <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC10614218/\">Weiner 2023</a>, which finds that in fact rare variants &#8220;explain 1.3% (SE = 0.03%) of phenotypic variance on average &#8211; much less than common variants&#8221; (<a href=\"https://x.com/AlexTISYoung/status/1676686411553185793\">other experts say</a> that burden heritability only captures some rare variants and is not the right tool for this problem).</p><p>But it may not even matter, because another set of findings suggests that heritability is genuinely low <em>even when </em>the rare variants are counted.</p><h2>Is Heritability Genuinely Low? (Part 2: Sib-Regression and RDR)</h2><p>Two newer methods, Sib-Regression and RDR, ask: using what we know from genetic studies, how much genetic variation do we think exists, total, across both common and rare genes?</p><p>On average siblings share 50% of genes. But there&#8217;s a little randomness in <a href=\"https://en.wikipedia.org/wiki/Meiosis#Role_in_human_genetics_and_disease\">meiosis</a>, so some siblings might share 40% and others might share 60%. The more genetic influence on a trait, the more similar sibling pairs who share 60% of their genes will be, compared to sibling pairs who only share 40% of their genes. Since 60%-gene siblings and 40%-gene siblings are both equally part of the same family, you can use these numbers to calculate heritability unconfounded by a range of family factors. This is Sib-Regression. If you do a more complicated statistical process to extend the same idea to relatives other than siblings, it&#8217;s <em>relatedness disequilibrium regression</em> or RDR. </p><p>GWAS asks: Looking at common easy-to-study genes, how much variation in a trait have we explained right now? GREML asks: looking at common easy-to-study genes, how much variation <em>could we ever </em>explain? But sib-regression and RDR ask a question more like twin studies: considering all genes, whether common / rare / easy-to-study / hard-to-study, how much variation is there total? This could address the rare variant objection mentioned above. And in many ways, these techniques are better than twin studies - Sib-Regression eliminates many potential biases, and RDR eliminates even more (although it&#8217;s harder to pull off, requiring more genetic information and computational resources).</p><p>These techniques are new and hard-to-use, and only a few published studies have applied them to the sorts of behavioral traits we&#8217;re interested in: </p><p><a href=\"https://www.nature.com/articles/s41467-021-21283-4/tables/3\">Young et al (2018)</a> did Sib-Regression and RDR to genetic data from Iceland. Sib-regression found educational attainment = 40% (&#177;15%) heritable, and RDR found 17% (&#177;9%) heritable.</p><p><a href=\"https://www.nature.com/articles/s41467-021-21283-4\">Kemper et al (2021)</a> did Sib-Regression only to genetic data from Britain. It found educational attainment = 14% heritable. This number conflicts with the 40% from the Young paper. Why? Unclear, but it could be selection bias - Young&#8217;s Icelandic sample was representative of the country; Kemper&#8217;s British population were Biobank volunteers who tend tend to be healthier and higher-class than the population at large. Upper-class people may have restricted range in educational attainment, or different factors affecting their educational attainment compared to the overall population.</p><p>Either way, these are closer to the low estimates from GWAS and GREML (7% direct, 20% total), than to the higher estimates from twin studies (40%, generally presumed direct). And we can no longer use contributions from rare variants to paper over the difference. So what is going on?</p><p>It seems like we have to accept one of three possibilities:</p><p>Either something is wrong with twin studies.</p><p>Or something is wrong with Sib-Regression and RDR (and then we can explain away GWAS and GREML by saying they&#8217;re missing rare variants).</p><p>Or something is wrong with how we&#8217;re thinking about this topic and comparing things.</p><h2>What&#8217;s Going On? (Part 1: Is Something Wrong With Twin Studies?)</h2><p>Twin studies have dominated discussion of behavioral genetics for decades, so there&#8217;s a vast literature investigating their various assumptions and whether something might be wrong with them.</p><p>Here are some of the assumptions and what the research says about each. Some of these will be duplicates of the GWAS confounders above, but we&#8217;ll go through them again anyway to review how they apply to twins.</p><p><strong>1: Parents Treat Fraternal And Identical Twins The Same:</strong><em> </em>Twin studies claim that twins are a uniquely powerful genetic laboratory; both fraternal and identical twin pairs have equally concordant environments, but identical twins have more concordant genes. Therefore, the more similar identical twin pairs are relative to fraternal twin pairs, the more heritable a trait must be. But this conclusion falls apart if identical twin pairs actually have more similar environments than fraternal twin pairs do, maybe because parents (knowing their twins are identical) treat them more similarly than they would fraternal twins. </p><p>Would-be twin-study-discreditors have been trying to argue that this must be true for decades, but it&#8217;s always been a kind of quixotic battle. Remember, twin studies find many behavioral traits like IQ are &gt;60% heritable, so you would need to prove not only that parents treat identical twin pairs differently from fraternal, but that this was an overwhelming effect. Parents of identical twins would have to obsessively expose them to the exact same stimuli in the exact same order; parents of fraternal twins would have to send one to the Gifted Advanced Placement Acceleration program while locking the other in a box and force-feeding them lead pellets. Common sense tells us there are no such differences, and studies confirm this: when parents are wrong about their twins&#8217; status (eg they have fraternal twins, but falsely think they&#8217;re identical, or vice versa) <a href=\"https://pubmed.ncbi.nlm.nih.gov/263638/\">their trait similarity </a><a href=\"https://www.cambridge.org/core/journals/psychological-medicine/article/abs/parental-treatment-and-the-equal-environment-assumption-in-twin-studies-of-psychiatric-illness/628A9204CB11927C52129A24EE4FDDFF\">matches their real status</a>, rather than the incorrect status that determined how their parents treat them; parental treatment explains less than 1% of why identical twin pairs are more concordant (<a href=\"https://pubmed.ncbi.nlm.nih.gov/23903437/\">2</a>, <a href=\"https://humanvarieties.org/2024/10/20/sometimes-biased-but-not-systematically-twin-study-assumptions-with-a-focus-on-the-equal-environment/\">3</a>, <a href=\"https://pubmed.ncbi.nlm.nih.gov/8476388/\">4</a>). See also <a href=\"https://pismin.com/10.1016/j.ssresearch.2013.10.004\">Felson 2013</a>, which tries to measure environmental similarity and adjust for it, with minimal effects.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!r3kV!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd575f2d6-3619-40e6-9a5e-f9f1ec1399a5_650x422.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"309.0338461538461\" src=\"https://substackcdn.com/image/fetch/$s_!r3kV!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd575f2d6-3619-40e6-9a5e-f9f1ec1399a5_650x422.png\" width=\"476\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Are these two cuties monozygotic or dizygotic? Are you sure? (<a href=\"https://www.astralcodexten.com/p/in-the-long-run-were-all-dad\">answer</a>)</figcaption></figure></div><p><strong>2: Fraternal And Identical Twins Have Equally Concordant Uterine Environments:</strong><em> </em>Fraternal twins have different sacs in the uterus and use different placentas. Most identical twins share a placenta, and some share an amniotic sac. If trait similarity is caused by sharing a placenta or sac (maybe because the placenta is defective, the fetal brain is starved of nutrients, and so the person has a lower IQ when they grow up), twin studies would falsely read this identical-fraternal difference as genetic.</p><p>Luckily this is easy to study; not all identical twins share a placenta or sac, so you can cleanly separate the effect of uterine environment from genetics. If you measure enough traits, you can find small deviations in some, but it&#8217;s not clear whether this is just multiple testing, and in any case the deviations are small. <a href=\"https://pubmed.ncbi.nlm.nih.gov/26410687/\">The best studies</a> suggest this chips off somewhere between 0 - 3% from heritability estimates<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-9\" id=\"footnote-anchor-9\" target=\"_self\">9</a>.</p><p><strong>3: There is little assortative mating:</strong><em> </em>We discussed this one above in the earlier section on GWAS - smart/pretty/kind/whatever people tend to marry other smart/pretty/kind/whatever people. Why would this bias twin study results? Identical twins share 100% of their genes. Fraternal twins ought to share 50% of their genes - but they get half their genes from their mother, and half from their father. In the degenerate case where the mother and father have exactly the same genes (&#8220;would you have sex with your clone?&#8221;) even fraternal twins will be extremely similar (although not quite identical, since they&#8217;ll get different alleles from each clone). In the more plausible case where mothers and fathers are just a little more alike than chance (eg because smart people tend to marry other smart people), fraternal twins will share a genetic tendency towards a trait somewhat more than their 50% shared genes suggest. Since this makes fraternal twin pairs more (genetically) like identical twin pairs, and twin studies assess heritability as the difference in fraternal-identical-twin-pair concordance, this bias would make twin studies underestimate heritability. But this is the opposite of what you would need to &#8220;discredit&#8221; twin studies - if this bias is true, then everything is <em>more</em> genetic than twin studies think. And unlike the previous two biases, this one <a href=\"https://www.nature.com/articles/s41539-023-00173-y\">seems real and important</a>, so much so that when you adjust for it, the heritability of educational attainment rises from ~40% to ~50%.</p><p>I&#8217;m only mentioning this one here because some anti-hereditarians argue that you can&#8217;t trust twin studies because of assortative mating, without mentioning that this can only bias them <em>down</em>.</p><p><strong>4: Population stratification:</strong><em> </em>This is often large and worth worrying about, but it applies to identical and fraternal twin pairs equally, and doesn&#8217;t bias twin study heritability estimates much (though it might shift the balance between shared and non-shared environment). See eg the sentence around footnote 30 <a href=\"https://gwern.net/doc/genetics/heritable/2018-kong.pdf\">here</a>.</p><p><strong>5: Non-additive / &#8220;interaction&#8221; effects:</strong><em> </em></p><p>These are theoretically interesting, but all research thus far has found they are minimal (<a href=\"https://www.sciencedirect.com/science/article/pii/S0002929721000562\">1</a>, <a href=\"https://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1000008\">2</a>). Some experts think this may miss rarer or harder-to-find interactions; we&#8217;ll return to this later.</p><p><strong>6: &#8220;Genetic nurture&#8221;, parent-to-child</strong></p><p>Mentioned above: if there is a gene for reading books to kids, and reading books raises IQ, it will look like a &#8220;gene for IQ&#8221;. </p><p>This isn&#8217;t as relevant to twin study estimates of heritability, since both identical twins and fraternal twins are equally related to their parents, and any trait caused by genetic nurture wouldn&#8217;t differ between them (and therefore would not falsely appear heritable in this design). Rather, they would appear as shared environment. </p><p><strong>7: &#8220;Genetic nurture&#8221;, sibling-to-sibling</strong></p><p>That is, suppose your sibling&#8217;s traits influence your own development. For example, suppose your sibling has a gene that makes them sabotage your schoolwork, causing you to fail and drop out of school early. An identical twin would share this gene with their sibling more often than a fraternal twin, making it look like a &#8220;gene for doing badly at school&#8221; (since the people who have it do worse at school than those who don&#8217;t). </p><p>Why are we even talking about this? Do we really think it&#8217;s a big part of the variance in behavioral traits? Challenging twin study heritability estimates through this route requires inhabiting a weird no-man&#8217;s-land where otherwise-invisible genetic and environmental pathways suddenly flare up when you say the magic words &#8220;it was done by a sibling&#8221;. For example, this requires a strong effect of shared environment - that is, your educational attainment has to depend on whether you&#8217;re being sabotaged or not. But in general, shared environmental effects are weak. And it requires a strong effect of genes - that is, this mechanism only works if your sibling&#8217;s tendency to sabotage you is highly genetically determined. But we&#8217;re deploying this claim to deny that traits like IQ or educational attainment are highly genetically determined. So to get much out of this, the tendency to sabotage siblings would have to be more genetic than other behavioral traits!</p><p>The reason this convoluted possibility gets brought up so often is that, unlike the more plausible parent-to-child genetic nurture, twin studies can&#8217;t rule it out. So if you really want to deny twin studies, this is one of your best bets. But <a href=\"https://www.nature.com/articles/s41588-022-01085-0/figures/11\">when investigated</a>, this has effects indistinguishable from zero.</p><p>I&#8217;ve been a bit mean in this whole section, because people really like to dismiss twin studies as &#8220;Oh, don&#8217;t you know, those depend on <em>assumptions</em>, I bet you never considered that assumptions might be wrong&#8221;, and then Gish Gallop you with different assumptions until you give up. But scientists have actually done a lot of really good work checking the assumptions and they mostly hold. </p><p>An alternative way of validating twin studies (brought up by Noah Carl <a href=\"https://www.aporiamagazine.com/p/a-response-to-sasha-gusev-on-iq\">in this article</a>) is to check them against their close cousins, adoption studies and pedigree studies.</p><p>Pedigree studies investigate large family trees, and check how trait similarity decreases with genetic distance. They avoid twin specific biases (like different treatment of fraternal vs. identical twin pairs, or different prenatal environments), while adding others like assortative mating. Here are the heritabilities of IQ and EA found in pedigree studies<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-10\" id=\"footnote-anchor-10\" target=\"_self\">10</a> (see footnote for sources and caveats, and see also <a href=\"https://dspace.mit.edu/handle/1721.1/57897\">here </a>and <a href=\"https://x.com/DamienMorris/status/1697930270308012336\">here</a> for somewhat similar designs):</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!b3LF!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc094f9c0-4c71-48cf-89dc-615498d94812_483x51.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"51\" src=\"https://substackcdn.com/image/fetch/$s_!b3LF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc094f9c0-4c71-48cf-89dc-615498d94812_483x51.png\" title=\"\" width=\"483\" /><div></div></div></a></figure></div><p>Adoption studies investigate whether adoptees&#8217; traits are more correlated with their adoptive or biological parents. They avoid a large swathe of biases, at the risk of introducing new adoption-related biases of their own (like the possibility that agencies deliberately place adoptive children with parents who are culturally or behaviorally similar, or the possibility that adoptees were adopted late enough to still get some shared environment from their biological parents). Here are the findings of some of the largest and best<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-11\" id=\"footnote-anchor-11\" target=\"_self\">11</a>: </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!XFWU!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F85f433e5-d141-47b7-8dc5-2271925032e9_483x102.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"102\" src=\"https://substackcdn.com/image/fetch/$s_!XFWU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F85f433e5-d141-47b7-8dc5-2271925032e9_483x102.png\" title=\"\" width=\"483\" /><div></div></div></a></figure></div><p>Both straightforwardly confirmed the larger heritability numbers found in twin studies.</p><p>I would add the evidence from some less formal &#8220;adoption studies&#8221;<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-12\" id=\"footnote-anchor-12\" target=\"_self\">12</a>. During residency, I spent a few months working in a child psychiatric hospital for the worst of the worst - kids who committed murder or rape or something before age 18. Many of these children had similar stories: they were taken from their parents just after birth because the parents were criminals/drug addicts/in jail/abusing them. Then they were adopted out to some extremely nice Christian family whose church told them that God wanted them to help poor little children in need. Then they promptly proceeded to commit crime / get addicted to drugs / go to jail / abuse people, all while those families&#8217; biological children were goody-goodies who never got so much as a school detention. When I met with the families, they would always be surprised that things had gone so badly, insisting that they&#8217;d raised them exactly like their own son/daughter and taught them good Christian morals. I had to resist the urge to shove a pile of twin studies in their face. This has left me convinced that behavioral traits are highly heritable to a level that it would be hard for any study to contradict.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://x.com/cremieuxrecueil/status/1935731422205010135\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"643.0344827586207\" src=\"https://substackcdn.com/image/fetch/$s_!zOAz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0ccbe034-9c28-47e9-84fd-0703035684d9_522x777.png\" width=\"432\" /><div></div></div></a><figcaption class=\"image-caption\">Ultimate source <a href=\"https://sci-hub.st/https://www.science.org/doi/10.1126/science.6719119\">here</a>. Although the study is confusing about this, I think it&#8217;s trying to say that almost 90% of subjects were adopted before age 2.</figcaption></figure></div><p>But I don&#8217;t think studies <em>do</em> contradict this. Given the degree to which their assumptions have been validated, and the level of confirmation from pedigree and adoption studies, I think they have earned a presumption of accuracy. Doubting the twin studies doesn&#8217;t seem like a promising route to reconciling the twin-vs-Sib-Regression/RDR discrepancy.</p><h2>What&#8217;s Going On? (Part 2: Is Something Wrong With Sib-Regression And RDR?)</h2><p>Sib-Regression is a clever way of avoiding most biases. Its independent variable - the degree to which some sibling pairs end up with slightly more shared genes than others - is even more random and exogenous than the difference between fraternal and identical twins. It can sometimes have biases related to assortative mating (which would falsely push heritability down), but otherwise it&#8217;s pretty good. RDR has many of the same advantages, and allows more diverse relationships and so larger sample sizes. It&#8217;s hard to think of ways these methods could be wildly off.</p><p>There is one caveat: although RDR includes most of the rare and structural variants missed by GWAS, in theory it can miss certain <em>ultra-rare variants </em>which are so uncommon that they aren&#8217;t shared between some of the relative pairs used in RDR. <em>De novo</em> variants that occurred during the subject&#8217;s own conception would be in this category, if the subject didn&#8217;t have children or didn&#8217;t pass on that gene<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-13\" id=\"footnote-anchor-13\" target=\"_self\">13</a>.  This seems like a pretty small subcategory of genetic variation, and I wouldn&#8217;t normally expect that much of importance to be hiding here, but maybe it&#8217;s more important than it seems.</p><p>RDR also doesn&#8217;t include much variance caused by statistical interactions between genes. Although we said above that these are usually found to be insignificant, they might be more important in a trait like intelligence that has been under recent evolutionary selection that lops off easily-detectable sources of variance and leaves only the weird obscure ones behind. There&#8217;s limited ability for classical Mendelian dominance to affect common variants, but more complicated genetic interactions might still prove important. </p><p>Overall these are strong methods, and their failure to converge is troubling. If forced to explain them away, we might tell a story like:</p><ul><li><p>So far, there is only one RDR study and a few Sib-Regression studies, so we should wait for more data before updating too hard.</p></li><li><p>Maybe ultra-rare variants are more important than we thought.</p></li><li><p>Maybe gene x gene interactions, especially epistasis, are more important than we thought.</p></li></ul><p>There&#8217;s some (weak) evidence for the latter two claims: Sib-Regression, unlike RDR, includes results from certain types of ultra-rare variants and non-additive effects. In the Iceland study, Sib-Regression found EA heritability of 40% (similar to twin studies), and RDR found 17% (much less than twin studies). Maybe these make Sib-Regression better at estimating the sort of broad heritability investigated in twin studies?</p><h2>What&#8217;s Going On? (Part 3: Is Educational Attainment Just Weird?)</h2><p>Above, we said that there were only two published peer-reviewed studies using Sib-Regression and RDR to estimate heritability of behavioral traits.</p><p>But <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5225447\">Markel et al (2025), </a>a not-yet-peer-reviewed pre-print from GMU (why is it always GMU?) complicates things further. It looks at genetic data from six different countries/studies to estimate heritability of IQ and EA.</p><p>Using Sib-Regression, they find educational attainment heritability of only <strong>8% </strong>(&#177;9%)<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-14\" id=\"footnote-anchor-14\" target=\"_self\">14</a>, <em>and</em> cognitive performance (~IQ) heritability of <strong>75% </strong>(&#177;20%)!</p><p>The 8% number has a confidence interval of &#177;9%, so the maximum number within their margin of error is 17%. Meanwhile, Young&#8217;s Icelandic estimate was 40% &#177; 15%, so their minimum is 25%. It seems like these two Sib-Regression-based estimates of EA heritability don&#8217;t overlap. Is that bad? Not necessarily - as with Kemper, these studies might have different levels of selection bias. Or the countries where they take place might have different levels of educational mobility. </p><p>But also, this is the first Sib-Regression study to investigate IQ - all the others had only done EA. They replicate (and even go beyond) the twin studies&#8217; high IQ number, while continuing to get low heritability for EA. This suggests our previous assumption - that EA was usually a decent proxy for IQ - might be totally off.</p><p>This doesn&#8217;t directly solve any of our problems - the twin study estimates for EA and the Sib-Regression estimates are still worryingly different. But it slightly bounds the damage. It suggests that the twin study estimates for IQ are ~correct, potentially meaning that whatever&#8217;s going on is some kind of EA-specific confounder. </p><p>We know that EA is a pretty unusual trait, with high assortative mating, high shared environmental component, and high potential for genetic nurture / dynastic effects. We saw above that there are theoretical reasons not to expect these to bias twin studies upward or Sib-Regression downward. But maybe it did that anyway, despite the theoretical reasons. </p><p>Stepping back, maybe educational attainment is full of landmines. Plenty of political and economic factors affect the degree to which your genes vs. your culture determine how far you go in school. Suppose a country passes a feel-good policy that high schools have to try to graduate all students, even ones who fail algebra. That changes the heritability of EA! Or suppose that scholarships become easier/harder to get, making rich people less/more likely to go to college relative to poor people. That changes the heritability of EA! Or suppose that the economy changes and jobs requiring PhDs are less/more lucrative than before - now ambitious people are less/more likely to pursue PhDs relative to people doing it for the love of academia, and that changes the heritability of EA! Finally, suppose some study enrolls mostly rich/well-educated people, and some other study enrolls proportionally across the population. That artificially restricts range and . . . changes the heritability of EA!</p><p>So two potential takeaways from this preprint are:</p><ol><li><p>EA is a weird trait with a high shared environmental component, and might not be a good flagship trait to use for discussing heritability more generally.</p></li><li><p>Heritability of EA might genuinely vary a lot among different countries, populations, and <a href=\"https://www.nature.com/articles/s41598-020-69526-6\">eras</a>, so maybe we should be less concerned when studies give weird results.</p></li></ol><h2>What&#8217;s Going On? (Part 4: Is Everything Weird?)</h2><p>On the other hand, here are some boring medical/biological traits. Graph is from <a href=\"https://www.researchgate.net/publication/333986666_Solving_the_missing_heritability_problem\">here</a>, but the ultimate data source is the same Iceland paper:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!lIwR!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc1f2d9a3-2fb1-4fc5-b681-f2c34b7a2075_4440x2192.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"306.6614010989011\" src=\"https://substackcdn.com/image/fetch/$s_!lIwR!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc1f2d9a3-2fb1-4fc5-b681-f2c34b7a2075_4440x2192.png\" title=\"\" width=\"621\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Many of the boring medical traits have as much &#8220;missing heritability&#8221; as educational attainment. For example, creatinine is a measure of kidney function; although twin studies find it&#8217;s about 55% heritable, Sib-Regression and RDR find less than half that.</p><p>But here there are limited opportunities for confounders. Nobody assortative-mates on kidney function. It&#8217;s hard to see how family members could push other family members to have better or worse kidney function. Identical twins don&#8217;t have more similar kidney function environments than fraternal twins.</p><p>Could there be some remaining possibility for confounding? Maybe there&#8217;s a gene for teaching your kid to have a good diet, and good diet causes better kidney function? Or maybe the measurements for creatinine were really bad during the Sib-Regression study (but apparently better during the twin studies?)</p><p>I don&#8217;t really know what&#8217;s going on here.</p><h2>What&#8217;s Going On (Part 5: No, Seriously, What&#8217;s Going On?)</h2><p>So how heritable are complex traits, and why can&#8217;t different methods agree on this?</p><p>I think the twin / pedigree / adoption estimates are mostly right. They are strong designs, their assumptions are well-validated, and they all converge on similar results. They also pass sanity checks and common sense observation.</p><p>Although polygenic scores, GWAS, GREML, RDR, and Sib-Regression are also strong designs, they&#8217;re newer, have less agreement among themselves, and have more correlated error modes in their potential to miss rarer variants and interactions. Although it&#8217;s hard to figure out a story of exactly what&#8217;s going on with these rarer variants and interactions, there seems to be some evidence that they exist (again, see <a href=\"https://www.nature.com/articles/s41588-024-01940-2\">1</a>, <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9119698/\">2</a>,  <a href=\"https://www.biorxiv.org/content/10.1101/106203v1\">3</a>)<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-15\" id=\"footnote-anchor-15\" target=\"_self\">15</a>, and it seems easier to doubt this new and fuzzy area than the strong and simple conclusions from twin / pedigree / adoption work. </p><p>In this model, polygenic scores, GWAS, and GREML could straightforwardly fail to pick up rare variants and interactions. The conclusions of RDR and Sib-Regression are harder to explain, but most of these anomalies are in educational attainment in particular - which is such a cursed construct, and so variable from sample to sample, that perhaps we can put it aside and focus on more stable traits. Otherwise, we can take solace in these methods&#8217; failure to stay consistent even among themselves, which makes their inconsistency with twin studies somewhat less jarring.</p><p>What mysteries remain? The parts that still bother me are:</p><ul><li><p>Why did the Iceland study find significantly lower numbers for Sib-Regression/RDR than twin studies for almost every trait? (hilariously, <em>not</em> for educational attainment with Sib-Regression this time, although I suspect this is just the big margin of error and the real number is commensurate with the other traits studied)</p></li><li><p>Why are twin studies so consistent in finding highish heritability for educational attainment, but other methodologies (eg Sib-Regression) so variable (even after their margin of error is taken into account)? Either EA is too complicated and variable to measure properly, or it isn&#8217;t - right?</p></li><li><p>If nonadditive interactions are so important, why have existing studies had such a hard time detecting them?</p></li><li><p>Can we flesh out the evolutionary argument and come to agreement on how many rare and ultra-rare variants we should expect given the level of selection pressure experienced during human evolution?</p></li><li><p>Can we bound the degree to which ultra-rare variants can drive a wedge between twin and RDR estimates? If the observed difference isn&#8217;t within the bound, what then?</p></li><li><p>Are we going to find and cash out &#8220;rare variants and interactions&#8221; soon? If we don&#8217;t, how long should we wait for genetic science to advance before changing our mind and deciding we must be missing something more fundamental?</p></li></ul><p>Alex Young thinks that once we get enough whole genomes sequenced (probably soon!) <a href=\"https://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1008222\">we might be able to use a technique called GREML-WGS</a> to get more definitive answers about rare variants. But other experts I talked to said that if complex interactions were a big part of the picture, this might be &#8220;computationally intractable&#8221;. On the other hand, &#8220;computationally intractable&#8221; is a relative term: with enough data, <a href=\"https://openreview.net/pdf?id=VyM7Voux5b\">genomic language models</a> offer the potential for improved understanding of nonlinear effects.</p><p>I&#8217;m encouraged to see increasingly good discussion of these topics on Substack, Twitter, and elsewhere. People like Sasha Gusev and Eric Turkheimer deserve credit for opening the discussion, but I would like to see a robust back-and-forth with the other side. </p><p>Thanks to everyone who helped me review this post, including Ruben Arslan, Alex Young, Damien Morris, and some other people who didn&#8217;t respond to my email asking if I had their permission to list their names publicly (if this is you, let me know and I&#8217;ll edit you in).  Most of what&#8217;s valuable is theirs, and all errors are <s>mine alone</s> the fault of o3, which provided invaluable research assistance but also hallucinated constantly.</p><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-1\" id=\"footnote-1\" target=\"_self\">1</a><div class=\"footnote-content\"><p>I&#8217;m abbreviating &#8220;two percentage points&#8221; as 2%pp. Nitpickers complain if I don&#8217;t use the &#8220;percentage points&#8221; framing, but it&#8217;s too long to spell out each time.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-2\" id=\"footnote-2\" target=\"_self\">2</a><div class=\"footnote-content\"><p>Geneticists distinguish between three related concepts:</p><ul><li><p><strong>Polygenic score r^2 </strong>is the degree to which our current best genetic models can predict traits. You might use this to discuss the accuracy of a genetic test or an embryo selection procedure.</p></li><li><p><strong>Narrow sense heritability</strong> is the degree to which all <em>normal, additive</em> genetic variation affects traits. You might use this to discuss the effectiveness of breeding programs, or how much you expect a parent&#8217;s traits to affect their children.</p></li><li><p><strong>Broad sense heritability</strong> is the degree to which all genetic variation, <em>including interactions and rare mutations</em>, affect traits. A correctly-done twin study should (modulo certain small issues) return the broad sense heritability. This is useful in resolving deep questions like &#8220;How much do genetic vs. social causes affect traits&#8221;, and acts as the limit for what we might be able to explain through some future genetic science.</p></li></ul><p>If there were no missing heritability, we should mostly<em> </em>expect polygenic score r^2 to converge to narrow sense heritability, modulo a bunch of small biases and technical issues. I&#8217;ll be sweeping these under the rug and talking about narrow sense heritability as the limit of polygenic score r^2 in order to highlight the question of why polygenic score r^2 seems to be asymptoting at a level below the narrow-sense heritability.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-3\" id=\"footnote-3\" target=\"_self\">3</a><div class=\"footnote-content\"><p>Why is this example about a gene for lactose tolerance, rather than simply a gene for black skin? Because in this society, the gene for black skin would in some sense &#8220;cause&#8221; the poverty - it would just be a less direct form of causation, through &#8220;gene-environment interaction&#8221;. Causal language in genetics gets tough quickly - what is a &#8220;confounder&#8221; for one purpose may well be a &#8220;cause&#8221; for another. </p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-4\" id=\"footnote-4\" target=\"_self\">4</a><div class=\"footnote-content\"><p>\"Inflated&#8221; if you were hoping to find the direct heritability. If you just want predictive power, this might be fine.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-5\" id=\"footnote-5\" target=\"_self\">5</a><div class=\"footnote-content\"><p>I&#8217;m using the awkward term &#8220;nondirect&#8221; instead of the more common &#8220;indirect&#8221; at the advice of an expert who advised that &#8220;indirect genetic effect&#8221; already has a specific meaning (similar to &#8220;genetic nurture&#8221; described elsewhere in this piece) and should not be used for things that merely fail to be direct.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-6\" id=\"footnote-6\" target=\"_self\">6</a><div class=\"footnote-content\"><p><em>Sic</em>; the correct number is 18.8%</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-7\" id=\"footnote-7\" target=\"_self\">7</a><div class=\"footnote-content\"><p>Not zero, because some rare variants are linked to SNPs; that is, everyone with a certain rare variant also has a certain set of SNPs, and so in practice measuring the SNPs will include the effect of the rare variant.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-8\" id=\"footnote-8\" target=\"_self\">8</a><div class=\"footnote-content\"><p>I don&#8217;t know how you square that with <a href=\"https://www.biorxiv.org/content/10.1101/2024.09.14.613021v1\">Reich&#8217;s study</a> indeed finding large recent selection for intelligence in ancient European DNA</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-9\" id=\"footnote-9\" target=\"_self\">9</a><div class=\"footnote-content\"><p>See <a href=\"https://x.com/cremieuxrecueil/status/1647069459578798081\">this Cremieux tweet thread</a> for some apparently paradoxical - though ultimately inconsequential - effects of uterine-environment-sharing</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-10\" id=\"footnote-10\" target=\"_self\">10</a><div class=\"footnote-content\"><p>Sources:</p><ul><li><p><strong>Generation Scotland:</strong> <a href=\"https://www.sciencedirect.com/science/article/pii/S0160289614000178?via%3Dihub\">https://www.sciencedirect.com/science/article/pii/S0160289614000178?via%3Dihub</a> . See also <a href=\"https://www.nature.com/articles/s41380-017-0005-1.pdf\">https://www.nature.com/articles/s41380-017-0005-1.pdf</a>, page 2353, \"The genetic results . . . are similar to the heritability estimates derived using the traditional pedigree study design in the same data set, which found a heritability estimate of 54% for g and 41% for education.\"</p></li><li><p><strong>Swedish National Sample:</strong> <a href=\"https://www.nature.com/articles/s41380-022-01500-2/tables/2\">https://www.nature.com/articles/s41380-022-01500-2/tables/2</a>, Table 2B, first column, second and third rows.</p></li></ul></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-11\" id=\"footnote-11\" target=\"_self\">11</a><div class=\"footnote-content\"><p>I made this table with the help of the o3 AI. It gave me a longer list of seven studies, but admitted that many of them didn&#8217;t list heritabilities and it was calculating them itself based on other statistics that were reported. In some cases, I was able to replicate its calculations; in others, it seemed to be hallucinating the relevant numbers, or had calculations complicated enough that I couldn&#8217;t prove that it wasn&#8217;t. I excluded two studies that o3 said had good data, but where it couldn&#8217;t explain its sources well enough to satisfy me. These were <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC4403216/\">Kendler et al 2015</a> (o3 claimed heritability of 0.5 - 0.6) and <a href=\"https://psycnet.apa.org/record/1990-04103-001\">Capron &amp; Duyme 1989</a> (o3 claimed heritability of 0.4).</p><p>Here are sources for the remaining:</p><ul><li><p><strong>Texas adoption:</strong> <a href=\"https://gwern.net/doc/genetics/heritable/adoption/2021-loehlin.pdf\">https://gwern.net/doc/genetics/heritable/adoption/2021-loehlin.pdf</a> , Table 6 . Heritability = 2*correlations. The first row of the table lists three parent-child IQ correlations (IQBM): 0.3, 0.34, and 0.35. I took the median, 0.34, and doubled it to 0.68.</p></li><li><p><strong>Colorado adoption:</strong> Same paper as above, same methodology as above, Table 7.</p></li><li><p><strong>Minnesota transracial:</strong> <a href=\"https://sci-hub.st/https://www.sciencedirect.com/science/article/abs/pii/016028969390018Z\">https://sci-hub.st/https://www.sciencedirect.com/science/article/abs/pii/016028969390018Z</a>, page 547, \"adoptive fathers' and mothers' correlations with their biological offspring at Time 1 were .25 and .40; with their trans-racially adopted children, .08 and .14 (h 2 = .34 &#177; .29 and .52 --- .26, respectively). At Time 2, the corresponding correlations were .13 and .45 for biological children; .21 and .21 for adoptees (h 2 = - . 16 &#177; .29 and .48 &#177; .25, respectively). o3 advised me to take the maternal correlation since there were too few fathers to give meaningful results (as indicated by the negative heritability at time 2). Because this required a design choice (throwing out the paternal data) I&#8217;ve listed it in gray as less trustworthy than some of the other estimates. Reversing this design choice would lower the estimate.</p></li><li><p><strong>Sibling Interaction And Behavior: </strong><a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC8513766/\">https://pmc.ncbi.nlm.nih.gov/articles/PMC8513766/</a>, see second-to-last sentence of the abstract.</p></li><li><p><strong>Swedish Adoption Twin Study Of Aging:</strong> h<a href=\"http://ttps://sci-hub.st/https://doi.org/10.1111/j.1467-9280.1992.tb00045.x\">ttps://sci-hub.st/https://doi.org/10.1111/j.1467-9280.1992.tb00045.x</a> , see Table 3, first principal component says 80%. <a href=\"https://sci-hub.st/10.1126/science.276.5318.1560\">https://sci-hub.st/10.1126/science.276.5318.1560</a>, abstract says 62%. These are different subsets of the same Swedish study; I averaged them together and said 71%. This is extremely unprincipled - they had different sample sizes and were measuring different things - but I also didn't want to list the same study twice.</p></li></ul><p>Observed adult heritabilities of IQ range from 0.42 to 0.71, with an average of 0.57. This is a wide range, but some of the variability is explicable. The SIBS study, which found the lowest estimate, used an unusually unreliable IQ test; if you correct for this, heritability increases to about 0.6 to 0.7. SATSA, which found the highest estimate, was looking at older people (age 65 - 80), and heritability of IQ increases with age. I think the adoption literature looks compatible with heritability of IQ going from the 40s in adolescence to the 60s in adulthood to potentially as high as 70-80% by age 65 (the 65 year olds in SATSA found 80%; heritability declined after 65, maybe because of non-heritable dementias).</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-12\" id=\"footnote-12\" target=\"_self\">12</a><div class=\"footnote-content\"><p>And here&#8217;s a less formal &#8220;twin study&#8221; - on average, twins have the same IQ and educational attainment as singletons. As a parent of twins myself, I&#8217;m increasingly aware how much worse parenting I do than my singleton-parent friends; it&#8217;s not just that you have half as much time per child, but that you can almost never give either of them quality time alone - the other one gets jealous and immediately interrupts. But this lower-quality parenting seems to have no measurable real-world effect!</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-13\" id=\"footnote-13\" target=\"_self\">13</a><div class=\"footnote-content\"><p>These might or might not be a problem with sibling-based estimates, depending on how the mutation happened - some mutations can happen in pre-sperm stem cells and affect many different sperm, so multiple siblings could theoretically be affected.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-14\" id=\"footnote-14\" target=\"_self\">14</a><div class=\"footnote-content\"><p>When the authors correct for assortative mating, heritability of EA goes up to 9-15%, depending on how much assortative mating they assume.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-15\" id=\"footnote-15\" target=\"_self\">15</a><div class=\"footnote-content\"><p>I tried to create a very weak and made-up model of what I thought was going on to see whether I could get the various study types to make sense. Here is the best I could do - please don&#8217;t take this seriously:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!ED7v!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8423f852-551d-4d7e-9362-fc841354aba2_669x166.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"166\" src=\"https://substackcdn.com/image/fetch/$s_!ED7v!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8423f852-551d-4d7e-9362-fc841354aba2_669x166.png\" width=\"669\" /><div></div></div></a></figure></div><p>These errors are mostly within the various studies&#8217; confidence intervals. I&#8217;m very unsure that I&#8217;m parsing the difference between common, rare, and ultra-rare right</p></div></div>"
            ],
            "link": "https://www.astralcodexten.com/p/missing-heritability-much-more-than",
            "publishedAt": "2025-06-26",
            "source": "SlateStarCodex",
            "summary": "<h3>The Story So Far</h3><p>The mid-20th century was the golden age of nurture. Psychoanalysis, behaviorism, and the spirit of the &#8216;60s convinced most experts that parents, peers, and propaganda were the most important causes of adult personality.</p><p>Starting in the 1970s, the pendulum swung the other way. Twin studies shocked the world by demonstrating that most behavioral traits - including socially relevant traits like IQ - were substantially genetic. Typical estimates for adult IQ found it was about 60% genetic, 40% unpredictable, and barely related at all to parenting or family environment.</p><p>By the early 2000s, genetic science reached a point where scientists could start pinpointing the particular genes behind any given trait. Early <em>candidate gene</em> <em>studies</em>, which hoped to find single genes with substantial contributions to IQ, depression, or crime, mostly failed. They were replaced with <em>genome wide association studies,</em> which accepted that most interesting traits were <em>polygenic </em>- controlled by hundreds or thousands of genes - and trawled the whole genome searching for variants that might explain 0.1% or even 0.01% of the pie. The goal shifted toward <em>polygenic scores</em> - algorithms that accepted thousands of genes as input and spit out predictions of IQ, heart disease risk, or some other",
            "title": "Missing Heritability: Much More Than You Wanted To Know"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-26"
}