{
    "articles": [
        {
            "content": [
                "<header>\n  <h1>Memory Safety Is …</h1>\n  <time class=\"meta\" datetime=\"2025-12-30\">Dec 30, 2025</time>\n</header>\n<p>Memory safety is one of those elusive concepts like intelligence, consciousness, or\n<a href=\"https://en.wikipedia.org/wiki/I_know_it_when_I_see_it\">porn</a>, that resist attempts to be put to\nwords. Thus, I am not going to attempt to define it. Instead, I want to poke holes in definitions of\nothers.</p>\n<p>Note that the present post is 90% sophistry in the style of Xeno — I don’t think you need a\nwater-tight definition to have a reasonable discussion, and no definition can save an unreasonable\none. But thinking <em>about</em> definitions focuses the mind.</p>\n<p>The crux of my argument:</p>\n\n<figure class=\"blockquote\">\n<blockquote><p>Memory safety is a property of an <em>implementation</em>.</p>\n</blockquote>\n\n</figure>\n<p>That’s the problem with many definitions — they are about a wrong kind of thing, and are confused\nfor that reason. For example, a definition used in\n<a href=\"https://queue.acm.org/detail.cfm?id=3773095\"><em>Memory Safety for Skeptics</em></a>:</p>\n\n<figure class=\"blockquote\">\n<blockquote><p>A program execution is memory safe so long as a particular list of bad things, called\nmemory-access errors, never occur:</p>\n<ul>\n<li>\nBuffer overflow\n</li>\n<li>\nNull pointer dereference\n</li>\n<li>\nUse after free\n</li>\n<li>\nUse of uninitialized memory\n</li>\n<li>\nIllegal free (of an already freed pointer, or a non-malloc-ed pointer)\n</li>\n</ul>\n</blockquote>\n\n</figure>\n<p>This is obvious nonsense! Java programs dereference null pointers all the time! And on typical\narchitectures dereferencing a null pointer in user-space is well-defined to trap. Many JVMs\nimplement Java-level NPE checks by relying on OS-level segfaults!</p>\n<p>Another popular definition comes from\n<a href=\"https://courses.grainger.illinois.edu/cs421/fa2018/CS421A/resources/cardelli.pdf\"><em>Type Systems</em></a>\npaper by Luca Cardelli.</p>\n\n<figure class=\"blockquote\">\n<blockquote><p>A program fragment is safe if it does not cause untrapped errors to occur.\nLanguages where all program fragments are safe are called safe languages.</p>\n</blockquote>\n\n</figure>\n<p>This definition is not wrong, but it is vacuous. It is internally consistent, but doesn’t define\nanything useful.</p>\n<p>To see that we need to sketch our domain of discourse.</p>\n<p>We start with a source language, L, such as Java or C. L is defined by its syntax and semantics.\nSyntax defines the set of programs, and semantics ascribes meaning to them. Semantics is necessarily\ndefined in terms of <em>abstract</em> machine LM — a mathematical device that captures all the real and\n“virtual” state to explain execution behavior of a program. For example, in languages with pointer\nprovenance, provenance is a concrete “field” of every pointer in the abstract machine.</p>\n<p>In addition to LM (abstract machine), we also have a concrete machine CM on hand, such as x86_64\nrunning Linux userspace, or Wasm in the browser. Concrete machine comes with its own language C and\nits own semantics.</p>\n<p>Finally, we have an implementation I that we use to run L programs on our concrete machine CM.\nRoughly, if P is an L program, then implementation transforms it to a C program with a matching\nsemantics:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">∀ P ∈ L:</span>\n<span class=\"line\">    I(P) ∈ C</span>\n<span class=\"line\">  ∧ LSema(P) ≈ CSema(I(P))</span></code></pre>\n\n</figure>\n<p>Concretely, if we have a Java program, we can reason about what this program does without thinking\nwhere it will run. It’s a job of the JVM to faithfully preserve our mental model when the\nprogram is executed on an aarch64 laptop. See\n<a href=\"https://xavierleroy.org/publi/compcert-backend.pdf\">Compcert</a> paper for details.</p>\n<p>The key detail here is that on the level of abstract semantics, you simply can not have undefined\nbehavior. For the specification to be consistent, you need to explain what abstract machine does in\nevery case exhaustively, even if it is just “AM gets stuck”. If UB is set complement to defined\nbehaviors, then it is defined just as precisely!\nAgain, Compcert paper <em>defines</em> what UB is on\n<a href=\"https://xavierleroy.org/publi/compcert-backend.pdf#page=15\">page 15</a>.</p>\n<p>And this is the problem I have with Cardelli’s definition. It hinges on how we <em>name</em> a particular\nset in our abstract semantics. If the set is called “trapped error” the language is safe, but if it\nis “undefined behavior”, it is unsafe.</p>\n<p>This is useless! Here, I’ve just made a language called Lil-C, which exactly like C, except that\nevery UB is formally defined to trap. It is safe! And it can run any C program! Have I just done\nanything useful? No!</p>\n<p>To recap, we have source language L, target language/machine C, and an implementation I that maps\nthe former to the latter. Any memory safety definition should talk about I. If it talks about L or\nC, it can’t be right.</p>\n<p>Cardelli’s definition ends up being vacuous, because it tries to talk about L in isolation.</p>\n<p>“Skeptics” definition is doubly confused. It’s unclear if it has L or C in mind (null pointer\ndereference in the source code, or in the generated machine code), but it would be wrong in either\ncount, as it definitely doesn’t touch I.</p>\n<p>As a positive example, consider <a href=\"https://fil-c.org\">Fil-C</a> (see also <a href=\"https://graydon2.dreamwidth.org/320265.html\"><em>A note on\nFil-C</em></a>). This is an <em>implementation</em> of C that\nmaintains C semantics, is safe, and is arguably sufficiently efficient to be practical. Unlike my\nLil-C, Fil-C is a useful thing (and requires <em>much</em> more effort to pull off).</p>\n<p>I know I promised not to define memory safety here, but, having skimmed that Compcert paper (hat tip\nto <a href=\"https://lobste.rs/s/va2mvi/without_futex_it_s_futile#c_uu3y6v\">@pervognsen</a>), I think I’ll go\nout on a limb and just do it? Compcert paper defines backward simulation as a property that every\nbehavior of a compiled program is a behavior of the source program (semantics of a program is a\n<em>set</em> of behaviors, due to non-determinism). Using this article’s notation:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">P ∈ L        -- source program</span>\n<span class=\"line\">I: L -&gt; C    -- implementation (e.g L to C compiler)</span>\n<span class=\"line\">I(P) ∈ C     -- compiled program</span>\n<span class=\"line\">LSema(P)     -- possible behaviors of P</span>\n<span class=\"line\">CSema(I(P))  -- behaviors of P under implementation I</span>\n<span class=\"line\"></span>\n<span class=\"line\">-- Backward simulation:</span>\n<span class=\"line\">∀B: B ∈ CSema(I(P)) =&gt; B ∈ LSema(P)</span></code></pre>\n\n</figure>\n<p>Memory safety is a weakening of backwards simulation:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">-- Memory safety of implementation I:</span>\n<span class=\"line\">MemorySafe(I) :=</span>\n<span class=\"line\">    ∀ P: ∀B: B ∈ CSema(I(P)) =&gt; (B ∈ LSema(P) ⋁ B = crash)</span></code></pre>\n\n</figure>\n<p>An implementation I of L is memory safe, if it cannot give rise to new, surprising behaviors, for\narbitrary programs P (including buggy ones), except that crashing is allowed. As a smoke test, an\nimplementation that produces programs that always immediately crash is safe according to this\ndefinition, as it should be.</p>\n<p>Thinking about definitions focuses the mind indeed!</p>"
            ],
            "link": "https://matklad.github.io/2025/12/30/memory-safety-is.html",
            "publishedAt": "2025-12-30",
            "source": "Alex Kladov",
            "summary": "Memory safety is one of those elusive concepts like intelligence, consciousness, or porn, that resist attempts to be put to words. Thus, I am not going to attempt to define it. Instead, I want to poke holes in definitions of others.",
            "title": "Memory Safety Is ..."
        },
        {
            "content": [
                "<p>I browse the discovery feed on Bear daily, both as part of my role as a moderator, and because it's a space I love, populated by a diverse group of interesting people.</p>\n<p>I've read the posts regarding AI-related content on the discovery feed, and I get it. It's such a prevalent topic right now that it feels inescapable, available everywhere from Christmas dinner to overheard conversation on the subway. It's also becoming quite a polarising one, since it has broad impacts on society and the natural environment.</p>\n<p>This conversation also raises the question about popular bloggers and how pre-existing audiences should affect discoverability. As with all creative media, once you have a big-enough audience it becomes self-perpetuating that you get more visibility. Think Spotify's 1%. Conveniently, Bear is small enough that bloggers with no audience can still be discovered easily and it's something I'd like to preserve on the platform.</p>\n<p>In this post I'll try and explain my thinking on these matters, and clear up a few misconceptions.</p>\n<p>First off, posts that get many upvotes through a large pre-existing audience, or from doing well on Hacker News do not spend disproportionately more time on the discovery feed. Due to how the algorithm works, after a certain number of upvotes, more upvotes have little to no effect. Even a post with 10,000 upvotes won't spend more than a week on page #1. I want Trending to be equally accessible to all bloggers on Bear.</p>\n<p>While this cap solves the problem of sticky posts, there is a second, less pressing issue: If a blogger has a pre-existing audience, say in the form of a newsletter or Twitter account, some of their existing audience will likely upvote, and that post has a good chance of feature on the Trending page.</p>\n<p>One of the potential solutions I've considered is either making upvotes available to logged in users only, or Bear account holders receive extra weighting in their upvotes. However, due to how domains work each blog is a new website according to the browser, and so logins don't persist between blogs. This would require logging in to upvote on each site, which isn't feasible.</p>\n<p>While I moderate Bear for spam, AI-generated content, and people breaking the Code of Conduct, I don't moderate by topic. That removes the egalitarian nature of the platform and puts up topic rails like an interest-group forum or subreddit. While I'm not particularly interested in AI as a topic, I don't feel like it's my place to remove it, in the same way that I don't feel particularly strongly about manga.</p>\n<p>There is a hide blog feature on the discovery page. If you don't want certain blogs showing up in your feed, add them to the <em>hidden</em> textarea to never see them again. Similarly to how Bear gives bloggers the ability to create their own tools within the dashboard, I would like to lean into this kind of extensibility for the discovery feed, with hiding blogs being the start. Curation instead of exclusion.</p>\n<p>This post is just a stream of consciousness of my thoughts on the matter. I have been contemplating this, and, as with most things, it's a nuanced problem to solve. If you have any thoughts or potential solutions, send me an email. I appreciate your input.</p>\n<p>Enjoy the last 2 days of 2025!</p>"
            ],
            "link": "https://herman.bearblog.dev/discovery-and-ai/",
            "publishedAt": "2025-12-30",
            "source": "Herman Martinus",
            "summary": "<p>I browse the discovery feed on Bear daily, both as part of my role as a moderator, and because it's a space I love, populated by a diverse group of interesting people.</p> <p>I've read the posts regarding AI-related content on the discovery feed, and I get it. It's such a prevalent topic right now that it feels inescapable, available everywhere from Christmas dinner to overheard conversation on the subway. It's also becoming quite a polarising one, since it has broad impacts on society and the natural environment.</p> <p>This conversation also raises the question about popular bloggers and how pre-existing audiences should affect discoverability. As with all creative media, once you have a big-enough audience it becomes self-perpetuating that you get more visibility. Think Spotify's 1%. Conveniently, Bear is small enough that bloggers with no audience can still be discovered easily and it's something I'd like to preserve on the platform.</p> <p>In this post I'll try and explain my thinking on these matters, and clear up a few misconceptions.</p> <p>First off, posts that get many upvotes through a large pre-existing audience, or from doing well on Hacker News do not spend disproportionately more time on the discovery feed. Due to how",
            "title": "Discovery and AI"
        },
        {
            "content": [],
            "link": "https://bernsteinbear.com/blog/gdb-jit/?utm_source=rss",
            "publishedAt": "2025-12-30",
            "source": "Max Bernstein",
            "summary": "<p>GDB is great for stepping through machine code to figure out what is going on. It uses debug information under the hood to present you with a tidy backtrace and also determine how much machine code to print when you type <code class=\"language-plaintext highlighter-rouge\">disassemble</code>.</p> <p>This debug information comes from your compiler. Clang, GCC, rustc, etc all produce debug data in a format called <a href=\"https://dwarfstd.org/\">DWARF</a> and then embed that debug information inside the binary (ELF, Mach-O, …) when you do <code class=\"language-plaintext highlighter-rouge\">-ggdb</code> or equivalent.</p> <p>Unfortunately, this means that by default, GDB has no idea what is going on if you break in a JIT-compiled function. You can step instruction-by-instruction and whatnot, but that’s about it. This is because the current instruction pointer is nowhere to be found in any of the existing debug info tables from the host runtime code, so your terminal is filled with <code class=\"language-plaintext highlighter-rouge\">???</code>. See this example from the V8 docs:</p> <div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>#8 0x08281674 in v8::internal::Runtime_SetProperty (args=...) at src/runtime.cc:3758 #9 0xf5cae28e in ?? () #10 0xf5cc3a0a in ?? () #11 0xf5cc38f4 in ?? () #12 0xf5cbef19 in ?? () #13 0xf5cb09a2 in ?? () #14 0x0809e0a5 in v8::internal::Invoke (...) at src/execution.cc:97",
            "title": "The GDB JIT interface"
        },
        {
            "content": [],
            "link": "https://www.ssp.sh/books/",
            "publishedAt": "2025-12-30",
            "source": "Simon Spati",
            "summary": "<p>These are my recently read books and some comments and notes from when I read them.</p> <p>As I love books and recommendations by others, I want to share them in a collective format so others can read gems of books, as I think books are still the best way to read new information these days. Even more with the fast pace we are going at, as books are well structured and made for the long term.</p> <h2 id=\"book-recommendations-ive-read\">Book Recommendations I&rsquo;ve Read</h2> <p>Over the years, I have made recommendations in <a href=\"https://www.ssp.sh/writers-room\" rel=\"\">Writer&rsquo;s Room</a>, <a href=\"https://subscribe.ssp.sh\" rel=\"noopener noreffer\" target=\"_blank\">my newsletter</a>, on my <a href=\"https://now.ssp.sh\" rel=\"noopener noreffer\" target=\"_blank\">now page</a> or in person. Here I have collected and curated them over the years including some comments. I hope you enjoy.</p> <h3 id=\"2025\">2025</h3> <ul> <li><strong><a href=\"https://www.goodreads.com/book/show/60387307-novelist-as-a-vocation\" rel=\"noopener noreffer\" target=\"_blank\">Novelist as a Vocation</a></strong> (Haruki Murakami): Such an amazing book on writing. It really reminded me of my writing style, as he translates words and tries to write beautifully for the sake of beauty, not to impress the reader. No timeline. It takes as long as it takes until the quality is good. And he likes a good challenge to keep him engaged, e.g., when he",
            "title": "Book Recommendations and Notes"
        },
        {
            "content": [
                "<p>Ultimately, it comes down to one question. Are you in? For you, and for them.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because They Got The Ick</h4>\n\n\n<p>The Ick, the ultimate red flag, makes perfect sense and is all about likelihood ratios.</p>\n<blockquote><p><a href=\"https://x.com/koenfucius/status/1903540188292247675\">Koenfuciu</a>s: The ‘ick’ is a colloquial term for a feeling of disgust triggered by a specific—typically trivial—behaviour from a romantic partner, often leading to the relationship’s demise. <a href=\"https://t.co/vxACqd0H8t\">New research explores</a> why some are more prone to getting it than others.</p>\n<p><a href=\"https://x.com/robinhanson/status/1903541634588909641\">Robin Hanson</a>: “Women also experienced the ick more frequently, with 75% having had the ick compared to 57% of men … Those with a higher tendency for disgust … [&amp;] grandiose narcissism was linked to stronger ick reactions, as was holding partners to exceptionally high standards.”</p>\n<div>\n\n\n<span id=\"more-24993\"></span>\n\n\n</div>\n<p>Paul Graham: About 30% of Seinfeld episodes were about this.</p></blockquote>\n<p>One gets The Ick because a small act is evidence of one’s general nature. The right type of person would never do [X], ideally never want to do [X], and at minimum would have learned not to do [X]. Often this is because they would know this is indicative of attribute [Y]. Indeed, if they should be aware that [X] is indicative of [Y], then their failure to do [X] is indicative not only of a lack of [Y], but also of a lack of desire or ability to even fake or signal [Y], especially in a romantic context. They don’t respect [Y]. Thus, this is extremely strong evidence. Thus, The Ick.</p>\n<p>The person is not consciously thinking through this, but that’s the point.</p>\n<p>That doesn’t mean that The Ick is always valid. Quite the contrary. Mistakes are made.</p>\n<p><a href=\"https://www.buzzfeed.com/sydrobinson1/icks-about-men-tiktok\">It’s fun to look at this list of Icks</a>. There are very clear categories involved &#8211; status markers, stupidity and Your Mom are the big three. In general, it’s something that ‘looks bad’ and the fact that the man should know it looks bad and therefore not do it.</p>\n<p>To what extent is The Ick a win-win? The majority of the time, I think it’s win-win, because them caring so much about this little thing, combined with you not caring, means it was never going to work. But on occasion there’s a classification mismatch, and when that happens it is super bad. And even if the particular person getting The Ick here is good, overall reaction to you continuing to do that thing is still bad, it’s almost certainly a mistake. So in general, if there’s something that is known to give The Ick, it’s worth making an effort to not do it.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\">You Are Still Single Because You Are Inventing Red Flags</h4>\n\n\n<p>This might be the new strangest take. It’s bad if he bought a house?</p>\n<blockquote><p>Cold: It’s offputting when a man buys a house when he’s single. Too prepared. The wife should help choose where they live, obviously. Is he just looking for a woman to slot in the missing hole in the fantasy he’s created? Even if a single man has money he should live in an apartment.</p>\n<p>Midwest Antiquarian: What if you own an apartment?</p>\n<p>cold: You’re doing great king.</p>\n<p>Generous Farm: I bought when interest rates were most attractive. 2.9%. Now they’re 7.5%. Sorry couldn’t wait.</p>\n<p>Cold: Love is bigger than 4.6% difference in rates.</p>\n<p><a href=\"https://x.com/robinhanson/status/1952487637371277749\">Robin Hanson</a>: Maybe many are a bit too eager to judge men for every little thing they do?</p></blockquote>\n<p>Any sane person would view ‘I own a house’ a highly positive sign. ‘Too prepared’?</p>\n<p>If it’s a case of ‘I own this house and refuse to move’ then I can see an issue, and you should think about whether you want to live in that house. But houses can be sold.</p>\n<p>This is what the wise man calls ‘favorable selection.’ If they turn you down because of this you presumably dodged a bullet. If someone thinks you should be paying 7.5% in interest rather than 2.9% so that you can avoid signaling you’re ‘too prepared’? Run. Or, rather, you don’t have to run, all you have to do is stay put. That’s the idea.</p>\n<p>I hope and presume not too many people are treating ‘owns a house’ (but not an apartment, that would mean you’re doing great king?) in particular as a red flag.</p>\n<p>Note that in the next section, one of Claire’s demands is that the man ‘has a small house,’ so a direct contradiction. I wonder if a large house is okay for her?</p>\n<p>The more important point is yes, there is a large trend of judging based on a single data point, and looking for ways in which to find that data point a red flag. Stop it, or at least stop it once you’ve got substantial amounts of other information.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Still Single Because You Demand The Same Generic Things</h4>\n\n\n<p>If you’re looking for the same things everyone is looking for, it’s rough out there.</p>\n<blockquote><p>Claire: Am looking for this man where is he?</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!vyPC!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9b1e9fff-e0ec-42f4-ac50-d98490dedc12_1536x2048.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/webdevMason/status/1951139887521862090\">Mason</a>: It’s not that these are bad things to want</p>\n<p>it’s not even that these are too much</p>\n<p>it’s just that there is no depth here, no values, nothing to anchor a connection on, you couldn’t even write a compelling side character in a comic book on this outline.</p>\n<p>The question isn’t where is he, it’s what would you do with him if you found him.</p>\n<p>Danneskjold (with the correct answer): Happily married to a normal person.</p>\n<p>Cynical Mike (also probably correct): All the things I’ll find before you find him:</p>\n<p>Waldo, Carmen Santiago, Jimmy Hoffa, Epstein’s Suicide video, Pot of Gold at the end of a Rainbow, A Dragon, Aliens, Noah’s ARK, Hogwarts and a Pegasus.</p></blockquote>\n<p>The good news is this is not 15 things, it is more like 5. A lot of redundancy.</p>\n<p>As Mason says, there’s nothing wrong with anything on the list but also nothing that differentiates what you in particular want, and it focuses on exactly the legible universally desirable features that put someone in high demand. The useful list has the things that you value more than ‘the market,’ and importantly drops some things that you value less.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because Everyone Is Too Picky</h4>\n\n\n<p>When the going gets weird, be careful not to inadvertently turn pro.</p>\n<p>The problem is that <a href=\"https://thezvi.substack.com/p/choices-are-bad\">Choices are Bad</a>. <a href=\"https://thezvi.wordpress.com/2017/08/12/choices-are-really-bad/\">Really bad</a>.</p>\n<blockquote><p><a href=\"https://x.com/drethelin/status/1915520375062249534\">Misha</a>: I think these days I see the biggest problem in dating is people are both increasingly weird and increasingly picky.</p>\n<p>This applies not just to dating qua dating but all aspects of socialization, which are of course upstream of romance.</p>\n<p>I think our minds are (sometimes perniciously) good at making us content with what seems possible.</p>\n<p>The modern world shows us a far wider range of what’s possible.</p>\n<p>What’s possible and what’s expected depends a lot on local culture and your knowledge of the world and one of these is drastically in flux right now and the other has grown immensely.</p>\n<p>Imagine you get into hiking. This is a fairly common hobby, and you want a partner who will go with you. Woops, you might’ve just cut your potential partners by a large percentage.</p></blockquote>\n<p>Any given thing you want, or want to avoid? Mostly you can solve for that. Combine enough different such things, and you quickly get into trouble. The search algorithms are not that robust.</p>\n<p><a href=\"https://www.reddit.com/r/intj/comments/g2pz4t/the_secretary_problem_for_dating/\">The Secretary Problem</a> thus suggests that if you are maximizing, you should be deeply stingy about accepting a match until you’ve done a lot of calibration, and then take your sweet time after that.</p>\n<p>But two big differences work against this in the dating case. You have an uncertain number of shots at this, taking each shot is costly in several ways, the pool you’re drawing from starts getting worse over time after a while, each time you’ve previously drawn may impose its own form of penalty to the final outcome, and you can easily miss outright. And once you pick, the comparisons directly impact your satisfaction levels. Thus, you want to be much quicker on the trigger.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single And They Will Never Tell You Why</h4>\n\n\n<blockquote><p><a href=\"https://x.com/DegenRolf/status/1953104214403449293\">Rolf Degen</a>: <a href=\"https://www.sciencedirect.com/science/article/pii/S0747563225002031#preview-section-snippets\">Being ghosted causes more lasting humiliation than being openly rejected.</a></p>\n<p>Research on how individuals respond to ghosting, defined as unilaterally ending a relationship without providing explanations and ignoring communication attempts, has primarily relied on retrospective and imaginative methodologies. The present research introduced a novel multi-day daily-diary experimental paradigm to examine the psychological consequences of ghosting compared to rejection.</p></blockquote>\n<p>It should be common knowledge at this point that not explaining, and especially outright ghosting, is making your life easier at the expense of the person ghosted.</p>\n<p>It can be the right move anyway, as in it sometimes helps you more than it hurts them. Not ghosting can have its own downsides, starting with them demanding a reason, or if you share a reason arguing about it, offering to change or getting really angry about it or using it against you (or in non-dating contexts outright suing). The less you say, the safer and better, and if you change your mind your options might be open.</p>\n<p>Despite this, by default, you should be ghostminning.</p>\n<p>If you know that you don’t want to continue talking to someone, say so. By default treat ghosting as a black mark on the person doing it. This applies to all forms of ghosting, not only in dating. Also, if they decide to ghost you, in some ways that’s a black mark on your ability to credibly signal that they don’t have to.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Won’t Tell Them The Problem</h4>\n\n\n<blockquote><p><a href=\"https://x.com/catehall/status/1951294725581103160\">Cate Hall</a>: unironically this is why everyone’s single</p>\n<p>“oh, there’s a small thing you don’t like about a promising match? definitely break up with him instead of mentioning it”</p>\n<p>no, you don’t have “the right” to force him to change it. but maybe just give him the info &amp; let him decide?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!hXnM!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7a3f07e7-0df8-4ab6-b3e5-b11e8ed4dc05_1199x1125.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Cate is correct that this is ludicrously terrible advice. He has hit a good vibe two dates out of three, everything else about him is great. Obviously you tell him that this cologne and aesthetic did not work for you. When did this become a ‘right to micromanage’ anything? Is there any possible world in which the guy is better off if you dump him rather than telling him, or silently suffer and never tell him?</p>\n<p>I do think Jorbs is right that this reads like a ‘good on paper’ description, and she may be looking for an excuse. But that’s dumb, if you don’t want to date him then don’t.</p>\n<blockquote><p>Jorbs: it reads like someone who met someone she feels like she should want to date but doesn’t actually like him very much, and is struggling to process that or work out what to do with it. the positives aren’t enchanting, the negatives are cosmetic.</p>\n<p>The response is ludicrous though.</p>\n<p>Zac Hill: The thing that is really insidious about this response is the subtle everyone-has-forgotten-their-Carol-Dweck-lessons habit of *internalization of a behavior as a fixed characteristic*. It’s not that you don’t like his cologne — it’s that you ARE sensitive to fragrance.</p></blockquote>\n<p>A good starting rule is that if them changing one eminently changeable thing would make dating worthwhile, you should tell them about it.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Not Single But The Clock Is Ticking</h4>\n\n\n<blockquote><p><a href=\"https://x.com/Empty_America/status/1905696306221531424\">VB Knives</a>: Just two useless boyfriends can easily consume the entire period between 21 and 30. You have one who doesn’t seem to ever propose. Then you finally get rid of him (you are 27) and the next effort brings you to 30+ with no ring. Not some exotic string of bad decisions.</p>\n<p><a href=\"https://x.com/literally_chad/status/1905728204092182534\">Literary Chad</a>: This is actually the issue&#8211; the median bodycount is 4, there aren’t wild sex parties, it’s serial monogamy without marriage or children.</p>\n<p>Which is obvious unless you’re a boomer-like media consumer who believes that the existence of a sex party somewhere means they’re ubiquitous.</p></blockquote>\n<p>The more I think about this question, the more it seems like an obvious mistake to stay in a long term relationship for years and not fully commit.</p>\n<p>I realize this is easier said than done. It is scary to go full The Ultimatum and insist on a rapid move up or move out, when you have something pretty good. It does seem like it is obviously a mistake to give things more than a year or at most two.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because of Your Bodycount</h4>\n\n\n<p>How much does it matter?</p>\n<blockquote><p>Steve Stewart-Williams: As shown in the graph below, the sweet spot was two to four past partners; fewer or more reduced attractiveness. In effect, people wanted someone with a bit of a past, but not too much (which was the title of our paper describing the research).</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ALxK!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6a24187a-2b78-4441-9c07-e3e3681b2baf_1279x1069.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Intriguingly, we found no evidence for a sexual double standard: none, zilch, nada. Contrary to what’s often claimed, women weren’t judged any more harshly than men for having a high body count. That’s not to say they <em>weren’t</em> judged for it, but only that men were judged too.</p>\n<p>This can be seen in the next graph. The left panel shows willingness ratings for long-term relationships, the right panel for short-term ones. As you can see, the sexes barely differed in their willingness to engage in long-term relationships. For short-term relationships, in contrast, men expressed greater willingness at every past-partner level.</p></blockquote>\n<p>This looks like a relative ranking, so it does not tell you how much this ‘willingness’ matters. Claiming ‘it literally does not matter at all’ would be bizarre, certainly this number contains information especially if the number is zero or one.</p>\n<p>Also, I flat out defy the data on there being no double standard? No way. Even if on some abstract 1-9 scale it looks similar, the practical impact is very obviously totally different. Yes, a male body count of 60+ is functionally a negative, but not at the same level.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Failed To Read The Signs</h4>\n\n\n<p>Astrology is a problem for men when dating, because:</p>\n<ol>\n<li>A remarkably high percentage of women believe in it to remarkably high degrees.</li>\n<li>If taken at all seriously, it is deeply stupid.</li>\n<li>Even as a clearly delineated <a href=\"https://www.lesswrong.com/posts/wDP4ZWYLNj7MGXWiW/in-praise-of-fake-frameworks\">fake framework</a>, it’s pretty terrible.</li>\n</ol>\n<p>It is also an opportunity, because the subset of humans that use astrology talk is not random, and the details of how a person interacts with astrology, no matter how seriously they do or don’t take it, are even less random.</p>\n<blockquote><p><a href=\"https://x.com/seattleiminyou/status/1995002486512652458\">Seattle Min You</a>: If a girl asks your zodiac sign and your first response is to be annoyed, you’ve already fucked up. You don’t have enough whimsy in your heart to entertain an arbitrary topic for even a little tiny bit and it’s ugly.</p>\n<p>Drea: Huge red flag… like, lighten up Francis.</p>\n<p>Seattle Min You: Totally.</p>\n<p>Purpskurp Capital LLC: If it was a whimsy topic for fun I’d 100% agree with too.</p>\n<p>Problem is many of these girls use this stuff to make real life decisions, instead of using critical thinking and reasoning skills. It’s terrifying. And that’s why a lot of men like me treat it as a red flag.</p>\n<p>Texanus: I will absolutely do that. for a child. are you a child? do you need to be treated like a child? I love my nieces and I’ve gotten all dressed up and played tea party with them. I’m not doing that with a grown woman however.</p>\n<p>Positivity Moon: His jaw tightens a little. His eyes do that micro roll. He says something like “I don’t believe in that stuff” with the same energy you would use for “I don’t support war crimes.” The girl just asked for his birthday. No one was trying to rewrite physics.</p>\n<p>People like to pretend it is about logic. Rationality. Being above “nonsense.” It almost never is. It is usually about control.</p>\n<p>Because on the surface, the question is stupidly harmless. She is not building a medical treatment plan off your sun sign. She is not deciding whether to let you hold her wallet based on whether Mercury is breakdancing. She is opening a door to talk about patterns, personality, taste, how you see yourself. If you answer “Scorpio” or “Gemini” or whatever, the conversation that follows is almost never actually about stars. It is about you, but sideways. She is saying: teach me how to play with you for a second.</p>\n<p>When your first instinct is annoyance, what you are really saying is: I hate being touched anywhere that does not fit my script.</p>\n<p>Because if you truly did not care, you would just answer and move on. “I’m a Virgo.” Smile. Shrug. Ask hers. Make a joke. You do not have to secretly download Co–Star in the bathroom and start believing. You just have to have enough flexibility to sit in someone else’s little universe for five minutes without throwing a tantrum about empirical evidence.</p>\n<p>People underestimate how much relationships are built on that ability. To step into someone’s weird side hobby, their micro belief system, their little rituals, even when you do not share them. She might have astrology. Someone else has Dungeons &amp; Dragons lore. Another person has fantasy football statistics. Your uncle has his grill. None of it matters in a lab. All of it matters when you are trying to figure out: can I talk to this person about something that is technically pointless and still feel respected.</p>\n<p>Annoyance at the sign question is rarely about skepticism. It is about contempt.</p>\n<p><a href=\"https://x.com/philiparola/status/1995909272228745481\">Philip Arola</a>: “Astrology is a vehicle women use to communicate indirectly. Why would it possibly make you annoyed?”</p></blockquote>\n<p>Responding with visible annoyance, or declining to answer with your birthday or sign, is everywhere and always an unforced error. Don’t do that, even if you’re effectively writing her off and no matter how actually annoyed you are. There’s no reason to make things unpleasant, especially before you know how far she’s going with this.</p>\n<p>However, well, do you still respect her as a potential partner? Should you?</p>\n<p>Annoyance here can come from many places. One of which is ‘oh god I have to deal with this now,’ another related one is ‘damn it I am no longer as interested.’</p>\n<p>There are three related but distinct stories from Moon here about a reaction of annoyance. You have logic versus control, and you have skepticism versus contempt, and you have ability to indulge in whimsey and retain respect.</p>\n<p>There is also the claim motte and bailey claim that of course she doesn’t actually believe in astrology and won’t let this influence things beyond a little whimsy.</p>\n<p>That brings us back to Purpskurp. There is a continuum of possibilities, but centrally three cases.</p>\n<ol>\n<li>Topic of whimsy. It’s a way of making conversation, seeing how you play off an arbitrary set of predictions to get things rolling, a form of cold reading.\n<ol>\n<li>This is still a negative update even once you establish this, because she is indicating she thinks this is a good move. Why? Because unless this was maximally explicit, she is engaging in a form of selection, and that choice of selection tells you about her, and it makes this less likely to be a good match.</li>\n<li>That said, this is totally survivable, especially if the whimsey is clear. Thus, you don’t want to fail the s*** test aspect of this by showing annoyance up top.</li>\n<li>If this is approached explicitly and strategically up front as a fake framework, then that is totally fine.</li>\n</ol>\n</li>\n<li>Taken somewhat seriously as actual Bayesian evidence, as in it might influence her decisions regarding you, including in the future.\n<ol>\n<li>That’s trouble, potentially of two distinct forms.</li>\n<li>It’s a bad sign on her general decision making capabilities and epistemics, and given you are reading this it’s a really bad sign about your compatibility across the board. It’s a red flag.</li>\n<li>The actual astrological implications could be bad news for you. Then again, they might also be good news. What matters is her interpretation of this, on whatever level she understands astrology.</li>\n<li>It’s worth noting that astrology is super flexible, so if you have green flags elsewhere you can ‘fight back’ if you know enough to play within the game.</li>\n</ol>\n</li>\n<li>Actual real belief in astrology, the way I believe in having lunch.\n<ol>\n<li>For the long term, this is a dealbreaker, period, straight up.</li>\n<li>How it impacts the short term is, of course, up to you.</li>\n</ol>\n</li>\n</ol>\n<p>An ‘interest in’ astrology or tarot cards can be fine, although tarot cards are strictly better and astrology indicates poor taste. Actual belief? <a href=\"https://x.com/s_r_constantin/status/1995835339852972119\">That’s a dealbreaker, ladies.</a></p>\n<blockquote><p><a href=\"https://x.com/everytstudies/status/1995614534531514490\">yashkaf</a>: this is entirely correct in that being dismissive of people’s niche interests on a date is a much bigger “red flag” than astrology.</p>\n<p>and yet if a cute girl posted “he brought up D&amp;D and fantasy football on our first date, I rolled my eyes so hard” will anyone take the guy’s side?</p>\n<p>no matter who brings up the cringe topic and who rolls their eyes, the guy fumbled.</p>\n<p>no matter who escalated intimacy and who shot it down, the guy fumbled.</p>\n<p>it’s always the guy who fumbles. thus, it’s always the guy who improves from feedback.</p>\n<p>this makes dating very hard for women.</p>\n<p>John Nerst: I mean astrology isn’t an interest, it’s a belief. Very different.</p>\n<p>yashkaf: differentiating interests from beliefs from beliefs in belief from world models is just your own special weird niche interest <img alt=\"🐀\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f400.png\" style=\"height: 1em;\" /></p>\n<p>John Nerst: Going meta, how droll. But yes, most people are totally nuts and this is one of the surest signs</p>\n<p>yashkaf: if you’re want to know the difference between “rat” and “post rat” without prejudice against either, read [the above] conversation between me and John and see who you intuitively side with</p>\n<p>Sarah Constantin: yeah, rat all the way.</p>\n<p>i think astrology is fun and i would not consider an interest in astrology a dealbreaker.</p>\n<p>but i *definitely* don’t believe in stretching the meaning of “truth” or going “what is true or false, really?”</p>\n<p>… i think it’s important to be grounded in (ordinary, waking, non-mystical) reality, to the point that you can enjoy *playing* with deviations from it, without getting seriously confused and throwing your life off the rails.</p>\n<p>“zero playing around allowed” types are no-fun scolds, but “come on in, this is literally real and true, from a certain point of view, let me talk you into that” can destabilize some people for real.</p></blockquote>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/30/dating-roundup-9-signals-and-selection/",
            "publishedAt": "2025-12-30",
            "source": "TheZvi",
            "summary": "Ultimately, it comes down to one question. Are you in? For you, and for them. You’re Single Because They Got The Ick The Ick, the ultimate red flag, makes perfect sense and is all about likelihood ratios. Koenfucius: The ‘ick’ &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/30/dating-roundup-9-signals-and-selection/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Dating Roundup #9: Signals and Selection"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-30"
}