{
    "articles": [
        {
            "content": [
                "<header>\n  <h1>Static Allocation For Compilers</h1>\n  <time class=\"meta\" datetime=\"2025-12-23\">Dec 23, 2025</time>\n</header>\n<p>TigerBeetle famously\n<a href=\"https://github.com/tigerbeetle/tigerbeetle/blob/main/docs/internals/ARCHITECTURE.md#static-memory-allocation\">uses “static allocation”</a>.\nInfamously, the use of the term is idiosyncratic: what is meant is <em>not</em> <code>static</code> arrays, as found\nin embedded development, but rather a weaker “no allocation after startup” form. The amount of\nmemory TigerBeetle process uses is not hard-coded into the Elf binary. It depends on the runtime\ncommand line arguments. However, all allocation happens at startup, and there’s no deallocation. The\nlong-lived event loop goes round and round happily without <code>alloc</code>.</p>\n<p>I’ve wondered for years if a similar technique is applicable to compilers. It seemed impossible, but\ntoday I’ve managed to extract something actionable from this idea?</p>\n<section id=\"Static-Allocation\">\n\n<h2><a href=\"https://matklad.github.io/2025/12/23/static-allocation-compilers.html#Static-Allocation\">Static Allocation</a></h2>\n<p>Static allocation depends on the physics of the underlying problem. And distributed databases have\nsurprisingly simple physics, at least in the case of TigerBeetle.</p>\n<p>The only inputs and outputs of the system are messages. Each message is finite in size (1MiB). The\nactual data of the system is stored on disk and can be arbitrarily large. But the diff applied by a\nsingle message is finite. And, if your input is finite, and your output is finite, it’s actually\nquite hard to need to allocate extra memory!</p>\n<p>This is worth emphasizing — it might seem like doing static allocation is tough and requires\nconstant vigilance and manual accounting for resources. In practice, I learned that it is\nsurprisingly compositional. As long as inputs and outputs of a system are finite, non-allocating\nprocessing is easy. And you can put two such systems together without much trouble.\n<a href=\"https://github.com/tigerbeetle/tigerbeetle/blob/0.16.67/src/vsr/routing.zig\">routing.zig</a> is a good\nexample of such an isolated subsystem.</p>\n<p>The only issue here is that there isn’t a physical limit on how many messages can arrive at the same\ntime. Obviously, you can’t process arbitrary many messages simultaneously. But in  the context of a\ndistributed system over an unreliable network, a safe move is to drop a message on the floor if the\nrequired processing resources are not available.</p>\n<p>Counter-intuitively, not allocating is simpler than allocating, provided that you can pull it off!</p>\n</section>\n<section id=\"For-Compilers\">\n\n<h2><a href=\"https://matklad.github.io/2025/12/23/static-allocation-compilers.html#For-Compilers\">For Compilers</a></h2>\n<p>Alas, it seems impossible to pull it off for compilers. You <em>could</em> say something like “hey, the\nlargest program will have at most one million functions”, but that will lead to both wasted memory\nand poor user experience. You <em>could</em> also use a single yolo arena of a fixed size, like I did in\n<a href=\"https://matklad.github.io/2022/10/06/hard-mode-rust.html\"><em>Hard Mode Rust</em></a>, but that isn’t at all\nsimilar to “static allocation”. With arenas, the size is fixed explicitly, but you can OOM. With\nstatic allocation it is the opposite — no OOM, but you don’t know how much memory you’ll need\nuntil startup finishes!</p>\n<p>The “problem size” for a compiler isn’t fixed — both the input (source code) and the output\n(executable) can be arbitrarily large. But that is <em>also</em> the case for TigerBeetle — the size of\nthe database is not fixed, it’s just that TigerBeetle gets to cheat and store it on disk, rather\nthan in RAM. And TigerBeetle doesn’t do “static allocation” on disk, it can fail with <code>ENOSPACE</code> at\nruntime, and it includes a dynamic block allocator to avoid that as long as possible by re-using no\nlonger relevant sectors.</p>\n<p>So what we could say is that a compiler consumes arbitrarily large input, and produces arbitrarily\nlarge output, but those “do not count” for the purpose of static memory allocation. At the start, we\nset aside an “output arena” for storing finished, immutable results of compiler’s work. We then say\nthat this output is accumulated after processing a sequence of chunks, where chunk size is strictly\nfinite.  While limiting the total size of the code-base is unreasonable, limiting a single file to,\nsay, 4 MiB (runtime-overridable) is fine. Compiling then essentially becomes a “stream processing”\nproblem, where both inputs and outputs are arbitrary large, but the filter program itself must\nexecute in O(1) memory.</p>\n<p>With this setup, it is natural to use indexes rather than pointers for “output data”, which then\nmakes it easy to persist it to disk between changes. And it’s also natural to think about “chunks of\nchanges” not only spatially (compiler sees a new file), but also temporally (compiler sees a new\nversion of an old file).</p>\n<p>Is there any practical benefits here? I don’t know! But seems worth playing around with! I feel that\na strict separation between O(N) compiler output and O(1) intermediate processing artifacts can\nclarify compiler’s architecture, and I won’t be too surprised if O(1) processing in compilers would\nlead to simpler code the same way it does for databases?</p>\n</section>"
            ],
            "link": "https://matklad.github.io/2025/12/23/static-allocation-compilers.html",
            "publishedAt": "2025-12-23",
            "source": "Alex Kladov",
            "summary": "TigerBeetle famously uses static allocation. Infamously, the use of the term is idiosyncratic: what is meant is not static arrays, as found in embedded development, but rather a weaker no allocation after startup form. The amount of memory TigerBeetle process uses is not hard-coded into the Elf binary. It depends on the runtime command line arguments. However, all allocation happens at startup, and there's no deallocation. The long-lived event loop goes round and round happily without alloc.",
            "title": "Static Allocation For Compilers"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Dec/23/cooking-with-claude/#atom-entries",
            "publishedAt": "2025-12-23",
            "source": "Simon Willison",
            "summary": "<p>I've been having an absurd amount of fun recently using LLMs for cooking. I started out using them for basic recipes, but as I've grown more confident in their culinary abilities I've leaned into them for more advanced tasks. Today I tried something new: having Claude vibe-code up a custom application to help with the timing for a complicated meal preparation. It worked really well!</p> <h4 id=\"a-custom-timing-app-for-two-recipes-at-once\">A custom timing app for two recipes at once</h4> <p>We have family staying at the moment, which means cooking for four. We subscribe to a meal delivery service called <a href=\"https://www.greenchef.com/\">Green Chef</a>, mainly because it takes the thinking out of cooking three times a week: grab a bag from the fridge, follow the instructions, eat.</p> <p>Each bag serves two portions, so cooking for four means preparing two bags at once.</p> <p>I have done this a few times now and it is always a mad flurry of pans and ingredients and timers and desperately trying to figure out what should happen when and how to get both recipes finished at the same time. It's fun but it's also chaotic and error-prone.</p> <p>This time I decided to try something different, and potentially even more chaotic and",
            "title": "Cooking with Claude"
        },
        {
            "content": [
                "<p>Several years ago Zvi Mowshowitz founded Balsa Research, a tiny nonprofit research organization currently focused on quantifying the impact of the Jones Act on the American economy, and working towards viable reform proposals.</p>\n<p>While changing century-old policy is not going to be easy, we continue to see many places where there is<a href=\"https://www.balsaresearch.com/blog/why-balsa-research-is-worthwhile\"> neglected groundwork</a> that we’re well positioned to do, and we are improving at doing it with another year of practice under our belts.</p>\n<p>We’re looking to raise $200,000 to support our work this giving season, though $50,000 would be sufficient to keep the lights on, and we think we are also well positioned to do more with more funding.</p>\n<div>\n\n\n<span id=\"more-24976\"></span>\n\n\n</div>\n<p>Funds raised this round will support Balsa’s policy advocacy, either in Jones Act and shipping or potentially in other planned cause areas of housing reform and NEPA reform if there is capacity to significantly expand.</p>\n<p><a href=\"https://www.balsaresearch.com/donate\"><strong>Donate here to fund our mainline policy work.</strong></a></p>\n<p>One additional possibility for Balsa, that would be funded entirely separately if it did happen, is for Zvi Mowshowitz to use Balsa as a piece of philanthropic infrastructure to help guide new philanthropic money coming online in 2026 if there is demand. Contact us (hello@balsaresearch.com) if you would like to be involved in such an effort in any capacity, or want to authorize this as a potential use of your funds.</p>\n<p><a href=\"https://www.every.org/balsa-research/f/flexible-funding-for\"><strong>Donate here if you are interested in helping us with fully flexible funding.</strong></a></p>\n\n\n<h4 class=\"wp-block-heading\">What Balsa Got Up to in 2025</h4>\n\n\n<p>Quite early in the year, Balsa’s plans for Jones Act investigative work was derailed by a certain Section 301 Investigation, which I wrote about <a href=\"https://www.balsaresearch.com/blog/springtime-in-dc\">here</a>. In short, the USTR was proposing two significant changes to maritime transport: a $3-5 million fee for Chinese-built ships to deliver imports to American ports, and new, Jones Act-tier restrictions to up to 20% of American maritime exports. All of American industry focused on lobbying against the legibly bad first proposal, sadly no one else was on the ball about how bad the second proposal was because it required a slightly more sophisticated argument. So Balsa stepped in and wrote up a public comment and presented it to the USTR during their public hearing on the proposal. At least in part due to our research and our outreach to maritime industry players, this proposal was basically entirely axed.</p>\n<p>After our mid-year write-up on the whole adventure, Balsa did also end up submitting a <a href=\"https://comments.ustr.gov/s/commentdetails?rid=7WRW6QYKR8\">second comment</a> in response to what we felt was a deeply counterproductive tariff scheme in the updated proposal. This was the first arc played out in miniature; after functionally scrapping both major proposals from the first round, the USTR was proposing that an increasing percentage of American LNG must be shipped out on U.S.-built LNG tankers (there are currently zero in the fleet and no capacity for the shipyards to build any new ones) and that all port crane parts made in China be subject to 100% tariffs. Everyone focused on lobbying against the first policy change which was obviously bad, the second was bad in a more subtle way. So it was up to Balsa to point out that the exact setup of the port crane tariffs were structured in a way counterproductive to the stated U.S. policy, would incentivize American ports to buy their cranes from Chinese manufacturers instead of manufacturers in allied countries (there is no domestic port crane manufacturing capacity), and negatively impact port revitalization investments that need to happen.</p>\n<p>One piece of good news is that President Trump signed a trade deal with China in November, which resulted in a <a href=\"https://ustr.gov/about/policy-offices/press-office/press-releases/2025/november/ustr-suspension-action-section-301-investigation-chinas-targeting-maritime-logistics-and\">one-year suspension</a> of all of the punitive measures proposed in the Section 301 investigation. We think there’s a good chance that the suspension might become indefinite, but it still seemed like a good use of our time to write up our objections should the measures resume in 2026.</p>\n<p>We also worked on the Jones Act. We launched a new <a href=\"https://www.balsaresearch.com/labor-rfa\">RFA to investigate the labor impacts of the Jones Act</a>. This is meant to complement our <a href=\"https://www.balsaresearch.com/econ-rfa\">first RFA</a>, which invites academics to look at the economic impacts of the Jones Act. You may also recall that we had already given out grants for two different studies under the first RFA, on economic impacts. These papers are still in the process of being written. We remain confident in both teams and look forward to seeing their results in 2026.</p>\n<p>We shored up a few places where we felt like some of the groundwork done by others on the Jones Act were either neglected or outdated. We published two pieces: <a href=\"https://www.balsaresearch.com/jones-act-index\">The Jones Act Index</a>, which works as a very short overview of all the myriad dysfunctions of the current domestic maritime industry, and an <a href=\"https://www.balsaresearch.com/jones-act-vessels\">operational analysis</a> of what exactly the 93 extant Jones Act eligible vessels get up to.</p>\n<p>Besides all that, there is of course the frustratingly intangible work of networking and building a deeper understanding of the shape of the problem. We conducted over forty conversations with stakeholders across the maritime policy landscape, including domestic shipping operators, port executives, and congressional staff. These conversations directly informed our operational analysis of Jones Act vessels and helped us identify which reform framings resonate (and which don’t) with different constituencies. We’ve compiled this primary research into internal documentation mapping stakeholder positions, constraints, and potential pressure points—groundwork that will directly inform our policy binder and draft reform proposals.</p>\n<p>Additionally, in the last few months of the year, we brought on a very part-time contractor to help with shipping out more of our policy work.</p>\n\n\n<h4 class=\"wp-block-heading\">A quick glance at our budget</h4>\n\n\n<p>A breakdown of our 2025 spend to the nearest thousand, for a total of ~$143k:</p>\n<ul>\n<li>$87,000 in wages (Jenn at 35 hours a week and a policy analyst at 10 hours a week)</li>\n<li>$0 for Zvi Mowshowitz</li>\n<li>$45,000 in research grants to RFA applicants</li>\n<li>$7000 in travel and conference expenses</li>\n<li>$2000 in accounting services</li>\n<li>$1000 in legal, compliance, and nonprofit registration fees</li>\n<li>$1000 in software, subscriptions, and office supplies</li>\n</ul>\n\n\n<h4 class=\"wp-block-heading\">Balsa in 2026, and Our Ask</h4>\n\n\n<p>Considering Balsa’s size, unless fundraising goes exceedingly well, we plan to stay focused on the Jones Act and maritime policy until we crack this nut (i.e. deliver the policy binder) instead of diverting attention across different policy streams.</p>\n<p>Currently, the people working on Balsa work are me (full time-ish), our contractor who works ten hours a week, plus Zvi Mowshowitz in an advisory capacity. In 2026, we’d like to bring this person or another policy analyst on full time, because my own time is somewhat constrained by the overhead of maintaining a 501(c)(3) nonprofit. The amount of funding we have in reserve gives us a decent amount of runway, but is insufficient for our grantmaking and hiring ambitions.</p>\n<p>We’re looking to raise <strong>$200,000</strong>, which would be enough to bring on our contractor full-time and give us a reasonable amount of buffer for additional research funding that we would like to disburse. However, we think $50,000 is the minimum for Balsa to be viably funded to the end of 2026.</p>\n<p>Here’s what we plan on doing in 2026, should we hit our fundraising goal:</p>\n\n\n<h4 class=\"wp-block-heading\">Complete the Jones Act policy binder</h4>\n\n\n<p>This is the core deliverable that everything else feeds into, that was waylaid by our Section 301 work. The binder will include a short executive summary of the case for reform; one-pagers on specific impacts; a longer technical document synthesizing our funded research and the existing literature; and a FAQ addressing common objections. Much of the work is filling gaps identified through stakeholder conversations, and interpreting the information for specific audiences.</p>\n\n\n<h4 class=\"wp-block-heading\">Receive and publicize findings from the two funded economic studies</h4>\n\n\n<p>Both teams are expected to submit their papers in 2026. Once results are in, we’ll write accessible summaries for non-academic audiences, brief interested Hill offices, and incorporate findings into the policy binder.</p>\n\n\n<h4 class=\"wp-block-heading\">Fund at least one high-quality study from the labor RFA</h4>\n\n\n<p>The labor angle is underexplored in existing Jones Act research and useful for engaging unions constructively. We’re looking for proposals examining questions like: How many jobs does the Jones Act actually protect, and in which states? What’s the counterfactual employment picture under reform? What are the job creation effects in industries currently harmed by high shipping costs? A rigorous study here could shift the conversation toward a more nuanced understanding of net labor market effects.</p>\n\n\n<h4 class=\"wp-block-heading\">Continue monitoring Section 301 and SHIPS Act developments, contributing input where it seems high-leverage</h4>\n\n\n<p>The one-year suspension of Section 301 measures expires in late 2026, and if negotiations with China stall, the proposed port fees and export restrictions could return; we’ll track developments and be prepared to submit updated comments or testimony. The SHIPS for America Act proposes expanded cargo preference requirements facing similar vessel availability problems to those we identified in Section 301, and we’re developing analysis of cargo preference laws we can deploy if this legislation gains momentum. The goal is readiness to contribute when high-leverage, without letting monitoring consume time that should go toward the policy binder.</p>\n\n\n<h4 class=\"wp-block-heading\">What Additional Funding Enables</h4>\n\n\n<p>We can do even more with additional resources:</p>\n<ul>\n<li>We can fund additional academic studies to strengthen the empirical case for reform, complementing our existing research initiatives, as we discover new opportunities. We estimate that each additional study costs around $30,000 to fund.</li>\n<li>Zvi is not taking any payment for his work currently, but at a sufficiently high level of funding, this could change and he would dedicate more of his attention to the project. In addition, there is still an abundance of policy analysts in DC who are out of work, that we can hire more of.</li>\n<li>With more funding and interest, we’d also look into spinning up a 501c4 to use going forwards for more direct political advocacy. Though of course the 501c4 would then require its own fundraising work, since we can’t mix the funds.</li>\n</ul>\n<p>Donating is not the only way to give. If you have experience with maritime shipping, naval procurement, connections to labor unions, or anything else you think might be relevant to Jones Act reform, we’d be interested in talking to you and hearing your perspective. Get in touch at hello@balsaresearch.com and let us know how you might be able to help, whether that’s sharing your insights, making introductions, or contributing in other meaningful ways.</p>\n<p>If you’re an economist positioned to publish in peer-reviewed journals, please consider applying to our <a href=\"https://www.balsaresearch.com/econ-rfa\">economy</a> or <a href=\"https://www.balsaresearch.com/labor-rfa\">labor</a> RFAs, and doing direct research on the issue. If you have friends who fit that profile and might be interested in this kind of work, please consider forwarding the RFAs their way.</p>\n<p>Balsa Research is still a very small organization (me, another policy analyst at ten hours per week, and Zvi in an unpaid, very part-time advisory role) and our progress this year has been possible only through the generous support of our donors and the many people who have shared their time and expertise with us. We’re grateful for this community of supporters and collaborators who continue to believe in the importance of this work.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/23/keeping-up-against-the-joneses-balsas-2025-fundraiser/",
            "publishedAt": "2025-12-23",
            "source": "TheZvi",
            "summary": "Several years ago Zvi Mowshowitz founded Balsa Research, a tiny nonprofit research organization currently focused on quantifying the impact of the Jones Act on the American economy, and working towards viable reform proposals. While changing century-old policy is not going &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/23/keeping-up-against-the-joneses-balsas-2025-fundraiser/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Keeping Up Against the Joneses: Balsa’s 2025 Fundraiser"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-23"
}