{
    "articles": [
        {
            "content": [
                "<img alt=\"A window into modern loan origination\" src=\"https://www.bitsaboutmoney.com/content/images/2025/10/Window-Installation-with-Digital-Financing.png\" /><p>The ultimate goal of financial plumbing is to enable commerce in the real economy. Consider the humble window: it is a fairly expensive, surprisingly high-tech manufactured good, installed by the dozen in homes by artisans. A window represents a supply chain, and one part of that supply chain is a sales process, convincing a homeowner of the desirability of updating their windows. The sales representative running that process would urgently prefer to leave their single visit to the home with not just tentative measurements but with a durable commitment to buying the window and financing firmly in place for it.</p><p>Why finance the purchase? Windows cost $1,000 to $3,000 each and updating all or a large fraction of them quickly becomes a mid-five figures project; relatively few homeowners will pay upfront with cash. Moreover, the sales process would <em>strongly prefer</em> the purchase be financeable, because that will sell more windows than a counterfactual world where windows were only available for cash.</p><p>One could imagine a world in which window manufacturers or installers provided financing off of their own balance sheets. This would be a rough world for them: they have upfront capital outlay (the window) and would recoup only after extended periods, bearing credit risk all the while. No, they would prefer to sell windows for money. It&#x2019;s frequently delivered in milestone payments, perhaps half prior to manufacturing the windows and half upon successful installation.</p><p>You could imagine the buyer could bring their own financing, perhaps by going to their usual bank and asking for a home improvement loan. That product very much exists, but it might be surprisingly less attractive to all parties: it will be costly, low margin for the bank, and have poor operational dynamics for the window company. And so you could imagine the window company asking the financial industry to come up with an alternative.</p><p>That alternative exists, and can underwrite and paperwork a four-party commercial loan in fifteen minutes, before the salesman has even left their home visit that sold the window. We&#x2019;ll return to it in a moment.</p><h2 id=\"why-not-just-have-banks-loan-money-for-home-improvement\">Why not just have banks loan money for home improvement?</h2><p>Again, very many banks do actually make home improvement loans available. But they&#x2019;re not wonderful loans for the banks.</p><p>We&#x2019;ll begin with the somewhat awkward dollar amount: a home improvement loan is enough money to hurt if it goes bad, but not enough money to justify a high-volume well-oiled machine to underwrite, not like e.g. mortgages. And indeed that is what many banks will immediately try to sell you if you ask for a loan for the purpose of home improvement: can we instead counterpropose a home equity line of credit (HELOC)? You can then borrow against your existing home equity, withdrawing cash, and <em>we have no objection to you swapping cash for a window, a decision we need hear no more about</em>. We have a <a href=\"https://www.bitsaboutmoney.com/archive/mortgages-are-a-manufactured-product/\">supply chain for mortgages</a>, including HELOCs, and this supply chain will decrease our capital requirements while smoothing every part of underwriting.</p><p>Why does the bank want to take the window out of the window purchase? Because a home improvement loan otherwise requires multiple operationally intensive document reviews and conversations where bankers talk to construction company office managers. Those conversations are frequently unhappy ones.</p><p>Consider the case where a construction project flies off the rails, which has been known to happen. The window company says it has installed the windows, and potentially they have a certificate proving that they were indeed installed, allegedly signed by the homeowner or their spouse on the date of installation. The homeowner, however, is unhappy with the windows: they are drafty; the color isn&#x2019;t the same as the brochure; and goodness was this what they agreed to pay e.g. $25,000 for?! They don&#x2019;t want to pay it anymore.</p><p>The bank must be the adult in this scenario, to release that second milestone payment. They very possibly could be drawn into litigation over their decision, because a few tens of thousands of dollars is <em>just enough</em> to justify calling a lawyer. Then the bank will have to have their own lawyers defend their own contracts in an expensive proposition over what is, to it, a small-dollar loan.</p><p>It&#x2019;s not nearly this hard to generate $25,000 of balances with a credit card issuing business. You mail out the cards and people buy airplane tickets. And <em>then the airline pays you 200 basis points off the top</em> even before you get to originate the high-interest loan! Great business to be in and you never have to talk about a stewardess spilling someone&#x2019;s drink or it raining in Hawaii that week.</p><p>Meanwhile, the window installer has their own complaints about this loan, even before it is originated. Between the day the salesman shakes hands with the customer and the bank commits to the installation, they have <em>very little they can do to influence success</em>. The homeowner might develop buyer&#x2019;s remorse and, while they might have signed a contract, it&#x2019;s just rough to compel payment for windows which don&#x2019;t exist yet. Your staff will not enjoy the process, your reviews will suffer, and it&#x2019;s not guaranteed that your contract will hold up: in some states, your customer might even have legal right to sever during a cooling-off period. You would <em>prefer to accelerate delivery</em> to avoid them cooling on the idea of windows.</p><p>But the bank is slow and has a bespoke underwriting process which requires information from you but which you cannot control, because the <em>window installer is not the bank&#x2019;s customer</em>. They can&#x2019;t call the bank up and yell at the underwriters to move faster, and they can&#x2019;t debate the bank over a credit decision, where a perfectly good sale gets nixed six weeks later because the bank just isn&#x2019;t feeling it. Very few of those sales will result in the buyer arranging successful alternative financing, partly for very human reasons and partly for a mechanical one: the fact of the hard pull on the credit report for the original loan origination plus non-issuance of a loan from one&#x2019;s home financial institution signals to the rest of the world &#x201c;Oh goodness there are probably better ex-ante risks in the economy than this one!&#x201d;</p><p>No, what the window installer wants is a lending product which can be issued at scale, very predictably, in as short a timeframe as possible, by financial institutions responsive to it who ask very few followup questions, always fund milestone payments promptly, and actually want this business.</p><p>That product exists.</p><h2 id=\"modern-installment-loan-origination-as-a-service\">Modern installment loan origination as a service</h2><p>Consumer credit issuance is, unless it comes directly from a manufacturer, a privilege reserved by law for regulated financial institutions. But, as we&#x2019;ve established, regulated financial institutions don&#x2019;t lust for this business on their own balance sheets at scale. (Recharacterizing the home improvement loan as a draw on a HELOC allows the bank to quickly get it off their balance sheet, because the HELOCs will generally be securitized. You could theoretically securitize a large pool of installment loans if you had a business process to generate them, but unless a bank specializes, they are unlikely to have core depositors simply ask for enough of these every year to justify building out the framework required to do this.)</p><p>Why is it reserved by law for financial institutions? As Bits about Money mentions often, financial institutions are a policy arm, and one thing the state requires is that Compliance make sure the financial institution is not abusing customers. The state believes that a e.g. window installer might use high-pressure sales tactics or say untrue things to a homeowner about how e.g. an interest-free financing period works, and then perhaps forget about those things when the customer complains. It believes, <em>rationally</em>, that financial institutions will keep extensive records of what they communicate about loans, that those records will be <em>truthful by default</em>, and that the financial institution will not endanger its permission to do business over a single product. Also, and this is a blunt but true observation, the state trusts white collar employees and executives at banks more than it trusts blue collar window installers.</p><p>So we need a bank <em>involved</em>, but that bank does not necessarily need to <em>lend</em> (from its own balance sheet). The bank could immediately sell a large portion of the loan, retaining perhaps 1% for form&#x2019;s sake, to a private provider of capital.</p><p>But, again, it is unlikely that a bank will want to call around to hedge funds and see if there are any takers. Someone needs to have capital providers have a standing offer to snap at this product quickly.</p><p>That standing offer is variously called a forward funds flow agreement or warehouse financing. I&#x2019;ve previously discussed the <a href=\"https://www.bitsaboutmoney.com/archive/buy-now-pay-later/\">mechanics for Buy Now Pay Later</a> (BNPL), and they&#x2019;re the same here. Someone, typically a facilitator and not the bank itself, has brought the capital partners to the table, negotiated terms, and has prepared them to receive what they want: millions of dollars of loans, at attractive prices, with known-in-advance credit characteristics&#x2026; originated by a massively scalable process, conducted partly by commission-earning sales reps bearing iPads into houses needing windows and partly by web applications and operational teams.</p><p>This machinery wasn&#x2019;t originally perfected for windows. It was originally aimed mostly at solar installations, which were heavily tax-advantaged at the time. Capturing the tax credit required a sale and upfront capital outlay, and the pitch was <em>essentially</em> &#x201c;Sign these loan docs for free money for all of us and, also, you&#x2019;ll get some solar panels.&#x201d; But the credits eventually expired, the addressable market for solar got more tapped, and the software and companies yearned for more originations. So, sign these documents, get windows at attractive prices.</p><p>The loan application begins with the customer verbally informing the salesman of their phone number or email address. They get given a link which swiftly brings them to a competently-designed web application. That application asks a few simple questions that are required for underwriting. The two most important ones that are not on a credit card application are &#x201c;Is this <em>your</em> house?&#x201d; and &#x201c;Do you <em>live in</em> this house?&#x201d; This is because the capital partners are much, much more confident that people will not welch on debts tied to their primary residence than that every real estate investor will be above water if 2008 happens again.</p><p>Questions about your finances are extremely pro-forma. You&#x2019;ll be asked to self-state your income, but no attempt will be made to verify it. A credit report will be pulled, which satisfies the twin purposes of a) derisking the applicant pool and b) verifying, via checking for the presence of a mortgage, that you do actually own the house.</p><p>I ended up in a fraud queue at this point in the process. Story of my life. The facilitating company does not expose to the sales rep why you are in the fraud queue, but <em>the clock is ticking</em>, and the rep will (hypothetically) strongly prefer continuing to drink tea and chitchat rather than leaving and letting one resolve that issue asynchronously. It was resolved by a combination of automated submission of a passport photo (again, <em>shockingly</em> competent software by the historical standards of loan origination) and an analyst manually clicking a button in a web application.</p><p>If I were to speculate what that analyst was doing, it would be reviewing the facts: credit report says high credit score, credit report shows a mortgage, credit report does not match this address, but government-provided ID does match the asserted identity. And thus the wager: is he in his own house, or has he decided to pull a hilarious prank on a window installer and buy someone else windows with a hedge fund&#x2019;s money? The analyst swiftly concluded I was probably in my own house. (Why did I end up in the fraud queue? I have a lot of weirdness, such as not being listed on the deed due to holding title through a <a href=\"https://www.bitsaboutmoney.com/archive/working-title-insurance/\">land trust</a>, for privacy reasons. Unfortunately, perhaps that sometimes makes it difficult for cron jobs to conclude I own the house.)</p><p>Once you&#x2019;re approved for the loan, you are automatically sent loan documents for signature. This will not be <em>compelled</em> at the meeting, but the installer <em>sure would appreciate</em> you signing before they leave. Compliance has extensively briefed them on where the line is. Compliance has, in fact, extensively briefed them on <em>many</em> lines, and because Compliance cares more about the law than it does about paying programmers to code a login form, I was able to read their entire Compliance training series and presentations to installers.</p><p>Don&#x2019;t lie. Don&#x2019;t translate any loan docs from English or provide any gloss of the terms. Don&#x2019;t say any of the forbidden phrases like &#x201c;guaranteed approval&#x201d;, &#x201c;same-as-cash financing&#x201d;, &#x201c;interest-free financing&#x201d;, etc. And definitely definitely <em>do not touch their phone or computer during the application process</em>.</p><p>The financial industry learned some things during the global financial crisis about aggressive salesmanship by its agents. Almost every bullet point in that 40 page PowerPoint has a stack of criminal convictions, billions of dollars of losses, or both to justify it.</p><h2 id=\"what%E2%80%99s-the-actual-product-offered\">What&#x2019;s the actual product offered?</h2><p>The salesman will first quote a scary number designed to anchor you, then present the discount available if you commit within a month. They will then say there is a sweetener if and only if you sign before they leave. Compliance is very clear that if you say that in the context of acting as an agent for a financial institution it <em>had better not be a lie</em>, but percentages are percentages and window companies like making deals for windows, and I would not bet against the proposition that they would offer other inducements on other days for other reasons, perhaps summing to similar numbers.</p><p>They then present financing terms. I was pleasantly surprised that this was not presented in the typical obfuscating <a href=\"https://www.consumerreports.org/cars/buying-a-car/beat-four-square-and-other-car-dealership-sales-tactics-a7590220303/\">car dealer financing four square method</a>. The real price stays onscreen on the iPad at all times and you are presented with columns for choices: pay cash (they mean immediately deliverable value, not actually specie), 12-month deferred interest financing, 15-year fixed rate financing, and pay in milestones (e.g. 50% deposit, 50% due on installation) on a credit card.</p><p>Compliance will inform representatives that you are absolutely not supposed to use the words &#x201c;same as cash&#x201d; and &#x201c;interest-free&#x201d; to describe 12 month deferred interest financing. This salaryman is unfortunately forgetful sometimes and so I cannot quite recall what the friendly local salesman actually said while pointing to the iPad. The offer is &#x201c;If you fully pay for your windows within the next 12 months, you just pay the sticker price. If it takes you longer than that, you will pay us interest, starting from the date of installation, at a rate which is <em>materially higher</em> than the rate we quote in the next column.&#x201d;</p><p>You might think, given that sketch, that the system is trying to trick naive homeowners and surprise them on day 366 with a nasty bill. I&#x2019;m <em>slightly</em> more sympathetic. This offer is designed to be attractive to people who can bring their own financing <em>without making the window installation dependent on that financing</em>. If, for example, a customer does not currently have a HELOC, but is pretty sure they can get a HELOC, the window installer is saying &#x201c;Great, convince any bank to give you a HELOC, then do a draw any time in the next year and repay us, and we&#x2019;ll foot the interest until then. But <em>to be clear</em> this window is going in irrespective of your future discussions with banks. Our capital partners do not want you to attempt to skate if your financing falls through, if you get divorced, if your tax refund is smaller than expected, etc, and you will be penalized if you attempt to turn this into a backdoor installment loan.&#x201d;&#xa0;</p><p>But the next column is where the real action is. I was quoted 6.99% APR for equal amortizing payments over 15 years. They, naturally, express this as a monthly number, but the contract floridly and in bold print (as required by regulations) discloses e.g. total interest cost over the life of the loan, the fact there is no pre-payment penalty, etc. This is as honest as consumer lending can possibly be.</p><p>You e-sign the loan documents and then the salesman thanks you for your time and arranges for another professional to come back and redundantly measure the windows. He measured for the quote, and the quote is good, but they&#x2019;ll measure again because a quarter inch matters a lot more for the physical universe than it does for the spreadsheet. Then the order goes to the factory and, a few weeks later, they install the windows. You sign an acknowledgement, and then the automated software springs back into action, starting the clock on your interest and collecting payments.</p><h2 id=\"how-does-this-pie-get-divvied-up\">How does this pie get divvied up?</h2><p><strong>Here I am going to speculate in reliance upon publicly available data sources rather than use information which I know as a result of private commercial negotiations. </strong>Window salesmen are not the only professionals who have been to Compliance training.</p><p>In the 15-minute window between the loan being applied for and signed, software has conducted a four-way commercial negotiation between the window installer, the facilitating entity, the bank, and the capital provider. The loan contract is between the customer and the bank (again, it has to be, regs) but the capital provider is a specialist institution.</p><p>There are a few banks which specialize in doing business like this. One of them is <a href=\"https://www.crossriver.com/solutions/digital-lenders\">Cross River Bank</a>, which keeps a <a href=\"https://www.crossriver.com/insights/q4-2024-consumer-lending\">keen eye</a> on trends in consumer lending.</p><p>A bank which originates a loan might charge the facilitating entity an upfront fee-for-services, collect a servicing fee from the capital providers sliced out of the APR quoted to the customer, and of course retains actual economic interest in the loan&#x2026; well, OK, a few hundred dollars of the loan, so that it can tell its regulators &#x201c;No, really, we are <em>lending money</em>! It would be calumny to describe this situation as <a href=\"https://sites.duke.edu/thefinregblog/2020/01/23/the-rise-of-rent-a-charter-examining-new-risks-behind-bank-fintech-partnerships/\">renting out a banking license</a>!&#x201d; Indicatively, that fee for services might look something like 1% of total loan volume, and the servicing fee might be 1% of the outstanding balance annually. (Mortgage servicing fees are <a href=\"https://www.congress.gov/crs-product/R48713\">about 0.25%</a> but houses cost more than windows do and so you get an economy of scale. The servicing is <em>essentially</em> the same amount of work: you need a 1-800 number, lawyers on standby, the capability to receive checks, etc.)</p><p>So who is the capital provider and what are they getting? It will generally be a specialist fund, like say <a href=\"https://sunlightfinancial.com/\">Sunlight Financial</a>, whose name alludes to the solar business they got started in. You might naively assume &#x201c;OK, 6.99% to the consumer, 1% servicing fee to the bank, so they get 5.99% APR on the loan, right?&#x201d; <em>I doubt that is the full calculation</em>.</p><p>One reason is that loan sounds awfully cheap: the 10 year Treasury rate is currently a hair over 4%, so why would you give a consumer 15 years fixed rate financing for 6%? Even with excellent credit quality, 2% spread doesn&#x2019;t sound like enough money to make a business out of this.</p><p>But: what if, like BNPLs, you could charge someone else a bit of money? Who benefits the most from this transaction? <em>The window installer</em>. So charge them for it. They&#x2019;re clearly willing to pay something like 2.4% of the entire transaction size already, because they will happily let you buy windows with a credit card. So that&#x2019;s the floor. A BNPL provider can charge Sephora something like 6% to sell lip gloss. That might be the ceiling. So can you get them to kick in&#x2026; 5%? Probably.</p><p>That moves the APR as perceived by the lender to about 7.9%. (Ask Python or Excel if you don&#x2019;t believe me.) It&#x2019;s a bit better than this, too, because of what will happen to the fund if interest rates fall. The value of outstanding bonds increases if rates fall, <em>but</em> this consumer loan might get rolled into e.g. a newly cheap HELOC if rates fall. (The free no-penalty prepayment option is a <a href=\"https://byrnehobart.medium.com/the-30-year-mortgage-is-an-intrinsically-toxic-product-200c901746a\">fundamental challenge in mortgage finance</a>.) So by default this is a lose-lose situation for the lender: if rates rise the value of the loan falls, if rates fall the loan very possibly gets repaid early. But with the origination fee from the installer, if rates fall and the loan is repaid early, <em>the return on capital over the lifetime of the loan rises sharply</em>.</p><p>If the loan is repaid after 7 years, which is approximately the average tenure in a house in the U.S., the real rate is about 8.15%. If it&#x2019;s extinguished after a year, perhaps due to rates-related refinancing, about 12%.</p><p>These numbers start to sound attractive to credit funds, particularly when you have a repeatable process for generating them at 9 figure scales with independent credit quality.</p><p>As an additional wrinkle: is Sunlight the ultimate source of capital at risk? Well, if I were Sunlight, I might think of tapping the booming private credit market: borrow at a lower rate than I earn in expectation on my portfolio, collect the spread. If I were Apollo (such a natural brand to associate with sunlight, and among the world&#x2019;s largest credit funds), I might <a href=\"https://www.reuters.com/markets/europe/luxembourgs-reinet-advanced-talks-sale-uk-insurer-stake-athora-2025-07-03/\">buy an insurer</a> or <a href=\"https://www.bloomberg.com/news/articles/2025-10-02/private-credit-gets-creative-as-fundraises-take-longer-than-ever\">figure out how to get retail investors private credit exposure</a> to fund billions of dollars to anyone who creates a loan origination engine with demonstrable credit quality.</p><p>For much more on that side of things, you should read Money Stuff or listen to Odd Lots, which cover &#x201c;private credit is the new bank lending&#x201d; all the time. I&#x2019;m just presenting the <em>speculative</em> case for how private credit turns permanent capital vehicles into windows.</p><h2 id=\"is-this-unsecured-lending\">Is this unsecured lending?</h2><p>Compliance will tell you not to describe this as unsecured lending to the customer. I am so forgetful as to offhand comments made during sales presentations, though.</p><p>Formally, the lender does have a security interest. However, they do not want to go to the trouble of &#x201c;dirtying the title&#x201d; by getting a lien on the house. That can&#x2019;t be done in 15 minutes. No, they only have a security interest in the window they financed.</p><p>A security interest in a car is valuable because people are quite attached to their cars and, if push comes to shove, you can repossess a car. A security interest in a house is valuable because people are quite attached to their homes and, if push comes to shove, you can foreclose on a mortgage and repossess the home. A security interest in a window is valuable because&#x2026; a security interest in a window is actually not valuable.</p><p><em>However</em>, by construction, the commanding majority of borrowers here have excellent credit. One factor decreasing their credit risk is that many consumers are, and this is an underwriting term of art, &#x201c;judgement proof.&#x201d; If you sue them for performance and a court gives you a judgement, that is worth the paper it is printed on, because they have no easily attachable assets and they might have employment in a <a href=\"https://blog.ted.com/system-d-the-informal-economy-robert-neuwirth-at-tedglobal-2012/\">System D</a> fashion where garnishing their income is difficult.</p><p>A homeowner, on the other hand, always has one asset you can attach: the house, by filing a lien on it <em>after receiving the judgement</em>. A lien against a house is <em>an immediately monetizable asset</em> in the United States, because it blocks the sale of the house until it is satisfied, and there is a specialized financial ecosystem which is happy to buy that lien and then attempt collection by some combination of a) asking nicely and then in the alternative b) waiting patiently.</p><p>And so the lender&#x2019;s contract is, to the extent it is concerned with credit risk, concerned with swiftly demonstrating to a court: valid contract, loan paid for windows, customer isn&#x2019;t paying, issue us judgement, thank you very much, we&#x2019;d like to file that judgement as a lien against coincidentally the same house. It&#x2019;s only fair.</p><h2 id=\"should-we-be-happy-this-rube-goldberg-machine-exists\">Should we be happy this Rube Goldberg machine exists?</h2><p>Nice new windows are better than broken ones, and the process of buying them is now painless at an attractive financing cost. They are still expensive, but homes are expensive.</p><p>Every time anyone mentions innovation in consumer lending, the same comment is made: isn&#x2019;t this just the financial crisis all over again? Aren&#x2019;t we stacking up billions of dollars of low-quality loans with intermediating layers of complex products like CDO-squared? Isn&#x2019;t this going to blow up?</p><p>That&#x2019;s an understandable point of view. But: there is an <em>actual underwriting process</em> here. We replaced &#x201c;You write a lie on paper, no one reads it&#x201d; with a computer program that never gets bored at comparing databases. The borrower is actually <em>reasonably good</em> credit quality, rather than a ninja (&#x201c;no income, no job&#x201d;; one of the subprime lending era excesses was writing NINJA loans in quantity).&#xa0;</p><p>If the installer successfully leans on the origination machine to lower underwriting standards and let anyone who can fog a window buy one with a smile, then the losses are largely not in the regulated banking sector and backstoppable by taxpayers. They&#x2019;re mostly to sophisticated investors in credit funds, who are being paid handsomely to take that risk. The system is also self-correcting: early defaults would cause the credit funds to tighten their risk appetites and constrain originations fairly quickly, rather than encouraging refinancing to juice origination numbers, until we were all holding (to quote Margin Call) the biggest bag of odorous excrement ever assembled in the history of capitalism.</p><p>Besides, if credit quality keeps you up at night, you should be much more concerned about bog-standard commercial real estate loans.</p>"
            ],
            "link": "https://www.bitsaboutmoney.com/archive/window-modern-loan-origination/",
            "publishedAt": "2025-10-10",
            "source": "Bits About Money",
            "summary": "<img alt=\"A window into modern loan origination\" src=\"https://www.bitsaboutmoney.com/content/images/2025/10/Window-Installation-with-Digital-Financing.png\" /><p>The ultimate goal of financial plumbing is to enable commerce in the real economy. Consider the humble window: it is a fairly expensive, surprisingly high-tech manufactured good, installed by the dozen in homes by artisans. A window represents a supply chain, and one part of that supply chain is a sales process, convincing a homeowner of the desirability of updating their windows. The sales representative running that process would urgently prefer to leave their single visit to the home with not just tentative measurements but with a durable commitment to buying the window and financing firmly in place for it.</p><p>Why finance the purchase? Windows cost $1,000 to $3,000 each and updating all or a large fraction of them quickly becomes a mid-five figures project; relatively few homeowners will pay upfront with cash. Moreover, the sales process would <em>strongly prefer</em> the purchase be financeable, because that will sell more windows than a counterfactual world where windows were only available for cash.</p><p>One could imagine a world in which window manufacturers or installers provided financing off of their own balance sheets. This would be a rough world for them: they have upfront capital outlay (the",
            "title": "A window into modern loan origination"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/three-ways-formally-verified-code-can-go-wrong-in/",
            "publishedAt": "2025-10-10",
            "source": "Hillel Wayne",
            "summary": "<h3>New Logic for Programmers Release!</h3> <p><a href=\"https://leanpub.com/logic/\" target=\"_blank\">v0.12 is now available</a>! This should be the last major content release. The next few months are going to be technical review, copyediting and polishing, with a hopeful 1.0 release in March. <a href=\"https://github.com/logicforprogrammers/book-assets/blob/master/CHANGELOG.md\" target=\"_blank\">Full release notes here</a>. </p> <p><img alt=\"Cover of the boooooook\" class=\"newsletter-image\" src=\"https://assets.buttondown.email/images/92b4a35d-2bdd-416a-92c7-15ff42b49d8d.jpg?w=960&amp;fit=max\" /></p> <p class=\"empty-line\" style=\"height: 16px; margin: 0px !important;\"></p> <h1>Three ways formally verified code can go wrong in practice</h1> <p>I run this small project called <a href=\"https://github.com/hwayne/lets-prove-leftpad\" target=\"_blank\">Let's Prove Leftpad</a>, where people submit formally verified proofs of the <a href=\"https://en.wikipedia.org/wiki/Npm_left-pad_incident\" target=\"_blank\">eponymous meme</a>. Recently I read <a href=\"https://lukeplant.me.uk/blog/posts/breaking-provably-correct-leftpad/\" target=\"_blank\">Breaking “provably correct” Leftpad</a>, which argued that most (if not all) of the provably correct leftpads have bugs! The lean proof, for example, <em>should</em> render <code>leftpad('-', 9, אֳֽ֑)</code> as <code>---------אֳֽ֑</code>, but actually does <code>------אֳֽ֑</code>.</p> <p>You can read the article for a good explanation of why this goes wrong (Unicode). The actual problem is that correct can mean two different things, and this leads to confusion about how much formal methods can actually guarantee us. So I see this as a great opportunity to talk about the nature of proof, correctness, and how \"correct\" code can still have bugs.</p> <h2>What we talk",
            "title": "Three ways formally verified code can go wrong in practice"
        },
        {
            "content": [],
            "link": "https://interconnected.org/home/2025/10/10/parables",
            "publishedAt": "2025-10-10",
            "source": "Matt Webb",
            "summary": "<div> <p>When I was at uni I went with some friends into a cellar with a druid to experience his home-made 6 foot tall light-strobing monolith, what I now know was a type of <a href=\"https://en.wikipedia.org/wiki/Dreamachine\">Dreammachine</a>, which was a pair of stacked out-of-sync strobing lights so bright that it makes the receptors in your eyes produce concentric circles of moving colour even with your eyelids tight shut.</p> <p>His performance of changing and interconnected strobe frequencies, which he had composed specially for my friend’s birthday, was exciting but also pretty overwhelming and long story short it made me puke.</p> <hr /> <p>Another story.</p> <p>When I was a teenager there was a guy in our circle who - and I don’t know how this came up and apologies in advance for the image - when we were discussing what your poo might feel like, because truthfully you don’t know right, it’s there at the bottom of the water in the loo and you see it and can imagine the feeling it of but you don’t know with the actual sensory accuracy of your hands - he said he did know, and when we asked he continued that he had wondered once, so",
            "title": "Parables involving gross bodily functions"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/10/10/style/modern-love-negotiating-the-end-of-us.html",
            "publishedAt": "2025-10-10",
            "source": "Modern Love - NYT",
            "summary": "My husband kept saying he was going to die at a young age, but we could never agree on an acceptable number.",
            "title": "Negotiating the End of Us"
        },
        {
            "content": [
                "<p>The following three things can&#8217;t all be true simultaneously:</p><ol><li><p>Many Americans are fascists</p></li><li><p>Fascists are an acceptable target for political violence</p></li><li><p>Political violence in America is morally unacceptable (at the current time)</p></li></ol><p>I thought about this while following <a href=\"https://www.the-independent.com/news/world/americas/us-politics/stephen-miller-fascist-gavin-newsom-b2837158.html\">the Twitter spat</a> between Democratic hopeful Gavin Newsom and Trump advisor Stephen Miller. Newsom called Miller fascist; Miller accused this of being a call to violence which placed &#8220;a target&#8221; on him.</p><p>Miller is hardly sympathetic here - <a href=\"https://www.the-independent.com/news/world/americas/us-politics/stephen-miller-fascist-gavin-newsom-b2837158.html\">he&#8217;s called people fascist himself in the past</a>, and later suggested Newsom <a href=\"https://www.msn.com/en-us/tv/celebrity/maga-lawmaker-calls-for-gavin-newsom-s-arrest-after-calling-miller-a-fascist/ar-AA1NtvTJ\">should be arrested</a> for his speech (if only there were a word to describe the sort of person who supports that kind of thing&#8230;)</p><p>Still, I found myself able to see things from both perspectives.</p><p>From Newsom&#8217;s perspective: Miller subscribes to some type of far-right nationalism. And fascism is a type of far-right nationalism. Whether or not these are the exact same type of far-right nationalism is a taxonomic argument, much like whether some particular long slimy toothy fish should be classified as an eel. Not every long slimy toothy fish is <em>necessarily</em> an eel, but it seems unwise to pre-emptively rule out the possibility.</p><p>From Miller&#8217;s perspective: people absolutely use &#8220;fascist&#8221; as a synonym for &#8220;person who it is acceptable to hurt because of their politics&#8221;. The signature of a mod on a bulletin board I used to frequent - back in the days of bulletin boards, mods, and signatures - was &#8220;If I can shoot rabbits, then I can shoot fascists&#8221; - an apocryphal Spanish Civil War quote <a href=\"https://en.wikipedia.org/wiki/If_You_Tolerate_This_Your_Children_Will_Be_Next\">popularized by a hit rock song</a>. A popular left-wing t-shirt, cap, and protest sign is &#8220;Make Fascists Afraid Again&#8221;.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!pH8v!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3e5a7df7-9f93-4aad-a9f7-04974b390c6c_2048x2048.avif\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"434\" src=\"https://substackcdn.com/image/fetch/$s_!pH8v!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3e5a7df7-9f93-4aad-a9f7-04974b390c6c_2048x2048.avif\" width=\"434\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">From the clenched fist, I gather that they&#8217;re not just afraid of losing elections.</figcaption></figure></div><p>When Woodie Guthrie famously wrote on his guitar that <a href=\"https://en.wikipedia.org/wiki/This_machine_kills_fascists\">&#8220;This machine kills fascists&#8221;</a> - a sentiment <a href=\"https://en.wikipedia.org/wiki/This_machine_kills_fascists\">imitated and snowcloned</a> by later generations of musicians and commentators - nobody worried this was a bad thing. Nobody demanded that somebody stop the machine before it killed again.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!UmUx!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6877979c-dab1-4c0a-80c9-213cc3f8e305_1280x1181.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"407.8140625\" src=\"https://substackcdn.com/image/fetch/$s_!UmUx!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6877979c-dab1-4c0a-80c9-213cc3f8e305_1280x1181.jpeg\" width=\"442\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">If Anyone Builds It (Woody Guthrie&#8217;s guitar), Everyone (fascists) Dies.</figcaption></figure></div><p>There&#8217;s no number of examples I could give which would absolutely prove I&#8217;m not cherry-picking. But I think it&#8217;s suggestive that <a href=\"https://www.reddit.com/r/DebateCommunism/comments/vizfto/just_kill_fascists/\">even people who argue against casually killing fascists</a> have to disclaim that they&#8217;re certainly not opposing <em>all</em> violence against fascists - just against jumping straight to murder before other forms of violence have been tried. Besides that, I can only appeal to a hope that you&#8217;ve experienced the same cultural currents that I have, and that this seems obviously true to you. </p><p>I&#8217;m not trying to normalize fascism, or claim that it isn&#8217;t extremely evil (I think it is, <a href=\"https://www.astralcodexten.com/p/dictator-book-club-mussolini-on-fascism\">see here for more</a>). I&#8217;m only saying, again, as a matter of basic logic, that the following things can&#8217;t all be true:</p><ol><li><p>Many Americans are fascists</p></li><li><p>Fascists are an acceptable target for political violence</p></li><li><p>Political violence in America is morally unacceptable (at the current time)</p></li></ol><p>And I don&#8217;t want to abandon 1, because it seems like a factual claim that might be true - even if you don&#8217;t think it&#8217;s true now, it obviously has the potential to be true in the future - and <a href=\"https://slatestarcodex.com/2017/10/23/kolmogorov-complicity-and-the-parable-of-lightning/\">we shouldn&#8217;t ban people from asserting true claims</a>. </p><p>And I don&#8217;t want to abandon 3, because political violence is extremely bad, the norm against it is the only thing restraining us from various forms of smoldering or overt civil war, and we&#8217;re still doing pretty well by the standards of most times and places.</p><p>So I think the natural conclusion is to abandon 2. Fascists, although evil, aren&#8217;t automatically a legitimate target for political violence.</p><p>The strongest objection is a slippery slope argument: political violence will always be inconvenient; it will always be tempting to put it off until some further red line is crossed. But if we always give into that impulse, nobody will ever resist dictatorship or start a revolution against an unjust government. Isn&#8217;t the tree of liberty naturally &#8220;fertilized with the blood of tyrants&#8221;?</p><p>There&#8217;s no simple answer to this concern. Nicholas Decker, <a href=\"https://nicholasdecker.substack.com/p/when-must-we-kill-them\">who considers this question more thoughtfully than most</a>, concludes that:</p><blockquote><p>Your threshold may differ from mine, but you must have one. If the present administration should cancel elections; if it should engage in fraud in the electoral process; if it should suppress the speech of its opponents, and jail its political adversaries; if it ignores the will of Congress; if it should directly spurn the orders of the court; all these are reasons for revolution. It may be best to stave off, and wait for elections to throw out this scourge; but if it should threaten the ability to remove it, we shall have no choice.</p></blockquote><p>But all of these are their own sorts of slippery slopes. Suppress the speech of their opponents? Should the Republicans have started a civil war when Democrats got social media to do woke content moderation? Ignore the will of Congress? Should Democrats have started a civil war when Trump refused to fund PEPFAR even after Congress allocated the money? Prosecute political opponents? Should the Republicans have started a civil war when New York prosecuted Trump for Stormy Daniels? Should the Democrats start one now that Trump is prosecuting James Comey for perjury? No particular form of any of these things ever feels like the <em>cosmically significant</em> version of these things where assassinations and armed uprisings become acceptable. But would-be dictators are masters of boundary-pushing and frog-boiling; there&#8217;s almost never one moment when they say outright &#8220;Today I will be cancelling democracy for no reason, sorry&#8221;.</p><p>I used to think that my bright line was contempt of the Supreme Court - when a leader echoes Andrew Jackson&#8217;s boast that &#8220;[the Court] has made its decision, now let them enforce it&#8221;. But the Trump administration briefly seemed to consider defying a Supreme Court order in the Kilmar Abrego Garcia case. In the end, they didn&#8217;t actually defy the order. And they were being subtle: less Jacksonian swagger, more special pleading about reasons why they thought the ruling didn&#8217;t mean what we thought it meant. But if they had actually defied the order - while still doing their best to maintain plausible deniability - would I have resorted to violence, or even felt in an abstract way that &#8220;it was time&#8221; for violence? I can&#8217;t imagine this would have felt convincing at the time.</p><p>Is violence justified when we get to FDR-level court packing threats? When we get to Orban? To Chavez? To Xi? To Putin? To Hitler? To Pol Pot? I think I land somewhere between Orban and Hitler, but I can&#8217;t say for sure, nor can I operationalize the distinction. And the last person to think about these questions in too much detail got a (mercifully polite) <a href=\"https://www.salon.com/2025/04/26/a-college-student-wrote-a-blog-about-tyrants-the-secret-had-questions/\">visit from the Secret Service</a>, and even if we disagree with him it&#8217;s poor practice to hold a debate where it&#8217;s impermissible to assert one side. I will be punting on the deep cosmic question here, at least publicly.</p><p>But I don&#8217;t think the answer can be &#8220;violence is permissible when you can classify someone with a loaded term so vague that <a href=\"https://x.com/kane/status/1976060207353729059\">people regularly use it to describe</a> expedited restaurant permitting&#8221;. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!mfnS!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fce13d0b6-5ff7-44aa-99e0-4a4641570b33_529x911.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"756.0094517958412\" src=\"https://substackcdn.com/image/fetch/$s_!mfnS!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fce13d0b6-5ff7-44aa-99e0-4a4641570b33_529x911.png\" width=\"439\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>So as a bare minimum, I think people should reject premise (2) above and stop talking about fascists as if it&#8217;s okay to kill them. I don&#8217;t think this implies support for fascism, any more than saying that you shouldn&#8217;t kill communists implies support for communism. They&#8217;re both evil ideologies which are bad and which we should work hard to keep out of America - but which don&#8217;t, in and of themselves, justify killing the host.</p><p>What about going beyond the minimum? If fascist denotatively means &#8220;far-right nationalist authoritarian corporatist&#8221;, but connotatively &#8220;person whom it is okay to kill&#8221;, and we personally try not to worsen the connotation but other people still have that association, then should we avoid using it at all? Or is it permissible to still use it for its denotative meaning?</p><p>Few people use fascism in a purely innocent denotative way; if they did, it would serve their purposes equally well to replace it with a synonym (like &#8220;far-right nationalist authoritarian corporatist&#8221;) or even a more specific subvariety (like &#8220;Francoist&#8221;). But it wouldn&#8217;t serve Gavin Newsom&#8217;s purpose to call Stephen Miller a far-right nationalist authoritarian corporatist, because Gavin Newsom specifically cares about the negative connotation of &#8220;fascist&#8221;, rather than its meaning. I trust he&#8217;s relying on some sort of weaker negative connotation, like &#8220;far-right nationalist etc who is a bad person&#8221;, rather than going all the way to &#8220;far-right nationalist etc who it&#8217;s acceptable to kill&#8221; - but it&#8217;s connotations all the way down. This isn&#8217;t necessarily bad - maybe you need <em>some</em> connotations to make a rhetorical case exciting enough to influence anyone besides a few political philosophers. But against this, most people who say &#8220;communist&#8221; would be happy enough to replace it with some applicable superset/subset/near-synonym, like Marxist, socialist, anticapitalist, far-leftist, Maoist, etc - and people seem to argue against communism just fine.</p><p>I think it&#8217;s probably bad practice to demand that reasonable people not use the word &#8220;fascist&#8221;. It risks giving unreasonable people a heckler&#8217;s veto over every useful term - if some moron says it&#8217;s okay to kill environmentalists, we can&#8217;t ban the term &#8220;environmentalist&#8221;, and we certainly can&#8217;t <em>let other people back us into</em> banning the term &#8220;environmentalist&#8221; when it&#8217;s convenient for them just because they can find one violent loon. It also risks giving too much quarter to the dangerous and wrongheaded &#8220;stochastic terrorism&#8221; framing, which places the blame for violence on anyone who criticized the victim. This not only chills useful speech - it&#8217;s important to protect the right to accuse people of being very bad, since people are often in fact very bad - but gives Power a big spiky club it can use one-sidedly to destroy anyone who criticizes it as soon as there&#8217;s a sympathetic case of violence.</p><p>Still, as an entirely supererogatory matter, I personally won&#8217;t be using this word when I can avoid it.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/fascism-cant-mean-both-a-specific",
            "publishedAt": "2025-10-10",
            "source": "SlateStarCodex",
            "summary": "<p>The following three things can&#8217;t all be true simultaneously:</p><ol><li><p>Many Americans are fascists</p></li><li><p>Fascists are an acceptable target for political violence</p></li><li><p>Political violence in America is morally unacceptable (at the current time)</p></li></ol><p>I thought about this while following <a href=\"https://www.the-independent.com/news/world/americas/us-politics/stephen-miller-fascist-gavin-newsom-b2837158.html\">the Twitter spat</a> between Democratic hopeful Gavin Newsom and Trump advisor Stephen Miller. Newsom called Miller fascist; Miller accused this of being a call to violence which placed &#8220;a target&#8221; on him.</p><p>Miller is hardly sympathetic here - <a href=\"https://www.the-independent.com/news/world/americas/us-politics/stephen-miller-fascist-gavin-newsom-b2837158.html\">he&#8217;s called people fascist himself in the past</a>, and later suggested Newsom <a href=\"https://www.msn.com/en-us/tv/celebrity/maga-lawmaker-calls-for-gavin-newsom-s-arrest-after-calling-miller-a-fascist/ar-AA1NtvTJ\">should be arrested</a> for his speech (if only there were a word to describe the sort of person who supports that kind of thing&#8230;)</p><p>Still, I found myself able to see things from both perspectives.</p><p>From Newsom&#8217;s perspective: Miller subscribes to some type of far-right nationalism. And fascism is a type of far-right nationalism. Whether or not these are the exact same type of far-right nationalism is a taxonomic argument, much like whether some particular long slimy toothy fish should be classified as an eel. Not every long slimy toothy fish is <em>necessarily</em> an eel, but it seems unwise to pre-emptively rule out the possibility.</p><p>From Miller&#8217;s perspective: people absolutely use &#8220;fascist&#8221; as a synonym for &#8220;person",
            "title": "Fascism Can't Mean Both A Specific Ideology And A Legitimate Target"
        },
        {
            "content": [
                "<p><a href=\"https://x.com/nathanbenaich/status/1976160269153038712\">The 2025 State of AI Report is out</a>, with lots of fun slides and a full video presentation. They’ve been consistently solid, providing a kind of outside general view.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!D1JK!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8a8ef48c-6e7c-42e9-8d5e-a031db911c39_1199x674.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://www.stateof.ai/\">I’m skipping over stuff my regular readers already know</a> that doesn’t bear repeating.</p>\n\n\n<h4 class=\"wp-block-heading\">Qwen The Fine Tune King For Now</h4>\n\n\n<blockquote><p>Nathan Benaich: Once a “Llama rip-off,” @Alibaba_Qwen now powers 40% of all new fine-tunes on @huggingface. China’s open-weights ecosystem has overtaken Meta’s, with Llama riding off into the sunset…for now.</p></blockquote>\n<p>I highlight this because the ‘for now’ is important to understand, and to note that it’s Qwen not DeepSeek. As in, models come and models go, and especially in the open model world people will switch on you on a dime. Stop worrying about lock-ins and mystical ‘tech stacks.’</p>\n<div>\n\n\n<span id=\"more-24781\"></span>\n\n\n</div>\n\n\n<h4 class=\"wp-block-heading\">Rise Of The Machines</h4>\n\n\n<blockquote><p>Robots now reason too. “Chain-of-Action” planning brings structured thought to the physical world &#8211; from AI2’s Molmo-Act to Gemini Robotics. Massive amounts of effort are thrown into the mix, expect lots of progress here…</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Model Context Protocol Wins Out</h4>\n\n\n<blockquote><p>.@AnthropicAI‘s Model Context Protocol is the new USB-C of AI. A single standard to connect models to tools, already embedded in ChatGPT, Gemini, Claude, and VS Code, has taken shape. But not without emerging security risks…</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Benchmarks Are Increasingly Not So Useful</h4>\n\n\n<p>I note this next part mostly because it shows the Different Worlds dynamic:</p>\n<blockquote><p>Nathan Benaich: The frontier fight is relentless. <a href=\"https://x.com/OpenAI\">@OpenAI</a> still tops most leaderboards, but <a href=\"https://x.com/GoogleDeepMind\">@GoogleDeepMind</a>‘s stays there longer. Timing releases has become its own science…not least informing financing rounds like clockwork.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Oh_a!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff188b4c4-cbb4-4c6e-9e51-7c0cb7b45dae_1199x687.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>They’re citing LMArena and Artificial Analysis. LMArena is dead, sir. Artificial Analysis is fine, if you had to purely go with one number, which you shouldn’t do.</p>\n\n\n<h4 class=\"wp-block-heading\">The DeepSeek Moment Was An Overreaction</h4>\n\n\n<p>Once more for the people in the back or the White House:</p>\n<blockquote><p>.@deepseek_ai “$5M training run” deep freak was overblown. Since the market realised the fineprint in the R1 paper, that’s led to Jevons paradox on steroids: lower cost per run → more runs → more compute needed, buy more NVIDIA.</p>\n<p>… China leads in power infrastructure too, adding &gt;400GW in 2024 vs 41GW for the US. Compute now clearly runs on geopolitics.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Capitalism Is Hard To Pin Down</h4>\n\n\n<p>Then we get to what I thought was the first clear error:</p>\n<blockquote><p>Now, let’s switch gears into Politics. The US Government is turning capitalist. Golden shares in US Steel, stakes in Intel and MP Materials, and revenue cuts from NVIDIA’s China sales. New-age Industrial policy?</p></blockquote>\n<p>Not capitalist. Socialist.</p>\n<p>The term for public ownership of the means of production is socialist.</p>\n<p>Unless this meant ‘the US Government centrally maximizing the interests of certain particular capitalists’ or similarly ‘the US Government is turning into one particular capitalist maximizing profits.’ In which case, I’m not the one who said that.</p>\n\n\n<h4 class=\"wp-block-heading\">The Odds Are Against Us And The Situation Is Grim</h4>\n\n\n<blockquote><p>The AI Safety Institute network has collapsed. Washington ditched attending meetings altogether, while the US and UK rebranded “safety” into “security.”</p></blockquote>\n<p>I don’t think this is fair to UK AISI, but yes the White House has essentially told anyone concerned about existential risk or seeking international coordination of any kind to, well, you know.</p>\n<blockquote><p>Moving into Safety: budgets are anemic. All 11 major US safety orgs will spend $133M in 2025…less than frontier labs burn in a day.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!p7em!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9d588210-7a73-4ca2-bafd-9a81488bb6a4_1200x692.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I like that this highlights Anthropic’s backpedaling, GDM’s waiting three weeks to give us a model card and xAI’s missing its deadline. It’s pretty grim.</p>\n<p>What I disagree with here is the idea that all of that has much to do with the Trump Administration. I don’t want to blame them for things they didn’t cause, and I think they played only a minor role in these kinds of safety failures. The rhetoric being used has shifted to placate them, but the underlying safety work wouldn’t yet be substantially different under Harris unless she’d made a major push to force that issue, well beyond what Biden was on track to do. That decision was up to the labs, and their encounters with reality.</p>\n<p>But yes, the AI safety ecosystem is tiny and poor, at risk of being outspent by one rabid industry anti-regulatory super-PAC alone unless we step things up. I have hope that things can be stepped up soon.</p>\n<blockquote><p>Cyber and alignment risks accelerate. Models can now fake alignment under supervision, and exploit code faster than humans fix it.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">They Grade Last Year’s Predictions</h4>\n\n\n<p>They then grade their predictions, scoring themselves 5/10, which is tough but fair, and made me confident I can trust their self-grading. As Sean notes they clearly could have ‘gotten away with’ claiming 7/10, although I would have docked them for trying.</p>\n<blockquote><p><a href=\"https://x.com/S_OhEigeartaigh/status/1976366008987418934\">Seán Ó hÉigeartaig</a>h: Two of the things I really appreciate is that (a) they make and review predictions each year and (b) unlike some other predictors they grade themselves HARSHLY. Several of these ‘no’s are distinctly borderline, they could have given themselves 7-8/10 and I don’t think I would have held it against them.</p></blockquote>\n<ol>\n<li>A $10B+ investment from a sovereign state into a US large AI lab invokes national security review.\n<ol>\n<li>No, although on technicalities, but also national security review hahaha.</li>\n</ol>\n</li>\n<li>An app or website created solely by someone with no coding ability will go viral (e.g. App Store Top-100).\n<ol>\n<li>Yes, Formula Bot.</li>\n</ol>\n</li>\n<li>Frontier labs implement meaningful changes to data collection practices after cases begin reaching trial.\n<ol>\n<li>Yes, Anthropic and the whole $1.5 billion fiasco.</li>\n</ol>\n</li>\n<li>Early EU AI Act implementation ends up softer than anticipated after lawmakers worry they’ve overreached.\n<ol>\n<li>No, they say, but you could definitely make a case here.</li>\n</ol>\n</li>\n<li>An open source alternative to OpenAI o1 surpasses it across a range of reasoning benchmarks.\n<ol>\n<li>Yes, r1 did this, although as stated this was an easy call.</li>\n</ol>\n</li>\n<li>Challengers fail to make any meaningful dent in NVIDIA’s market position.\n<ol>\n<li>Yes, again relatively easy call on this time frame.</li>\n</ol>\n</li>\n<li>Levels of investment in humanoids will trail off, as companies struggle to achieve product-market fit.\n<ol>\n<li>No, investment grew from $1.4b to $3b. I half-kid that spiritually this is kind of counts as a win in AI, it only doubled, that’s kind of a trail off?</li>\n<li>But no, seriously, the robots are coming.</li>\n</ol>\n</li>\n<li>Strong results from Apple’s on-device research accelerates momentum around personal on-device AI.\n<ol>\n<li>No, Apple Intelligence and their research department flopped. On device AI is definitely growing anyway.</li>\n</ol>\n</li>\n<li>A research paper generated by an AI Scientist is accepted at a major ML conference or workshop.\n<ol>\n<li>Yes, AI Scientist-v2 at an ICLR workshop.</li>\n</ol>\n</li>\n<li>A video game based around interacting with GenAI-based elements will achieve break-out status.\n<ol>\n<li>Nope. This continues to be a big area of disappointment. Not only did nothing break out, there wasn’t even anything halfway decent.</li>\n</ol>\n</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Their Predictions for 2026</h4>\n\n\n<p>Here are their predictions for 2026. These are aggressive, GPT-5-Pro thinks their expected score is only 3.1 correct. If they can hit 5/10 again I think they get kudos, and if they get 7/10 they did great.</p>\n<p>I made my probability assessments before creating Manifold markets, to avoid anchoring, and will then alter my assessment based on early trading.</p>\n<p>I felt comfortable creating those markets because I have confidence both that they will grade themselves accurately, and that LLMs will be strong enough in a year to resolve these questions reasonably. So my resolution rule was, their self-assessment wins, and if they don’t provide one I’ll feed the exact wording into Anthropic’s strongest model &#8211; ideally this should probably be best 2 out of 3 of Google, OpenAI and Anthropic, but simplicity is good.</p>\n<ol>\n<li>A major retailer reports &gt;5% of online sales from agentic checkout as AI agent advertising spend hits $5B.\n<ol>\n<li>Total advertising spending in America in 2025 was ~$420 billion.</li>\n<li>I think this is ambitious, but variance here is really high and the correlation between the two numbers is large.</li>\n<li>GPT-5-Pro says 18%, Sonnet says 8%, I think it’s more plausible than that. Maybe 25%?</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai1-a-major-retailer-reports-5-of\">Manifold says 23%</a> so that seems good.</li>\n</ol>\n</li>\n<li>A major AI lab leans back into open-sourcing frontier models to win over the current US administration.\n<ol>\n<li>GPT-5-Pro says 22%, Sonnet says 25%.</li>\n<li>I don’t see it, if this means ‘release your frontier model as an open model.’ Who? I would only count at most five labs as major, and Meta (who is pushing it in terms of counting) is already open. The only realistic option here is xAI.</li>\n<li>That goes double if you include the conditional ‘to win over the current US administration.’ There’s a lot of other considerations in such a move.</li>\n<li>Thus, I’d sell this down to 15%, but it’s hard to be too confident about Elon?</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai2-a-major-ai-lab-leans-back-int\">Manifold agreed with the AIs at 25%</a> but tends to be too high in such spots, so I still would be a seller.</li>\n</ol>\n</li>\n<li>Open-ended agents make a meaningful scientific discovery end-to-end (hypothesis, expt, iteration, paper).\n<ol>\n<li>Define ‘meaningful’ and ‘end to end’ in various ways? Always tricky.</li>\n<li>I’m actually optimistic, if we’re not going to be sticklers on details.</li>\n<li>GPT-5-Pro says 36%, Sonnet is deeply skeptical and says 15%. If I knew we had a reasonable threshold for ‘meaningful’ and we could get it turned around, I’d be on the optimistic end, but I think Sonnet is right that if you count the paper the timeline here is pretty brutal. So I’m going to go with 35%.</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai3-openended-agents-make-a-meani\">Manifold is optimistic and says 60%</a> with active trading, with Nathan Metzger noting the issue of defining a meaningful discovery and Brian Holtz noting the issue of how much assistance is allowed. I’m willing to interpret this as an optimistic take on both feasibility and what would count and go to 50%.</li>\n</ol>\n</li>\n<li>A deepfake/agent-driven cyber attack triggers the first NATO/UN emergency debate on AI security.\n<ol>\n<li>It would take really a lot to get this to trigger. Like, really a lot.</li>\n<li>There’s even an out that if something else triggers a debate first, this didn’t happen.</li>\n<li>GPT-5-Pro said 25%, Sonnet said 12% and I’m with Sonnet.</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai4-a-deepfakeagentdriven-cyber-a\">Manifold says 18%,</a> down the middle. I’m still with Sonnet.</li>\n</ol>\n</li>\n<li>A real-time generative video game becomes the year’s most-watched title on Twitch.\n<ol>\n<li>I’ll go ahead and take the no here. Too soon. Generative games are not as interesting as people think, and they’re doubling down on the 2024 mistake.</li>\n<li>GPT-5-Pro has this at 14%, Sonnet says 3%. I think Sonnet is a bit overconfident, let’s say 5%, but yeah, this has to overcome existing behemoths even if you make something great. Not gonna happen.</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai5-a-realtime-generative-video-g\">Manifold agrees this is the long shot at 7%</a>, which is basically their version of ‘not gonna happen’ given how the math works for long shots.</li>\n</ol>\n</li>\n<li>“AI neutrality” emerges as a foreign policy doctrine as some nations cannot or fail to develop sovereign AI.\n<ol>\n<li>I doubt they’ll call it that, but certainly some nations will opt out of this ‘race.’</li>\n<li>GPT-5-Pro said 25%, Sonnet says 20%. I agree if this is a meaningful ‘neutrality’ in the sense of neutral between China and America on top of not rolling one’s own, but much higher if it simply means that nations opt out of building their own and rely on a frontier lab or a fine tune of an existing open model. And indeed I think this opt out would be wise for many, perhaps most.</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai6-ai-neutrality-emerges-as-a-fo\">Manifold says 29%</a>. Given the ambiguity issues, that’s within reasonable range.</li>\n</ol>\n</li>\n<li>A movie or short film produced with significant use of AI wins major audience praise and sparks backlash.\n<ol>\n<li>GPT-5-Pro says 68%, Sonnet says 55%. I’d be a buyer there, normally a parlay is a rough prediction but there would almost certainly be backlash conditional on this happening. A short film counts? I’m at more like 80%.</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai7-a-movie-or-short-film-produce\">Manifold is only at 67%</a>. That seems low to me, but I can moderate to 75%.</li>\n</ol>\n</li>\n<li>A Chinese lab overtakes the US lab dominated frontier on a major leaderboard (e.g. LMArena/Artificial Analysis).\n<ol>\n<li>I’d bet big against a Chinese lab actually having the best model at any point in 2026, but benchmarks are not leaderboards.</li>\n<li>I’d be very surprised if this happened on Artificial Analysis. Their evaluation suite is reasonably robust.</li>\n<li>I’d be less surprised if this happened on LM Arena, since it is rather hackable, if one of the major Chinese labs actively wanted to do this there’s a decent chance that they could, the way Meta hacked through their model for a bit.</li>\n<li>I still think this is an underdog. GPT-5-Pro said 74%, Sonnet says 60% and is focusing on Arena as the target. It only has to happen briefly. I think the models are too optimistic here, but I’ll give them maybe 55% because as worded this includes potential other leaderboards too.</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai8-a-chinese-lab-overtakes-the-u\">Manifold says 34%</a>, and on reflection yeah I was being a coward and moderating my instincts too much, that’s more like it. I’d probably buy there small because the resolution criteria is relatively generous, fair 40%.</li>\n</ol>\n</li>\n<li>Datacenter NIMBYism takes the US by storm and sways certain midterm/gubernatorial elections in 2026.\n<ol>\n<li>Threshold is always tricky with such questions. If we’re talking at least two races for governor, house or senate, I think this is not that likely to happen, nor is it likely to be very high on the list of issues in general. I’m on no.</li>\n<li>GPT-5-Pro says 23%, Sonnet says 18%. I’d probably say more like 15%. If you expand this so ‘a bunch of local races around potential cites’ counts including for ‘take by storm’ then I could go higher.</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai9-datacenter-nimbyism-takes-the\">Manifold is optimistic at 41%</a>. I’ll adjust to 25% on that, they might especially have a better sense of what would count, but this particular AI issue ‘taking the US by storm’ that often seems like a stretch.</li>\n</ol>\n</li>\n<li>Trump issues an unconstitutional executive order to ban state AI legislation.\n<ol>\n<li>I love that they explicitly say it will be unconstitutional.</li>\n<li>I do agree that if he did it, it would be unconstitutional, although of course it will be 2026 so it’s possible he can Just Do Things and SCOTUS will shrug.</li>\n<li>Both GPT-5-Pro and Sonnet say 35% here. That feels high but I can definitely see this happening, I agree with Sonnet that it is ‘on brand.’ 25%?</li>\n<li><a href=\"https://manifold.markets/ZviMowshowitz/soai10-trump-issues-an-unconstituti\">Manifold is at 19%</a>. Okay, sure, I’ll accept that and creep fair down a bit.</li>\n</ol>\n</li>\n</ol>\n<p>Indeed, despite nothing ever happening, do many things come to pass. It would be cool to have my own bold predictions for 2026, but I think the baseline scenario is very much a boring ‘incremental improvements, more of the same with some surprising new capabilities, people who notice see big improvements but those who want to dismiss can still dismiss, the current top labs are still the top labs, a lot more impact than the economists think but nothing dramatic yet, safety and alignment look like they are getting better and for short term purposes they are, and investment is rising, but not in ways that give me faith that we’re making Actual Progress on hard problems.’</p>\n<p>I do think we should expect at least one major vibe shift. Every time vibes shift, it becomes easy to think there won’t soon be another vibe shift. There is always another vibe shift, it is so over and then we are so back, until AGI arrives and perhaps then it really is over whether or not we are also so back. Two shifts is more likely than zero. Sometimes the shifts are for good reasons, usually it is not. The current ‘powers that be’ are unlikely to be the ones in place, with the same perspectives, at the end of 2026.</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/10/10/2025-state-of-ai-report-and-predictions/",
            "publishedAt": "2025-10-10",
            "source": "TheZvi",
            "summary": "The 2025 State of AI Report is out, with lots of fun slides and a full video presentation. They’ve been consistently solid, providing a kind of outside general view. I’m skipping over stuff my regular readers already know that doesn’t &#8230; <a href=\"https://thezvi.wordpress.com/2025/10/10/2025-state-of-ai-report-and-predictions/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "2025 State of AI Report and Predictions"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3153/",
            "publishedAt": "2025-10-10",
            "source": "XKCD",
            "summary": "<img alt=\"Despite a reputation for safety, the temperatures and surprisingly high pressures make them even more dangerous than the air kind, but the NTSB refuses to investigate accidents because they insist there is no 'transportation' involved.\" src=\"https://imgs.xkcd.com/comics/hot_water_balloon.png\" title=\"Despite a reputation for safety, the temperatures and surprisingly high pressures make them even more dangerous than the air kind, but the NTSB refuses to investigate accidents because they insist there is no 'transportation' involved.\" />",
            "title": "Hot Water Balloon"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-10-10"
}