{
    "articles": [
        {
            "content": [
                "<p>I&rsquo;ve been thinking recently about what sets apart my coworkers who&rsquo;ve done the best work.</p>\n<p>You might think that the main thing that makes people really effective at research or engineering is technical ability, and among the general population that&rsquo;s true. Among my Anthropic coworkers, though, we&rsquo;ve <a href=\"https://www.statology.org/restriction-of-range/\">restricted the range</a> by screening for extremely high-percentile technical ability, so the remaining differences, while they still matter, aren&rsquo;t quite as critical. Instead, people&rsquo;s biggest bottleneck eventually becomes their ability to get <em>leverage</em>&mdash;i.e., to find and execute work that has a big impact-per-hour multiplier.</p>\n<p>For example, here are some types of work at Anthropic that tend to have high impact-per-hour, or a high impact-per-hour ceiling when done well (of course this list is extremely non-exhaustive!):</p>\n<ul>\n<li>Improving tooling, documentation, or dev loops. A tiny amount of time fixing a papercut in the right way can save hundreds of users hours of debugging or schlepping through inefficient workflows.</li>\n<li>Identifying promising research directions. Things like <a href=\"https://www.anthropic.com/research/claude-character\">character</a> and <a href=\"https://www.anthropic.com/news/3-5-models-and-computer-use\">computer use</a> started off as a fraction of one person&rsquo;s time, taking a bet that some technique applied to some problem was going to work really well, and ended up being a major influence on Anthropic&rsquo;s research direction.</li>\n<li>System design. This tends to be a small part of the overall time to execute a project, but when done well, it can make the final system way better and save lots of work.</li>\n<li>Collecting and digging into data. It&rsquo;s almost always the case that, if we start looking at some new source of data that we didn&rsquo;t previously have, we discover huge <del>problems</del> <em>opportunities for improvement</em>, and it changes our prioritization a lot.\n<ul>\n<li>Interestingly, even versions of this work that seem very rote are often extremely high leverage. For example, you might think that a task like &ldquo;look at 100-1000 individual data points for anomalies&rdquo; could be delegated to a junior hire, but in fact, the people who are most obsessive about this are our most senior researchers and managers&mdash;and they often find severe issues by doing it that we wouldn&rsquo;t have noticed otherwise.</li>\n</ul>\n</li>\n</ul>\n<p>I think of finding high-leverage work as having two interrelated components:</p>\n<ul>\n<li><strong>Agency:</strong> i.e. some combination of the initiative/proactiveness to try to make things happen, and <a href=\"https://paulgraham.com/relres.html\">relentlessness and resourcefulness</a> to make sure you&rsquo;ll succeed.</li>\n<li><strong>Taste:</strong> you need a good intuition for what things will and won&rsquo;t work well to try. Taste is important both &ldquo;in the large&rdquo; (picking important problems) and &ldquo;in the small&rdquo; (picking approaches to solving those problems that will work well); I usually see people first become great at the latter, then the former.</li>\n</ul>\n<p>Without taste, you&rsquo;re likely to work toward the wrong thing. Without agency, even if you work toward the right thing, you&rsquo;re likely to get nowhere.</p>\n<p>How can someone improve at these? Mostly, I think, by practicing: there&rsquo;s no substitute for good feedback loops with reality. So maybe the most important takeaway here is that <em>you have permission</em> to try to exercise good taste and high agency! But below are some more specific pieces of advice that have helped me improve on these dimensions.</p>\n<h2 id=\"i-agency\">I. Agency</h2>\n<h3 id=\"understand-and-work-backwards-from-the-root-goal\">Understand and work backwards from the root goal</h3>\n<p>One of the easiest ways to get more leverage is to take a goal you&rsquo;re already trying to accomplish, and figure out a better way to accomplish the same thing. (For example: changing your experiment design to be more directly relevant to the high-level question; finding an 80/20 way of building a tool; just deciding not to do something entirely; etc.) In order to do this, you need to keep careful track of the high-level context and priorities that your specific project is aimed at, so that you can understand and judge the trade-offs.</p>\n<p>Obviously, whoever&rsquo;s supervising your project will make an attempt to point you at the most effective way of achieving the goal that they can think of. But finding the most effective way of doing something takes a lot of time and attention, they probably have a lot of other things to do, and they also have much less detailed context than you, so they&rsquo;re liable to miss things!</p>\n<p>For example, when I did a work trial at Anthropic in late 2022, I was assigned the task of building a custom scheduler for our compute cluster to fix some unfortunate behaviors in the default scheduler that were making researchers&rsquo; lives hard. But after seeing the team work for a week and thinking about the system design, I started to worry that this project would end up imposing a high maintenance burden on the team that owned the cluster, which was already overloaded, and I ended up suggesting that we postpone it. It turned out that second-order effect would have made this project net-negative for the root goal of &ldquo;keep the clusters working well!&rdquo;</p>\n<h3 id=\"dont-rely-too-much-on-permission-or-encouragement\">Don&rsquo;t rely too much on permission or encouragement</h3>\n<p>A counterintuitive fact about the highest-leverage projects is that they&rsquo;re often not <em>obviously</em> high-leverage to most people in advance (because if they were, they would already have been done a long time ago). That means people are often skeptical of the value of pursuing them.</p>\n<p>That skepticism can be for a couple reasons (in the real world, most projects have some mix of both going on):</p>\n<ul>\n<li>People might underrate the impact that the project will have. For example, I find that people often underestimate the value of work related to metrics, instrumentation, or generally looking at data, because you can&rsquo;t predict what specific things you would learn or what specific impact you&rsquo;d have as a result. Because of that, many teams consistently under-invest in looking at data.</li>\n<li>The project might seem too hard to execute in a high-impact way. For example, someone I knew built a system to identify unhealthy hosts in a data center by parsing and categorizing <em>every kernel log message</em>, which ended up saving $X00m/yr (iirc). When he proposed the project initially, others thought it would take a whole team multiple quarters, probably because it&rsquo;s extremely boring and detail-oriented; but because this person was good at focused, detail-oriented work even when it was boring, he finished it in a couple months.</li>\n</ul>\n<p>A personal example: shortly after I joined Anthropic&rsquo;s inference team, a couple folks on the team proposed completely rewriting our inference service codebase, because they felt the current version was overcomplicated. I was somewhat skeptical of this, based on <a href=\"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/\">the standard software engineering heuristic</a> of &ldquo;most rewrites fail and most people are over-optimistic about how long they will take,&rdquo; although I didn&rsquo;t push back very hard because I knew I didn&rsquo;t have much context. It turned out that the rewrite took about a week, was an immediate integer-multiple efficiency improvement, and made it much easier to make further efficiency improvements. I&rsquo;m glad that people didn&rsquo;t listen to my skepticism!</p>\n<p>One tactic for addressing this dynamic is that instead of asking people for approval to go do something, you can just <a href=\"https://trainingmag.com/change-top-down-leadership-with-i-intend-to/\">tell them what you intend to do</a> (implicitly giving them space to object or course-correct if they feel strongly).</p>\n<p>Of course, the same &ldquo;high leverage projects are non-obvious&rdquo; phenomenon also means that some of your self-driven high-impact project attempts will probably fail, because you misjudged their impact or difficulty. Because of this, you should think of them as <em>bets that might or might not pay off</em>, and&mdash;at least until you&rsquo;ve proven your ability to make good bets over fairly long time horizons&mdash;it&rsquo;s best to keep these as part of a portfolio with low-risk projects as well, to avoid the situation where you bite off a single high-risk project, it doesn&rsquo;t pan out, and people lose trust in your ability to pick your own projects.</p>\n<h3 id=\"make-success-inevitable\">Make success inevitable</h3>\n<p>A common trait of high-agency people is that they take accountability for <em>achieving a goal</em>, not just doing some work.</p>\n<p>There&rsquo;s a huge difference between the following two operating modes:</p>\n<ol>\n<li>My goal is to ship this project by the end of the month, so I&rsquo;m going to get people started working on it ASAP.</li>\n<li>My goal is to ship this project by the end of the month, so I&rsquo;m going to list out everything that needs to get done by then, draw up a schedule working backwards from the ship date, make sure the critical path is short enough, make sure we have enough staffing to do anything, figure out what we&rsquo;ll cut if the schedule slips, be honest about how much slop we need, track progress against the schedule and surface any slippage as soon as I see it, pull in people from elsewhere if I need them&hellip;</li>\n</ol>\n<p>Mode 1 makes you a <a href=\"https://www.joelonsoftware.com/2002/11/11/the-law-of-leaky-abstractions/\">leaky abstraction</a>&mdash;if your project is critical, someone else needs to be constantly monitoring it and figuring out how to resolve blockers. My <a href=\"https://notes.andymatuschak.org/z3b7sidNrEkNaY9qfGwZjwz\">concept handle</a> for being in mode 2 is &ldquo;making success inevitable,&rdquo; because &ldquo;inevitable&rdquo; is the bar where other people can stop spending substantial fractions of mental energy on worrying about the project.</p>\n<p>People who can be trusted to make something inevitable are really rare, and are typically the bottleneck for how many different things a team or company can do at once. So if someone else is responsible for making your project inevitable, you&rsquo;re consuming some of that scarce resource; if you&rsquo;re the one making your own projects inevitable, you&rsquo;re a <em>producer</em> of that resource, and you&rsquo;re helping unblock a key constraint for your team.</p>\n<p>(Of course in practice you will never achieve full inevitability, but getting closer to it still makes a huge difference!)</p>\n<h2 id=\"ii-taste\">II. Taste</h2>\n<h3 id=\"find-your-angle\">Find your angle</h3>\n<p>I wrote above that you should expect high-impact projects to be non-obvious because if they were obvious, they&rsquo;d have been done already. This points to another interesting dynamic, which is that it&rsquo;s quite rare for different people&rsquo;s &ldquo;zone of best taste&rdquo; to overlap very much. Instead, the quality of most people&rsquo;s taste is highly idiosyncratic and area-specific, where areas can be as localized as e.g. &ldquo;language model personality design&rdquo; or &ldquo;what blog post titles will get upvoted on Hacker News&rdquo; (one of my own less-useful areas of good taste&hellip;)</p>\n<p>For this reason, an important signal to keep track of is: where is your taste the best?</p>\n<p>I&rsquo;ve noticed a lot of people underestimate their own taste, because they expect having good taste to feel like being very smart or competent or good at things. Unfortunately, I am here to tell you that, at least if you are similar to me, you will never feel smart, competent, or good at things; instead, you will just start feeling more and more like everyone else mysteriously sucks at them.</p>\n<p>For this reason, the prompt I suggest here is: <strong>what does it seem like everyone else is mysteriously bad at?</strong> That&rsquo;s probably a sign that you have good taste there.</p>\n<p>It&rsquo;s okay if this prompt doesn&rsquo;t immediately yield anything; you might just be on a team with a lot of really good people, where you don&rsquo;t have a really unique angle on anything yet. Even so, a weakened version of this question&mdash;where does it seem like the most people are being the least competent?&mdash;is a useful gradient signal!</p>\n<h3 id=\"think-real-hard\">Think real hard</h3>\n<p>One way of thinking about taste is that it&rsquo;s about <em>the quality of your predictive models and search heuristics</em>. If I design the experiment this way, what will I find? If I design the tool this way, how easy will it be to use? If I write the doc this way, how much will it resonate with people?</p>\n<p>Doing enough search and prediction to come up with great ideas takes time. The first domain that I got some degree of taste in was software design, and I remember <a href=\"https://www.benkuhn.net/conviction/#:~:text=Since%20I%20had%20plenty%20of%20free%20time%2C%20I%20spent%20it%20thinking%20through%20my%20plans%20from%20first%20principles.\">a pretty clear phase transition</a> where I gained the ability to improve my designs by thinking harder about them. After that point, I spent a lot of time iterating on many different design improvements&mdash;most of which I never implemented because I couldn&rsquo;t come up with something I was happy enough with, but a few of which turned into major wins.</p>\n<p>The easiest way to improve at this is just to try it! Whenever you&rsquo;re debating what to do, explicitly ask yourself &ldquo;what do I predict will happen if I choose option A?&rdquo; and try to unroll the trajectory. Even if you think you&rsquo;re already intuitively predicting the results of your choices, I&rsquo;ve found it helps surprisingly much to be explicit&mdash;one of my manager role models asks me this (&ldquo;what do you think will happen?&rdquo;) every time I ask him for advice and it&rsquo;s kind of silly how often it helps me realize something new. (For bonus points, revisit your predictions afterwards.)</p>\n<p>Things that I&rsquo;ve found benefit from a lot of thinking time:</p>\n<ul>\n<li>What to work on. Changing your prioritization is often the single biggest lever for improving your leverage!</li>\n<li>&ldquo;Design&rdquo; broadly construed&mdash;whether that&rsquo;s experiment design, system design, org design, process design, outlining blog posts, etc.</li>\n<li>How projects could have gone better and what I should learn from them&mdash;see below.</li>\n</ul>\n<p>(See also: <a href=\"https://www.benkuhn.net/thinkrealhard/\">Think real hard</a>. Although if you&rsquo;re someone whose natural failure mode is to overthink things, it&rsquo;s possible you should <a href=\"https://slatestarcodex.com/2014/03/24/should-you-reverse-any-advice-you-hear/\">reverse this advice</a>.)</p>\n<h3 id=\"reflect-on-your-thinking\">Reflect on your thinking</h3>\n<p>If taste is about the quality of your predictive models and search heuristics, it&rsquo;s important to wring out every possible update to these from the data that you get.</p>\n<p>For that reason, many of the most effective people I&rsquo;ve worked with also do the most <em>metacognition</em>, i.e., reflecting on their own (and their team&rsquo;s) work and thought processes, and figuring out how to improve them. They&rsquo;re often the people who are most likely to identify improvements to our processes or mental models&mdash;things like:</p>\n<ul>\n<li>Wow, we should have added this instrumentation months ago because we learned so much valuable stuff from it. I should probably up-weight my heuristic that &ldquo;any time you&rsquo;re not looking at data about something important, you&rsquo;re probably unaware of some fire.&rdquo;</li>\n<li>I think we&rsquo;re working inefficiently because we&rsquo;re overestimating how close we are to being done; we need to step back and improve our tooling. Also, I&rsquo;ve noticed we get into this pattern kinda often; I&rsquo;ll try to notice it earlier next time!</li>\n<li>In retrospect, we could have avoided this problem if we&rsquo;d thought about X earlier&mdash;let&rsquo;s keep that in mind next time we&rsquo;re in a similar situation.</li>\n<li>I think our key constraint here is we don&rsquo;t have enough people with Y skillset. Can we move people around somehow to get more of the right people working on the problem?</li>\n</ul>\n<p>Often, they don&rsquo;t just do their own metacognition but also help drive &ldquo;group metacognition&rdquo; by sharing these reflections with the team, scheduling retrospectives, etc. Even if each of the lessons here is small individually, they compound over time to help people and teams become much more effective.</p>\n<p>My best habit for encouraging myself to metacogitate more is a <a href=\"https://www.benkuhn.net/weekly/\">weekly review</a>. The format and typical outcomes of my reviews have evolved a lot since I wrote that, but I still do them and find them extremely valuable for helping me improve at whatever I&rsquo;m currently focused on improving at!</p>\n<p>(See also / further reading: Chris Olah&rsquo;s <a href=\"https://colah.github.io/notes/taste/\">Research Taste Exercises</a>)</p>"
            ],
            "link": "https://www.benkuhn.net/impact/",
            "publishedAt": "2025-04-19",
            "source": "Ben Kuhn",
            "summary": "understand + work backwards from the root goal • don&rsquo;t rely too much on permission or encouragement • make success inevitable • find your angle • think real hard • reflect on your thinking",
            "title": "Impact, agency, and taste"
        },
        {
            "content": [
                "<p>Brace yourself, because I’m about to utter a sequence of words I never thought I would hear myself say:</p>\n<p>I really miss posting on Twitter.</p>\n<p>I really, really miss it.</p>\n<p>It’s funny, because Twitter was never <em>not</em> a trash fire. There was never a time when it felt like we were living through some kind of hallowed golden age of Twitter. I always felt a little embarrassed about the amount of time I spent posting.</p>\n<p>Or maybe you only ever really see golden ages in hindsight.</p>\n<p>I joined Twitter in 2009, and was an intermittent user for years. But it was after we started working on Honeycomb that Twitter became a lifeline, a job, a huge part of my everyday life.</p>\n<h2>Without Twitter, there would be no Honeycomb</h2>\n<p>Every day I would leave the house, look down at my phone, and start pecking out tweets as I walked to work. I turned out these mammoth threads about instrumentation, cardinality, storage engines, etc. Whatever was on my mind that day, it fed into Twitter.</p>\n<p>In retrospect, I now realize that I was doing things like “outbounding” and “product marketing” and “category creation”, but at the time it felt more like oxygen.</p>\n<p>Working out complex technical concepts in public, in real time, seeing what resonated, batting ideas back and forth with so many other smart, interesting people online&#8230;it was heady shit.</p>\n<p>In the early days, we actually thought that Honeycomb-style observability (high cardinality, slice-and-dice, explorability, etc) was something only super large, multi-tenant platforms would ever care about or be willing to pay for. It was the conversations we were having on Twitter, the intensity of people’s reactions, that made us realize that no, actually; this was fast becoming an <em>everybody</em> problem.</p>\n<h2>Twitter was my most reliable source of dopamine</h2>\n<p>It’s impossible to talk about Twitter’s impact on my life and career without also acknowledging the ways I used it to self-medicate.</p>\n<p>My ADHD was unmanaged, unmedicated, and unknown to me in those years. In retrospect, I can see that my only tool as an engineer was hyperfocus, and I rode that horse into the <em>ground</em>. When I unexpectedly became CEO, my job splintered into a million little bite sized chunks of time, and hyperfocus was no longer available to me. The tools I did have were Twitter and sleep deprivation.</p>\n<p>Lack of sleep, it turns out, can wind me down and help me focus. If I’ve been awake for over 24 hours, I can buckle down and force myself to grind through things like email, expense reports, or writing marketing copy. Sleep deprivation is not pleasant, it’s actually really fucking painful, but it works. So I did it. From 2016 to 2020, I slept only once every two or three days. (People always think I am exaggerating when I say this, but people closer to me know that this is probably an understatement.)</p>\n<p>But Twitter, you dear, dysfunctional hellsite… Twitter could wind me <em>up</em>.</p>\n<p>I would go for a walk, pound out a fifty-tweet thread, and arrive at my destination feeling all revved up.</p>\n<p>I picked fights, I argued. I was combative and aggressive in public, and I <em>loved it.</em> I regret some of it now; I burned some good relationships, and I burned out my adrenal glands. But I would sit down at my desk feeling high on dopamine, and I could channel that high into <em>focus</em>. It’s the only way I got shit done.</p>\n<p>I got my ADHD diagnosis in 2020 (thank the gods). Since then I’ve done medication, coaching, therapy in several modalities, cats… I’ve tried it all, and a lot of it has helped. I sleep every single night now.</p>\n<h2>That world is gone, and it&#8217;s not coming back</h2>\n<p><a href=\"https://www.newyorker.com/newsletter/the-daily/social-media-is-getting-better-by-falling-apart\">The social media landscape has fragmented</a>, and <a href=\"https://www.theatlantic.com/technology/archive/2022/11/twitter-facebook-social-media-decline/672074/\">maybe that’s a good thing</a>. There is nothing today that scratches the same itch for me as Twitter did, in its golden years. And maybe I don’t need it in quite the same way as I used to.</p>\n<p>Most of the people I used to love talking with on X seem to have abandoned it to the fascists. LinkedIn is performatively corporate and has no soul. I’m still on Bluesky, but it’s a bit of an echo chamber and people mostly talk about politics; that is not what I go to social media for. The noisy, combative tech scene I loved doesn’t really seem to exist anymore.</p>\n<p>These days I use social media less than ever, but I am learning that my writing is more important to me than ever. Which is forcing me to reckon with the fact that my writing process may no longer fit or serve the function I need it to.</p>\n<p>Most of those epic threads I put so much time and energy into crafting have vanished into the ether. The few that I bothered to convert into essay format are the only ones that have endured.</p>\n<h2>I’ve been writing in public for ten years now</h2>\n<p>Do you ever hear yourself say something, causing you to pause, surprised: “I guess that’s a thing I believe”?</p>\n<p>A couple months ago, Cynthia Dunlop asked me to share any thoughts I might have on my writing, as part of the promotional tour for “<a href=\"https://github.com/scynthiadunlop/WritingForDevelopersBook/\">Writing for Developers: Blogs That Get Read</a>” (p.s., great book!). <a href=\"https://writethatblog.substack.com/p/charity-majors-on-technical-blogging\">I wrote back</a>:</p>\n<blockquote><p>There are very few things in life that I am prouder of than the body of writing I have developed over the past 10 years.</p>\n<p>When I look back over things I have written, I feel like I can see myself growing up, my mental health improving, I&#8217;m getting better at taking the long view, being more empathetic, being less reactive&#8230; I&#8217;ve never graduated from anything in my life, so to me, my writing kind of externalizes the progress I&#8217;ve made as a human being. It&#8217;s meaningful to me.</p></blockquote>\n<p>Huh. Turns out that’s a thing I believe. <img alt=\"🤔\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/15.1.0/72x72/1f914.png\" style=\"height: 1em;\" /></p>\n<p>I wrote my first post on this site in December of 2015. It’s crazy to look back on all the different things I have written about here over the past ten years — book reviews, boba recipes, technology, management, startup life, and more.</p>\n<p>Even more mindblowing is when I look at my drafts folder, my notes folders. The hundreds of ideas or pieces I wanted to write about, or started writing about, but never found the time to polish or finish. Whuf.</p>\n<h2>I need to learn how to write shorter, faster pieces, without the buffer of social media</h2>\n<p>From 2015 to somewhere in the 2021-2023 timeframe, thoughts and snippets of writing were pouring out of me every day, mostly feeding the Twitter firehose. Only a few of those thoughts ever graduated into blog post form, but those few are the ones that have endured and had the most impact.</p>\n<p>Over the past 2-4 years, I’ve been writing less frequently, less consistently, and mostly in blog post form. My posts, meanwhile, have gotten longer and longer. I keep shipping these 5000-9000-word monstrosities (I’m so sorry <img alt=\"🤦\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/15.1.0/72x72/1f926.png\" style=\"height: 1em;\" />). I sometimes wonder who, if anyone, ever reads the whole thing.</p>\n<p>The problem is that I keep writing myself into a ditch. I pick up a topic, and start writing, and somehow it metastasizes. It expands to consume all available time and space (and then some). By the time I’ve finished editing it down, weeks if not months have passed, and I have usually grown to loathe the sight of it.</p>\n<p>For most of my adult life, I’ve relied on hard deadlines and panic to drive projects to completion, or to determine the scope of a piece. I’ve relied on anger and adrenaline rushes to fuel my creative juices, and due dates and external pressure to get myself over the finish line.</p>\n<p>And what does that finish line look like? Running out of time, of course! I know I&#8217;m done because I have run out of time to work on it. No wonder scoping is such a problem for me.</p>\n<h2>A three month experiment in writing bite sized pieces</h2>\n<p>I need to learn to write in a different way. I need to learn to draft without twitter, scope without deadlines. Over the next five years, I want to get a larger percentage of my thoughts shipped in written form, and I don’t want them to evaporate into the ether of social media. This means I need to make some changes.</p>\n<ol>\n<li>write shorter pieces</li>\n<li>spend less time writing and editing</li>\n<li>find the line of embarrassment, and hug it.</li>\n</ol>\n<p>For the next three months, I am going to challenge myself to write <strong>one blog post per week</strong> (travel weeks exempt). I will try to cap each one under 1000 words (but not obsess over it, because the point is to edit less).</p>\n<p>I’m writing this down as a public commitment and accountability mechanism.</p>\n<p>So there we go, 1473 words. Just above the line of embarrassment.</p>\n<p>See you here next week.</p>"
            ],
            "link": "https://charity.wtf/2025/04/19/on-writing-social-media-and-finding-the-line-of-embarrassment/",
            "publishedAt": "2025-04-19",
            "source": "Charity Majors",
            "summary": "Brace yourself, because I’m about to utter a sequence of words I never thought I would hear myself say: I really miss posting on Twitter. I really, really miss it. It’s funny, because Twitter was never not a trash fire. There was never a time when it felt like we were living through some kind [&#8230;]",
            "title": "On Writing, Social Media, and Finding the Line of Embarrassment"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-04-19_b6c7182158d9_our-fake-sakura-tree-is-blosso/",
            "publishedAt": "2025-04-19",
            "source": "Harper Reed",
            "summary": "<p>Our fake Sakura tree is blossoming.</p> <figure> <img alt=\"image_1.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-04-19_b6c7182158d9_our-fake-sakura-tree-is-blosso/image_1.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #191"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-04-19_18fafb35ebeb_hanging-out-with-palmer-eating/",
            "publishedAt": "2025-04-19",
            "source": "Harper Reed",
            "summary": "<p>Hanging out with Palmer. Eating amazing tofu.</p> <figure> <img alt=\"image_1.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-04-19_18fafb35ebeb_hanging-out-with-palmer-eating/image_1.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #190"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-04-19_9c5cc908253b_got-a-new-tape/",
            "publishedAt": "2025-04-19",
            "source": "Harper Reed",
            "summary": "<p>Got a new tape.</p> <figure> <img alt=\"image_1.jpg\" height=\"1350\" src=\"https://harper.blog/notes/2025-04-19_9c5cc908253b_got-a-new-tape/image_1.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_2.jpg\" height=\"2400\" src=\"https://harper.blog/notes/2025-04-19_9c5cc908253b_got-a-new-tape/image_2.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #189"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Apr/19/llama-eu-ai-act/#atom-entries",
            "publishedAt": "2025-04-19",
            "source": "Simon Willison",
            "summary": "<p>I encountered a theory a while ago that one of the reasons Meta insist on using the term “open source” for their Llama models despite the Llama license <a href=\"https://opensource.org/blog/metas-llama-license-is-still-not-open-source\">not actually conforming</a> to the terms of the <a href=\"https://opensource.org/osd\">Open Source Definition</a> is that the EU’s AI act includes special rules for open source models without requiring OSI compliance.</p> <p>Since the EU AI act (12 July 2024) is <a href=\"https://artificialintelligenceact.eu/the-act/\">available online</a> I decided to take a look for myself.</p> <p>Here’s <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=OJ:L_202401689\">one giant HTML page</a> containing the full text of the act in English. I checked the token count with <a href=\"https://github.com/simonw/ttok\">ttok</a> (which uses the OpenAI tokenizer, but it’s close enough to work as a good estimate for other models):</p> <div class=\"highlight highlight-source-shell\"><pre>curl <span class=\"pl-s\"><span class=\"pl-pds\">'</span>https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=OJ:L_202401689<span class=\"pl-pds\">'</span></span> <span class=\"pl-k\">|</span> ttok</pre></div> <p>241,722 tokens. That should fit nicely into <a href=\"https://simonwillison.net/2025/Apr/17/start-building-with-gemini-25-flash/\">Gemini 2.5 Flash</a> (or GPT-4.1 or Gemini 2.5 Pro).</p> <p>My Gemini API key was playing up so I ran it via <a href=\"https://openrouter.ai/\">OpenRouter</a> (and <a href=\"https://github.com/simonw/llm-openrouter\">llm-openrouter</a>) instead:</p> <div class=\"highlight highlight-source-shell\"><pre>llm -f <span class=\"pl-s\"><span class=\"pl-pds\">'</span>https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=OJ:L_202401689<span class=\"pl-pds\">'</span></span> \\ -m openrouter/google/gemini-2.5-flash-preview:thinking \\ -s <span class=\"pl-s\"><span class=\"pl-pds\">'</span>Summary of mentions of open source here, including what the document defines open source to mean<span class=\"pl-pds\">'</span></span></pre></div> <p>Here's <a href=\"https://gist.github.com/simonw/f2e341a2e8ea9ca75c6426fa85bc2dfc\">the full",
            "title": "Maybe Meta's Llama claims to be open source because of the EU AI act"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-04-19"
}