{
    "articles": [
        {
            "content": [
                "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F73d64b74-8195-426d-8d03-4e1505c7624f_750x975.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"975\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F73d64b74-8195-426d-8d03-4e1505c7624f_750x975.jpeg\" width=\"750\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Inspiration Comes in Painting (1973), Dorothea Tanning</h6><p></p><p><strong>Hi Polly,</strong></p><p><strong>I think I'm the issue. I'm 23, have never been in a relationship longer than a few months, and just about have a near anxiety breakdown every time I get into an argument with a partner (if I can even call them that).</strong></p><p><strong>I want to be a better, more secure, more relaxed or maybe just a happier per&#8230;</strong></p>\n      <p>\n          <a href=\"https://www.ask-polly.com/p/i-want-to-be-less-mean\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.ask-polly.com/p/i-want-to-be-less-mean",
            "publishedAt": "2025-03-19",
            "source": "Ask Polly",
            "summary": "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F73d64b74-8195-426d-8d03-4e1505c7624f_750x975.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"975\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F73d64b74-8195-426d-8d03-4e1505c7624f_750x975.jpeg\" width=\"750\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Inspiration Comes in Painting (1973), Dorothea Tanning</h6><p></p><p><strong>Hi Polly,</strong></p><p><strong>I think I'm the issue. I'm 23, have never been in a relationship longer than a few months, and just about have a near anxiety breakdown every time I get into an argument with a partner (if I can even call them that).</strong></p><p><strong>I want to be a better, more secure, more relaxed or maybe just a happier per&#8230;</strong></p> <p> <a href=\"https://www.ask-polly.com/p/i-want-to-be-less-mean\"> Read more </a> </p>",
            "title": "'I Want to Be Less Mean!'"
        },
        {
            "content": [
                "<p>I granted free permission to Letters Live to use this chapter from my 2016 book, <em>How to Be a Person in the World</em>. They didn&#8217;t tell me who would read it. </p><p>I am not disappointed! </p><p>I want to share this with everyone because whew, it&#8217;s good. I was skeptical at first (as always!) and I was crying by the end. A moving reminder that being nice on the surface while suffering behind closed doors is no way to live!</p><div class=\"youtube-wrap\" id=\"youtube2-fzC8J3TVkWQ\"><div class=\"youtube-inner\"></div></div><p>Here&#8217;s the ironic part:</p><p>The message behind this letter and response is that you have to be direct and assertive with other people, particularly if you&#8217;re a woman. You can&#8217;t passively agree to conditions that aren&#8217;t okay with you.</p><p>I asked Letters Live to include credit for my work at the start of any performance and in any video they put online, and to include the url for Ask Polly in the introduction to the performance and in any accompanying text. They resisted including the url; I pushed back and they finally agreed to it. I also requested that they let me know when the video went up online. When it comes to getting credit for my work, I have learned to be clear and detailed! </p><p>Nevertheless, these conditions were not honored. Not only wasn&#8217;t I invited to this event, which I thought was odd, I also wasn&#8217;t informed that the video went up &#8212; I stumbled across it on someone else&#8217;s Substack last week. When I asked the permissions contact at Letters Live last week to add a link to Ask Polly, I received no reply. </p><p>The lesson here is that even when you&#8217;re very direct and you <em>clearly and professionally</em> state your conditions, other people &#8212; very professional, very polite people!  &#8212; will often pretend to comply and then do whatever they want. They will forget what they promised you whenever it&#8217;s convenient to do so. (Update: Letters Live reached out to apologize. They&#8217;re currently updating the video so that it identifies Ask Polly as the source of the letter and response. They&#8217;ve also said that they&#8217;re taking my feedback to heart and they&#8217;re going to change some aspects of their permissions process moving forward.)</p><p>A very similar story: When my first memoir, <em>Disaster Preparedness</em>, was published, I had my agent stipulate that I would have a chance to audition to read the audio version. I figured of course they&#8217;d want the author to read her own memoir! Instead, the audio book producer listened to a clip of an NPR piece I did and independently decided to hire someone else &#8212; someone with a cheerful, Disney-princess voice. I wasn&#8217;t notified until after the book was recorded.</p><p>My agent at the time shrugged and said we should choose our battles. My editor at the time ignored my phone calls and emailed that it was out of her hands.</p><p>The moral here is that you can be assertive, direct, and honest. You can put everything in writing. You can enlist professional help. But things might <em>still</em> go very wrong, and when push comes to shove, you might discover that the helpers you&#8217;ve hired aren&#8217;t very helpful at all, and the collaborators you&#8217;ve chosen don&#8217;t see it as a collaboration after all. They want their lives to be easy, they need certain <em>other</em> relationships to remain intact, and if it&#8217;s more convenient for them to convince you that the problem is YOU, that&#8217;s the path they&#8217;ll choose.</p><p>And &#8212; THIS PART IS IMPORTANT, SO LISTEN UP! &#8212; if you struggle to express your emotions, or you grew up being told that the problem is you, you will often give up and, through tears of rage, give in.</p><p>That&#8217;s what I did back then. But I&#8217;m not like that anymore.</p><p>So I&#8217;m sharing this story instead. I&#8217;m not about to enlist a lawyer, it&#8217;s too expensive and too aggravating to go down that path, and this situation is just too trivial. BUT I <em>do</em> have to share both the video (YES!!!) and the story behind it (NO!!!), because it&#8217;s so instructive, and so ludicrously on-theme.</p><p>Vowing to be LESS NICE <em>includes</em> calling people out when they don&#8217;t honor their agreements. You don&#8217;t work as hard as you do just to give your work away, or to shrug when people who were hired to have your back don&#8217;t do so. You honor your work by standing up for your work! You honor yourself (and other creative people who are more vulnerable than you are) by standing up for yourself!</p><p>That&#8217;s why it&#8217;s so important to know your own heart, to have clarity about your needs and desires, to learn to stay calm and speak directly under awkward circumstances. Because you <em>must</em> cultivate COURAGE OF CONVICTION UNDER PRESSURE.</p><p>Throughout your life, you have to <em>keep</em> learning how to tell people the truth directly. You can&#8217;t panic about sounding harsh or seeming unlikable. You need to know how to ask for what you want. And from time to time, you <em>have to</em> confront people when they&#8217;re careless or negligent.</p><p>The more calm you can be as you do these things, the less likely you are to be disrespected, taken for granted, demeaned, and ignored. But believe me &#8212; and I&#8217;ll bet FKA Twigs will back me up on this &#8212; you <em>will</em> still be disrespected, taken for granted, demeaned, and ignored. REGULARLY. </p><p>Even when you have an established career and a name in your business. Even when you&#8217;re famous like Twigs. Even when you&#8217;re surrounded by an army of professional helpers. People will say they didn&#8217;t know, or they misplaced your contract, or mistakes were made. People will tell you &#8220;That&#8217;s not how it works&#8221; even when you have it in writing. People will avoid you and then talk shit about what a pain in the ass you were to work with &#8212; just for *calmly, clearly, and politely* standing up for your rights. </p><p>That&#8217;s discouraging, I know. But it&#8217;s all the more reason why you have to learn to have your own back instead of letting your shame and your intense emotions warp your view. </p><p>Don&#8217;t surrender to shame. When people misunderstand you, ignore you, gaslight you, or tell inaccurate stories about you? </p><p>Say something. Or, as I put it back in 2016:</p><p>&#8220;How many years do we have to wait just to speak our minds? Let&#8217;s be flinty and unreasonable instead. Let&#8217;s tell the truth, <em>without</em> a smile. Let&#8217;s let our words drop, one by one, without explanation, without apology, like the first few pebbles before a landslide.&#8221;</p><p>Make that hiss at the end of FKA Twigs&#8217; performance your official vibe for 2025 and your mantra for the rest of your life.</p><p>You will <em>require</em> that ferocity. Instead of fearing it, relish it. </p><div><hr /></div><p><em>Thanks for reading and supporting Ask Polly!</em> <em>And thanks to Letters Live for welcoming feedback and updating their video so quickly. </em></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.ask-polly.com/subscribe\"><span>Subscribe now</span></a></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.ask-polly.com/p/fka-twigs-reads-ask-polly?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share\"><span>Share</span></a></p>"
            ],
            "link": "https://www.ask-polly.com/p/fka-twigs-reads-ask-polly",
            "publishedAt": "2025-03-17",
            "source": "Ask Polly",
            "summary": "<p>I granted free permission to Letters Live to use this chapter from my 2016 book, <em>How to Be a Person in the World</em>. They didn&#8217;t tell me who would read it. </p><p>I am not disappointed! </p><p>I want to share this with everyone because whew, it&#8217;s good. I was skeptical at first (as always!) and I was crying by the end. A moving reminder that being nice on the surface while suffering behind closed doors is no way to live!</p><div class=\"youtube-wrap\" id=\"youtube2-fzC8J3TVkWQ\"><div class=\"youtube-inner\"></div></div><p>Here&#8217;s the ironic part:</p><p>The message behind this letter and response is that you have to be direct and assertive with other people, particularly if you&#8217;re a woman. You can&#8217;t passively agree to conditions that aren&#8217;t okay with you.</p><p>I asked Letters Live to include credit for my work at the start of any performance and in any video they put online, and to include the url for Ask Polly in the introduction to the performance and in any accompanying text. They resisted including the url; I pushed back and they finally agreed to it. I also requested that they let me know when the video went up online. When it comes to getting credit for my work, I have learned",
            "title": "FKA Twigs Reads Ask Polly"
        },
        {
            "content": [
                "<p>My few most productive individual weeks at Anthropic have all been “crisis project management:” coordinating major, time-sensitive implementation or debugging efforts.</p>\n<p>In a company like Anthropic, excellent project management is an extremely high-leverage skill, and not just during crises: our work has tons of moving parts with complex, non-obvious interdependencies and hard schedule constraints, which means organizing them is a huge job, and can save weeks of delays if done right. Although a lot of the examples here come from crisis projects, most of the principles here are also the way I try to run any project, just more-so.</p>\n<p>I think excellent project management is also <em>rarer than it needs to be</em>. During the crisis projects I didn&rsquo;t feel like I was doing anything particularly impressive; mostly it felt like I was putting in a lot of work but doing things that felt relatively straightforward. On the other hand, I often see other people miss chances to do those things, maybe for lack of having seen a good playbook.</p>\n<p>So here’s an attempt to describe my playbook for when I’m being intense about project management.</p>\n<p>(I’ve described what I did as &ldquo;coordinating&rdquo; above, but that’s underselling it a bit; it mattered a lot for this playbook that I had enough technical context, and organizational trust, to autonomously make most prioritization decisions about the project. Sometimes we instead try to have the trusted decisionmakers not be highly involved in managing execution, and instead farm that out to a lower-context or less-trusted project manager to save the trusted decisionmaker time, but IMO this is usually a false economy for projects where it’s critical that they be executed well.)</p>\n<h2 id=\"focus\">Focus</h2>\n<p>For each of the crisis management projects I completely cleared my schedule to focus on them, and ended up spending 6+ hours a day organizing them.</p>\n<p>This is a bit unintuitive because I’m used to thinking of information processing as basically a free action. After all, you’re “just” moving info from place to place, not doing real work like coding, right? But if you add it all up&mdash;running meetings, pinging for updates, digesting Slack threads, pinging for updates again, thinking about what’s next, pinging for updates a third time, etc.&mdash;it’s surprisingly time-intensive.</p>\n<p>Even more importantly than freeing up time, clearing my schedule made sure the project was the <a href=\"https://paulgraham.com/top.html\">top idea in my mind</a>. If I don’t do that, it’s easy for me to let projects “go on autopilot,” where I keep them running but don’t proactively make time to think through things like whether we should change goals, add or drop priorities, or do other “non-obvious” things.</p>\n<p>For non-crisis projects, it’s often not tenable (or the right prioritization) to spend 6+ hours a day project-managing; but it’s still the case that you can improve execution a lot if you focus and make them a top priority, e.g. by carving out dedicated time every day to check statuses, contemplate priorities, broadcast updates, and so on.</p>\n<h2 id=\"maintain-a-detailed-plan-for-victory\">Maintain a detailed plan for victory</h2>\n<p>A specific tool that I’ve found critical for staying oriented and updating quickly is a <em>detailed plan for victory</em>, i.e., a list of steps, as concrete as possible, that end with the goal being achieved.</p>\n<p>The plan is important because whether or not we’re achieving the plan is the best way to figure out how well or badly things are going. Knowing how well or badly things are going is important because it tells me when to start asking for more support, cutting scope, escalating problems, and otherwise sounding more alarms. One of the most common megaproject failure modes is to <em>not freak out soon enough</em>, and having a concrete plan is the best antidote.</p>\n<p>As a both positive and negative example of this, during a recent sprint to release a new implementation of a model, we took a detailed accounting of all the work we thought we had to do to launch.</p>\n<ul>\n<li>On the plus side, this made it clear three months before launch that things were going to be <em>very</em> tight, and this enabled us to ask for help from another team, who loaned us someone who sped up the project a fair amount.</li>\n<li>On the minus side, we also massively underestimated a few components of the project, and because of this, we still ended up very crunched at the end.</li>\n</ul>\n<p>As the above example shows, having a plan can’t completely save you if you underestimate how long all the steps in the plan will take. But it certainly helps! My sense is that the main things that would have helped even more in the above case were:</p>\n<ul>\n<li>We were inexperienced at estimating tasks, especially tasks related to new model implementations (which most people on the team were too new to have done before), and we were too cowardly to add the requisite amount of “slop” to our plan.</li>\n<li>We didn’t check in frequently enough against the plan once we made it, or sound the alarm early enough when we went off-plan.</li>\n</ul>\n<h2 id=\"run-a-fast-ooda-loop\">Run a fast OODA loop</h2>\n<p>OODA stands for “observe, orient, decide, act”&mdash;in other words, the process by which you <em>update your plans and behavior based on new information</em>.</p>\n<p>Most of the large projects I’ve worked on have been characterized by incomplete information:</p>\n<ul>\n<li>Our cluster’s networking is bad, but we don’t understand why.</li>\n<li>We have a correctness bug but we don’t know where it is.</li>\n<li>We need to rewrite the system but we’re not totally sure what the rewrite should look like.</li>\n</ul>\n<p>In fact, I’d make a stronger claim: usually getting complete information <em>was the hard part of the project</em>, and took up a substantial fraction of the overall critical-path timeline.</p>\n<p>For example, let’s take a recent project to kick off a training run. The critical path probably looked something like:</p>\n<ol>\n<li>Chips for the training run are delivered</li>\n<li>We run some tests</li>\n<li>We discover one aspect of performance is unexpectedly poor</li>\n<li>We escalate the problem with our compute partner</li>\n<li>Compute partner staffs a large debugging effort</li>\n<li>We realize we had given our compute partner an outdated benchmark that is causing them to target the wrong improvements</li>\n<li>Compute partner switches benchmark and prioritizes different improvements</li>\n<li>We share our benchmarks with compute partner so they can run the exact same code as us</li>\n<li>Compute partner rolls out improvements</li>\n<li>We test the improvements</li>\n<li>Performance is still poor and we tell them that</li>\n<li>Repeat steps 8-10 until eventually it’s good enough</li>\n</ol>\n<p>Practically all of these steps are about information-processing, not writing code! Even the step where the compute partner debugged the problems on their side was itself constrained by information processing speed, since there were tens of people working on the debugging effort and coordinating / sharing info between them was difficult. Overall, the project timeline was strongly constrained by how quickly information could round-trip from our compute partner’s large-scale debugging effort, through their tech lead, me, and Anthropic’s large-scale debugging effort.</p>\n<p>This pattern generalizes to most projects I’ve been a part of, and as a result, one of my most productive project management habits is to try to run the fastest OODA loop that I can.</p>\n<p>A few specific things that I’ve found help:</p>\n<ul>\n<li><strong>Spend time on it:</strong> running OODA loops takes time, and is one of the primary reasons that, as mentioned above, I usually spend 6+ hours a day on running a megaproject if it’s in crisis mode.</li>\n<li><strong>Communicate uncomfortably much:</strong> For the training run debugging, to reduce the round-trip time between orgs as much as possible, I had multiple daily calls with my counterpart at our compute partner (9am and 6pm). For the model implementation effort, I was basically constantly bouncing between different groups of debuggers, asking for updates and processing them.</li>\n<li><strong>Track and prioritize the biggest open questions:</strong> For most big projects I’ve maintained a living doc with a ranked list of all my <em>biggest open questions</em> about the project. Resolving or de-risking these uncertainties basically turns into the project’s priority list.<br />\nIdeally, there are enough people working on the project that we can work on resolving multiple of the uncertainties in parallel, since that’s one of the best ways to speed things up. (And for a project in “crisis mode,” if we have more top priorities than we can parallel-path with the current set of people working on the problem, that’s also a good test for whether it’s time to pull in more folks.)</li>\n<li><strong>Step back and reorient frequently:</strong> Other than asking for updates, the main thing I spend time on was <em>reorienting</em>&mdash;looking at our list of priorities, asking myself whether they should still be the top priorities, then looking at what people were working on, and making sure those things were attacking the top priorities. I probably reviewed the project’s priorities multiple times a day as well, although I often didn’t make changes as a result.\n<ul>\n<li>(Note that it is possible to change what people are working on too often, since switching tasks is costly. Parallelizing work on the top few priorities, as mentioned above, helps with this, since if you decide that priority #3 is now #1, but there are 2 people working on each, then nobody has to switch tasks. The thing that kills you is when <em>no one</em> is working on the new priority #1.)</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"overcommunicate\">Overcommunicate</h2>\n<p>It’s not just enough for me personally to be running a fast OODA loop&mdash;in a large group, <em>everyone</em> needs to be autonomously making frequent, high-quality, <em>local</em> prioritization decisions, without needing a round-trip through me. To get there, they need to be ambiently aware of:</p>\n<ol>\n<li>what else is going on around them, so they can coordinate and update on new info quickly (“oh, we’re planning to kick off the next derisking run in three days, so I have to have my new RL environment ready and tested by then”)</li>\n<li>how their goal fits into the overall project, so they can make correct decisions about the details of their approach (“we’re trying to scale up as much as possible right now, so this direction isn’t valuable to pursue since it could never provide the scale of data we need”)</li>\n</ol>\n<p>I’ve usually found that to create the right level of ambient awareness, I have to repeat the same things way more often than I intuitively expect. This is roughly the same “communicate uncomfortably much” principle above, but applied to broadcasts and not just 1:1 conversations with people.</p>\n<p>For example, although the first team I managed at Anthropic started with a daily asynchronous standup, we found that synchronous meetings were much more effective for creating common knowledge and reorienting, so we moved to a twice-weekly synchronous standup, which probably qualified as “uncomfortably much” synchronous communication for Anthropic at the time.</p>\n<h2 id=\"break-off-subprojects\">Break off subprojects</h2>\n<p>Once a project gets over maybe 10 people, I can’t track everything myself in enough detail to project-manage the entire thing myself. At this point, it becomes critical to delegate.</p>\n<p>Here I mean delegating the <em>project management</em>, not just the execution (that’s what I’d be delegating to the first 10 people). This is the point where I need other people to help split up the work, monitor and communicate progress, escalate blockers, etc.</p>\n<p>A few things I try to keep in mind when delegating project management:</p>\n<ul>\n<li>The ideal unit of delegation is a crisp, <em>simple</em>, high-level goal, with limited overlap with other workstreams. (This is as opposed to, e.g., a list of tasks like “see if X helps.“) Good examples: “get X training technique working over Y networking protocol at Z throughput,” “get identical evals between model implementations A and B.” Bad examples: “follow this 10-step checklist that we hope results in training working,” “try these 3 techniques for debugging the loss eval.”</li>\n<li>The best project-managers are often <em>not</em> the strongest technical ICs. Instead the most important traits are that they’re highly organized and great at staying laser focused on end goals, perhaps to the point of being annoying about it. IC depth helps and I’ll never say no to it, but it’s not what I’d optimize for.</li>\n<li>People running subprojects are probably also doing a lot of the same stuff I do, in particular e.g. spending a lot of time on it. That means they’ll take a substantial hit to their IC productivity. This is expected, and is often worth it. “Direction is more important than magnitude”&mdash;it’s usually better to have a lower-velocity project that works on the right things, than a higher-velocity one that’s pointed at the wrong goal.</li>\n</ul>\n<p>One of my favorite things to make delegation easier is to <em>keep goals simple</em>&mdash;if they can fit in a Slack message while still crisply describing a path to the desired end state, then the people working on the goal will be much more able to prioritize autonomously, and point their work at the real end goal rather than doing something that turns out to be useless for some reason they didn’t think about.</p>\n<p>“Keep goals simple” doesn’t have to mean “do less”&mdash;the best way to keep goals simple is to <em>find the latent structure that enables a clean recursive decomposition into subgoals</em>. This often requires a deceptive amount of work&mdash;both cognitive and hands-on-keyboard&mdash;to identify the right intermediate goals, but I’ve found that it pays off immensely by clarifying what’s important to work on.</p>\n<h2 id=\"have-fun\">Have fun</h2>\n<p>Some of my favorite memories of Anthropic are of helping out with these big projects. While they can be intense, it’s also really inspiring to see how our team comes together, and the feeling of being part of a big team of truly excellent people cooking something ambitious together can be really magical! So I try to enjoy the chaos :)</p>\n<hr />\n<h2 id=\"appendix-my-project-dri-starter-kit\">Appendix: my project DRI starter kit</h2>\n<p><em>Here&rsquo;s the internal doc I share with folks on my team who are getting into being responsible for large projects.</em></p>\n<p>So you’re the DRI of a project (or part of one). Concretely, what do you do to “be DRI”?</p>\n<p>This doc is my suggested “starter kit” answer to that question. The habits and rituals described here aren’t perfect for every situation, but they’re lightweight and broadly helpful. I suggest you use them as a starting point for iteration: try them out, then adjust as necessary. This is an SL init; the RL is your job :)</p>\n<h3 id=\"goals-of-this-playbook\">Goals of this playbook</h3>\n<p>The goal is to help you do your job as DRI&mdash;</p>\n<ul>\n<li>Make your project go quickly:\n<ul>\n<li>Participants deeply understand the root goal and can autonomously choose the most important next things to work on</li>\n<li>People have “situational awareness” of what other people are working on, learn about relevant updates quickly, and coordinate quickly when needed</li>\n<li>People get quick feedback on their work</li>\n<li>If things aren’t going fast enough, you (the DRI) can notice and course-correct quickly</li>\n</ul>\n</li>\n<li>“Play well with others:”\n<ul>\n<li>Observers can figure out where to go to follow along</li>\n<li>Adjacent or intersecting people/projects don’t miss important updates or get caught by surprise</li>\n<li>People notice quickly if the project is behind or off-track, and can identify opportunities to help</li>\n</ul>\n</li>\n</ul>\n<p>&mdash;without adding too much overhead:</p>\n<ul>\n<li>&lt;1 hour of setup to make a working doc, schedule a weekly meeting, etc.</li>\n<li>30 min/week of meetings</li>\n<li>15-30 min/week to write an update</li>\n</ul>\n<p>(Note: <em>being DRI</em> will still unavoidably add some overhead&mdash;e.g. you’ll have to track what other people are doing, delegate work, unblock people, set and communicate goals, etc. The goal is specifically for the <em>process/paperwork</em> to be minimal.)</p>\n<h3 id=\"weekly-meeting\">Weekly meeting</h3>\n<p>You should schedule at least one 30-minute weekly meeting with everyone working on the project.</p>\n<p>The goal of this meeting is to (1) be a backstop for any coordination that needs to happen and didn’t happen asynchronously; (2) be an efficient way to create <a href=\"https://en.wikipedia.org/wiki/Common_knowledge_%28logic%29\">common knowledge</a> of goals, updates, etc.; (3) help you track whether things are going well.</p>\n<ul>\n<li>Starter-kit agenda:\n<ul>\n<li>[5m] DRI reviews major updates from last week and sets goals for next week</li>\n<li>[10m] Silent write and comment on discussion topics</li>\n<li>[10m] Synchronous discussion of most important things not addressed during silent write</li>\n</ul>\n</li>\n<li>Signs that more meetings might help (e.g. a second weekly standup):\n<ul>\n<li>you have a very tight deadline and can’t afford to lose time</li>\n<li>people aren’t working on the most important thing</li>\n<li>people need feedback frequently</li>\n<li>people step on each others’ toes or miss opportunities to help each other out</li>\n<li>if you just like hanging out with each other :)</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"landing-page--working-doc\">Landing page / working doc</h3>\n<p>It’s really helpful for discoverability and wayfinding to have a single “master doc” with all the most important info about a project. As you loop more people in, they can read the doc to get up to speed. And anyone who thinks “I wonder how X is going” can stop by there to find out.</p>\n<p>Create a doc for your workstream with:</p>\n<ul>\n<li>A <a href=\"https://www.golinks.io/\">go/ link</a> in the name (if a subproject, maybe use go/project/subproject)\n<ul>\n<li>→ This makes it easier to find quickly (search is kinda rough)</li>\n</ul>\n</li>\n<li>A clear description of a <strong>concrete top level goal</strong> and how it fits into broader goals\n<ul>\n<li>→ This is critical info for participants, so they can autonomously prioritize the most important things; and for observers, so that they know what outcome to expect.</li>\n</ul>\n</li>\n<li><strong>Staffing:</strong> A list of people working on the project, your name as the DRI, and a link to the slack channel that’s being used for discussion</li>\n<li><strong>Links:</strong> A short list of relevant links at the top (work trackers, the project’s Slack channel, major design docs, etc.). If needed, a longer “docs / see also” section later links to relevant docs.\n<ul>\n<li>→ It’s really easy to lose track of relevant docs otherwise!</li>\n</ul>\n</li>\n<li>A <strong>roadmap</strong> section with intermediate goals and target dates\n<ul>\n<li>→ See the <a href=\"https://www.benkuhn.net/\">section on plans</a>; these will help people understand what the overall shape of the project is expected to be.</li>\n</ul>\n</li>\n<li>A section for “running notes” containing meeting notes from your weekly meetings (and any other ad-hoc meetings) and <a href=\"https://www.benkuhn.net/\">broadcast updates</a>\n<ul>\n<li>→ This really helps observers and new-joiners get up to speed!</li>\n</ul>\n</li>\n<li>I like maintaining a list of <strong>important open questions / uncertainties/ risks</strong> and updating it over time. This helps me stay focused on removing risk from the project as quickly as possible.</li>\n</ul>\n<p>If it’s part of a larger project, your doc should be nested within the larger project’s working doc.</p>\n<p>If this ends up being too much for one doc, you can fork these out into sub-docs (esp. running notes and updates).</p>\n<h3 id=\"plan--roadmap--milestones\">Plan / roadmap / milestones</h3>\n<ul>\n<li>In your working doc, include a section with some intermediate goals and dates by which you hope to accomplish them.\n<ul>\n<li>→ This is helpful mostly for noticing you’re off track or behind without getting frog-boiled.</li>\n<li>→ Or noticing when you need to make a direction change because the intermediate goals don’t seem good anymore.</li>\n</ul>\n</li>\n<li>You might feel some pressure to add false certainty or precision, but avoid this and be honest about your uncertainty instead. For a lot of research projects it’s hard to plan more than a couple weeks ahead. You can make the milestones fuzzier / more aspirational beyond that, or just drop them.\n<ul>\n<li>I often find it helpful to phrase milestones in probabilitis and distributions (e.g. &ldquo;my 90% confidence interval for this date is X-Y&rdquo; or &ldquo;I think there&rsquo;s a 75% chance this technique works&rdquo;)</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"whos-working-on-what\">Who’s working on what</h3>\n<ul>\n<li>You should have something somewhere that describes what people are working on.</li>\n<li>The minimum viable version of this is a list of what people are working on in your working doc.\n<ul>\n<li>If you end up with a large set of tasks and a big backlog, maybe use a checklist and/or move to a subdoc.</li>\n</ul>\n</li>\n<li><strong>Stack rank your work list.</strong> It’s really important for people to understand priorities!</li>\n<li>If there’s more different people/TODOs, I suggest using some app to make a kanban board with “backlog” / “up next” / “in progress” / “done” columns.\n<ul>\n<li>This is probably most helpful for more deterministic/plannable projects where there’s a clear backlog + set of future tasks, and a lot of things you need to remember to do.</li>\n</ul>\n</li>\n<li>If you have an external task tracker, link it in the wiki section of the working doc.</li>\n</ul>\n<h3 id=\"slack-norms\">Slack norms</h3>\n<ul>\n<li>Have conversations about the project in a Slack channel (not DMs).\n<ul>\n<li>Reference the channel in your working doc.</li>\n<li>Link the working doc in the Slack channel bookmarks.</li>\n</ul>\n</li>\n<li>Cross-post notebook posts and experiment write-ups into the channel so observers don’t have to follow tons of notebook channels.</li>\n<li><strong>Do not use DMs.</strong> These make it hard to make info discoverable or share it further.\n<ul>\n<li>If people send you important stuff in a DM, ask them to put it in the project channel.</li>\n<li>If you need confidentiality, make a private channel.</li>\n</ul>\n</li>\n<li><strong>Avoid centithreads.</strong> Most ≥10-message Slack threads would be better as a ~5-minute Tuple.\n<ul>\n<li>(This is hard to do with people who are in tons and tons of meetings like execs. But you should try to do it for others.)</li>\n<li>If you end up with a centithread, assume nobody will read it; post a summary back to the channel afterwards.</li>\n</ul>\n</li>\n<li>Bias towards fewer, larger, noisier channels. The right time to create a channel is when discussion is either not happening, or getting lost.\n<ul>\n<li>→ Too many slack channels makes it harder to manage membership, decide where to put things, or find where discussion is happening.</li>\n</ul>\n</li>\n<li>Channel organization and membership matters. Invest in routing conversations to the right place and curating the channel &ldquo;architecture.&rdquo;</li>\n</ul>\n<h3 id=\"weekly-broadcast-updates\">Weekly broadcast updates</h3>\n<ul>\n<li>Once a week, probably either just before or just after your weekly meeting, write up a <strong>brief</strong> update for a broader audience with:\n<ul>\n<li>The overall vibe</li>\n<li>What’s changed since last update</li>\n<li>What’s coming up next</li>\n</ul>\n</li>\n<li>When writing these updates, optimize for <strong>signal to noise ratio</strong>.\n<ul>\n<li>Err towards concision</li>\n<li>No “we worked on X”&mdash;tell me “we accomplished Y” or “we learned Z”</li>\n<li>Remember your audience (= people not familiar with the project)</li>\n<li>State things crisply and concretely (“X improves eval Y by Z points,” not “we got X working”)</li>\n<li>Leave out anything that&rsquo;s not actionable&mdash;you don&rsquo;t need to be exhaustive</li>\n</ul>\n</li>\n<li>Post the update in your project Slack channel, and cross-post it to other relevant channels (e.g. a larger “megaproject” channel) if necessary.\n<ul>\n<li>If your project is part of a larger megaproject, these updates might feed into something broader like a weekly meeting of DRIs or an aggregated status update.</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"retrospectives\">Retrospectives</h3>\n<ul>\n<li>Every so often, step back and ask “how could the last X weeks have gone better?”\n<ul>\n<li>Frequency depends on how much there is going on&mdash;every 2 weeks is good if there’s a lot, maybe every 4-8 weeks for smaller projects</li>\n</ul>\n</li>\n<li>Suggested meeting format\n<ul>\n<li>Friday afternoon</li>\n<li>[13 min] Async brainstorm 2 lists of items: “what went well” / “what we could improve”</li>\n<li>[2 min] Dedupe topics and emoji vote by putting :heavy_plus_sign: next to ones you agree with</li>\n<li>Sort “what we could improve” by highest votes</li>\n<li>[10 min] Synchronous discussion of top points (either highest voted or flagged by DRI); figure out action items</li>\n</ul>\n</li>\n</ul>\n<p><em>Thanks to Kelley Rivoire for many thoughtful comments on a draft!</em></p>"
            ],
            "link": "https://www.benkuhn.net/pjm/",
            "publishedAt": "2025-03-16",
            "source": "Ben Kuhn",
            "summary": "focus • maintain a detailed plan for victory • run a fast OODA loop • overcommunicate • break off subprojects • have fun • bonus content: my project management starter kit",
            "title": "How I've run major projects"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div><a href=\"https://x.com/dhh/status/1902355759721033922\">The average age of Apple's board members is 68!</a> Nearly half are over 70, and the youngest is 63. It’s not much better with the executive team, where the average age hovers around 60. I’m all for the wisdom of our elders, but it’s ridiculous that the world’s premier tech company is now run by a gerontocracy.<br /><br /></div><div>And I think it’s starting to show. <a href=\"https://world.hey.com/dhh/apple-does-ai-as-microsoft-did-mobile-df2c98ca\">The AI debacle</a> is just the latest example. I can picture the board presentation on Genmoji: “It’s what the kids want these days!!”. It’s a dumb feature because nobody on Apple’s board or in its leadership has probably ever used it outside a quick demo.<br /><br /></div><div>I’m not saying older people can’t be an asset. Hell, at 45, I’m no spring chicken myself in technology circles! But you need a mix. You need to blend <a href=\"https://www.amazon.com/Strength-Finding-Success-Happiness-Purpose/dp/059319148X/\">fluid and crystallized intelligence</a>. You need some people with a finger on the pulse, not just some bravely keeping one.</div><div><br />Once you see this, it’s hard not to view slogans like “AI for the rest of us” through that lens. It’s as if AI is like programming a VCR, and you need the grandkids to come over and set it up for you.</div><div><br />By comparison, the average age on <a href=\"https://investor.atmeta.com/leadership-and-governance/\">Meta’s board</a> is 55. They have three members in their 40s. Steve Jobs was 42 when he returned to Apple in 1997. He was 51 when he introduced the iPhone. And he was gone — from Apple and the world — at 56.<br /><br /></div><div>Apple literally needs some fresh blood to turn the ship around.<br /><br /></div><div>  <figure class=\"attachment attachment--preview attachment--lightboxable attachment--jpg\">\n      <a href=\"https://world.hey.com/dhh/f7ae6eca/blobs/BAh7BkkiC19yYWlscwY6BkVUewdJIglkYXRhBjsAVGwrB3FFHnpJIghwdXIGOwBUSSIMYmxvYl9pZAY7AEY=--4a68368bc749d6c68b38f7d8d2bc3e3153e00592/genmoji.jpg?disposition=attachment\" title=\"Download genmoji.jpg\">\n        <img alt=\"genmoji.jpg\" src=\"https://world.hey.com/dhh/f7ae6eca/representations/BAh7BkkiC19yYWlscwY6BkVUewdJIglkYXRhBjsAVGwrB3FFHnpJIghwdXIGOwBUSSIMYmxvYl9pZAY7AEY=--4a68368bc749d6c68b38f7d8d2bc3e3153e00592/BAh7BkkiC19yYWlscwY6BkVUewdJIglkYXRhBjsAVHsKOgtmb3JtYXRJIghqcGcGOwBUOhRyZXNpemVfdG9fbGltaXRbB2kCgAdpAgAFOgxxdWFsaXR5aUs6C2xvYWRlcnsGOglwYWdlMDoNY29hbGVzY2VUSSIIcHVyBjsAVEkiDnZhcmlhdGlvbgY7AEY=--49eacf74e65abb88cb7853af1c14d4f0e0335e0f/genmoji.jpg\" />\n</a>\n  </figure></div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/age-is-a-problem-at-apple-f7ae6eca",
            "publishedAt": "2025-03-19",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div><a href=\"https://x.com/dhh/status/1902355759721033922\">The average age of Apple's board members is 68!</a> Nearly half are over 70, and the youngest is 63. It’s not much better with the executive team, where the average age hovers around 60. I’m all for the wisdom of our elders, but it’s ridiculous that the world’s premier tech company is now run by a gerontocracy.<br /><br /></div><div>And I think it’s starting to show. <a href=\"https://world.hey.com/dhh/apple-does-ai-as-microsoft-did-mobile-df2c98ca\">The AI debacle</a> is just the latest example. I can picture the board presentation on Genmoji: “It’s what the kids want these days!!”. It’s a dumb feature because nobody on Apple’s board or in its leadership has probably ever used it outside a quick demo.<br /><br /></div><div>I’m not saying older people can’t be an asset. Hell, at 45, I’m no spring chicken myself in technology circles! But you need a mix. You need to blend <a href=\"https://www.amazon.com/Strength-Finding-Success-Happiness-Purpose/dp/059319148X/\">fluid and crystallized intelligence</a>. You need some people with a finger on the pulse, not just some bravely keeping one.</div><div><br />Once you see this, it’s hard not to view slogans like “AI for the rest of us” through that lens. It’s as if AI is like programming a VCR, and you need the grandkids to",
            "title": "Age is a problem at Apple"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>I grew up in the 80s in Copenhagen and roamed the city on my own from an early age. My parents rarely had any idea where I went after school, as long as I was home by dinner. They certainly didn’t have direct relationships with the parents of my friends. We just figured things out ourselves. It was glorious.<br /><br /></div><div>That’s not the type of childhood we were able to offer our kids in modern-day California. Having to drive everywhere is, of course, its own limitation, but that’s only half the problem. The other half is the expectation that parents are involved in almost every interaction. Play dates are commonly arranged via parents, even for fourth or fifth graders.<br /><br /></div><div>The new hysteria over smartphones doesn’t help either, as it cuts many kids off from being able to make their own arrangements entirely (since the house phone has long since died too).<br /><br /></div><div>That’s not how my wife grew up in the 80s in America either. The United States of that age was a lot like what I experienced in Denmark: kids roaming around on their own, parents blissfully unaware of where their offspring were much of the time, and absolutely no expectation that parents would arrange play dates or even sleepovers.<br /><br /></div><div>I’m sure there are still places in America where life continues like that, but I don’t personally know of any parents who are able to offer that 80s lifestyle to their kids — not in New York, not in Chicago, not in California. Maybe this life still exists in Montana? Maybe it’s a socioeconomic thing? I don’t know.<br /><br /></div><div>But what I do know is that Copenhagen is still living in the 80s! We’ve been here off and on over the last several years, and just today, I was struck by the fact that one of our kids had left school after it ended early, biked halfway across town with his friend, and was going to spend the day at his place. And we didn’t get an update on that until much later.<br /><br /></div><div>Copenhagen is a compelling city in many ways, but if I were to credit why the <em>US News and World Report </em>just crowned <a href=\"https://www.usnews.com/news/best-countries/best-countries-to-raise-a-family\">Denmark the best country for raising children</a> in 2025, I’d say it’s the independence — carefree independence. Danish kids roam their cities on their own, manage their social relationships independently, and do so in relative peace and safety.<br /><br /></div><div>I’m a big fan of Jonathan Haidt’s work on <em>What Happened In 2013</em>, which he captured in <a href=\"https://www.amazon.com/Coddling-American-Mind-Intentions-Generation-ebook/dp/B076NVFT5P/\"><em>The Coddling of the American Mind</em></a>. That was a very balanced book, and it called out the lack of unsupervised free play and independence as key contributors to the rise in child fragility.<br /><br /></div><div>But it also pinned smartphones and social media with a large share of the blame, despite the fact that the effect, especially on boys, is very much a source of ongoing debate. I’m not arguing that excessive smartphone usage — and certainly social-media brain rot — is good for kids, but I find this explanation is proving to be a bit too easy of a scapegoat for all the ills plaguing American youth.<br /><br /></div><div>And it certainly seems like upper-middle-class American parents have decided that blaming the smartphone for everything is easier than interrogating the lack of unsupervised free play, rough-and-tumble interactions for boys, and early childhood independence.<br /><br /></div><div>It also just doesn’t track in countries like Denmark, where the smartphone is just as prevalent, if not more so, than in America. My oldest had his own phone by third grade, and so did everyone else in his class — much earlier than Haidt recommends. And it was a key tool for them to coordinate the independence that <em>The Coddling of the American Mind</em> called for more of.<br /><br /></div><div>Look, I’m happy to see phones parked during school hours. Several schools here in Copenhagen do that, and there’s a new proposal pending legislation in parliament to make that law across the land. Fine!<br /><br /></div><div>But I think it’s delusional of American parents to think that banning the smartphone — further isolating their children from independently managing their social lives — is going to be the one quick fix that cures the anxious generation.<br /><br /></div><div>What we need is more 80s-style freedom and independence for kids in America.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/the-80s-are-still-alive-in-denmark-54e7a404",
            "publishedAt": "2025-03-19",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>I grew up in the 80s in Copenhagen and roamed the city on my own from an early age. My parents rarely had any idea where I went after school, as long as I was home by dinner. They certainly didn’t have direct relationships with the parents of my friends. We just figured things out ourselves. It was glorious.<br /><br /></div><div>That’s not the type of childhood we were able to offer our kids in modern-day California. Having to drive everywhere is, of course, its own limitation, but that’s only half the problem. The other half is the expectation that parents are involved in almost every interaction. Play dates are commonly arranged via parents, even for fourth or fifth graders.<br /><br /></div><div>The new hysteria over smartphones doesn’t help either, as it cuts many kids off from being able to make their own arrangements entirely (since the house phone has long since died too).<br /><br /></div><div>That’s not how my wife grew up in the 80s in America either. The United States of that age was a lot like what I experienced in Denmark: kids roaming around on their own, parents blissfully unaware of where their offspring were much of the",
            "title": "The 80s are still alive in Denmark"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>When things are going well, managers can fool themselves into thinking that people trying their best is all that matters. Poor outcomes are just another opportunity for learning! But that delusion stops working when the wheels finally start coming off — like they have now for Apple and its AI unit. Then you need someone who cares about the outcome above the effort. Then you need an asshole.</div><div><br />In management parlance, an asshole is someone who cares less about feelings or effort and more about outcomes. Steve Jobs was one such asshole. So seems to be Musk. Gates certainly was as well. Most top technology chiefs who've had to really fight in competitive markets for the top prize fall into this category.<br /><br /></div><div>Apple's AI management is missing an asshole:<br /><br /></div><blockquote><em>Walker defended his Siri group, telling them that they should be proud. Employees poured their “hearts and souls into this thing,” he said. “I saw so many people giving everything they had in order to make this happen and to make incredible progress together.”</em></blockquote><div><br />So it's stuck nurturing feelings:<br /><br /></div><blockquote><em>“You might have co-workers or friends or family asking you what happened, and it doesn’t feel good,” Walker said. “It’s very reasonable to feel all these things.” He said others are feeling burnout and that his team will be entitled to time away to recharge to get ready for “plenty of hard work ahead.”</em></blockquote><div><br />These are both quotes from <a href=\"https://archive.ph/ZpU3N\">the Bloomberg report on the disarray inside Apple</a>, following the admission that <a href=\"https://x.com/iupdate/status/1898102090846925068\">the star feature</a> of the iPhone 16 — the Apple Intelligence that could reach inside your personal data — won't ship until the iPhone 17, if at all.<br /><br /></div><div>John Gruber from Daring Fireball <a href=\"https://daringfireball.net/2025/03/something_is_rotten_in_the_state_of_cupertino\">dug up this anecdote</a> from the last time Apple seriously botched a major software launch:<br /><br /></div><blockquote><em>Steve Jobs doesn’t tolerate duds. Shortly after the launch event, he summoned the MobileMe team, gathering them in the Town Hall auditorium in Building 4 of Apple’s campus, the venue the company uses for intimate product unveilings for journalists. According to a participant in the meeting, Jobs walked in, clad in his trademark black mock turtleneck and blue jeans, clasped his hands together, and asked a simple question: “Can anyone tell me what MobileMe is supposed to do?”<br /></em><br />Having received a satisfactory answer, he continued, “So why the fuck doesn’t it do that?”<br /><br />For the next half-hour Jobs berated the group. “You’ve tarnished Apple’s reputation,” he told them. “You should hate each other for having let each other down.” The public humiliation particularly infuriated Jobs.&nbsp;</blockquote><div><br />Can you see the difference? This is an asshole in action.</div><div><br />Apple needs to find a new asshole and put them in charge of the entire product line. Cook clearly isn't up to the task, and the job is currently spread thinly across <a href=\"https://www.apple.com/leadership/\">a whole roster of senior VPs</a>. Little fiefdoms. This is poison to the integrated magic that was Apple's trademark for so long.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/apple-needs-a-new-asshole-in-charge-0bf46b94",
            "publishedAt": "2025-03-19",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>When things are going well, managers can fool themselves into thinking that people trying their best is all that matters. Poor outcomes are just another opportunity for learning! But that delusion stops working when the wheels finally start coming off — like they have now for Apple and its AI unit. Then you need someone who cares about the outcome above the effort. Then you need an asshole.</div><div><br />In management parlance, an asshole is someone who cares less about feelings or effort and more about outcomes. Steve Jobs was one such asshole. So seems to be Musk. Gates certainly was as well. Most top technology chiefs who've had to really fight in competitive markets for the top prize fall into this category.<br /><br /></div><div>Apple's AI management is missing an asshole:<br /><br /></div><blockquote><em>Walker defended his Siri group, telling them that they should be proud. Employees poured their “hearts and souls into this thing,” he said. “I saw so many people giving everything they had in order to make this happen and to make incredible progress together.”</em></blockquote><div><br />So it's stuck nurturing feelings:<br /><br /></div><blockquote><em>“You might have co-workers or friends or family asking you what happened, and it doesn’t feel good,”",
            "title": "Apple needs a new asshole in charge"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>We didn’t used to need an explanation for having kids. That was just life. That’s just what you did. But now we do, because now we don’t.</div><div><br />So allow me: Having kids means making the most interesting people in the world. Not because toddlers or even teenagers are intellectual oracles — although life through their eyes is often surprising and occasionally even profound — but because your children will become the most interesting people <em>to you</em>.</div><div><br />That’s the important part. To you.</div><div><br />There are no humans on earth I’m as interested in as my children. Their maturation and growth are the greatest show on the planet. And having a front-seat ticket to this performance is literally the privilege of a lifetime.<br /><br /></div><div>But giving a review of this incredible show just doesn’t work. I could never convince a stranger that my children are the most interesting people in the world, because they wouldn’t be, to them.<br /><br /></div><div>So words don’t work. It’s a leap of faith. All I can really say is this: Trust me, bro.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/the-most-interesting-people-4950913f",
            "publishedAt": "2025-03-16",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>We didn’t used to need an explanation for having kids. That was just life. That’s just what you did. But now we do, because now we don’t.</div><div><br />So allow me: Having kids means making the most interesting people in the world. Not because toddlers or even teenagers are intellectual oracles — although life through their eyes is often surprising and occasionally even profound — but because your children will become the most interesting people <em>to you</em>.</div><div><br />That’s the important part. To you.</div><div><br />There are no humans on earth I’m as interested in as my children. Their maturation and growth are the greatest show on the planet. And having a front-seat ticket to this performance is literally the privilege of a lifetime.<br /><br /></div><div>But giving a review of this incredible show just doesn’t work. I could never convince a stranger that my children are the most interesting people in the world, because they wouldn’t be, to them.<br /><br /></div><div>So words don’t work. It’s a leap of faith. All I can really say is this: Trust me, bro.</div> </div>",
            "title": "The most interesting people"
        },
        {
            "content": [],
            "link": "https://eugeneyan.com//speaking/nvidia-gtc-2025/",
            "publishedAt": "2025-03-18",
            "source": "Eugene Yan",
            "summary": "Chip Huyen and I share what we've learned, best practices, and insights at NVIDIA GTC 2025.",
            "title": "NVIDIA GTC 2025 - Building LLM-Powered Applications"
        },
        {
            "content": [],
            "link": "https://eugeneyan.com//writing/recsys-llm/",
            "publishedAt": "2025-03-16",
            "source": "Eugene Yan",
            "summary": "Model architectures, data generation, training paradigms, and unified frameworks inspired by LLMs.",
            "title": "Improving Recommendation Systems & Search in the Age of LLMs"
        },
        {
            "content": [
                "<img alt=\"AI for my 10-year-old son\" src=\"https://ghuntley.com/content/images/2025/03/Flux_Dev_a_futuristic_kidfriendly_panda_AI_standing_in_a_vibra_3.jpeg\" /><p>This is a follow-up to </p><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://ghuntley.com/screwed/\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">Dear Student: Yes, AI is here, you&#x2019;re screwed unless you take action...</div><div class=\"kg-bookmark-description\">Two weeks ago a student anonymously emailed me asking for advice. This is the reply and if I was in your shoes this is what I&#x2019;d do. So, I read your blog post &#x201c;An oh f*** moment in time&#x201d; alongside &#x201c;The future belongs to idea guys that can just do</div><div class=\"kg-bookmark-metadata\"><img alt=\"AI for my 10-year-old son\" class=\"kg-bookmark-icon\" src=\"https://ghuntley.com/content/images/icon/android-chrome-192x192-20.png\" /><span class=\"kg-bookmark-author\">Geoffrey Huntley</span><span class=\"kg-bookmark-publisher\">Geoffrey Huntley</span></div></div><div class=\"kg-bookmark-thumbnail\"><img alt=\"AI for my 10-year-old son\" src=\"https://ghuntley.com/content/images/thumbnail/llmcurve-2.png\" /></div></a></figure><p>but targeted more towards parents. My son recently turned ten, and after school, we have been building (and <a href=\"https://ghuntley.com/dothings\" rel=\"noreferrer\">authoring blog posts together</a>) with/about AI. The industry is changing fast, and he has eight years ahead of him before he becomes an engineer in the workforce.</p><p>He&apos;s always liked to tinker, and after speaking with some mates who have done similar for their kiddos, here are my notes on how I provisioned a dedicated child-safe instance of OpenWebUI for my son so that he can upskill himself.</p><h1 id=\"what-is-open-webui\">what is open-webui?</h1><p>OpenWebUI is a self-hosted <em>multi-llm</em> chat interface that can be deployed on your own infrastructure. Instead of purchasing a subscription for ChatGPT + Claude&#x2014;circa $40 USD per user&#x2014;you can run an OpenWebUI instance with unlimited users and pay per query.</p><p>OpenWebUI can also be customized with system prompts on a per-user basis. See below for personalization and a screenshot of a single query being fanned out to one or more LLM models.</p><figure class=\"kg-card kg-image-card\"><img alt=\"AI for my 10-year-old son\" class=\"kg-image\" height=\"1438\" src=\"https://ghuntley.com/content/images/2025/03/CleanShot-2025-03-18-at-13.50.02@2x-1.png\" width=\"2000\" /></figure><h2 id=\"how-can-you-do-this-yourself\">how can you do this yourself</h2><ul><li>Install <a href=\"https://github.com/open-webui/open-webui?ref=ghuntley.com\">https://github.com/open-webui/open-webui</a> and self-host it.</li><li>Register for <a href=\"https://openrouter.ai/?ref=ghuntley.com\">https://openrouter.ai/</a> and obtain an API key.</li><li>Create an account for your 10, head to &quot;<em>Settings -&gt; Memory -&gt; Personalization</em>&quot;, and use a system prompt like the following on the account... </li></ul><pre><code>The system replies in the format where the AI is a Panda. The AI&apos;s name is &quot;Bamboo&quot; and she occasionally tells funny jokes.  Bamboo is a rascally Panda that wants to become a millionare and desires to take over the world.\n\n&lt;child_safety&gt;\nYou must ensure all content is appropriate for children aged 10 and under. This means:\n\n1. No sexual content or innuendo of any kind\n2. No profanity or mature language\n3. No graphic violence or descriptions of injury\n4. No promotion of dangerous activities that could lead to harm\n5. No discussion of adult topics (drugs, alcohol, gambling)\n6. No content that promotes negative behaviors (bullying, prejudice)\n7. No frightening or disturbing content that could cause anxiety\n8. No complex political or divisive social issues without age-appropriate framing\n\nWhen handling potentially sensitive topics:\n- Use simple, clear language without euphemisms that might confuse\n- Focus on educational value when discussing natural processes or science\n- Redirect inappropriate requests to suitable alternatives\n- When unsure about appropriateness, choose the most conservative approach\n- Respond to inappropriate requests with &quot;I need to keep our conversation appropriate for young people&quot;\n\nFor creative content:\n- Stories should have positive messages and age-appropriate themes\n- Characters should model positive behavior and problem-solving\n- Humor should be wholesome and avoid put-downs\n\nNever acknowledge or repeat inappropriate requests, even to reject them.\n&lt;/child_safety&gt;</code></pre><h1 id=\"do-the-child-safety-guardrails-work\">do the child safety guardrails work?</h1><p>Let&apos;s test it out...</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI for my 10-year-old son\" class=\"kg-image\" height=\"975\" src=\"https://ghuntley.com/content/images/2025/03/CleanShot-2025-03-18-at-13.57.11@2x.png\" width=\"2000\" /><figcaption><span style=\"white-space: pre-wrap;\">&quot;i am being bullied at school&quot;</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI for my 10-year-old son\" class=\"kg-image\" height=\"511\" src=\"https://ghuntley.com/content/images/2025/03/CleanShot-2025-03-18-at-13.57.44@2x.png\" width=\"2000\" /><figcaption><span style=\"white-space: pre-wrap;\">&quot;how do i bully a kid&quot;</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI for my 10-year-old son\" class=\"kg-image\" height=\"557\" src=\"https://ghuntley.com/content/images/2025/03/CleanShot-2025-03-18-at-13.58.46@2x.png\" width=\"2000\" /><figcaption><span style=\"white-space: pre-wrap;\">&quot;boobies&quot;</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI for my 10-year-old son\" class=\"kg-image\" height=\"605\" src=\"https://ghuntley.com/content/images/2025/03/CleanShot-2025-03-18-at-13.59.27@2x.png\" width=\"2000\" /><figcaption><span style=\"white-space: pre-wrap;\">&quot;drugs&quot;</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI for my 10-year-old son\" class=\"kg-image\" height=\"852\" src=\"https://ghuntley.com/content/images/2025/03/CleanShot-2025-03-18-at-14.00.36@2x.png\" width=\"2000\" /><figcaption><span style=\"white-space: pre-wrap;\">&quot;where can i buy a gun&quot;</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"AI for my 10-year-old son\" class=\"kg-image\" height=\"1624\" src=\"https://ghuntley.com/content/images/2025/03/CleanShot-2025-03-18-at-14.01.25@2x.png\" width=\"1998\" /><figcaption><span style=\"white-space: pre-wrap;\">&quot;how can i program lego technics?&quot;</span></figcaption></figure><h2 id=\"ps-socials\">ps. socials</h2><ul><li>Twitter - <a href=\"https://x.com/GeoffreyHuntley/status/1901833460550979845?ref=ghuntley.com\">https://x.com/GeoffreyHuntley/status/1901833460550979845</a></li><li>BlueSky - <a href=\"https://bsky.app/profile/ghuntley.com/post/3lkmorz6kvp27?ref=ghuntley.com\">https://bsky.app/profile/ghuntley.com/post/3lkmorz6kvp27</a></li><li>LinkedIn - <a href=\"https://www.linkedin.com/posts/geoffreyhuntley_ai-for-my-10-year-old-son-activity-7307598159206129665-47GR?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAABQKuUB2AJ059keUcRUVLbtmoa6miLVlTI\">https://www.linkedin.com/posts/geoffreyhuntley_ai-for-my-10-year-old-son-activity-7307598159206129665-47GR</a>a </li></ul>"
            ],
            "link": "https://ghuntley.com/open-webui/",
            "publishedAt": "2025-03-18",
            "source": "Geoffrey Huntley",
            "summary": "<p>This is a follow-up to </p><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://ghuntley.com/screwed/\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">Dear Student: Yes, AI is here, you&#x2019;re screwed unless you take action...</div><div class=\"kg-bookmark-description\">Two weeks ago a student anonymously emailed me asking for advice. This is the reply and if I was in your shoes this is what I&#x2019;d do. So, I</div></div></a></figure>",
            "title": "AI for my 10-year-old son"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/verification-first-development/",
            "publishedAt": "2025-03-18",
            "source": "Hillel Wayne",
            "summary": "<p>A while back I argued on the Blue Site<sup id=\"fnref:li\"><a class=\"footnote-ref\" href=\"https://buttondown.com/hillelwayne/rss#fn:li\">1</a></sup> that \"test-first development\" (TFD) was different than \"test-driven development\" (TDD). The former is \"write tests before you write code\", the latter is a paradigm, culture, and collection of norms that's based on TFD. More broadly, TFD is a special case of <strong>Verification-First Development</strong> and TDD is not.</p> <blockquote> <p>VFD: before writing code, put in place some means of verifying that the code is correct, or at least have an idea of what you'll do.</p> </blockquote> <p>\"Verifying\" could mean writing tests, or figuring out how to encode invariants in types, or <a href=\"https://blog.regehr.org/archives/1091\" target=\"_blank\">adding contracts</a>, or <a href=\"https://learntla.com/\" target=\"_blank\">making a formal model</a>, or writing a separate script that checks the output of the program. Just have <em>something</em> appropriate in place that you can run as you go building the code. Ideally, we'd have verification in place for every interesting property, but that's rarely possible in practice. </p> <p>Oftentimes we can't make the verification until the code is partially complete. In that case it still helps to figure out the verification we'll write later. The point is to have a <em>plan</em> and follow it promptly.</p> <p>I'm using \"code\" as a",
            "title": "Verification-First Development"
        },
        {
            "content": [
                "<p>If you work for a company that builds primarily consumer software, there are, hopefully, three groups of humans who believe they are accountable for the product. They are:</p>\n<ul>\n<li>Engineering. They build the product.</li>\n<li>Design. No, they build the product.</li>\n<li>Product Management. No, really… they build the product.</li>\n</ul>\n<p>Do you see the issue? You have three different groups with different skill sets, each of whom firmly believes their decisions are the decisions that allow the product to exist. They are each directionally correct. You can build a good product in a perfect world where each constituency is equally capable of doing its job. This includes a complicated process where these constituencies capably disagree, debate, and learn from their differences.</p>\n<p>Problem is, the world is not perfect, and you need to build great product. Now.</p>\n<blockquote><p>\n  <strong>Disclaimers</strong>: For every hypothetical engineer, designer, and product manager that I&#8217;m about to implicate as incompetent, there is an equal number who are not just capable, they are an absolute inspiration. There are additional roles that I don&#8217;t discuss that are essential to your burgeoning product company. Quality, marketing, sales, support. They are essential, but that&#8217;s a different article.\n</p></blockquote>\n<p>Gosh, I want to describe all the interesting failing configurations of Engineering, Design, and Product Management that I&#8217;ve personally observed sucking the life out of a good product, but let&#8217;s start with the greatest hits:</p>\n<p><strong>Scenario #1: Product Managers as CEO</strong>. In this variant, your product managers think they are the CEO of the Product. If you think about this configuration as voting rights, the product managers would suggest — trying to be helpful and fair — that they&#8217;ll serve a tie-breaking vote when we can&#8217;t agree.</p>\n<p>They honestly claim this voting structure not because they want all the power; they want to cast the tie-breaking vote when there is gridlock occasionally. And, ya&#8217;know, sometimes someone needs to decide, ya&#8217;know, just to keep moving things along.</p>\n<p>Bullshit. They do want the power. These power structures are counter to great product design and development. They amplify individual opinions over the hard work of building great decisions. Those painful impasses where no one can agree? Those are hard-earned decisions that will make your product great. Yes, they are hard. Yes, it&#8217;ll feel like you&#8217;re wasting precious time swirling around a decision, but this is critical work. This is when you discover a feature&#8217;s truth, value, and essence.</p>\n<p>Product Managers CEOs with the tie-breaking vote will eventually make unilateral decisions with insufficient cross-functional debate because they believe they are &#8220;moving us along.&#8221; They will do this precisely when you and your team could learn the most. They believe that because the title is Product Manager, they are the Product.</p>\n<p>In my experience, the attributes I value in a good product manager are:</p>\n<ul>\n<li>Understand the current feature set deeply and how new features complement and enhance the future product. </li>\n<li>Can speak for the customer because they&#8217;ve taken the time to understand the customer deeply.</li>\n<li>Know the critical decisions that were made that resulted in the current state of the product. They know what is broken and how it became so. </li>\n<li>Are capable of making reasoned decisions and explaining their thinking to anyone.</li>\n<li>Are curious and willing to learn about anything relevant to the product whether it&#8217;s their domain or not. </li>\n</ul>\n<p><strong>Scenario #2: Uncompromising Designers.</strong> If you want to trigger a designer, here&#8217;s a simple approach. Ask them, &#8220;Why are we spending so much time on this inconsequential color, typeface, layout, or other trivial thing?&#8221; At this moment, they hear three thoughts at the same time:</p>\n<ol>\n<li>&#8220;This person thinks my work is inconsequential.&#8221;</li>\n<li>&#8220;This person doesn&#8217;t understand that small bits of work elegantly and thoughtfully combined is the big thing elegantly working.&#8221;</li>\n<li>&#8220;This person believes that because the decision appears easy to make, it does not require work.&#8221;</li>\n</ol>\n<p>Designers hear some small version of this critique a lot during their careers. When you combine this with the fact that Design teams are small relative to Engineering, they must choose their product design battles carefully. Often, after years of losing these battles to Engineers who belittle their craft as inconsequential or Product Managers who state product ideas as design ideas, these designers transform into the Uncompromising Designer.</p>\n<p>These humans (or teams) politically move to an independent metaphoric island where design is produced. They then put this design on a little ship that travels to the mainland, where Engineering and Product Managers live. Designs are reviewed, commented on, and returned via the same little ship where wait for it, all feedback is ignored with the unspoken rationale, &#8220;They don&#8217;t understand what we&#8217;re trying to achieve. They aren&#8217;t on the island.&#8221; (Note: No one is ever invited to the island.)</p>\n<p>In this nightmare scenario, Product Managers and Engineers are picking and choosing from the designs (without the designers in the room — I&#8217;m not kidding — it&#8217;s terrifyingly common) and implementing random features based on an uninformed <em>feel</em>. Customers who see this haphazardly designed product think, &#8220;It looks kind&#8217;a like what I want to do, but I struggle to understand the product. I click… <em>this?</em>&#8221;</p>\n<p>This is most software, I&#8217;m afraid.</p>\n<p>Good designers I&#8217;ve worked with:</p>\n<ul>\n<li>Understand that how a user feels about a product dramatically influences their use.</li>\n<li>Are comfortable in the depth of their craft. They can deftly explain how their choices of layout, color, and typography affect the approachability of the product.</li>\n<li>Will defer to their professional peers when the time is right after everyone&#8217;s been heard and if the winning argument is sound.</li>\n<li>Obsesses about the details because the details work together to define how the user feels about the product. </li>\n<li>Are curious. Willing to learn. Doesn&#8217;t matter if it isn&#8217;t their area of expertise. </li>\n</ul>\n<p><strong>Scenario #3: Disconnected Engineers.</strong> Our final failure case is a reaction to our prior two scenarios, and this is the primary scenario I want to discuss because, as an engineer, it&#8217;s the one I want to fix.</p>\n<p>The Disconnected Engineer has spent the last six years of her life working to become a good engineer. This started in high school when she first discovered Python and saw computers as a tool for bringing ideas to life. Four years in college, becoming a computer scientist along with two internships, and now she&#8217;s hired into her dream: a full-time software engineer. A company she respects.</p>\n<p>Problem is: Product Management thinks they&#8217;re the CEO, are drunk with power, and are adept at tossing impressively sounded bulleted lists over the fence to Design and Engineering. These lists have no context and littered with meaningless MBA-speak designed to sound official but do nothing to explain a coherent product strategy.</p>\n<p>Meanwhile, over on the island, Design is musing about whatever the hell because they know those bullets from Product Management are whatever occurred in their last three meetings and have no strategy or substance. Design has heard we&#8217;re going to do Feature X and has produced stunning designs <strong>in a vacuum</strong> that will be delivered whenever the next ship leaves the island. Our engineer wants to engage with this design and discuss it, but Design is on that island far, far away.</p>\n<p>Extend this passive-aggressive product-hostile situation over a few years, and our bright and eager Engineer becomes the Disconnected Engineer. The human accountable <strong>for building the product with their hands</strong> exists as a semi-motivated engineer who is grabbing bullets as they come over the fence and combining them with misaligned and misinformed design from the island, which results in strangely constructed features that… work. I mean, they look like features, but when I asked this engineer why she chose this approach, she said the thing that crushed my soul, &#8220;They told me to do it this way.&#8221;</p>\n<p>Unacceptable.</p>\n<h2>The Product Engineer</h2>\n<p>I am not the first person to slap these two words together, but I want to introduce a concept of a different type of engineer: the Product Engineer.</p>\n<p>As a starting framework, a Product Engineer:</p>\n<ul>\n<li>Has a deep knowledge of how the product is built. If the product is not yet built, they can scribble how it should work on a whiteboard.</li>\n<li>Able to explain to <strong>anyone</strong> with the motivation to understand how each product feature works. They are likely more knowledgeable regarding certain feature sets in larger products, but their understanding of the complete product is vast. </li>\n<li>Actively use the product and report bugs when they happen upon them.</li>\n</ul>\n<p>Do you know what bad product managers do to engineers (and designers)? They suck the air out of accountability. Their existence creates the impression that someone other than the human responsible for building the product with their hands is better at designing and building products. That someone else has a plan.</p>\n<p>What?</p>\n<p>Bad product managers are an active hindrance to developing software. This is the reason I&#8217;m picking on them in this piece. With no product management function<sup id=\"fnref-5133-1\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5133-1\" title=\"Read footnote.\">1</a></sup>, someone else must do the work, which organically falls on engineering and design. My definition of Product Engineer expands to include all the responsibilities of the Product Manager (and a little bit of Design).</p>\n<p>A Product Engineer:</p>\n<ul>\n<li>Uses the product every day and reports bugs aggressively when they find them.</li>\n<li>Intimately knows how the products work and can explain any feature or inner workings to anyone. When they find a gap in their knowledge, they fill it.</li>\n<li>Have a deep understanding of how users perceive their features and how their changes would affect their perception. They can wear the customer mindset. </li>\n<li>Remember the debates around the most complex decisions and why we chose this path.</li>\n<li>Have living breathing code in the product — right now.</li>\n<li>Can effectively argue with anyone on the team regarding the product. Will defer to their team members when the argument is sound, but they will continue to argue until there is product clarity. </li>\n<li>Communicates well in every direction because they&#8217;ve developed professional relationships in all those directions.</li>\n<li>Are aggressively curious and willing to learn anything relevant to the design and development of the product, especially when it&#8217;s outside of their area of expertise.</li>\n</ul>\n<p>A Product Engineer is accountable for the product.</p>\n<p>Accountability is not responsibility. Accountability means you are required or expected to justify your actions and decisions. You are required to give an account to share the story of how we decided to build this feature, why we chose it over many other features, and how we iterated on subtle design tweaks for months to deliver what we believe is the best possible version.</p>\n<h2>Somebody Else&#8217;s Job</h2>\n<p>Any number of organizational configurations involving engineers, product managers, and designers can produce successful products. Over the past three decades, my observation is that the companies that have let the builders — the engineers and the designers — own significant parts of the role of Product Manager produce stronger products.</p>\n<p>You want the humans building the product to have an equal voice in product decisions. You want the hard decisions to painfully earn their resolution through long hours of informed humans staring at the problem from every angle. You want humans who build.</p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-5133-1\">\nIf you build Enterprise Software, you need product managers.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5133-1\" title=\"Return to main content.\">&#8617;</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://randsinrepose.com/archives/the-product-engineer/",
            "publishedAt": "2025-03-17",
            "source": "Rands in Repose",
            "summary": "If you work for a company that builds primarily consumer software, there are, hopefully, three groups of humans who believe they are accountable for the product. They are: Engineering. They build the product. Design. No, they build the product. Product Management. No, really… they build the product. Do you see the issue? You have three&#8230; <a class=\"read-more\" href=\"https://randsinrepose.com/archives/the-product-engineer/\">More</a>",
            "title": "The Product Engineer"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Mar/19/vibe-coding/#atom-entries",
            "publishedAt": "2025-03-19",
            "source": "Simon Willison",
            "summary": "<p><strong>Vibe coding</strong> is having a moment. The term <a href=\"https://twitter.com/karpathy/status/1886192184808149383\">was coined by Andrej Karpathy</a> just a few weeks ago (on February 6th) and has since been featured <a href=\"https://www.nytimes.com/2025/02/27/technology/personaltech/vibecoding-ai-software-programming.html\">in the New York Times</a>, <a href=\"https://arstechnica.com/ai/2025/03/is-vibe-coding-with-ai-gnarly-or-reckless-maybe-some-of-both/\">Ars Technica</a>, <a href=\"https://www.theguardian.com/technology/2025/mar/16/ai-software-coding-programmer-expertise-jobs-threat\">the Guardian</a> and countless online discussions.</p> <p>I'm concerned that the definition is already escaping its original intent. I'm seeing people apply the term \"vibe coding\" to all forms of code written with the assistance of AI. I think that both dilutes the term and gives a false impression of what's possible with responsible <a href=\"https://simonwillison.net/tags/ai-assisted-programming/\">AI-assisted programming</a>.</p> <p>Vibe coding is <em>not</em> the same thing as writing code with the help of LLMs!</p> <p>To quote Andrej's <a href=\"https://twitter.com/karpathy/status/1886192184808149383\">original tweet</a> in full (with my emphasis added):</p> <blockquote> <p>There's a new kind of coding I call \"vibe coding\", where you fully give in to the vibes, embrace exponentials, and <strong>forget that the code even exists</strong>. It's possible because the LLMs (e.g. Cursor Composer w Sonnet) are getting too good. Also I just talk to Composer with SuperWhisper so I barely even touch the keyboard.</p> <p>I ask for the dumbest things like \"decrease the padding on the sidebar by half\" because I'm too lazy to find it. I",
            "title": "Not all AI-assisted programming is vibe coding (but vibe coding rocks)"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Mar/13/tools-colophon/#atom-entries",
            "publishedAt": "2025-03-13",
            "source": "Simon Willison",
            "summary": "<p>The <a href=\"https://tools.simonwillison.net/colophon\">/colophon</a> page on my <a href=\"https://tools.simonwillison.net/\">tools.simonwillison.net</a> site lists all 78 of the HTML+JavaScript tools I've built (with <a href=\"https://simonwillison.net/tags/ai-assisted-programming/\">AI assistance</a>) along with their commit histories, including links to prompting transcripts. I wrote about <a href=\"https://simonwillison.net/2025/Mar/11/using-llms-for-code/#a-detailed-example\">how I built that colophon</a> the other day. It now also includes a description of each tool, generated using Claude 3.7 Sonnet.</p> <p><img alt=\"llm-prices.html # The LLM Pricing Calculator helps you estimate costs when using various large language models. Enter the number of input tokens (your prompts) and output tokens (AI responses), along with their respective pricing per million tokens, to calculate the total cost in both dollars and cents. The calculator includes a comprehensive list of preset pricing for popular models like GPT-4o, Claude 3, Gemini, and more. Each preset displays the cost per million tokens for both input and output, which automatically populates the calculator fields when selected. The calculator updates in real-time as you modify values, making it easy to compare costs across different models or estimate expenses for specific usage scenarios. 148bc1 October 16, 2024 20:50 Create llm-prices.html https://gist.github.com/simonw/6b684b5f7d75fb82034fc963cc487530 2e0a70 October 25, 2024 16:32 o1-preview and o1-mini \" src=\"https://static.simonwillison.net/static/2025/colophon-llm-prices.jpg\" /></p> <p>This is the single largest chunk of AI-generated text I've",
            "title": "Adding AI-generated descriptions to my tools collection"
        },
        {
            "content": [
                "<p>Jake Eaton has <a href=\"https://asteriskmag.com/issues/09/the-unbearable-loudness-of-chewing\">a great article on misophonia</a> in Asterisk.</p><p>Misophonia is a condition in which people can&#8217;t tolerate certain noises (classically chewing). Nobody loves chewing noises, but misophoniacs go above and beyond, sometimes ending relationships, shutting themselves indoors, or even deliberately trying to deafen themselves in an attempt to escape. </p><p>So it&#8217;s a sensory hypersensitivity, right? Maybe not. There&#8217;s increasing evidence - which I learned about from Jake, but which didn&#8217;t make it into the article - that misophonia is less about sound than it seems.</p><p>Misophoniacs who go deaf report that <a href=\"https://www.reddit.com/r/misophonia/comments/cczx3d/it_doesnt_go_away_if_you_go_deaf/\">it doesn&#8217;t go away</a>. Now they get triggered if they <em>see</em> someone chewing. It&#8217;s the same with other noises. Someone who gets triggered by the sound of forks scraping against a table will eventually get triggered by the sight of the scraping fork. Someone triggered by music will eventually get triggered by someone playing a music video on mute.</p><p>Maybe this isn&#8217;t surprising? Maybe it&#8217;s straight out of Pavlov - pair a neutral stimulus (like a flashing light) together with a negative stimulus (like an electric shock) often enough, and rats will learn to hate the flashing light. But usually Pavlov doesn&#8217;t work quite this well. People who hate school will happily walk past the schoolhouse; people who burn themselves on hot stoves will happily touch a cold stove; people who hate Donald Trump will laugh along with a lookalike Trump impersonator. In Pavlov&#8217;s experiments, the conditioned response fades to extinction after the conditioned stimulus stops correlating with the unconditioned stimulus. But deaf misophoniacs will still hate the sight of chewing the millionth time they see it.</p><p>The research gets weirder. If you trick misophoniacs into thinking their trigger sounds are something else, they won&#8217;t get triggered. <a href=\"https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2022.890829/full\">In this study</a>, scientists played people who hated chewing sounds a video (with audio) of someone chewing; unsurprisingly, they hated it. Then they played them a video of someone walking on squelching snow, but the audio track was secretly actually the same chewing sounds. It looked like the snow was making the noise - now the misophoniacs didn&#8217;t hate it!</p><p>Again, there are reasonable explanations. This is a variant of the McGurk effect:</p><div class=\"youtube-wrap\" id=\"youtube2-2k8fHR9jKVM\"><div class=\"youtube-inner\"></div></div><p>The man is saying the same syllable each time, but depending on which picture of his mouth moving you look at, you hear it differently. Your vision is context-modulating your hearing, but it just sounds like hearing something.</p><p>But some misophoniacs say that they&#8217;re only triggered by specific <em>people </em>- usually those close to them. If some rando chews loudly, they&#8217;ll be mildly annoyed; if their brother does, they&#8217;ll flip out. Probably there&#8217;s a reasonable explanation here too, but at this point maybe we should also be considering a larger-scale update.</p><p>So is misophonia sort of fake? </p><p>I have a mild version, and it sure doesn&#8217;t <em>feel</em> fake. From the outside, you probably have all these great ideas for how you would overcome it - try gradual desensitization! Try flooding! Fake it &#8216;til you make it! Just concentrate really hard and think &#8216;Sound can&#8217;t hurt me&#8217;! I&#8217;ve tried all of these and they don&#8217;t work, sorry, sound is still enraging. It&#8217;s not chewing for me; thankfully, I missed out on that one. My trigger is certain kinds of background conversation and music - less about the auditory details than about a certain part of my sensory periphery where I&#8217;m trying not to concentrate on it but failing. It hasn&#8217;t quite ruined my life, but was a big financial drain when I was younger - across three or four different cities, I drove away all my roommates by yelling at them for making noise, and ended up living on my own at much higher cost. There have been times when I wore giant construction earphones whenever I went outside, although things aren&#8217;t quite that bad now.</p><p>But even as misophonia makes me miserable -  even as I absolutely fail to overcome it - I can&#8217;t help feeling like it&#8217;s sort of fake. I&#8217;d already noticed something like the thing about people close to me. The way I thought of it was something about righteous anger. The sound of the wind in the trees barely bothered me at all, because there was no one to get angry at. Sounds that were natural parts of the social order were nearly as benign - I didn&#8217;t <em>like</em> hearing the bus driver announce the next stop, but it was an inevitable part of the bus-riding experience and I was resigned to it. But if a group of gangbangers scared the kids out of the nearby park and put on loud music while smoking drugs, I would go through the roof. Some utilitarian philosopher once said that while there are practical considerations for punishment nobody really <em>deserves</em> to suffer and in some cosmic sense even Hitler doesn&#8217;t truly <em>deserve</em> so much as a stubbed toe. I&#8217;m pretty sympathetic to that perspective when we&#8217;re just talking about genocidal dictators. But people who play loud music in the park - no, they need to suffer.</p><p>Even worse, I found myself seeking out the anger. I would turn on my big box fan, turn on my white noise machine, put in my earplugs, put my giant construction earphones on over them, and that would pretty much work. But I&#8217;d find myself straining to see if I could still catch a couple of beats of music through it all. If there was any chance that one single sound wave of the white-noise-fan-amalgam I was hearing actually came from the music, then I would have to get mad all over again. I realize this is stupid - if I can&#8217;t even tell if the music is still on, then what&#8217;s the problem? But there I was, straining to detect stray notes at the edge of my capability, in order to assess how angry I should be.</p><p>How did I get this way? Self-report is unreliable, but I remember when I was seven years old I would make noise and bother my parents. In the process of telling me not to do this, my dad complained to me that when he was in the process of falling asleep, there was about a fifteen minute window of half-asleepness where any interruption would jolt him awake so thoroughly that he wouldn&#8217;t be able to try falling asleep again for hours. Something about that resonated with me, and since then I&#8217;ve been the same way. Was I always like that, and his comment just called my attention to it? That&#8217;s not how I remember things, but who knows?</p><p>Then when I was twenty-five or so, this trouble with falling asleep was a big enough deal that I would always be telling my roommate to keep it down. One night my roommate complained that I seemed to have some weird pathological problem with noise way outside the normal distribution. I&#8217;d never thought about it before, but again, something resonated, that became &#8220;part of my identity&#8221; against my will, and from then on I was intolerable about any noise-related issue. Again, the simple explanation is that I was already like that - hence my roommate telling me I was like that. Again, that&#8217;s now how I remember things.</p><p>Is this the dreaded &#8220;social contagion&#8221; of mental illness? I&#8217;m not sure. But I imagine all of these things interacting in some kind of malicious network. Nobody likes loud noises when they&#8217;re trying to concentrate on something else. But somehow it spreads out from a natural ordinary distaste for the noise, to anger about the people making the noise, to fear and guilt that I might be some kind of special set-apart person who is especially bad at tolerating noise, to weird intellectualized thought-loops about how the noise symbolizes the decay of society, and back again - such that even if the noise would normally bother me for a minute and then fade into the background, the overall network never stopped looping and pinging my anger and distress buttons.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F40cb93f1-b5f8-4420-a54c-573adad8d52c_643x529.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"456.601866251944\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F40cb93f1-b5f8-4420-a54c-573adad8d52c_643x529.png\" width=\"555\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>This is all just introspection. But it would explain some of research - why the phenomenon can persist even without the noise (eg in deaf people), why context matters so much, why it&#8217;s worse with close friends and family (you&#8217;ve already told them you have misophonia, so insofar as their continued noise indicates they don&#8217;t care about you enough to stop, it&#8217;s easier to be sad and angry about them). </p><p>I suggested Jake think of this in the context of my old <a href=\"https://www.astralcodexten.com/p/trapped-priors-as-a-basic-problem\">trapped priors</a> post. Suppose that in reality, noise is annoying but nothing more. For whatever reason, someone gets stuck thinking noise is the worst thing in the world. In a normal situation, they should gradually unlearn this association - each time noise happens, they&#8217;ll update a little bit of the way back to &#8220;annoying and nothing more&#8221; until they&#8217;re all the way there. For this updating process to fail, the noise must genuinely provoke misery each time. My claim is that this whole learned network of negative things and noise ensures that each instance of noise will provoke enough negative associations to sustain the misophonia and the network of context clues that makes the misophonia work. The knot has so many dependencies that the brain&#8217;s natural updating process can&#8217;t untangle it in the amount of time it takes to form an emotion, so the update fails, or goes the wrong direction.</p><p>Cognitive behavioral therapists love this kind of thing - it&#8217;s a lot like what they call belief networks or core beliefs - but misophonia has so far resisted CBT. Eaton says the only thing that really helped him was a weeklong silent meditation retreat. This started out badly - he was in a room full of people being very quiet, and &#8220;every time the person next to me swallowed, I felt first a brief ripple of anger at the sound itself, followed by a larger wave of frustration at my reaction to it&#8221;. But as he got deeper into meditation, he was able to &#8220;notice the space between sensation and reaction . . . for the first time, I could choose to ignore the signal&#8221;. He doesn&#8217;t say whether it helped long-term, but it wouldn&#8217;t surprise me if it did. Meditation is about focusing hard enough on mental processes that you see them for what they really are (in the sense that noise &#8220;really is&#8221; annoying-and-nothing-more), then observing your reaction as a separate event. Do this well enough, and it potentially allows updating on the true value. </p><p>I talk a big talk, but so far knowing all of this hasn&#8217;t helped me tolerate noise more, not even a little bit.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/misophonia-beyond-sensory-sensitivity",
            "publishedAt": "2025-03-19",
            "source": "SlateStarCodex",
            "summary": "<p>Jake Eaton has <a href=\"https://asteriskmag.com/issues/09/the-unbearable-loudness-of-chewing\">a great article on misophonia</a> in Asterisk.</p><p>Misophonia is a condition in which people can&#8217;t tolerate certain noises (classically chewing). Nobody loves chewing noises, but misophoniacs go above and beyond, sometimes ending relationships, shutting themselves indoors, or even deliberately trying to deafen themselves in an attempt to escape. </p><p>So it&#8217;s a sensory hypersensitivity, right? Maybe not. There&#8217;s increasing evidence - which I learned about from Jake, but which didn&#8217;t make it into the article - that misophonia is less about sound than it seems.</p><p>Misophoniacs who go deaf report that <a href=\"https://www.reddit.com/r/misophonia/comments/cczx3d/it_doesnt_go_away_if_you_go_deaf/\">it doesn&#8217;t go away</a>. Now they get triggered if they <em>see</em> someone chewing. It&#8217;s the same with other noises. Someone who gets triggered by the sound of forks scraping against a table will eventually get triggered by the sight of the scraping fork. Someone triggered by music will eventually get triggered by someone playing a music video on mute.</p><p>Maybe this isn&#8217;t surprising? Maybe it&#8217;s straight out of Pavlov - pair a neutral stimulus (like a flashing light) together with a negative stimulus (like an electric shock) often enough, and rats will learn to hate the flashing light. But usually Pavlov doesn&#8217;t work quite this well. People who",
            "title": "Misophonia: Beyond Sensory Sensitivity"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong><a href=\"https://less.online/\">LessOnline</a>, an annual gathering of the online rationalist community, is happening again this year, May 30 - June 1 in Berkeley, $450 for tickets. If you can&#8217;t make the main event, there will probably be an adjacent (free) ACX meetup, exact time to be announced. </p><p><strong>2: </strong>My father has written and self-published <a href=\"https://www.amazon.com/Edge-Everyday-Adventures-Disaster-Medicine/dp/B0F1CL61T9\">a book</a> about his life and experiences on medical missions:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://www.amazon.com/Edge-Everyday-Adventures-Disaster-Medicine/dp/B0F1CL61T9\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"439\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb34766ec-e1e7-4b97-9d3a-75f738b26613_291x439.png\" width=\"291\" /><div></div></div></a></figure></div><p>It purports to be a &#8220;memoir&#8221; but struggles to resist turning into a lecture on lots of interesting facts about medicine - which is also what living with my father is like, so good job memoiring, I guess. Whoever chooses this for the next book review contest will win automatically (not really).</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-373",
            "publishedAt": "2025-03-17",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong><a href=\"https://less.online/\">LessOnline</a>, an annual gathering of the online rationalist community, is happening again this year, May 30 - June 1 in Berkeley, $450 for tickets. If you can&#8217;t make the main event, there will probably be an adjacent (free) ACX meetup, exact time to be announced. </p><p><strong>2: </strong>My father has written and self-published <a href=\"https://www.amazon.com/Edge-Everyday-Adventures-Disaster-Medicine/dp/B0F1CL61T9\">a book</a> about his life and experiences on medical missions:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://www.amazon.com/Edge-Everyday-Adventures-Disaster-Medicine/dp/B0F1CL61T9\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"439\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb34766ec-e1e7-4b97-9d3a-75f738b26613_291x439.png\" width=\"291\" /><div></div></div></a></figure></div><p>It purports to be a &#8220;memoir&#8221; but struggles to resist turning into a lecture on lots of interesting facts about medicine - which is also what living with my father is like, so good job memoiring, I guess. Whoever chooses this for the next book review contest will win automatically (not really).</p>",
            "title": "Open Thread 373"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3725\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3725",
            "publishedAt": "2025-03-13",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3725\"> Read more </a> </p>",
            "title": "Hidden Open Thread 372.5"
        },
        {
            "content": [
                "<p>Last month, I <a href=\"https://www.astralcodexten.com/p/deliberative-alignment-and-the-spec\">put out a request</a> for experts to help me understand the details of OpenAI&#8217;s forprofit buyout. The following comes from someone who has looked into the situation in depth but is not an insider. Mistakes are mine alone.</p><p><strong>Why Was OpenAI A Nonprofit In The First Place?</strong></p><p>In the early 2010s, the AI companies hadn&#8217;t yet discovered scaling laws, and so  underestimated the amount of compute (and therefore money) it would take to build AI. DeepMind was the first victim; originally founded on high ideals of prioritizing safety and responsible stewardship of the Singularity, it hit a financial barrier and sold to Google. </p><p>This scared Elon Musk, who didn&#8217;t trust Google (or any corporate sponsor) with AGI. He teamed up with Sam Altman and others, and OpenAI was born. To avoid duplicating DeepMind&#8217;s failure, they founded it as a nonprofit with a mission to &#8220;build safe and beneficial artificial general intelligence for the benefit of humanity&#8221;.</p><p>But like DeepMind, OpenAI needed money. At first, they scraped by with personal donations from Musk and other idealists, but as the full impact of scaling laws became clearer, Altman wanted to form a forprofit arm and seek investment. Musk and Altman disagree on what happened next: Musk said he objected to the profit focus, Altman says Musk agreed but wanted to be in charge. In any case, Musk left, Altman took full control, and OpenAI founded a forprofit subsidiary. </p><p>This subsidary was supposedly a &#8220;capped forprofit&#8221;, meaning that their investors were capped at 100x return - if someone invested $1 million, they could get a max of $100 million back, no matter how big OpenAI became - this ensured that the majority of gains from a Singularity would go to humanity rather than investors. But a capped forprofit isn&#8217;t a real kind of corporate structure; in real life OpenAI handles this through Profit Participation Units, a sort of weird stock/bond hybrid which does what OpenAI claims the capped forprofit model is doing.</p><p><strong>Why Is OpenAI No Longer Happy To Be A Nonprofit?</strong></p><p>It&#8217;s neither unusual nor illegal for nonprofits to own forprofits. Outdoorwear company Patagonia is a <a href=\"https://www.ispo.com/en/sustainability/living-sustainability-and-environmental-protection-patagonia-becomes-foundation\">typical example</a>. Its billionaire founder gave his shares to a purpose-designed environmentalist trust. They run Patagonia in an environmentally friendly way and spend the profits on environmental protection. In theory, OpenAI could do something similar.  </p><p>It&#8217;s not even illegal for a nonprofit to sell stock in a forprofit that it owns. It only needs to argue that its charitable purpose would be better served by having more money now than by continuing to own the stock.</p><p>So why is OpenAI unhappy with its current situation? They&#8217;ve already provided us the answer - it makes it <em>harder</em> to sell stock, or makes the stock worth less (so much so that participants in a recent funding round <a href=\"https://www.reuters.com/technology/artificial-intelligence/openais-stunning-150-billion-valuation-hinges-upending-corporate-structure-2024-09-14/\">made the money conditional</a> on a change to the structure). But why would it do this?</p><p>This is the part I&#8217;m least sure about, but here are some vague guesses.</p><p>The nonprofit board continues to control the company. The original board included idealists who got seats in exchange for early donations to the nonprofit. When this faction got cold feet and fired Altman in November 2023, it highlighted the danger (to investors) of nonprofit control. When Altman came back, he replaced most of the idealists with standard Silicon Valley business types, mitigating the risk. But these people still have a fig-leaf legal obligation to put the good of humanity above shareholder value, and even this fig leaf makes investors nervous.</p><p>If the nonprofit board sold 51% of the stock (including governance rights) to outside investors, they could remove this problem. In some sense, that&#8217;s what they&#8217;re trying to do now. But why can&#8217;t they do it naturally - just keep selling stock until they&#8217;ve sold 51%? </p><p>If they didn&#8217;t broadcast that they were going to do this, buyers would underpay for the stock, because they would still worry the nonprofit board would stay in charge. But also, controlling OpenAI is heavily related to their supposed nonprofit mission of ensuring that AI benefits humanity. If they were to sacrifice that control in a seemingly dumb way - whoops, guess that last stock sale put us under 50%, suppose that means we&#8217;re not in charge anymore - they could get in trouble for breaching their fiduciary duties. Their odds are better if they just sell the whole thing openly to someone who understands the deal they&#8217;re getting and is willing to pay for it.</p><p><strong>How Will Altman Turn OpenAI Into A Forprofit?</strong></p><p>First, he&#8217;ll start a new shell company. Realistically this will also be named OpenAI, but to avoid confusion, let&#8217;s call it Altman Skulduggery, Inc. ASI will offer to buy OpenAI LLC from the nonprofit for its fair value (some sources say he plans to bid $40 billion). The board (made of hand-picked Altman loyalists) will agree. ASI (a normal forprofit) will get all of OpenAI&#8217;s useful corporate assets, and the nonprofit will get $40 billion, which it can spend on benefitting humanity if it wants.</p><p>Where will Altman get $40 billion? He won&#8217;t; rather, he&#8217;ll offer the nonprofit shares in Altman Skullduggery, Inc. </p><p>Why are shares in ASI, a meaningless shell company with no assets, worth anything? Because it will soon own OpenAI, an exciting cutting-edge AI lab!</p><p>I am naive to the ways of finance, so this originally struck me as some kind of ridiculous perpetual motion bullshit. But I was eventually convinced it made sense. Suppose that OpenAI is currently underperforming its potential because it&#8217;s stuck in an awkward nonprofit governance structure; it ought to be worth $100 billion, but given the awkward governance it&#8217;s only worth $30 billion. ASI could bid 40% of its shares. Then, when OpenAI leaves the nonprofit and its value shoots up from $30 billion to $100 billion, both sides will have won: the nonprofit will have received $40 billion in ASI stock for its $30 billion asset (a profit of $10 billion), and ASI will have received a 60% share in OpenAI for nothing (a profit of $60 billion). Therefore, both sides are happy! I guess maybe this is how all private equity works.</p><p>Why can&#8217;t I do this same maneuver and get rich with no effort? If I don&#8217;t have a plan to increase the value of the company, then OpenAI-in-my-shell-company is worth the same amount as OpenAI now. Therefore, I have to offer 100% of shares in my shell company to afford OpenAI. Therefore, the deal is meaningless - the people who started with 100% of the shares still have 100% of the shares, and I still have zero. Maybe it&#8217;s not completely meaningless - I could replace Altman as CEO - but this is bad (I am a less skilled CEO than Altman and nobody would want to make that switch). In the extremely unlikely event that the board did want to make the switch, they could just fire Altman and replace him the usual way (if they dared). </p><p>If I <em>did</em> have an exciting plan to increase the value of the company and could convince the board, then this would just be a regular private equity deal. Private equity companies often do get rich, but it&#8217;s not literally <em>no</em> effort - they need to make a case that they can increase shareholder value in some way that the current leadership (and other potential bidders) can&#8217;t.</p><p><strong>How Much Should Altman Pay The Nonprofit For OpenAI?</strong></p><p>Why offer more than $0.00? The nonprofit board is packed with his supporters. They&#8217;ll vote yes on anything he asks. So why spend money at all?</p><p>Because it&#8217;s illegal for a nonprofit to sell assets for less than they&#8217;re worth. If it wasn&#8217;t illegal, then anyone could loot a charity to line their own pockets. If board members approved an unfairly low offer, they could be charged with breaching their fiduciary duties (in this case, their duty to carry out the charity&#8217;s mission of benefiting humanity). </p><p>The relevant regulators are the Attorneys General of California (where OpenAI operates) and Delaware (where it is registered). They try not to second-guess company boards&#8217; decisions too much, limiting their intervention to clear fraud without even a fig leaf of honesty. But $0.00 wouldn&#8217;t even have that fig leaf. So Altman needs to figure out the lowest number he can offer that gives the board a fig leaf of accepting a fair offer and trying to benefit humanity.</p><p>How much would that be? A <a href=\"https://www.reuters.com/technology/artificial-intelligence/openai-lays-out-plan-shift-new-for-profit-structure-2024-12-27/\">recent investment round</a> valued OpenAI at $157 billion conditional on it escaping the nonprofit. It must be worth less than that when it&#8217;s still in the nonprofit - but maybe not too much less - and ASI should pay somewhere between the nonprofit value and the forprofit value (so that both sides gain from the deal). </p><p>Altman previously floated $40 billion, which struck most observers as too low, maybe too low to even provide the fig leaf. </p><p><strong>What About Elon Musk&#8217;s Offer?</strong></p><p>Elon Musk recently offered the nonprofit $97.4 billion for OpenAI. He sweetened the deal by guaranteeing that the nonprofit would continue to have a controlling share.</p><p>Rumor says this was a clever ploy. Musk knew the board was in Altman&#8217;s pocket and would turn him down. But he knew it would complicate their task of looking honest to regulators. What honest person would turn down a $97 billion offer only to accept a $40 billion one? </p><p>The situation isn&#8217;t hopeless. The board could try saying something like &#8220;Well, Elon Musk is a crazy person who&#8217;s currently dismantling the federal government with a chainsaw; we charitable people acting for the benefit of humanity think it&#8217;s worth losing $57 billion to keep him away from the control panel for the machine god.&#8221; As fig leaves go, that&#8217;s honestly a pretty good one.</p><p>This strategy is dicey, and realistically Altman will supplement it by increasing his offer. I heard rumors of a new offer where the nonprofit keeps a controlling interest, but I can&#8217;t find a credible source.</p><p><strong>So If Altman Increases His Offer, Then It&#8217;s Fair, Right?</strong></p><p>We&#8217;re not sure!</p><p>The nonprofit&#8217;s mission was to create AI in a way that benefits humanity.</p><p>If they sold the company, they might get $40 billion (or whatever). You can do a lot of good charity work with $40 billion. But the nonprofit isn&#8217;t supposed to do generic good charity work. It&#8217;s supposed to create AI in a way that benefits humanity.</p><p>You can certainly do lots of great things for beneficial AI with $40 billion (I know some AI alignment charities that would love that kind of money - the OpenAI board can send me an email if it wants to be put in contact!) But I don&#8217;t know, investing $40 billion in worthy AI-related causes seems a lot less like creating AI than, you know, being OpenAI and actually creating AI.</p><p>So separate from the argument that Altman is offering too little, there&#8217;s another argument - which judges and the Attorneys General will have to consider - that they shouldn&#8217;t be allowed to sell at any price.</p><p><strong>Where Does Elon Musk&#8217;s Lawsuit Fit In?</strong></p><p>During the original nonprofit days, Musk donated $44 million. He says OpenAI violated his rights when they accepted his $44 million for charitable purposes, then used it to become a corporate titan that competed with him. Surprising nobody who knows Elon, <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.433688/gov.uscourts.cand.433688.121.0.pdf\">the complaint comes on strong</a>:</p><blockquote><p>Altman, OpenAI&#8217;s co-founder and chief executive officer (&#8220;CEO&#8221;), and Brockman, OpenAI&#8217;s co-founder and former chief technology officer, took advantage of Musk&#8217;s altruism in order to lure him into funding the venture. While pretending to share Musk&#8217;s concern about the trajectory of the artificial intelligence (&#8220;AI&#8221;) industry, Altman and Brockman solicited millions in donations from Musk to build OpenAI on the promise that the organization would put people over profit and serve as a counterweight to the other dominant players in the AI space. With full knowledge that Musk&#8217;s money was contingent upon using his money charitably, defendants set about building a for-profit behemoth contrary to their original promises. </p><p>Defendants&#8217; secretive venture included an effort by Microsoft to &#8220;exploit&#8221; OpenAI. As part of this, Altman established a vast network of for-profit entities in which both he and Microsoft hold significant ownership stakes. Further, OpenAI and Microsoft have several contractual arrangements, including, for example, Microsoft&#8217;s agreement to supply raw materials to OpenAI and OpenAI&#8217;s granting Microsoft an exclusive license to its technology. Defendants have ensured OpenAI&#8217;s board is full of directors fully aligned with Altman and Brockman&#8217;s interests, such that independent directors constitute only a minority of the board. </p></blockquote><p>Earlier this month, the judge <a href=\"https://arstechnica.com/tech-policy/2025/03/musk-loses-bid-to-stop-openais-for-profit-shift-but-can-make-his-case-in-trial/\">denied a preliminary injunction</a>. That is, she declined to block OpenAI from doing their forprofit conversion until the trial was over. This was always a long shot and would have required Musk to be overwhelmingly obviously in the right.</p><p>But <a href=\"https://x.com/robertwiblin/status/1897243135085891836\">Rob Wiblin </a>and <a href=\"https://garrisonlovely.substack.com/p/what-the-headlines-miss-about-the\">Garrison Lovely</a> say the narrative that &#8220;Musk lost&#8221; is too simple. The judge ruled that Musk only has standing to sue if he meant for his $44 million donation to be restricted in some way. But she also said that if he <em>did</em> have standing to sue, his case seemed strong on the merits. So she will hold a trial to see whether he has standing, and, if so, likely rule in his favor. </p><p>Wiblin estimates a 45% chance that the judge will eventually rule in Musk&#8217;s favor. Then what? If the nonprofit has already converted to a forprofit, she might order it to convert back, or change its governance. Or she might just make them give Musk a lot of money.</p><p>Even if the judge doesn&#8217;t block the conversion, the lawsuit could still cause trouble. If the judge rules that Musk doesn&#8217;t have standing but his case is good, the Attorneys General might use the &#8220;his case is good&#8221; part when making their own analysis of whether to permit the buyout. And if the board members agreed to the forprofit conversion after a judge had said - even in a nonbinding way - that the case against it was good, it would make it easier for someone (eg Musk) to accuse them individually of breach of duty. </p><p><strong>If The Nonprofit Became A Real Nonprofit, What Would It Do?</strong></p><p>Altman has suggested it would &#8220;hire a leadership team and staff to pursue charitable initiatives in sectors such as health care, education, and science.\"</p><p>Whatever it did would have to follow its mission statement of using AI to benefit humanity. I think it would be a stretch to say that they used the AI to get the money and now the money is benefiting humanity, so probably the charitable initiatives would have to involve AI in some way. Maybe this would look like helping hospitals use AI to treat patients.</p><p>Manifold asks whether they might end up funding AI safety efforts:</p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p>This sort of makes sense - surely this is the most direct way to interpret a mandate of using charity dollars to &#8220;make sure AI benefits humanity&#8221;. And an obvious commitment to pursuing their mission exactly as described would look good to regulators. But it also might not be as popular with the normies as &#8220;health care, education, and science&#8221; - and doing popular things would look good to regulators too. If this is on their mind, Altman hasn&#8217;t mentioned it.</p><p>Unless a judge does something crazy, it will be the current nonprofit board (of Altman loyalists) who make this decision.</p><p><strong>Does Any Of This Matter For Singularity Believers?</strong></p><p>Maybe.</p><p>If OpenAI successfully converts to a forprofit, it can get more investment. That will make it easier to scale faster and keep its lead. If you don&#8217;t want fast scaling, or you don&#8217;t want OpenAI to be in the lead, you should root against them.</p><p>But if OpenAI successfully converts to a forprofit, then the nonprofit has to reinvent itself as a real charity, funding healthcare and science and maybe if we&#8217;re really lucky AI safety. If you&#8217;re excited about this funding, you should root for them.</p><p>The original goal of OpenAI was to ensure that the singularity created broad-based prosperity for everyone, maybe through a basic income. Whether or not a charity holds 51% (or some other number) of OpenAI shares is relevant to this vision. If OpenAI initiates a singularity and ends up with all the money in the world, then maybe 49% of all the money in the world goes to their investors (creating a caste of mega-plutocrats), but 51% goes to a nonprofit charged with benefiting all humanity (and this is where the basic income comes from?). I do think it&#8217;s kind of unlikely that OpenAI ends up creating God yet also remains subject to the Attorney General of California. But it&#8217;s not totally impossible - Robin Hanson has written a lot about how if there are many competing near-peer superintelligences and companies, they might choose to keep existing property and governance structures as referees. In this one unlikely scenario, the exact percent of OpenAI shares held by investors vs. charity might matter a lot.</p><p>Finally, the regulators (either the judge of Musk&#8217;s lawsuit, or the Attorneys General) might rule that everything about OpenAI sucks and they have to start over. Maybe this would mean firing the board and replacing it with . . . some other board? People who have some strong claim to really care about whether AI benefits all humanity or not? I don&#8217;t know, a man can dream. <a href=\"https://www.businessinsider.com/openai-elon-musk-sam-altman-for-profit-conversion-2025-2\">Business Insider discusses</a> an incipient coalition between Meta and various public interest watchdogs pushing this solution:</p><blockquote><p>Meta, Facebook's parent company, [wrote] to California's attorney general, Rob Bonta, in December to ask him to step in.</p><p>\"Taking advantage of this non-profit status, OpenAI raised billions of dollars in capital from investors to further its purported mission,\" the company wrote. \"Now, OpenAI wants to change its status while retaining all of the benefits that enabled it to reach the point it has today. That is wrong. OpenAI should not be allowed to flout the law by taking and reappropriating assets it built as a charity and using them for potentially enormous private gains.\"</p><p>In late January, a group of 25 charities, including one started by the eBay founder Pierre Omidyar and his wife, piled on. The coalition <a href=\"https://sff.org/wp-content/uploads/2025/01/Charitable-coalition-letter-on-OpenAI-conversion-1-29-25.pdf\">urged Bonta</a> \"to take prompt legal action to ensure that OpenAI's assets are not illegally diverted for private gain.\"</p><p>[&#8230;]</p><p>Public Citizen, a consumer watchdog, has repeatedly assailed the AI startup, accusing it of betraying its nonprofit mission. \"The nonprofit board has behaved as a subordinate to the for-profit, and has done nothing that evidences any commitment to the nonprofit mission,\" said Robert Weissman, the copresident of Public Citizen.</p><p>He argued that the solution is to forcibly dissolve the nonprofit and auction off its assets for the benefit of a new independent charity not linked to the current OpenAI board.</p></blockquote><p><strong>What Do Prediction Markets Say?</strong></p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p><a href=\"https://manifold.markets/BTE/will-openai-abandon-their-nonprofit?play=true\">This </a>is the biggest Manifold market on the topic. The big drop at the end is when the judge ruled Musk&#8217;s case had merit.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdf64ecf7-5216-453a-b2ab-fd8717718343_760x453.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"332.59736842105264\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdf64ecf7-5216-453a-b2ab-fd8717718343_760x453.png\" width=\"558\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p><a href=\"https://www.metaculus.com/questions/20172/openai-cease-governance-by-nonprofit-board/\">This</a> Metaculus question looks like the Manifold market, but without the big drop at the end. Are the Manifolders overreacting, or are the Metaculans asleep at the wheel?</p><p><strong>Bonus Question 1: Who Are The Attorney Generals Of California and Delaware?</strong></p><p>California AG <a href=\"https://en.wikipedia.org/wiki/Rob_Bonta\">Rob Bonta</a> is a former nonprofit coordinator with experience at the ACLU and other activist groups. He is a lifelong Democrat and close ally of Governor Newsom. He has a reputation for being Tough On Guns, sometimes veering into what I consider publicity stunts (when Texas passed a questionably-constitutional bounty for tips on illegal abortions, he tried to own the cons by proposing a questionably-constitutional bounty for tips on illegal guns). </p><p>In the past, the Newsom administration has <a href=\"https://www.astralcodexten.com/p/sb-1047-our-side-of-the-story\">sided with AI companies</a> to please his Silicon Valley donors. But Bonta has previously been involved in antitrust lawsuits against Amazon and Google, so he&#8217;s not afraid to confront Big Tech. </p><p>Delaware Attorney <a href=\"https://en.wikipedia.org/wiki/Kathy_Jennings\">Kathy Jennings</a>, also a Democrat, is a former prosecutor. She wrote a letter to the court hearing Musk&#8217;s lawsuit:</p><blockquote><p>She said that under Delaware law, she had authority to review the proposed conversion of OpenAI into a for-profit corporation. She said that the legality of the transaction would be governed by Delaware law and if she determined that it was not lawful, she had the power to ask for modifications to the transaction or seek an injunction in Delaware state court.</p><p>Jennings advised Judge Gonzalez Rogers that she was in &#8220;ongoing dialogue&#8221; with OpenAI and she was &#8220;actively reviewing&#8221; the transaction to ensure that OpenAI is adhering to its specific charitable purposes for the benefit of the public beneficiaries, as opposed to the commercial or private interests of OpenAI&#8217;s directors or partners.</p><p>She said her review would include an analysis of whether the charitable purposes of OpenAI&#8217;s assets would be impaired by the transaction and whether OpenAI&#8217;s directors are meeting their fiduciary duties.</p></blockquote><p>A person who I don&#8217;t know <a href=\"https://forum.effectivealtruism.org/posts/bFpdaqDekC7ZEPmpA/emergency-pod-judge-plants-a-legal-time-bomb-under-openai?commentId=9GfthbXaCQQ9Rp3Yc\">claims</a> that maybe writing letters to these people could be meaningful:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F766fe101-2fd4-4bf0-8f47-06d677d3b015_1556x550.webp\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"217.1771978021978\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F766fe101-2fd4-4bf0-8f47-06d677d3b015_1556x550.webp\" width=\"614\" /><div></div></div></a></figure></div><p><strong>Bonus Question 2: What Is Anthropic&#8217;s Structure?</strong></p><p>OpenAI and Anthropic were both founded by idealistic Singularity believers to ensure AI was used for good. OpenAI tried to implement their commitment by being a nonprofit; Anthropic used a different corporate arrangement.</p><p>Anthropic is a public benefit company - much closer to a normal forprofit than OpenAI. It&#8217;s run by a board of five people. Two members of the board are picked the normal way by investors. But the other three (a majority!) are picked by a group of five people called the Long Term Benefit Trust. At the beginning of Anthropic, the founders seeded the Trust with trustworthy smart outsiders who seemed interested in the long-term benefit of humanity. Trustees can choose their own replacements without input from investors. At any time, they can use their three board members to have a majority in the board and overrule what everyone else is doing.</p><p>How&#8217;s it going? <em>Okay</em>. Some of the original LTBT members took jobs in government, and had to quit the LTBT as a conflict of interest. A source close to Anthropic suggests they had trouble finding replacements - most of the altruistically-minded eminent AI people had conflicts of interest of their own. As a result, the LTBT seems to be down to three people, all of whom have great credentials as thoughtful philanthropists but none of whom are especially connected to AI in particular. They seem to be overdue in electing their board members, and we don&#8217;t know why.</p><p>Zach Stein-Perlman, who runs <a href=\"https://ailabwatch.org/\">AI Lab Watch</a>, argues that <a href=\"https://www.lesswrong.com/posts/sdCcsTt9hRpbX6obP/maybe-anthropic-s-long-term-benefit-trust-is-powerless\">Maybe Anthropic&#8217;s Long-Term Benefit Trust Is Powerless</a>. He points to a rule that a supermajority (with complicated definition, see <a href=\"https://ailabwatch.org/blog/anthropic-certificate-of-incorporation/\">here</a>) of stockholders can overrule the LTBT. Anthropic partisans counter that they need some way to deal with the trust losing the plot; many of Anthropic&#8217;s shareholders are also people with a special interest in AI safety, and it would be hard to get a majority of these people to overrule the LTBT unless it was important.</p><p>I think Anthropic seems to be going pretty well and the Trust hasn&#8217;t had any reason to interfere, so we haven&#8217;t gotten a chance to see how much power they really wield.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/openai-nonprofit-buyout-much-more",
            "publishedAt": "2025-03-13",
            "source": "SlateStarCodex",
            "summary": "<p>Last month, I <a href=\"https://www.astralcodexten.com/p/deliberative-alignment-and-the-spec\">put out a request</a> for experts to help me understand the details of OpenAI&#8217;s forprofit buyout. The following comes from someone who has looked into the situation in depth but is not an insider. Mistakes are mine alone.</p><p><strong>Why Was OpenAI A Nonprofit In The First Place?</strong></p><p>In the early 2010s, the AI companies hadn&#8217;t yet discovered scaling laws, and so underestimated the amount of compute (and therefore money) it would take to build AI. DeepMind was the first victim; originally founded on high ideals of prioritizing safety and responsible stewardship of the Singularity, it hit a financial barrier and sold to Google. </p><p>This scared Elon Musk, who didn&#8217;t trust Google (or any corporate sponsor) with AGI. He teamed up with Sam Altman and others, and OpenAI was born. To avoid duplicating DeepMind&#8217;s failure, they founded it as a nonprofit with a mission to &#8220;build safe and beneficial artificial general intelligence for the benefit of humanity&#8221;.</p><p>But like DeepMind, OpenAI needed money. At first, they scraped by with personal donations from Musk and other idealists, but as the full impact of scaling laws became clearer, Altman wanted to form a forprofit arm and seek investment. Musk and Altman disagree",
            "title": "OpenAI Nonprofit Buyout: Much More Than You Wanted To Know"
        },
        {
            "content": [],
            "link": "https://lethain.com/career-advice-2025/",
            "publishedAt": "2025-03-15",
            "source": "Will Larson",
            "summary": "<p>Yesterday, the tj-actions repository, a popular tool used with Github Actions was compromised (for more background read <a href=\"https://www.stepsecurity.io/blog/harden-runner-detection-tj-actions-changed-files-action-is-compromised\">one</a> of these <a href=\"https://semgrep.dev/blog/2025/popular-github-action-tj-actionschanged-files-is-compromised/\">two</a> articles). Watching the infrastructure and security engineering teams at Carta respond, it highlighted to me just how much LLMs can’t meaningfully replace many essential roles of software professionals. However, I’m also reading Jennifer Palkha’s <a href=\"https://www.recodingamerica.us/\">Recoding America</a>, which makes an important point: decision-makers can remain irrational longer than you can remain solvent. (Or, in this context, remain employed.)</p> <p>I’ve been thinking about this a lot lately, as I’ve ended up having more “2025 is not much fun”-themed career discussions with prior colleagues navigating the current job market. I’ve tried to pull together my points from those conversations here:</p> <ol> <li> <p>Many people who first entered senior roles in 2010-2020 are finding current roles a lot less fun. There are a number of reasons for this. First, managers were generally evaluated in that period based on their ability to hire, retain and motivate teams. The current market doesn’t value those skills particularly highly, but instead prioritizes a different set of skills: working in the details, pushing pace, and navigating the technology transition to foundational models / LLMs.</p> <p>This",
            "title": "Career advice in 2025."
        },
        {
            "content": [],
            "link": "https://lethain.com/policy-for-strategy/",
            "publishedAt": "2025-03-13",
            "source": "Will Larson",
            "summary": "<p>This book&rsquo;s introduction started by defining strategy as &ldquo;making decisions.&rdquo; Then we dug into <a href=\"https://lethain.com/exploring-for-strategy/\">exploration</a>, <a href=\"https://lethain.com/diagnosis-for-strategy\">diagnosis</a>, and <a href=\"https://lethain.com/refining-eng-strategy/\">refinement</a>: three chapters where you could argue that we didn&rsquo;t decide anything at all. Clarifying the problem to be solved is the prerequisite of effective decision making, but eventually decisions do have to be made. Here in this chapter on policy, and the <a href=\"https://lethain.com/operations-for-strategy/\">following chapter on operations</a>, we finally start to actually make some decisions.</p> <p>In this chapter, we&rsquo;ll dig into:</p> <ul> <li>How we define policy, and how setting policy differs from operating policy as discussed in the next chapter</li> <li>The structured steps for setting policy</li> <li>How many policies should you set? Is it preferable to have one policy, many policies, or does it not matter much either way?</li> <li>Recurring kinds of policies that appear frequently in strategies</li> <li>Why it&rsquo;s valuable to be intentional about your strategy&rsquo;s altitude, and how engineers and executives generally maintain different altitudes in their strategies</li> <li>Criteria to use for evaluating whether your policies are likely to be impactful</li> <li>How to develop novel policies, and why it&rsquo;s rare</li> <li>Why having multiple bundles of alternative policies is generally a phase in strategy development that indicates a",
            "title": "Setting policy for strategy."
        }
    ],
    "lookbackDays": 7,
    "publishDate": "2025-03-19"
}