{
    "articles": [
        {
            "content": [
                "<p>In my opinion, one of the best critiques of modern AI design comes from <a href=\"https://cgi.csc.liv.ac.uk/~coopes/comp319/2016/papers/UbiquitousComputingAndInterfaceAgents-Weiser.pdf\">a 1992 talk</a> by the researcher <a href=\"https://en.wikipedia.org/wiki/Mark_Weiser\">Mark Weiser</a> where he ranted against &ldquo;copilot&rdquo; as a metaphor for AI.</p>\n\n<p>This was 33 years ago, but it&rsquo;s still incredibly relevant for anyone designing with AI.</p>\n\n<h2 id=\"weisers-rant\">Weiser&rsquo;s rant</h2>\n\n<p>Weiser was speaking at an <a href=\"https://www.dropbox.com/scl/fo/axpzd925tcsnkc9x5nd51/AJMdLqxafEYFun4Ns6fqMHo?dl=0&amp;e=1&amp;preview=frames_1992_014_Nov.pdf&amp;rlkey=znit21hyth8w24m6gm02rq2y7\">MIT Media Lab event</a> on &ldquo;interface agents&rdquo;. They were grappling with many of the same issues we&rsquo;re discussing in 2025: how to make a personal assistant that automates tasks for you and knows your full context. They even had a human &ldquo;butler&rdquo; on stage representing an AI agent.</p>\n\n<p>Everyone was super excited about this&hellip; except Weiser. He was opposed to the whole idea of agents! He gave this example: how should a computer help you fly a plane and avoid collisions?</p>\n\n<p><strong>The agentic option is a &ldquo;copilot&rdquo; — a virtual human who you talk with to get help flying the plane.</strong> If you&rsquo;re about to run into another plane it might yell at you &ldquo;collision, go right and down!&rdquo;</p>\n\n<p>Weiser offered a different option: <strong>design the cockpit so that the human pilot is naturally aware of their surroundings.</strong> In his words: &ldquo;You’ll no more run into another airplane than you would try to walk through a wall.&rdquo;</p>\n\n<p>Weiser&rsquo;s goal was an &ldquo;invisible computer&quot;—not an assistant that grabs your attention, but a computer that fades into the background and becomes &quot;an extension of [your] body&rdquo;.</p>\n\n<figure style=\"margin: 0;\">\n  <img alt=\"\" src=\"https://www.geoffreylitt.com/images/article_images/weiser-slide.png\" />\n  <figcaption>Weiser&rsquo;s 1992 slide on airplane interfaces</figcaption>\n</figure>\n\n<h2 id=\"huds\">HUDs</h2>\n\n<p>There&rsquo;s a tool in modern planes that I think nicely illustrates Weiser&rsquo;s philosophy: <strong>the Head-Up Display (HUD), which overlays flight info like the horizon and altitude on a transparent display directly in the pilot&rsquo;s field of view.</strong></p>\n\n<p>A HUD feels completely different from a copilot! You don&rsquo;t talk to it. It&rsquo;s literally part invisible—you just become naturally aware of more things, as if you had magic eyes.</p>\n\n<p><img alt=\"\" src=\"https://www.geoffreylitt.com/images/article_images/copilot-hud.png\" /></p>\n\n<h2 id=\"designing-huds\">Designing HUDs</h2>\n\n<p>OK enough analogies. What might a HUD feel like in modern software design?</p>\n\n<p>One familiar example is spellcheck. Think about it: <strong>spellcheck isn&rsquo;t designed as a &ldquo;virtual collaborator&rdquo; talking to you about your spelling.</strong> It just instantly adds red squigglies when you misspell something! You now have a new sense you didn&rsquo;t have before. It&rsquo;s a HUD.</p>\n\n<p>(This example comes from Jeffrey Heer&rsquo;s excellent <a href=\"https://idl.cs.washington.edu/files/2019-AgencyPlusAutomation-PNAS.pdf\">Agency plus Automation</a> paper. We may not consider spellcheck an AI feature today, but it&rsquo;s still a fuzzy algorithm under the hood.)</p>\n\n<figure style=\"margin: 0;\">\n  <img alt=\"\" src=\"https://www.geoffreylitt.com/images/article_images/spellcheck.png\" />\n  <figcaption>Spellcheck makes you aware of misspelled words without an &ldquo;assistant&rdquo; interface.</figcaption>\n</figure>\n\n<p>Here&rsquo;s another personal example from AI coding. Let&rsquo;s say you want to fix a bug. The obvious &ldquo;copilot&rdquo; way is to open an agent chat and ask it to do the fix.</p>\n\n<p>But there&rsquo;s another approach I&rsquo;ve found more powerful at times: <strong>use AI to build a custom debugger UI which visualizes the behavior of my program!</strong> In one example, I <a href=\"https://www.geoffreylitt.com/2024/12/22/making-programming-more-fun-with-an-ai-generated-debugger.html\">built a hacker-themed debug view of a Prolog interpreter</a>.</p>\n\n<p>With the debugger, I have a HUD! I have new senses, I can see how my program runs. The HUD extends beyond the narrow task of fixing the bug. I can ambiently build up my own understanding, spotting new problems and opportunities.</p>\n\n<video controls=\"controls\" loop=\"loop\" preload=\"auto\" src=\"https://www.geoffreylitt.com/images/article_images/debugger/demo.mp4\" type=\"video/mp4\" width=\"100%\"></video>\n\n<p>Both the spellchecker and custom debuggers show that automation / &ldquo;virtual assistant&rdquo; isn&rsquo;t the only possible UI. We can instead use tech to build better HUDs that enhance our human senses.</p>\n\n<h2 id=\"tradeoffs\">Tradeoffs</h2>\n\n<p>I don&rsquo;t believe HUDs are universally better than copilots! But I do believe <strong>anyone serious about designing for AI should consider non-copilot form factors that more directly extend the human mind.</strong></p>\n\n<p>So when should we use one or the other? I think it&rsquo;s quite tricky to answer that, but we can try to use the airplane analogy for some intuition:</p>\n\n<p>When pilots just want the plane to fly straight and level, they fully delegate that task to an autopilot, which is close to a &ldquo;virtual copilot&rdquo;. But if the plane just hit a flock of birds and needs to land in the Hudson, the pilot is going to take manual control, and we better hope they have great instruments that help them understand the situation.</p>\n\n<p>In other words: routine predictable work might make sense to delegate to a virtual copilot / assistant. But when you&rsquo;re shooting for extraordinary outcomes, perhaps the best bet is to equip human experts with new superpowers.</p>\n\n<hr />\n\n<h2 id=\"further-reading\">Further reading</h2>\n\n<ul>\n<li>A nice discussion of one approach to this idea can be found in <a href=\"https://distill.pub/2017/aia/\">Using Artificial Intelligence to Augment Human Intelligence</a> by Michael Nielsen and Shan Carter.</li>\n<li>A more cryptic take on the same topic: <a href=\"https://www.geoffreylitt.com/2025/06/29/chat-ai-dialogue.html\">Is chat a good UI for AI? A Socratic dialogue</a></li>\n<li>A discussion of how the the HUD philosophy intersects with on-demand software creation: <a href=\"https://www.geoffreylitt.com/2023/03/25/llm-end-user-programming.html\">Malleable software in the age of LLMs</a></li>\n</ul>"
            ],
            "link": "https://www.geoffreylitt.com/2025/07/27/enough-ai-copilots-we-need-ai-huds.html",
            "publishedAt": "2025-07-27",
            "source": "Geoffrey Litt",
            "summary": "<p>In my opinion, one of the best critiques of modern AI design comes from <a href=\"https://cgi.csc.liv.ac.uk/~coopes/comp319/2016/papers/UbiquitousComputingAndInterfaceAgents-Weiser.pdf\">a 1992 talk</a> by the researcher <a href=\"https://en.wikipedia.org/wiki/Mark_Weiser\">Mark Weiser</a> where he ranted against “copilot” as a metaphor for AI.</p> <p>This was 33 years ago, but it’s still incredibly relevant for anyone designing...</p>",
            "title": "Enough AI copilots! We need AI HUDs"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-27"
}