{
    "articles": [
        {
            "content": [
                "<p>In my early twenties I had a cohort of friends and coworkers, all Silicon Valley engineers, all quite good at their jobs, all college dropouts. We developed a shared conviction that <strong>only losers got computer science degrees</strong>. This sounds like a joke, or a self-defense mechanism, but it was neither. We were serious.</p>\n<p>We held CS grads in contempt, as a class. We privately mocked them. When interviewing candidates, we considered it a knock against someone if they graduated — not an insuperable one by any means, but certainly a yellow flag, something to be probed in the interview process, to ensure they had good judgment and were capable of learning independently and getting shit done, despite all evidence to the contrary.</p>\n<p>We didn’t look down on ALL college graduates (that would be unreasonable). If you went to school to study something like civil engineering, or philosophy, or Russian literature, good for you! But <em>computers</em>? Everything in my experience led me to conclude that sitting in a classroom studying computers was a waste of time and money.</p>\n<p>I had evidence! I worked my way through school — as the university sysadmin, at a local startup — and I had always learned soooo much more from my work than my classes. The languages and technologies they taught us were consistently years out of date. Classes were slow and plodding. Our professors lectured on and on about “IN-dustry” in a way that made it abundantly clear that they had no recent, relevant experience.</p>\n<h2>College dropouts: the original bootstrappers</h2>\n<p>The difference became especially stark after I spent a year working in Silicon Valley. I then returned to school, fully intending to finish and graduate, but I could not focus; I was bored out of my skull.</p>\n<p>How could anyone sit through that amount of garbage? Wouldn’t anyone with an ounce of self-respect and intrinsic motivation have gotten up off their butts and learned what they needed to know much faster on their own? For fuck’s sake! just google it!</p>\n<p>My friends and I rolled our eyes at each other and sighed over these so-called software engineers with degrees, who apparently needed their learning doled out in small bites and spoon-fed to them, like a child. Who wanted to work with someone with such a high tolerance for toil and bullshit?</p>\n<p>Meanwhile we, the superior creatures, had simply figured out whatever the fuck we needed to learn by reading the source code, reading books and manuals, trying things out. We pulled OUR careers up by our own bootstraps, goddammit. Why couldn’t they? What was WRONG with them??</p>\n<p>We knew so many deeply mediocre software engineers who had gotten their bachelor’s degree in computer science, and so many exceptional engineers with arts degrees or no degrees, that it started to feel like a rule or something.</p>\n<p>Were they cherrypicked examples? Of <em>course</em> they were. That’s how these things work.</p>\n<h2>People are really, really good at justifying their status</h2>\n<p>Ever since then, I’ve met wave after wave of people in this industry who are convinced they know how to sift “good” talent from “bad” via easily detected heuristics. They’re mostly bullshit.</p>\n<p>Which is not to say that heuristics are never useful, or that any of us can afford to expend infinite amounts of time sifting through prospects on the off chance that we miss a couple quality candidates. They can be useful, and we cannot.</p>\n<p>However, I have retained an abiding skepticism of heuristics that serve to reinforce existing power structures, or ones that just so happen to overlap with the background of the holder of said heuristics.</p>\n<p>Those of us who work in tech are fabulously fortunate; in terms of satisfying, remunerative career outcomes, we are easily in the top .0001% of all humans who have ever lived. Maybe this is why so many of us seem to have some deep-seated compulsion to prove that we belong here, no really, <em>people like me deserve to be here</em>.</p>\n<h2>This calls for some humility</h2>\n<p>If nothing else, I think it calls for some humility. I don’t feel like I “deserve” to be here. I don’t think any of us do. I think I worked really fucking hard and I got really fucking lucky. Both can be true. Some of the smartest kids I grew up with are now pumping gas or dead. Almost none of the people I grew up with ever reached escape velocity and made it out of our small town.</p>\n<p>When I stop to think about it, it scares me how lucky I got. How lucky I am to have grown up when I did, to have entered tech when I did, when the barriers to entry were so low and you really could just learn on the job, if you were willing to work your ass off. I left home when I was 15 to go to college, and put myself through largely on minimum wage jobs. Even five years later, I couldn’t have done that.</p>\n<p>There was a window of time in the 2000s when tech was an escalator to the middle class for a whole generation of weirdos, dropouts and liberal arts misfits. That window has been closed for a while now. I understand why the window closed, and why it was inevitable (software isn’t a toy anymore), but it&#8217;s still.. bittersweet.</p>\n<p>I guess I&#8217;m just really grateful to be here.</p>\n<p>~charity</p>\n<h2>Experiment update</h2>\n<p>As I wrote last week, I’m trying to reset my relationship with writing, by publishing one short blog post per week: under 1000 words, minimal editing. And there marks week 2, 942 words.</p>\n<p>See you next week.</p>\n<p>Week 1 &#8212; &#8220;<a href=\"https://charity.wtf/2025/04/19/on-writing-social-media-and-finding-the-line-of-embarrassment/\">On Writing, Social Media, and Finding the Line of Embarrassment</a>&#8221;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://charity.wtf/2025/04/28/on-dropouts-and-bootstraps/",
            "publishedAt": "2025-04-28",
            "source": "Charity Majors",
            "summary": "In my early twenties I had a cohort of friends and coworkers, all Silicon Valley engineers, all quite good at their jobs, all college dropouts. We developed a shared conviction that only losers got computer science degrees. This sounds like a joke, or a self-defense mechanism, but it was neither. We were serious. We held [&#8230;]",
            "title": "On Dropouts and Bootstraps"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>The web will be far worse off <a href=\"https://www.msn.com/en-us/technology/tech-companies/a-judge-could-force-google-to-sell-chrome-what-you-need-to-know/ar-AA1DjlGy\">if Google is forced to sell Chrome</a>, even if it's to atone for legitimate ad-market monopoly abuses. Which mean we'll all be worse off as the web would lose ground to actual monopoly platforms, like the iOS App Store and Google's own Play Store. <br /><br />First, Chrome won the browser war fair and square by building a better surfboard for the internet. This wasn't some opportune acquisition. This was the result of grand investments, great technical prowess, and markets doing what they're supposed to do: rewarding the best. Besides, we have a million alternatives. Firefox still exists, so does Safari,&nbsp; so does the billion Chromium-based browsers like Brave and Edge. And we finally even have new engines on the way with the <a href=\"https://ladybird.org/\">Ladybird browser</a>.&nbsp;<br /><br /></div><div>Look, Google's trillion-dollar business depends on a thriving web that can be searched by Google.com, that can be plastered in AdSense, and that now can feed the wisdom of AI. Thus, Google's incredible work to further the web isn't an act of charity, it's of economic self-interest, and that's why it works. Capitalism <a href=\"https://www.goodreads.com/quotes/68664-it-is-not-from-the-benevolence-of-the-butcher-the\">doesn't run on benevolence</a>, but incentives.</div><div><br />We want an 800-pound gorilla in the web's corner! Because Apple would love nothing better (despite the admirable work to keep up with Chrome by Team Safari) to see the web's capacity as an application platform diminished. As would every other owner of a proprietary application platform. Microsoft fought the web tooth and nail back in the 90s because they knew that a free, open application platform would undermine lock-in — and it did!</div><div><br />But the vitality of that free and open application platform depends on constant development. If the web stagnates, other platforms will gain. But with Team Chrome pushing the web forward in a million ways — be it import maps, nested CSS, web push, etc. — is therefore essential.</div><div><br />This is a classic wealth vs. riches mistake. Lawyers see Chrome as valuable in a moment's snapshot, but the value is all in the wealth that continued investment brings. A Chrome left to languish with half the investment will evaporate as quickly as a lottery winner's riches. Wealth requires maintenance to endure.</div><div><br />Google should not get away with rigging the online ad market, but forcing it to sell Chrome will do great damage to the web.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/don-t-make-google-sell-chrome-93cefbc6",
            "publishedAt": "2025-04-28",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>The web will be far worse off <a href=\"https://www.msn.com/en-us/technology/tech-companies/a-judge-could-force-google-to-sell-chrome-what-you-need-to-know/ar-AA1DjlGy\">if Google is forced to sell Chrome</a>, even if it's to atone for legitimate ad-market monopoly abuses. Which mean we'll all be worse off as the web would lose ground to actual monopoly platforms, like the iOS App Store and Google's own Play Store. <br /><br />First, Chrome won the browser war fair and square by building a better surfboard for the internet. This wasn't some opportune acquisition. This was the result of grand investments, great technical prowess, and markets doing what they're supposed to do: rewarding the best. Besides, we have a million alternatives. Firefox still exists, so does Safari,&nbsp; so does the billion Chromium-based browsers like Brave and Edge. And we finally even have new engines on the way with the <a href=\"https://ladybird.org/\">Ladybird browser</a>.&nbsp;<br /><br /></div><div>Look, Google's trillion-dollar business depends on a thriving web that can be searched by Google.com, that can be plastered in AdSense, and that now can feed the wisdom of AI. Thus, Google's incredible work to further the web isn't an act of charity, it's of economic self-interest, and that's why it works. Capitalism <a href=\"https://www.goodreads.com/quotes/68664-it-is-not-from-the-benevolence-of-the-butcher-the\">doesn't run on benevolence</a>, but incentives.</div><div><br />We want an",
            "title": "Don't make Google sell Chrome"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX meetups this week in Istanbul, Copenhagen, Paris, Zurich, Vienna, Rome, Vancouver, Las Vegas, and LA. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">the post</a> for details.</p><p><strong>2: </strong><a href=\"https://www.givedirectly.org/\">GiveDirectly</a> (a charity that gives money directly to poor people in developing countries) is hiring a \"fundraising-focused research senior manager\". Remote work, $108K in the US and slightly less in other countries. See <a href=\"https://job-boards.greenhouse.io/givedirectly/jobs/4544771005\">here</a> for details. </p><p><strong>3: </strong>New subscribers-only post, <a href=\"https://www.astralcodexten.com/p/with-this-characters-death-the-thread\">With This Character&#8217;s Death, The Thread Of Prophecy Is Severed</a>, discussing how Pope Francis&#8217; passing obsoletes a 500-year-old apocalyptic prophecy (or not).</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-379",
            "publishedAt": "2025-04-28",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX meetups this week in Istanbul, Copenhagen, Paris, Zurich, Vienna, Rome, Vancouver, Las Vegas, and LA. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">the post</a> for details.</p><p><strong>2: </strong><a href=\"https://www.givedirectly.org/\">GiveDirectly</a> (a charity that gives money directly to poor people in developing countries) is hiring a \"fundraising-focused research senior manager\". Remote work, $108K in the US and slightly less in other countries. See <a href=\"https://job-boards.greenhouse.io/givedirectly/jobs/4544771005\">here</a> for details. </p><p><strong>3: </strong>New subscribers-only post, <a href=\"https://www.astralcodexten.com/p/with-this-characters-death-the-thread\">With This Character&#8217;s Death, The Thread Of Prophecy Is Severed</a>, discussing how Pope Francis&#8217; passing obsoletes a 500-year-old apocalyptic prophecy (or not).</p>",
            "title": "Open Thread 379"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3082/",
            "publishedAt": "2025-04-28",
            "source": "XKCD",
            "summary": "<img alt=\"It's important to learn the moves that take you into the vortex, but it's best not to study vortex itself too closely. Even grandmasters who have built up a tolerance lose the ability to play for a few hours after studying it.\" src=\"https://imgs.xkcd.com/comics/chess_position.png\" title=\"It's important to learn the moves that take you into the vortex, but it's best not to study vortex itself too closely. Even grandmasters who have built up a tolerance lose the ability to play for a few hours after studying it.\" />",
            "title": "Chess Position"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-04-28"
}