{
    "articles": [
        {
            "content": [
                "<div class=\"lead\"><p>The $FLY Airdrop is live!  Claim your share of <a href=\"https://fly.io/blog/macaroons-escalated-quickly/\" title=\"\">the token powering Fly.io’s global network</a> of 3M+ apps and (🤮) own a piece of the sky!</p>\n</div>\n<p>We know. Our Twitter got owned. We knew within moments of it happening. We know exactly how it happened. Nothing was at risk other than our Twitter account (and one Fly.io employee&rsquo;s self-esteem).  Also: for fuck&rsquo;s sake.</p>\n\n<p>Here&rsquo;s what happened: Kurt Mackey, our intrepid CEO, got phished.</p>\n<div class=\"callout\"><p>Had this been an impactful attack, we would not be this flippant about it. For this, though, any other tone on our part would be false.</p>\n</div><h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"how-they-got-kurt\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#how-they-got-kurt\"></a><span class=\"plain-code\">How They Got Kurt</span></h2>\n<p>Two reasons: one, it was a pretty good phishing attack, and two, Twitter fell outside the &ldquo;things we take seriously&rdquo; boundary.</p>\n\n<p>The phishing attack was effective because it exploited a deep psychological vulnerability in our management team: we are old and out of touch with the youths of today.</p>\n\n<p>For many months now, we&rsquo;ve had an contractor/intern-type-person Boosting Our Brand on Twitter by posting dank developer memes (I think that&rsquo;s what they&rsquo;re called). The thing about this dankery is that we don&rsquo;t really understand it. I mean, hold on, we know what the memes mean technically. We just don&rsquo;t get why they&rsquo;re funny.</p>\n\n<p>However, in pushing back on them, we&rsquo;re up against two powerful forces:</p>\n\n<ol>\n<li>The dank memes appear to perform better than the stuff we ourselves write on Twitter.\n</li><li>We are reliably informed by our zoomer children that we are too cringe to be trusted on these matters.\n</li></ol>\n\n<p>Here&rsquo;s the phish Kurt got:</p>\n\n<p><img alt=\"A pretty-plausible Twitter alert\" src=\"https://fly.io/blog/kurt-got-got/assets/phish.png?2/3&amp;center\" /></p>\n\n<p>Diabolical. Like a scalpel expertly wielded against Kurt&rsquo;s deepest <a href=\"https://theonion.com/cool-dad-raising-daughter-on-media-that-will-put-her-en-1819572981/\" title=\"\">middle-aged-dude</a> insecurity. Our ruthless attackers clinically designed this email to trigger an autonomic Kurt response: &ldquo;oh, what the fuck is this, and why did we post it?&rdquo;</p>\n<div class=\"right-sidenote\"><p>ATO is cool-kid for “got owned”</p>\n</div>\n<p>I&rsquo;m getting a little ahead of the story here. We knew our X.com account had suffered an ATO because a bunch of us simultaneously got another email saying that the <a href=\"https://twitter.com/flydotio\" title=\"\">@flydotio</a> account&rsquo;s email address now pointed to <code>achilles19969@gmail.com</code>. Our immediate response was to audit all accesses to the login information in <a href=\"https://1password.com/\" title=\"\">1Password</a>, to cut all access for anybody who&rsquo;d recently pulled it; your worst-case assumption in a situation like this is that someone&rsquo;s endpoint has been owned up.</p>\n\n<p>Fortunately, nobody lost access for very long. I called Kurt to let him know why he was being locked out, and 5 seconds later, he&rsquo;d <a href=\"https://archive.is/6rVqf\" title=\"\">realized what had happened.</a> <strong class=\"font-semibold text-navy-950\">Don&rsquo;t click anything there.</strong></p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"why-it-worked\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#why-it-worked\"></a><span class=\"plain-code\">Why It Worked</span></h2>\n<p>That&rsquo;s the right question to ask, isn&rsquo;t it? How could this have been possible in the first place?</p>\n\n<p>Contrary to one popular opinion, you don&rsquo;t defeat phishing by training people not to click on things. I mean, tell them not to, sure! But eventually, under continued pressure, everybody clicks. <a href=\"https://people.cs.uchicago.edu/~grantho/papers/oakland2025_phishing-training.pdf\" title=\"\">There&rsquo;s science on this</a>. The cool kids haven&rsquo;t done phishing simulation training in years.</p>\n\n<p>What you&rsquo;re supposed to do instead is use phishing-resistant authentication. This is almost the whole backstory for <a href=\"https://www.imperialviolet.org/tourofwebauthn/tourofwebauthn.html\" title=\"\">U2F,  FIDO2</a> and <a href=\"https://support.apple.com/en-us/102195\" title=\"\">Passkeys</a>.</p>\n\n<p>Phishing-resistant authentication works by mutual authentication (or, if you&rsquo;re a stickler, by origin- and channel-binding). Phishes are malicious proxies for credentials. Modern MFA schemes like FIDO2 break that proxy flow; your browser won&rsquo;t send real credentials to the fake site.</p>\n<div class=\"right-sidenote\"><p>there’s more to it than this, but, broad strokes.</p>\n</div>\n<p>This is, in fact, how all of our infrastructure is secured at Fly.io; specifically, we get <a href=\"https://fly.io/blog/soc2-the-screenshots-will-continue-until-security-improves/#what-soc2-made-us-do\" title=\"\">everything behind an IdP</a> (in our case: Google&rsquo;s) and have it require phishing-proof MFA. You&rsquo;re unlikely to phish your way to viewing logs here, or to refunding a customer bill at Stripe, or to viewing infra metrics, because all these things require an SSO login through Google.</p>\n\n<p>Twitter, on the other hand. Yeah, so, about that. You may have heard that, a few years back, there were some goings-on involving Twitter. Many of us at Fly.io <a href=\"https://hachyderm.io/@flydotio\" title=\"\">decamped for Mastodon</a>, and <a href=\"https://bsky.app/profile/did:plc:j7herf6n4xiig2yg7fqdmkci\" title=\"\">later to Bluesky.</a> There was a window of time in 2023-2024 where it looked as if Twitter might not be a long term thing for us at all.</p>\n<div class=\"right-sidenote\"><p>† (to whom I sincerely apologize for having assumed they had been owned up and were the proximate cause of the hack)</p>\n</div>\n<p>As a result, Twitter had been a sort of legacy shared account for us, with credentials managed in 1Password and shared with our zoomer contractor†.</p>\n\n<p>Which is why Kurt was in a position to pull credentials from 1Password and log in to members-x.com in response to an email from alerts-x.com.</p>\n<div class=\"callout\"><p>Still: we could have dodged this attack with hygiene: Kurt complains that “x.com” is an extremely phishable domain, and, sure, but also: the 1Password browser plugin would have noticed that “members-x.com” wasn’t an “x.com” host.</p>\n</div><h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"what-took-so-long\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#what-took-so-long\"></a><span class=\"plain-code\">What Took So Long</span></h2>\n<p>The attacker immediately revoked all tokens and set up new 2FA, so while we were quickly able to reset our password, we couldn&rsquo;t lock them out of our account without an intervention from X.com, which took something like 1 5 hours to set up.</p>\n\n<p>(That&rsquo;s not a knock on X.com; 15 hours for a 2FA reset isn&rsquo;t outside industry norms).</p>\n\n<p>We&rsquo;re obviously making a lot of noise about this now, but we were pretty quiet during the incident itself (beyond just &ldquo;We know. We knew 45 seconds after it happened. We know exactly how it happened. It&rsquo;s just a Twitter thing.&rdquo;)</p>\n\n<p>That&rsquo;s because, in the grand scheme of things, the attack was pretty chill: <a href=\"https://archive.is/PTO2M\" title=\"\">a not-very-plausible crypto scam</a> that presumably generated $0 for the attackers, 15+ hours of <code>brand damage</code>, and extra security engineering cycles burnt on watchful waiting. Our users weren&rsquo;t under attack, and the account wasn&rsquo;t being used to further intercept customer accounts. At one point, the attackers apparently deleted our whole Twitter history, which, like, don&rsquo;t threaten us with a good time. So we let it roll, until we got our account recovered the next morning.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"the-moral-of-the-story-is\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#the-moral-of-the-story-is\"></a><span class=\"plain-code\">The Moral Of The Story Is</span></h2><div class=\"right-sidenote\"><p>“Really the biggest takeaway for me is that Kurt reads his email.”</p>\n</div>\n<p>Obviously Kurt loses his commit access. The time comes in the life of every CEO, and now it comes for him. </p>\n\n<p>Also, we&rsquo;ll finally have a population sample for &ldquo;incident response&rdquo; in <a href=\"https://fly.io/blog/soc2-the-screenshots-will-continue-until-security-improves/\" title=\"\">our next SOC2</a>.</p>\n\n<p>Maybe we&rsquo;ll post more on Twitter. Or maybe we&rsquo;ll double down on Zoomer memes. I don&rsquo;t know. Social media is really weird right now. Either way: our Twitter access is Passkeys now.</p>\n<div class=\"right-sidenote\"><p>seriously don’t click anything on that page</p>\n</div>\n<p>If you were inclined to take us up on an &ldquo;airdrop&rdquo; to &ldquo;claim a share&rdquo; of the &ldquo;token&rdquo; powering Fly.io, the site is <a href=\"https://archive.is/PTO2M\" title=\"\">still up</a>. You can connect your wallet it it! You&rsquo;ll lose all your money. But if we&rsquo;d actually done an ICO, you&rsquo;d have lost all your money anyways.</p>\n\n<p>Somebody involved in pulling this attack off had to come up with &ldquo;own a piece of the sky!&rdquo;, and I think that&rsquo;s punishment enough for them.</p>\n\n<p>Whatever you&rsquo;re operating that isn&rsquo;t behind phishing-resistant MFA, or, better yet, an SSO IdP that requires phishing-resistant MFA: that thing is eventually going to get phished. Dance around the clown-fire of our misfortune if you must, but let us be a lesson to you as well.</p>"
            ],
            "link": "https://fly.io/blog/kurt-got-got/",
            "publishedAt": "2025-10-08",
            "source": "Fly.io Blog",
            "summary": "<div class=\"lead\"><p>The $FLY Airdrop is live! Claim your share of <a href=\"https://fly.io/blog/macaroons-escalated-quickly/\" title=\"\">the token powering Fly.io’s global network</a> of 3M+ apps and (🤮) own a piece of the sky!</p> </div> <p>We know. Our Twitter got owned. We knew within moments of it happening. We know exactly how it happened. Nothing was at risk other than our Twitter account (and one Fly.io employee&rsquo;s self-esteem). Also: for fuck&rsquo;s sake.</p> <p>Here&rsquo;s what happened: Kurt Mackey, our intrepid CEO, got phished.</p> <div class=\"callout\"><p>Had this been an impactful attack, we would not be this flippant about it. For this, though, any other tone on our part would be false.</p> </div><h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"how-they-got-kurt\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#how-they-got-kurt\"></a><span class=\"plain-code\">How They Got Kurt</span></h2> <p>Two reasons: one, it was a pretty good phishing attack, and two, Twitter fell outside the &ldquo;things we take seriously&rdquo; boundary.</p> <p>The phishing attack was effective because it exploited a deep psychological vulnerability in our management team: we are old and out of touch with the youths of today.</p> <p>For many months now, we&rsquo;ve had an contractor/intern-type-person Boosting Our Brand on Twitter by posting dank developer memes (I",
            "title": "Kurt Got Got"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/10/08/style/tiny-modern-love-stories-even-painful-things-can-heal.html",
            "publishedAt": "2025-10-08",
            "source": "Modern Love - NYT",
            "summary": "Modern Love in miniature, featuring reader-submitted stories of no more than 100 words.",
            "title": "Tiny Love Stories: ‘Even Painful Things Can Heal’"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/10/08/podcasts/tessa-thompson-hedda.html",
            "publishedAt": "2025-10-08",
            "source": "Modern Love - NYT",
            "summary": "In Thompson’s latest film, she plays an unhappy housewife who blows up her life. In reality, the actor and producer has left relationships with much less fallout.",
            "title": "Tessa Thompson on Playing ‘Hedda’— and Finding What You Really Want"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Oct/8/claude-datasette-plugins/#atom-entries",
            "publishedAt": "2025-10-08",
            "source": "Simon Willison",
            "summary": "<p>This isn't necessarily surprising, but it's worth noting anyway. Claude Sonnet 4.5 is capable of building a full Datasette plugin now.</p> <p>I've seen models complete aspects of this in the past, but today is the first time I've shipped a new plugin where every line of code and test was written by Claude, with minimal prompting from myself.</p> <p>The plugin is called <strong><a href=\"https://github.com/datasette/datasette-os-info\">datasette-os-info</a></strong>. It's a simple debugging tool - all it does is add a <code>/-/os</code> JSON page which dumps out as much information as it can about the OS it's running on. Here's a <a href=\"https://til.simonwillison.net/-/os\">live demo</a> on my TIL website.</p> <p>I built it to help experiment with changing the Docker base container that Datasette uses to <a href=\"https://docs.datasette.io/en/stable/publish.html\">publish images</a> to one that uses Python 3.14.</p> <p>Here's the full set of commands I used to create the plugin. I started with my <a href=\"https://github.com/simonw/datasette-plugin\">datasette-plugin</a> cookiecutter template:</p> <div class=\"highlight highlight-source-shell\"><pre>uvx cookiecutter gh:simonw/datasette-plugin [1/8] <span class=\"pl-en\">plugin_name</span> (): os-info [2/8] <span class=\"pl-en\">description</span> (): Information about the current OS [3/8] hyphenated (os-info): [4/8] underscored (os_info): [5/8] <span class=\"pl-en\">github_username</span> (): datasette [6/8] <span class=\"pl-en\">author_name</span> (): Simon Willison [7/8] <span class=\"pl-en\">include_static_directory</span> (): [8/8] <span class=\"pl-en\">include_templates_directory</span> (): </pre></div> <p>This created a <code>datasette-os-info</code> directory with the",
            "title": "Claude can write complete Datasette plugins now"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-4025\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-4025",
            "publishedAt": "2025-10-08",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-4025\"> Read more </a> </p>",
            "title": "Hidden Open Thread 402.5"
        },
        {
            "content": [
                "<p>It’s been about a year since the last one of these. Given the long cycle, I have done my best to check for changes but things may have changed on any given topic by the time you read this.</p>\n\n\n<h4 class=\"wp-block-heading\">The NEPA Problem</h4>\n\n\n<p>NEPA is a constant thorn in the side of anyone attempting to do anything.</p>\n<p>A certain kind of person responds with: “Good.”</p>\n<p>That kind of person does not want humans to do physical things in the world.</p>\n<ol>\n<li>They like the world as it is, or as it used to be.</li>\n<li>They do not want humans messing with it further.</li>\n<li>They often also think humans are bad, and should stop existing entirely.\n<div>\n\n\n<span id=\"more-24772\"></span>\n\n\n</div>\n</li>\n<li>Or believe humans deserve to suffer or do penance.</li>\n<li>Or do not trust people to make good decisions and safeguard what matters.</li>\n<li>To them: If humans want to do something to the physical world?</li>\n<li>That intention is highly suspicious.</li>\n<li>We probably should not let them do that.</li>\n</ol>\n<p>This is in sharp contrast with the type of person who:</p>\n<ol>\n<li>Cares about the environment.</li>\n<li>Who wants good things rather than bad to happen to people.</li>\n<li>Who wants the Earth not to boil and the air to be clean and so on.</li>\n</ol>\n<p>That person notices that NEPA long ago started doing more harm than good.</p>\n<p>The central problem lies is the core structure.</p>\n<p>NEPA is based on following endlessly expanding procedural requirements. NEPA does not ask whether costs exceed benefits, or whether something is a good idea.</p>\n<p>It only asks about whether procedure was followed sufficiently, or whether blame can be identified somewhere.</p>\n\n\n<h4 class=\"wp-block-heading\">The Full NEPA Solution</h4>\n\n\n<p>Is to never go full NEPA.</p>\n<p>Instead, one of Balsa’s central policy goals is an entire reimagining of NEPA.</p>\n<p>The proposal is to replace NEPA’s procedural requirement with (when necessary) an analysis of costs and benefits, followed by a vote of stakeholders on whether to proceed. Ask the right question, whether the project is worthwhile, not the wrong question of what paperwork is in order.</p>\n<p>This post is not about laying out that procedure. This post is mostly about telling various Tales From the NEPA. It is also telling tales of energy generation from around the world, including places that do not share our full madness.</p>\n<p>Versions and components of this post have been in my drafts for a long time, so not all of them will be as recent as is common here.</p>\n\n\n<h4 class=\"wp-block-heading\">The Other Full NEPA Solution</h4>\n\n\n<p>That was the plan, but the vibes have changed, and NEPA is pretty clearly a large net negative for climate change, which has to win in a fight at this point over the local concerns it protects. There’s a new plan.</p>\n<p>Kill it. Repeal NEPA. Full stop.</p>\n<blockquote><p><a href=\"https://x.com/eshear/status/1877388330548998603\">Emmett Shear</a>: Previously I believed that there was probably enough protection offered by NEPA / CEQA that it offset the damage. At this point, it’s pretty clear we should simply repeal it and figure out if we need to replace anything later.</p>\n<p>Repeal NEPA.</p>\n<p><a href=\"https://x.com/elidourado/status/1877061236610806227\">Eli Dourado</a>: NEPA is the most harmful law in the United States and must be repealed. In addition to causing forest fires and miring Starbase in litigation, it results in delays and endless litigation for any project that the federal government touches. It should be target #1 for DOGE.</p>\n<p>Sadly this is not yet within the Overton window of relevant Congressional staff. We need to make this happen.</p></blockquote>\n<p>The problem is DOGE is working via cutting off payments, which doesn’t let you hit NEPA. But if you want to strike a blow that matters? This is it.</p>\n\n\n<h4 class=\"wp-block-heading\">Meanwhile</h4>\n\n\n<blockquote><p><a href=\"https://x.com/senatorshoshana/status/1881703774038937979\">Thomas Hochman</a>: Trump has revoked Carter&#8217;s 1977 EO – the one that empowered CEQ to issue binding NEPA regulations.</p>\n<p>This could dramatically reshape how federal agencies conduct NEPA reviews. In the post-Marin Audobon landscape, this is a HUGE deal!</p>\n<p>…</p>\n<p>Let&#8217;s walk through a few of the specifics.</p>\n<p>CEQ will formally propose repealing the existing NEPA regulations that have guided agencies since the late 1970s.</p>\n<p>This is major: those regs currently supply the standard NEPA procedures (e.g., EIS format, “major federal action,” significance criteria, scoping, etc.).</p>\n<p>Rescinding them will leave agencies free to adopt leaner, agency-specific processes—or rely on new guidance.</p>\n<p>CEQ will lead a “working group” composed of representatives from various agencies.</p>\n<p>This group’s job is to develop or revise each agency’s own NEPA procedures so that they’re consistent with the new (post-rescission) approach.</p>\n<p>As I wrote in Green Tape, establishing this internal guidance at the agency level will be crucial.</p>\n<p>And finally: general permits and permits-by-rule!!!</p>\n<p><a href=\"https://x.com/elidourado/status/1881557328677437792\">Eli Dourado</a>: NEPA is still there but CEQ’s authority to issue regs is gone (and was already under dispute in the courts). NEPA the statute still applies.</p>\n<p><a href=\"https://x.com/cremieuxrecueil/status/1881548589589315800\">Cremieux</a>: Some pretty major components of permitting reform on day one might be the biggest news in the day one EOs.</p>\n<p>There&#8217;s trillions in value in these EOs.</p>\n<p>I am delighted.</p></blockquote>\n<p>You love to see it. This day one move gave me a lot of hope things would go well, alas other things happened that were less good for my hopes.</p>\n<p>As with everything Trump Administration, we will see what actually happens once the lawyers get involved. This is not an area where ‘ignore the law and simply do things’ seems likely to work out. Some of it will stick, but how much?</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">Yay Nuclear Power</h4>\n\n\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/01/nuclear-deregulation.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=nuclear-deregulation\">Yay nuclear deregulation, yes obviously</a>, Alex Tabarrok opens with ‘yes, I know how that sounds’ but actually it sounds great if you’re familiar with the current regulations. I do see why one would pause before going to the level of ‘treat small modular reactors like x-ray machines,’ I’d want to see the safety case and all that, but probably.</p>\n<p><a href=\"https://www.huffpost.com/entry/congress-advance-act-nuclear-power_n_6670a926e4b08889dbe5e626?ivrf\">Nuclear is making an attempted comeback</a>, <a href=\"https://x.com/HopfJames/status/1788254232380071974\">now that AI</a> and trying the alternative of doing nothing has awoken everyone to the idea that this will be a good idea.</p>\n<blockquote><p>Alexander Kaufman: The Senate voted nearly unanimously (88-2) to pass major legislation designed to reverse the American nuclear industry’s decades-long decline and launch a reactor-building spree to meet surging demand for green electricity at home and to catch up with booming rivals overseas.</p>\n<p>The bill slashes the fees the Nuclear Regulatory Commission charges developers, speeds up the process for licensing new reactors and hiring key staff, and directs the agency to work with foreign regulators to open doors for U.S. exports.</p>\n<p>The NRC is also tasked with rewriting its mission statement to avoid unnecessarily limiting the “benefits of nuclear energy technology to society,” essentially reinterpreting its raison d’être to include protecting the public against the dangers of not using atomic power in addition to whatever safety threat reactors themselves pose.</p></blockquote>\n<p>There is a lot of big talk about how much this will change the rules on nuclear power regulation. As usual I remain skeptical of big impacts, but it would not take much to reach a tipping point. As the same post notes when discussing the reactors in Georgia, once you relearn what you are doing things get a lot better and cheaper.</p>\n<blockquote><p>That pair of reactors, which just came online last month at the Alvin W. Vogtle Electric Generating Plant in Georgia, cost more than $30 billion. As the expenses mounted, other projects to build the same kind of reactor elsewhere in the country were canceled.</p>\n<p>The timing could hardly have been worse. After completing the first reactor, the second one cost far less and came online faster. But the disastrous launch dissuaded any other utilities from investing in a third reactor, which economists say would take even less time and money now that the supply chains, design and workforce are established.</p></blockquote>\n<p>After seeing the results, <a href=\"https://x.com/energybants/status/1796578141797789794\">the secretary of energy called for ‘hundreds’ more large nuclear reactions</a>, two hundred by 2050.</p>\n<p><a href=\"https://x.com/energybants/status/1882792905921999001\">NextEra looking to restart a nuclear plant in Iowa that closed in 2020</a>.</p>\n<p><a href=\"https://x.com/HopfJames/status/1879961863842410587\">Ontario eyeing a new nuclear plant near Port Hope</a>, 8-10 GWs.</p>\n<p>It seems the world is a mix of people who shut down nuclear power out of spite and mood affiliation and intuitions that nuclear is dangerous or harmful when it is orders of magnitudes safer and fully green, versus those who realize we should be desperate to build more.</p>\n<blockquote><p><a href=\"https://x.com/mattyglesias/status/1803217019564859450\">Matthew Yglesias</a>: The all-time energy champ</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!N0TW!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5501e009-dcff-4026-8739-921b1e9d4efc_970x1356.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>Matthew Yglesias: The Fukushima incident was deadly not because anyone died in the accident but <a href=\"https://t.co/Pa9leQEzGi\">because the post-Fukushima nuclear shutdown caused more Japanese people to freeze to death to conserve energy</a>.</p></blockquote>\n<p><a href=\"https://x.com/deanwball/status/1803228403425738974\">Dean Ball is excited by the bill</a>, including its prize for next-gen nuclear tech and the potential momentum for future action.</p>\n<p>There is a long way to go. <a href=\"https://x.com/AlecStapp/status/1787635514977165800\">It seems we do things like this</a>? And the lifetime for nuclear power plants has nothing to do with their physical capabilities or risks?</p>\n<blockquote><p>Alec Stapp: Apparently we have been arbitrarily limiting licenses for nuclear power reactors to 40 years because of… “antitrust considerations”??</p>\n<p>Nuclear Regulatory Commission: The Atomic Energy Act authorizes the Nuclear Regulatory Commission to issue licenses for commercial power reactors to operate for up to 40 years. These licenses can be renewed for an additional 20 years at a time. The period after the initial licensing terris known as the period of extended operation. Economic and antitrust considerations, not limitations of nuclear technology, determined the original 40-year term for reactor licenses. However, because of this selected time period, some systems, structures, and components may have been engineered on the basis of an expected 40-year service life.</p></blockquote>\n<p><a href=\"https://t.co/5GUgUb81Wl\">Or how many nuclear engineers does it take to change a light bulb?</a> $50k worth.</p>\n<p><a href=\"https://x.com/Sam_Dumitriu/status/1790727812875157822\">How much for a $200 panel meter in a control room?</a> Trick question, it’s $20k.</p>\n<p>And yet nuclear is still at least close to cost competitive.</p>\n<p>The <a href=\"https://www.huffpost.com/entry/biden-nrc-jeff-baran-nuclear_n_65aeb5e4e4b0be962c82f22a?lxl\">Senate also previously forced Biden</a> to drop attempt to renominate Jeff Baran to the Nuclear Regulatory Commission (NRC), the the basis of Baran being starkly opposed to the concept of building nuclear power plants.</p>\n<p>Why has Biden effectively opposed nuclear power? My model is that it is the same reason he is effectively opposing power transmission and green energy infrastructure. Biden thinks throwing money and rhetoric at problems makes solutions happen. He does not understand, even in his best moments, that throwing up or not removing barriers to doing things stops those things from happening even when that was not your intention.</p>\n<p><a href=\"https://twitter.com/mattyglesias/status/1773002253017792943\">Thus, he can also do things</a> like <a href=\"https://t.co/9lOPR53G4Y\">offer $1.5 billion in conditional commitments</a> to support recommissioning a Michigan nuclear power plant, because he understands that more nuclear power plants would be a good thing. <a href=\"https://x.com/sporadicalia/status/1796115854536372436\">And he can say things like ‘White House to support new nuclear power plants in the U.S.’</a> That does not have to cause him to, in general, do the things that cause there to be more nuclear power plants. Because he cannot understand that those are things like ‘appoint people to the NRC that might ever want to approve a new nuclear power plant in practice.’ Luckily, it sounds like the new bill does indeed help.</p>\n<p><a href=\"https://www.theguardian.com/australia-news/2023/nov/09/small-modular-nuclear-reactor-that-was-hailed-by-coalition-as-future-cancelled-due-to-rising-costs\">Small modular nuclear reactor</a> (SMR) planned for Idaho, called most advanced in the nation, <a href=\"https://www.nuscalepower.com/en/news/press-releases/2023/uamps-and-nuscale-power-agree-to-terminate-the-carbon-free-power-project\">was cancelled in January after customers could not be found to buy the electricity</a>. Only a few months later, everyone is scrambling for more electricity to run their data centers. It seems like if you build it, Microsoft or Google or Amazon will be happy to plop a data center next to that shiny new reactor, no? And certainly plenty of other places would welcome one. So odd that this got slated first for Idaho.</p>\n<p><a href=\"https://dailyhive.com/vancouver/alberta-nuclear-energy-opg\">Alberta signs deal to jointly assess the development and deployment of SMRs</a>. One SMR is to be built in Ontario by end of 2028, to be online in 2029.</p>\n<p><a href=\"https://x.com/AlecStapp/status/1792282249980780963\">Slovakia to build a new nuclear reactor.</a> Also talk of increased capacity in France, Italy, Britain, Japan, Canada, Poland and The Netherlands in the thread, from May. <a href=\"https://twitter.com/skdh/status/1738907972636397912\">From December 2023: Poland authorizes 24 new small nuclear plants.</a></p>\n<p><a href=\"https://x.com/HopfJames/status/1792965148581503281\">Philippines are considering nuclear as well.</a></p>\n<p><a href=\"https://x.com/HopfJames/status/1799108791897915763\">Support for Nuclear in Australia has increased dramatically to 61%-37%</a>.</p>\n<p>Claim that <a href=\"https://twitter.com/isabelleboemeke/status/1783923390379921498\">the shutdown of nuclear power in Germany was even more corrupt than we realized</a>, <a href=\"https://www.euractiv.com/section/energy-environment/news/german-greens-minister-robert-habeck-under-fire-over-2022-nuclear-shutdown/\">with the Green Party altering expert conclusions</a> to stop a reconsideration. The claims have been denied.</p>\n<p><a href=\"https://x.com/HopfJames/status/1958583424354304352\">Unfortunately, we are allowing an agreement whereby Korea Hydro &amp; Nuclear Power</a> (KHNP) will not be allowed to bid on new nuclear projects in Western countries, due to an IP issue with Westinghouse, on top of them paying royalties for any Asian projects that move forward. The good news is that if Westinghouse wins the projects, KHNP and KEPCO are prime sub-contractors anyway, so it is unclear this is that much of a functional</p>\n\n\n<h4 class=\"wp-block-heading\">Yay Solar and Wind Power</h4>\n\n\n<p>India’s energy mix is rapidly improving.</p>\n<blockquote><p><a href=\"https://twitter.com/johnrhanger/status/1737451395203096679?s=61\">John Raymond Hanger</a>: Good morning with good news: Solar and wind were 92% of India&#8217;s generation additions in 2022. It deployed as much solar in 2022 as the UK has ever built. Coal also was down 78%.</p>\n<p>India&#8217;s large wind &amp; solar additions are vital climate action. Wonderful!</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!dCak!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F55b65f11-9940-4009-bff5-8ce46d18ebcd_619x555.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>David Bryan: Confusingly written. Coal in India is at 55%. Wind is at 10% &amp; solar is at 12% &#8211; sometimes more, sometimes less.</p>\n<p>A Zaugurz: mmmkay &#8220;India has an estimated 65.3 GW of proposed, on-grid coal capacity under active development: 30.4 GW under construction and 34.9 GW in pre-construction&#8221;</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!ZGHW!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F47b86943-ec28-4de6-a2d5-329ddfbf92ea_779x645.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Stocks are different from flows are different from changes in flow.</p>\n<p>India was still adding more coal capacity even as of December. But almost all of their new capacity was Solar and Wind, and they are clearly turning the corner on new additions. One still has to then make emissions go down, and then make net emissions drop below zero. One step at a time.</p>\n<p>Also, 15% of the installed base is already not bad at all. Renewables are a big deal. A shame nuclear is only 2%.</p>\n<p><a href=\"https://twitter.com/OpenskiesX/status/1778640176035877065\">Khavda in India,</a> now the world’s largest renewable energy park using a combination of solar and wind energy.</p>\n<p>Back in America, who is actually building the most solar?</p>\n<p>Why, Texas, of course. California talks a good game, but what matters most (aside from sunlight where California has the edge) <a href=\"https://twitter.com/AlecStapp/status/1779516563965530490\">is not getting in the way</a>.</p>\n<blockquote><p>EIAGov: More than half of the new utility-scale solar capacity scheduled to come online in 2024 is planned for three states: Texas (35%), California (10%) and Florida (6%).</p>\n<p><a href=\"https://twitter.com/AlecStapp/status/1779516563965530490\">Alec Stapp</a>: Blue states talk a big game on clean energy goals while Texas just goes and builds it.</p>\n<p>Texas is building grid-scale solar at a much faster rate than California.</p>\n<p>Can’t be due to regulations — must be because CA is a small state with little sunshine <img alt=\"🙃\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f643.png\" style=\"height: 1em;\" /></p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!Zl9B!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8743980e-ce3f-408a-8513-1bb4c1ab8784_950x731.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!KI6X!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F50e6c6d0-61cd-4f91-8f00-67254f100255_1107x948.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The numbers mean that despite being the state with at least the third most sunlight after Arizona and New Mexico, California is bringing online solar per capita than the nation overall.</p>\n<p><a href=\"https://x.com/cody_a_hill/status/1790811816739656130\">If you want to install home solar</a>, <a href=\"https://t.co/vbiGZ2yscQ\">it is going to get expensive</a> in the sense that the cost of the panels themselves is now less than 10% of your all-in price.</p>\n\n\n<h4 class=\"wp-block-heading\">Yay Grid Storage</h4>\n\n\n<blockquote><p><a href=\"https://twitter.com/patrickc/status/1746751008896917566\">Patrick Collison:</a> <a href=\"https://t.co/MfW0Z4X5Ii\">Grid storage to grow 80% in 2024</a>.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!nrl4!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Feec71378-637d-4a2d-9fb9-8be75d165448_1164x1182.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This is a great start, but still a drop in the bucket, as I understand it, compared to what we will need if we intend to largely rely on solar and wind in the future.</p>\n\n\n<h4 class=\"wp-block-heading\">Yay Transmission Lines</h4>\n\n\n<p>One enemy of transmission lines and other grid capabilities are NIMBYs who block projects. This includes the projects that never get proposed because of anticipation that they would then be blocked, or would require time and money to not be blocked.</p>\n<p>Tyler Cowen reprints an anonymous email he got, <a href=\"https://marginalrevolution.com/marginalrevolution/2024/03/a-different-perspective-on-power-grid-yimby-and-nimby-from-my-email.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=a-different-perspective-on-power-grid-yimby-and-nimby-from-my-email\">that notes that there is also an incentive problem</a>.</p>\n<p>When you increase power transmission capacity, you make power fungible between areas. Which is good, unless you are in the power selling business, in which case this could mean more competition and less profit. By sticking to smaller local projects, you can both avoid scrutiny and mostly get the thing actually built, and also avoid competition.</p>\n<p>That makes a lot of sense. It suggests we need to look at who is tasked with building new transmission lines, and who should be bearing the costs, including the need to struggle to make the plans and ensure they actually happen.</p>\n\n\n<h4 class=\"wp-block-heading\">American Energy is Cheap</h4>\n\n\n<p>Why do we produce so little energy in America? Partly because it is so cheap.</p>\n<blockquote><p>Alex Tabarrok: The US has some of the lowest electricity prices in the world. Shown below are <a href=\"https://op.europa.eu/en/publication-detail/-/publication/3b43f47c-e1c5-11ee-8b2b-01aa75ed71a1/\">industrial retail electricity prices in EU27, USA, UK, China and Japan</a>. Electricity is critical for AI compute, electric cars and more generally reducing carbon footprints. The US needs to build much more electricity infrastructure, by some estimates <a href=\"https://ifp.org/how-to-save-americas-transmission-system/\">tripling or quadrupling production</a>. That’s quite possible with <a href=\"https://ifp.org/how-to-save-americas-transmission-system/\">deregulation and permitting reform</a>. I am pleased to learn, moreover, that we are starting from a better base than I had imagined.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!RC9Z!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3aa4a3d6-dffa-4c2c-8126-c52b913ea641_1440x661.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Amazing how much prices elsewhere have risen lately, and how timid has been everyone’s response.</p>\n\n\n<h4 class=\"wp-block-heading\">Geoengineering</h4>\n\n\n<p>Harvard was going to do something useful and run a geoengineering experiment. They cancelled it, because of course they did. <a href=\"https://twitter.com/MTabarrok/status/1769802734469869847\">And their justifications were, well…</a></p>\n<blockquote><p>James Temple (MIT Technology Review): Proponents of solar geoengineering research argue we should investigate the concept because it may significantly reduce the dangers of climate change. Further research could help scientists better understand the potential benefits, risks and tradeoffs between various approaches.</p>\n<p>But critics argue that even studying the possibility of solar geoengineering eases the societal pressure to cut greenhouse gas emissions.</p>\n<p>Maxwell Tabarrok: The moral hazard argument against geoengineering is ridiculous. The central problem of climate change is that firms <em>ignore </em>the cost of carbon emissions.</p>\n<p>Since these costs are already ignored, decreasing them will not change their actions, but it will save lives.</p></blockquote>\n<p>It is difficult to grasp how horrible this reasoning actually is. I can’t even. Imagine this principle extended to every other bad thing.</p>\n<p>Yes, actually implementing such solutions comes with a lot of costs and dangers. That makes it seem like a good idea to learn now what those are via experiments? Better to find out now than to wait until the crisis gets sufficiently acute that people or nations get desperate?</p>\n<p>The alternative hypothesis is that many people who claim to care about the climate crisis are remarkably uninterested in the average temperatures in the world not going up. We have a lot of evidence for this hypothesis.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">NEPA Standard Procedure is a Doom Loop</h4>\n\n\n<p><a href=\"https://twitter.com/CSElmendorf/status/1771983627599155516\">It goes like this.</a></p>\n<blockquote><p>Chris Elmendorf: A $650m project would:</p>\n<p>&#8211; subtract 20 acres from wildlife refuge</p>\n<p>&#8211; add 35 acres to same refuge</p>\n<p>&#8211; connect 160 renewable energy projects to grid</p>\n<p>Not with NEPA + local enviros standing in the way. Even after &#8220;years&#8221; of enviro study.</p>\n<p><a href=\"https://x.com/kevindstevens/status/1784654719417294934\">Kevin Stevens</a>: An environmental group successfully blocked the last miles of a nearly complete 102 mile transmission line that would connect 160 renewable sites to the Midwest. Brutal.</p></blockquote>\n<p>I mean it’s completely insane that we would let 20 acres stop this at all, the cost/benefit is so obviously off the charts even purely for the environmental impacts alone. But also they are adding 35 other acres. At some point, you have to wonder why you are negotiating with people who are never willing to take any deal at all.</p>\n<p>The answer is, you are forced to ‘negotiate,’ they pretend to do so back, you give them concessions like the above, and then they turn around and keep suing, with each step adding years of delay. <a href=\"https://www.slowboring.com/p/we-must-end-the-litigation-doom-loop?utm_source=post-email-title&amp;publication_id=159185&amp;post_id=144040819&amp;utm_campaign=email-post-title&amp;isFreemail=false&amp;r=53dk&amp;triedRedirect=true&amp;utm_medium=email\">The result is known as a ‘doom loop.</a>’</p>\n<blockquote><p>Clean energy projects are the very projects most likely to get stuck in the litigation doom loop. A recent <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4498938\">Stanford study</a> found that clean energy projects are disproportionately subject to the strictest level of review. These reviews are also litigated at higher rates — 62% of the projects currently pending the strictest review are clean energy projects. The best <a href=\"https://twitter.com/JesseJenkins/status/1572998749131264000?s=20&amp;t=qFy46JwwxtpTO7zh9oEevQ\">emissions modelers</a> show that our emissions reductions goals are not possible without permitting reform.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!lwct!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9db332d5-544c-4bd5-ad6d-b6291fd7d3de_1113x1207.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>That is why we’re <a href=\"https://ifp.org/a-grand-bargain-for-permitting-reform/\">proposing</a> a time limit on injunctions. Under our proposal, after four years of litigation and review, courts could no longer prevent a project from beginning construction. This solution would pair nicely with the two-year deadlines imposed on agencies to finish review in the Fiscal Responsibility Act. If the courts believe more environmental review is necessary, they could order the government to perform it, but they could no longer paralyze new energy infrastructure construction.</p></blockquote>\n<p>This kills projects, and not the ones you want to kill. I am actually surprised the graph here lists rates that are this low.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!3gf5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F06db29e8-c968-4452-9178-96da5be76b80_1179x1385.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>If we are not going to do any other modifications, a time limit on court challenges seems like the very least we can do. My preferred solution is to change the structure entirely.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">Categorical Exemptions</h4>\n\n\n<p>The good news is that some actions are exempt. <a href=\"https://twitter.com/AlecStapp/status/1773072264784670918\">But the exemptions are illustrative.</a></p>\n<blockquote><p>Thomas Hochman: Perhaps the funniest categorical exclusion under NEPA is the one that allows the Department of the Interior to make an arrest without filling out an environmental assessment.</p>\n<p>Alec Stapp: When everything qualifies as a &#8220;major federal action&#8221; under NEPA, you get absurd outcomes like this where agencies have to waste time creating categorical exclusions for every little thing.</p>\n<p>This is how state capacity withers and dies.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Teachers Against Transportation</h4>\n\n\n<p>So in practice, what does NEPA look like?</p>\n<p>Congestion Pricing in NYC was a case in point before Hochul betrayed us.</p>\n<p>It looks like this, seriously, read how the UFT itself made its claims.</p>\n<blockquote><p><a href=\"https://twitter.com/UFT/status/1742948991979917410\">United Federation of Teachers</a>: In our lawsuit, we assert that this program, scheduled to go into effect this spring, cannot be put in place without the completion of a thorough environmental impact statement that includes the potential effects of the plan on the city’s air quality.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!91Ey!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb6560106-d56b-496e-bcd5-56780a3666c3_954x535.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>In our lawsuit, we assert that this program, scheduled to go into effect this spring, cannot be put in place without the completion of a thorough environmental impact statement that includes the potential effects of the plan on the city’s air quality.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!A-ss!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F168c73fb-d542-48d6-83c0-131bcd5a5243_879x577.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The current plan would not eliminate air and noise pollution or traffic, but would simply shift that pollution and traffic to the surrounding areas, particularly Staten Island, the Bronx, upper Manhattan and Northern New Jersey, causing greater environmental injustice in our city.</p>\n<p>[<a href=\"https://t.co/p230vk50TS\">Copy of lawsuit here</a>.]</p>\n<p><a href=\"https://twitter.com/eshear/status/1743006367471030444\">Emmett Shear</a>: This NYC teacher&#8217;s union in suing to stop congestion pricing by using a claims that it will somehow have a negative impact on the environment when fewer people drive into the city. Truly extraordinary.</p>\n<p>Joey Politano: &#8220;Teachers Union Sues NYC Over Congestion Pricing Proposal&#8217;s Lack of Thorough Environmental Review&#8221; would almost be too on the nose for an Onion headline about the problems with American transit &amp; environmental policy, and yet here we are.</p>\n<p>Alec Stapp: NYC teachers union claims the environmental review for congestion pricing wasn’t thorough enough. Actual photo of the 4,000-page environmental review:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!rB_P!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2d32f6b8-253a-4f72-9707-352dda8fdd74_950x1336.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Alec Stapp: Reminder that congestion pricing was passed by the democratically-elected state legislature in 2019. Vetocracy is bad.</p></blockquote>\n<p>That’s right. Reducing the use of cars via congestion pricing has been insufficiently studied in case it causes air pollution in other areas, and would cause ‘injustice.’ And the review pictured above means they did not take review seriously, it’s not enough.</p>\n<p>It is amazing to me we put up with such nonsense.</p>\n<p>Alternatively, it looks similar to this, technically the National Historic Preservation Act:</p>\n<blockquote><p>AP: Tribes, environmental groups ask US court to block $10 billion energy transmission project in Arizona.</p>\n<p><a href=\"https://twitter.com/AlecStapp/status/1749886443869045163\">Alec Stapp</a>: The biggest clean energy project in the country is being sued by environmental groups.</p>\n<p>This outdated version of “environmentalism” needs to die.</p>\n<p>It’s time to build, not block.</p>\n<p>The project is being sued under the National Historic Preservation Act. The NHPA is possibly the second most abused law in this space (the first being NEPA).</p>\n<p>This is the last thing you see before your clean energy project gets sued into oblivion.</p>\n<p><a href=\"https://www.latimes.com/world-nation/story/2021-12-31/lawsuit-seeks-to-block-2-geothermal-power-plants-in-nevada\">Same group sues to block geothermal project [in Nevada.</a>]</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!lX3A!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F51688881-86d6-47cf-8dff-00a083f32c23_1266x564.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Here we have a lithium mine and a geothermal project in California, and conservation groups once again are suing.</p>\n<blockquote><p>E&amp;E News: Environmental groups on Thursday sued officials who signed off on a lithium project in the Salton Sea that a top Biden official has helped advance.</p>\n<p>Comité Civico del Valle and Earthworks filed the legal complaint in Imperial County Superior Court against county officials who approved conditional permits for Controlled Thermal Resources&#8217; Hell&#8217;s Kitchen lithium and geothermal project.</p>\n<p>The groups argue that the country&#8217;s approval of the direct lithium extraction and geothermal brine project near the southeastern shore of the Salton Sea violates county and state laws, such as the California Environmental Quality Act.</p>\n<p>Alec Stapp: Conservation groups suing to stop a lithium and geothermal project in California. Yet another example of conservation groups at direct odds with climate goals. Clean energy deployment requires building stuff in the real world, full stop.</p>\n<p><a href=\"https://twitter.com/ArmandDoma/status/1768404204127940791\">Armand Domalewski</a>: so so so many environmental groups are just climate arsonists</p></blockquote>\n<p><a href=\"https://x.com/scottlincicome/status/1800583411234402650\">And by rule of three, the kicker</a>:</p>\n<blockquote><p>Thomas Hochman: This is the most classic NEPA story of all time: The US Forest Service wanted to implement a wildfire prevention plan, so it had to fill out an environmental impact statement. <a href=\"https://t.co/7URHmVhOrV\">Before they could complete the environmental impact statement, though, half the forest burned down</a>.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!_c7Q!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F601db5ee-839b-4230-95fb-8a3af56af79d_1274x468.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>Scott Lincicome: 10/10. no notes. A little googling here reveals the kicker: the appellant apparently filed the appeal/complaint to protect the forest (a goshawk habitat)&#8230; that subsequently burned down bc of her appeal/complaint.</p></blockquote>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">Also CEQA</h4>\n\n\n<p>CEQA is like NEPA, only it is by California, and it is even worse.</p>\n<blockquote><p>Dan Federman: It breaks my brain that NIMBYs have succeeded in blocking coastal wind farms that aren’t visible from shore, but yet Santa Barbara somehow has oil rigs visible from its gorgeous beaches <img alt=\"🤯\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f92f.png\" style=\"height: 1em;\" /></p>\n<p><a href=\"https://twitter.com/maxdubler/status/1738354770287755330\">Max Dubler</a>: You have to understand that California environmental law is chiefly concerned with *preserving the environment that existed in 1972,* not protecting nature. <a href=\"https://t.co/rUXNrws3tQ\">For example, oil companies sued under environmental law to block LA’s ban on oil drilling</a>.</p>\n<p><a href=\"https://twitter.com/aarmlovi/status/1738571885082800440\">Alex Armlovich</a>: According to CEQA, the California Environment of 1970 Quality Act, removing the oil derricks for renewables would impact the visual &amp; cultural resources of this historic beach drilling site</p>\n<p>Years of study &amp; litigation needed to protect our heritage drilling environment <img alt=\"🛢\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f6e2.png\" style=\"height: 1em;\" /><img alt=\"👨‍🏭\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f468-200d-1f3ed.png\" style=\"height: 1em;\" /><img alt=\"⛽\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/26fd.png\" style=\"height: 1em;\" /></p></blockquote>\n<p>Here is one CEQA issue. This also points out that you can write in all the exemptions you want, and <a href=\"https://twitter.com/CSElmendorf/status/1774121758674800758\">none of that will matter unless those in charge actually use them.</a></p>\n<blockquote><p>Alec Stapp: Environmental review is now holding up ***bus shelters*** by six months. Literally can’t even build the smallest physical infrastructure quickly.</p>\n<p>Chris Elmendorf: Why is LA&#8217;s transit agency <a href=\"https://t.co/ZMM6Fhmibh\">cowering before NIMBYs</a> rather than invoking the new @Scott_Wiener-authored CEQA exemption for transit improvements?</p>\n<p>Bus stops certainly would seem to meet SB 922&#8217;s definition of &#8220;transit prioritization project,&#8221; which includes &#8220;transit stop access and safety improvement.&#8221;</p>\n<p>But instead of invoking the exemption, the city prepared a CEQA &#8220;negative declaration,&#8221; which is the most legally vulnerable kind of CEQA document.</p>\n<p>It looks like city&#8217;s neg dec was made just months prior to effective date of SB 922. So what? City could have approved an exemption too as soon as SB 922 took effect.</p>\n<p>Or city could approve it tomorrow.</p>\n<p>Rather than putting bus shelters on hold just b/c a lawsuit was filed.</p>\n<p>Halting transit projects just b/c a lawsuit was filed seems especially dumb at the present moment, when Leg has made clear it wants these projects streamlined and elite/journalist opinion has turned against CEQA abuse.</p>\n<p>If a court dared to enjoin the project, there&#8217;d be uproar &amp; Leg would probably respond by strengthening the transit exemption.</p>\n<p>Just look at what the NIMBYs &#8220;won&#8221; by stopping 500 apartments on a valet parking lot in SF (AB 1633), or student housing in Berkeley (AB 1307).</p>\n<p>Is this just a case of bureaucratic risk aversion (@pahlkadot) or autopiloting of dumb processes? Is there an actual problem with SB 922 that makes it unusable for ordinary LA bus stops?</p>\n<p>Curious to hear from anyone who knows.</p></blockquote>\n<p>My presumption is it is basically autopiloting, that the people who realize it is dumb do not have the reach to the places where people don’t care. It is all, of course, madness.</p>\n<p>The good news is that <a href=\"https://thezvi.substack.com/i/145808239/government-working\">the recent CEQA ruling</a> says that it should no longer give the ‘fullest possible protection’ to everything, so things should get somewhat better.</p>\n<p><a href=\"https://x.com/RSI/status/1887531858847482334\">I wish this number were slightly higher for effect, but still, seriously:</a></p>\n<blockquote><p>R Street: 49% of CEQA lawsuits are against environmentally advantageous projects!</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">It Can Always Be Worse</h4>\n\n\n<p>Somehow, rather than struggling to improve the situation, many Democrats seem to strive to make the inability to do things even worse.</p>\n<p><a href=\"https://twitter.com/CSElmendorf/status/1742066484879487222\">For example, we have this thread</a> from January detailing the proposed Clean Electricity Transmission Acceleration Act. Here are some highlights of an alternative even worse future, where anyone attempting to do anything is subject to arbitrary hold up for ransom, and also has to compensate any losers of any kind, including social and economic costs, and destroying any limitations on scope of issues. The bill even spends billions to fund these extractive oppositional efforts directly.</p>\n<blockquote><p>Chris Elmendorf: The bill defines &#8220;enviro impact&#8221; to include not only enviro impacts, but also &#8220;aesthetic, historic, cultural, economic, social, or health&#8221; effects. (Whereas CEQA is still about &#8220;physical environment&#8221;&#8211;even in the infamous Berkeley case.</p>\n<p>The bill creates utterly open-ended authority for fed. agencies to demand a &#8220;community benefit agreement&#8221; as price of any permit for which an EIS was prepared. This converts NEPA from procedural statute into grant of substantive reg / exaction authority.</p>\n<p>In exercising the &#8220;community benefit agreement&#8221; authority, what is a federal agency supposed to consider? Consideration #1 is the deepness of the permit-applicant&#8217;s pocket. Seriously.</p>\n<p>And in case the new, expansive definition of &#8220;enviro impact&#8221; wasn&#8217;t clear enough, the bill adds that CBAs may be imposed to offset any *social or economic* (as well as enviro) impacts of the project.</p>\n<p>The bill would also destroy the caselaw that limits scope of enviro review to scope of agency&#8217;s regulatory discretion, not only via the CBA provision but also by expressly requiring analysis of effects &#8220;not within control of any federal agency.&#8221;</p>\n<p>And the bill would send a torrent of federal dollars into the coffers of groups who&#8217;d exploit NEPA for labor or other side hustles. &#8211; there&#8217;s $3 billion of &#8220;community engagement&#8221; grants to arm nonprofits &amp; others</p>\n<p>…</p>\n<p>And in case NEPA turned up to 11 isn&#8217;t enough, there&#8217;s also a new, judicially enforceable mandate for &#8220;community impact reports&#8221; if a project may affect an &#8220;environmental justice community.&#8221;</p>\n<p>There&#8217;s also a wild provision that seems to prevent federal agencies from considering any project alternatives in an EIS unless (a) the alternative would have no adverse impact on any &#8220;overburdened community,&#8221; or (b) it serves a compelling interest *in that community.*</p>\n<p>…</p>\n<p>One more observation: the bill subtly nudges NEPA toward super-statute status by directing conflicts b/t NEPA &#8220;and any other provision of law&#8221; to be resolved in favor of NEPA.</p></blockquote>\n<p><a href=\"https://x.com/moreisdifferent/status/1788977822234452068\">Or we could have black-clad anarchists storming electric vehicle factories</a>, as happened in Tesla’s plant in Berlin. Although <a href=\"https://x.com/TheArisen01/status/1798095298054746513\">we do have ‘Georgia greens’ suing over approval of an EV plant there</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">How We Got Into This Mess</h4>\n\n\n<p>It turns out everyone basically let this mess happen <a href=\"https://twitter.com/rSanti97/status/1769729701457608888\">because Congress wanted to get home for Christmas?</a> No one understood what they were doing?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!XE4C!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4e5d1e66-7e88-4915-b443-1107e8754529_1254x694.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This seems like it should be publicized more, as part of the justification for killing this requirement outright, and finding a better way to accomplish the same thing. It is amazing how often the worst laws have origin stories like this.</p>\n<blockquote><p><a href=\"https://twitter.com/patio11/status/1769749808963616824\">Patrick McKenzie</a>: Sometimes we spend a trillion dollars because not spending a trillion dollars would require an exhausting amount of discussions and it is almost Christmas.</p>\n<p>Please accept a trillion dollars as a handwavy gesture in the direction of the impact of NEPA; my true estimate if I gave myself a few hours to think would probably be higher.</p></blockquote>\n<p>I know everyone says that once you pass a regulation it is almost impossible to remove. But what if… we… did it anyway?</p>\n\n\n<h4 class=\"wp-block-heading\">Categorical Exclusions</h4>\n\n\n<p>It is good that these exclusions are available. It is rather troublesome that they are so necessary?</p>\n<blockquote><p><a href=\"https://twitter.com/nicholas_bagley/status/1776955844267028761\">Nicholas Bagley</a>: A number of federal agencies have categorical exclusions from NEPA for &#8230; picnics.</p>\n<p>If you need a special exception to make the lawyers comfortable with picnics, maybe you&#8217;ve gone too far?</p>\n<p>“29. Approval of recreational activities (such as Coast Guard unit picnic) which do not involve significant physical alteration of the environment, increase disturbance by humans of sensitive natural habitats, or disturbance of historic properties, and which do not occur in, or adjacent to, areas inhabited by threatened or endangered species.”</p></blockquote>\n<p>I mean, modest proposal time, perhaps?</p>\n<p>If your physical activity:</p>\n<ol>\n<li>Does not significantly physically alter the environment.</li>\n<li>Does not disturb sensitive natural habitats.</li>\n<li>Does not disturb historic properties.</li>\n<li>Does not occur in or adjacent to areas inhabited by threatened or endangered species.</li>\n</ol>\n<p>Or, actually, how about if your physical activity:</p>\n<ol>\n<li>Does not significantly physically alter the environment.</li>\n</ol>\n<p>Then why are we not done? What is there we need to know, that this does not imply?</p>\n<p>Shouldn’t we be able to declare this in a common sense way, and then get sued in court if it turns out we were lying or wrong, with penalties and costs imposed if someone sues in profoundly silly fashion, such as over a picnic?</p>\n<p>The good news: <a href=\"https://twitter.com/AlecStapp/status/1780048314768969885\">We are getting some new ones.</a></p>\n<blockquote><p>Alec Stapp: Huge permitting reform news:</p>\n<p>The Bureau of Land Management is giving geothermal energy exploration a categorical exclusion from environmental review under NEPA.</p>\n<p>If you care about clean energy abundance, this is a massive win.</p>\n<p>Arnab Datta: ICMYI &#8211; great news, BLM is adopting categorical exclusions to streamline permitting for geothermal exploration.</p>\n<p>What&#8217;s the upshot? Exploration for geothermal resources should be a little bit easier.</p>\n<p>As a result of the FRA (passed last year), agencies can now more easily adopt the categorical exclusions of other agencies. That&#8217;s what BLM is doing, adopting the CXs from the Navy and USFS.</p>\n<p>Ex: Here&#8217;s the Navy CX. Applications to BLM for geophysical surveys will be easier.</p>\n<p>Why is this important? BLM (and the federal government writ-large) owns a LOT of land, particularly in the Mountain West where heat resources are strongest, most ripe for geothermal production.</p>\n<p>We previously recommended that BLM expand its CXs for geothermal exploration. This is a great first step, but there&#8217;s more to do.</p>\n<p>Patrick McKenzie: I’ve been doing some work with a geothermal non-profit, and my inexpert understanding is that while first-of-their-kind projects are the immediate blocker, NEPA lawsuits were a major worry with expanding rollout to blue states after proof of concepts get accomplished and tweaked.</p>\n<p>The (without loss of generality) Californias of the world are huge energy consumers, cannot simply import electricity from (without loss of generality) Texas (though you can tweak that assumption a tiny bit on margins), and local organized political opposition is a real factor.</p>\n<p>If you’re curious as to why geothermal is likely to be a much larger part of U.S. and world energy mixes than you model currently, <a href=\"https://t.co/CbGKD4G3Ye\">see this</a>.</p>\n<p>Short version: fracking makes it viable in many more places than it is currently.</p></blockquote>\n<p>There is a lot more to do on the exclusion front. It seems like obvious low-hanging fruit to exclude as many green projects as possible. Yes, this suggests the laws are bad and should be replaced entirely, but until then we work with the system we have.</p>\n<blockquote><p>Alec Stapp: Other federal agencies should start thinking about how to use categorical exclusions from NEPA environmental review to make it easier to build in the US.</p>\n<p>Here&#8217;s some low-hanging fruit:</p>\n<p>@HUDgov should update its categorical exclusion to cover office-to-residential conversions.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!bK7U!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdf0f70dc-baf0-4cd6-a1f8-26a207df6d57_1308x1344.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>That seems like it should fall under ‘wait why do we even need an exclusion again?’</p>\n<p><a href=\"https://twitter.com/jsamdrolet/status/1783579647911031253\">And that’s not all.</a></p>\n<blockquote><p>Alec Stapp: <a href=\"https://t.co/fOLKiZwPYk\">Good news</a> on permitting reform!</p>\n<p>The Department of Energy is giving a categorical exclusion from NEPA environmental review to:</p>\n<p>&#8211; transmission projects that use existing rights of way</p>\n<p>&#8211; solar projects on disturbed lands</p>\n<p>&#8211; energy storage projects on disturbed lands</p>\n<p>Sam Drolet: This is huge. It&#8217;s good to see agencies starting to use categorical exclusions in a sensible way to streamline permitting.</p>\n<p><a href=\"https://twitter.com/christiantfong/status/1783588121478570422\">Christian Fong</a>: A lot of great rules coming out right now from the Biden admin, but one that has gone under the radar is on NEPA reforms from the DOE! Specifically, expanding the list of projects that qualify for categorical exclusions, which can speed up NEPA reviews from 2 years to 2 months!</p>\n<p>,,,</p>\n<p>For solar, CXes were initially granted only if projects were built in a previously disturbed/developed land and were under 10 acres in size. This rule has removed the acreage limit, so that even projects 1000+ acres in size can still qualify if on previously disturbed lands.</p>\n<p>A new CX was established for storage, with similar qualifications around previously disturbed/developed land, as well as the ability for projects to use a small bit of contiguous undisturbed land, as storage may be colocated with existing energy/tx/industry infrastructure.</p>\n<p>…</p>\n<p>Given full NEPA EISes can take 2 years, and new tx lines can take 10+ years to build, these rules are particularly important for improving tx capacity through reconductoring, GETs, etc. DOE just <a href=\"https://liftoff.energy.gov/innovative-grid-deployment/\">released its liftoff report on this topic here</a>.</p></blockquote>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">A Green Bargain</h4>\n\n\n<p><a href=\"https://t.co/gaknMzyHbY\">A new paper </a>suggested a ‘a green bargain’ could be struck on permitting reform, that is a win for everyone. It misunderstands what people are trying to win.</p>\n<blockquote><p>Zachary Liscow: NEW PAPER: “Getting Infrastructure Built: The Law and Economics of Permitting,” on:</p>\n<p>&#8211; What to consider in design of permitting rules</p>\n<p>&#8211; The evidence</p>\n<p>&#8211; A possible &#8220;green bargain&#8221; that benefits efficiency, the environment, &amp; democracy</p>\n<p>…</p>\n<p>Infrastructure is often slowed by permitting rules. One example is NYC congestion pricing, which was passed by the legislature in 2019, had a 4,000-page environmental assessment, and is now subject to 5 lawsuits.</p>\n<p>But how can we speed up permitting and make infrastructure less expensive, while still protecting the environment and promoting democratic participation?</p>\n<p>…</p>\n<p>Environmental permitting might be part of why infrastructure is so expensive in the US. Urban transit costs about 3x the rich/middle-income country average and 6x some European countries.</p>\n<p>…</p>\n<p>At the same time, US environmental outcomes aren’t particularly good. Based on the Yale Center for Environmental Law &amp; Policy’s Environmental Performance Index, the US (at 51, just the 25thpercentile) is considerably worse than the OECD average (at 58).</p>\n<p>…</p>\n<p>So what to do? I have a framework w/ 2 dimensions. 1: Improve the capacity of the executive to decide – for example, by limiting the power of litigation to delay. 2: Improve the capacity to plan, including by adding broad-based participation. Currently the US is weak along both.</p>\n<p>I propose a “green bargain” that strengthens both executive power and capacity, empowering the executive to decide, but coupling that w/ increased capacity to plan, especially in ways that promote broad-based participation.</p></blockquote>\n<p>Can we create a win-win-win for:</p>\n<ol>\n<li>Efficiency</li>\n<li>Democracy</li>\n<li>The Environment?</li>\n</ol>\n<p>Yes, most certainly, in a big way. The current system is horribly inefficient in many ways that benefit neither democracy nor the environment, indeed frequently this problem is harmful to both. If these are the stakeholders, then there any number of reasonable ‘good governance’ plans one could use.</p>\n<p>So what is the deal proposed? As far as I can tell it is this:</p>\n<ol>\n<li>Increase executive power over decisions.</li>\n<li>Rise standards required for judicial review and make court challenges harder in various ways &#8211; time limits, standing requirements, limits on later new objections, limits on challenges to negotiated agreements, more categorical exclusions.</li>\n<li>Limits on court injunctions to stop projects.</li>\n<li>Increase executive capacity on all levels of government so they can handle it.</li>\n<li>Improve quality and scope of executive reviews and enhance public participation.</li>\n</ol>\n<p>Do I support all of these proposals on the margin? Absolutely. Most would be good individually, the rest make sense as part of the package.</p>\n<p>Do I think that this should be convincing to a sincere environmentalist, that they should trust that this will lead to good outcomes? Alas, my answer is essentially no, if this was applied universally.</p>\n<p>I do think this should be convincing if it is applied exclusively to green energy projects and complementary infrastructure. If the end goal is solar panels or batteries, and one believes there is a climate crisis, then one should have a strong presumption that this should dominate local concerns and that delays and cost overruns kill projects.</p>\n<p><a href=\"https://knowyourmeme.com/photos/1125992-spider-man\">Here is the other core problem</a>: Many obstructionists do not want better outcomes.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"YOU CAN REWRITE DNA ON THE FLY, AND YOU'RE USING IT TO TURN PEOPLE INTO DINOSAURS? BUT WITH TECH LIKE THAT, YOU COULD CURE CANCER! BUT I DON'T WANT TO CURE CANCER. I WANT TO TURN PEOPLE INTO DINOSAURS.\" src=\"https://substackcdn.com/image/fetch/$s_!FZbe!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbea0c20e-a623-4263-b19d-eddb0fb54bd0_680x802.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://twitter.com/Austen/status/1783503091914141942\">Or in other words:</a></p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!95EF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F81c1047d-975f-4f19-b5e3-23295606b422_974x1319.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>If someone’s goal is to accomplish good things that make life better, such as reducing how much carbon is in the atmosphere or ensuring the air and water are clean, and is willing to engage in trade to make the world improve and not boil, but has different priorities and weightings and values than you have?</p>\n<p>Then you can and should engage in trade, talk price. We can make a deal.</p>\n<p>If someone’s goal is to stop development and efficiency because they believe development and efficiency are bad, either locally or globally? If they think humanity and civilization (or at least your civilization) are bad and want them to suffer and repent? Or consider every downside a sacred value that should veto any action?</p>\n<p>If they actively do not want the problem solved because they want to use the problem as leverage to demand other things, and you are not a fan of those other things?</p>\n<p>Then you are very much out of luck. There is no deal.</p>\n<p>My expectation is that even if your deal is a clear win for people and the environment, in way they can trust, you are going to get a lot of opposition from environmental groups anyway. Here, I worry that this proposal also does not give them sufficient reason to trust. Half the time the executive will be a Republican.</p>\n<p><a href=\"https://twitter.com/JohnArnoldFndtn/status/1783156236998873398\">There is also this issue</a>:</p>\n<blockquote><p>John Arnold: I used to think decarbonization was hard because voters prioritized the goals of the energy system in the following order:</p>\n<ol>\n<li>Affordable</li>\n<li>Reliable</li>\n<li>Secure</li>\n<li>Clean</li>\n</ol>\n<p>But I missed one. The actual order of prioritization is:</p>\n<ol>\n<li>Jobs</li>\n<li>Affordable</li>\n<li>Reliable</li>\n<li>Secure</li>\n<li>Clean</li>\n</ol>\n</blockquote>\n<p>That, however infuriating, is something we can work with. There is no inherent conflict between jobs and energy. It trades off with affordable, but we can talk price.</p>\n\n\n<h4 class=\"wp-block-heading\">Costs Versus Benefits</h4>\n\n\n<p>I have so had it with all the ‘yes this saves the Earth but think of the local butterfly species’ arguments, <a href=\"https://x.com/AlecStapp/status/1882874767109403126\">not quite literally this case but</a> yeah, basically.</p>\n<blockquote><p>Alec Stapp: Very funny to me that the framing of this NYT article is sincerely like:</p>\n<p>“What’s more important: Saving earth or satisfying the idiosyncratic preferences of a small handful of activists?”</p>\n<p>That’s not a close call!</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!3Rli!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F81a2bc7b-927b-42cc-8178-f22f0624fea9_573x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!bShg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff6d2ee61-9dd6-4fce-8a48-e31dd0deb25e_618x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>&nbsp;</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">A Call for Proposals</h4>\n\n\n<p>Act fast, this closes July 15: <a href=\"https://www.challenge.gov/?challenge=modernizing-nepa-challenge\">Introducing the Modernizing NEPA Challenge</a>.</p>\n<blockquote><p>In alignment with ongoing efforts at DOT to improve the NEPA process, this <em>Modernizing NEPA Challenge</em> seeks:</p>\n<ul>\n<li>To encourage project sponsors to publish documents associated with NEPA that increase accessibility and transparency for the public, reviewing agencies, and historically under-represented populations and</li>\n<li>To incentivize project sponsors to implement collaborative, real-time agency reviews to save time and improve the quality of documents associated with NEPA.</li>\n</ul>\n</blockquote>\n<p>More details at the link. The goal is to get collaborative tools and documents, and interactive documents, that make it easier to navigate the NEPA process.</p>\n\n\n<h4 class=\"wp-block-heading\">The Men of Two Studies</h4>\n\n\n<blockquote><p>Thomas Hochman: Almost every pro-NEPA argument can be traced back to two studies: Adelman&#8217;s &#8220;Permitting Reform&#8217;s False Choice&#8221; and Ruple&#8217;s &#8220;Measuring the NEPA Litigation Burden.&#8221;</p>\n<p><a href=\"https://www.greentape.pub/p/revisiting-pro-nepa-studies\">Today on Green Tape, we take a closer look at both studies.</a></p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!tkHE!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F86402a8d-3433-4519-bcc7-7caf49dcbe97_792x690.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Note that the majority of the pie is green, as in clearly net good for the planet, even if you take the position that fossil fuels are always bad &#8211; and I’d argue the opposite, that anything replacing coal on the margin is obviously net good too.</p>\n<blockquote><p>Ruple’s study analyzes 1,499 federal court opinions involving NEPA challenges from 2001-2013. He comes up with two key findings:</p>\n<ol>\n<li>Only about 0.22% of NEPA decisions (1 in 450) face legal challenges</li>\n<li>Less than 1% of NEPA reviews are environmental impact statements (EISs), and about 5% of NEPA reviews are environmental assessments (EAs).</li>\n</ol>\n<p>…</p>\n<p>But in “Measuring the NEPA Litigation Burden,” Ruple makes the same error that he’s made throughout his <a href=\"https://journals.library.columbia.edu/index.php/cjel/article/view/9479\">work</a> <a href=\"https://dc.law.utah.edu/scholarship/191/\">on</a> <a href=\"https://naturalresources.house.gov/uploadedfiles/testimony_ruple.pdf\">permitting</a>: he takes the average volume of litigation across <em>all </em>NEPA reviews and makes a conclusion about NEPA’s impact on <em>infrastructure in particular.</em> In other words, his denominator is wildly inflated.</p>\n<p>Ruple’s dataset includes NEPA reviews at every level of stringency: categorical exclusions (CatExes), EAs, and EISs. And as Ruple himself points out, around 95% of NEPA reviews are CatExes. This is because NEPA is triggered by almost <em>every federal action</em>, and thus CatExes are required for everything from <a href=\"https://ceq.doe.gov/nepa-practice/categorical-exclusions.html\">federal hiring</a> to, yes, <a href=\"https://x.com/nicholas_bagley/status/1776955844267028761\">picnics</a>.</p>\n<p>…</p>\n<p>Their findings are remarkable: solar, pipeline, wind, and transmission projects saw litigation rates of 64%, 50%, 38%, and 31% respectively. The cancellation rates for each of these project types were also extraordinarily high, ranging from 12% to 32%.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!85Q2!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1fa258ab-5d32-4181-9825-1e7a7f6dcee1_1093x1062.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Barring a rebuttal I do not expect, that seems definitive to me.</p>\n<p>What about the other study?</p>\n<blockquote><p>The basic flaw in Adelman’s analysis is that he sees the low percentage of renewable projects that undergo NEPA as evidence that NEPA isn’t a big deal. In reality, the exact opposite is true.</p></blockquote>\n<p>As in, NEPA is so obnoxious that where there would be NEPA issues, the projects never even get proposed. We only get renewable projects, mostly, where they have sufficient protections from this. Again, this seems definitive to me.</p>\n\n\n<h4 class=\"wp-block-heading\">A Modest Proposal</h4>\n\n\n<p>My grand solution to NEPA would be to repeal the paperwork and impact statement requirements, and replace them with a requirement for cost-benefit analysis. That is a complex proposal that I am confident would work if done properly, but which I agree is tricky.</p>\n<p>The grander, simpler solution is repeal NEPA first and ask questions later. At this point, I think that’s the play.</p>\n<p>A solution in bewteen those two would perhaps be to change the remedy for failure, so that any little lapse does not stop an entire project.</p>\n<p>This is another approach to the fundamental problem of sacred values versus cost-benefit.</p>\n<p>Right now, we are essentially saying that a wide variety of potential harms are sacred values, that we would not compromise at any price, such that if there is any danger that they might be compromised then that is a full prohibition.</p>\n<p>But of course that is crazy. With notably rare exceptions, that is not how most anything should ever work.</p>\n<p>Thus, an alternative solution is to keep all the requirements in place, and allow all the lawsuits to proceed.</p>\n<p>But we change the remedy from injunctions to damages.</p>\n<p>As in, suppose a group sues you, and says that your project might violate some statute or do harm in some way. Okay, fine. They file that claim, it is now established. You can choose to wait until the claim is resolved, if the claim actually is big enough and plausible enough that you are worried they might win.</p>\n<p>Or, you can convince an insurance company to post a bond for you, covering the potential damages (and let’s say you can get dinged for double or triple the actual harms, more if you ‘did it on purpose’ and knew you were breaking the rules, in some sense, or something). So you can choose to do the project anyway, without a delay, and if it turns out you messed up or broke the rules and the bill comes due, then you have to pay that bill. And since it is a multiplier, everyone is still ahead.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/10/08/nepa-permitting-and-energy-roundup-2/",
            "publishedAt": "2025-10-08",
            "source": "TheZvi",
            "summary": "It’s been about a year since the last one of these. Given the long cycle, I have done my best to check for changes but things may have changed on any given topic by the time you read this. The &#8230; <a href=\"https://thezvi.wordpress.com/2025/10/08/nepa-permitting-and-energy-roundup-2/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "NEPA, Permitting and Energy Roundup #2"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3152/",
            "publishedAt": "2025-10-08",
            "source": "XKCD",
            "summary": "<img alt=\"I understand it's hard to do more than 300 feet on these 90-second rush jobs, but with a smaller ramp I'm worried the gee forces will be too high for me to do any tricks.\" src=\"https://imgs.xkcd.com/comics/skateboard.png\" title=\"I understand it's hard to do more than 300 feet on these 90-second rush jobs, but with a smaller ramp I'm worried the gee forces will be too high for me to do any tricks.\" />",
            "title": "Skateboard"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-10-08"
}