{
    "articles": [
        {
            "content": [
                "<p>Every now and then, people ask me why I write. I don’t get paid to write here, so it’s not immediately obvious why I keep writing.</p>\n\n<p>I think writing is one of the most valuable things you can do, and I recommend everyone try it. Here’s why:</p>\n\n<ol>\n  <li><strong>It makes you a better thinker and communicator.</strong> Writing is a muscle. The more you write, the easier it gets, and your ability improves. You’ll learn to make clearer arguments, crisper explanations, and better empathize with your audience. These skills are applicable to everything.</li>\n  <li><strong>You’ll get feedback that makes you a better writer.</strong> Feedback exposes weak arguments and strengthens the good ones. Plus, learning to listen to feedback is another skill that is universally applicable.</li>\n  <li><strong>You’ll meet people interested in the same things you are.</strong> Looking through my correspondence, it’s amazing how many of my favorite people to chat with I met through writing online. (BTW, this goes both ways. If you read something that resonates with you online, write them a note thanking them and telling them what you liked!)</li>\n  <li><strong>Your past thinking will be archived and searchable.</strong> This is more valuable than you think. If you invest time to hone a piece, you’ll turn back to it more often than you’d expect. Further, reviewing old pieces and threads over time will reveal what worked and what didn’t while making your progress tangible.</li>\n  <li><strong>The value of your writing compounds.</strong> The value <em>to you</em>, that is. I don’t think my pieces from 6 years ago are improving anyone’s life, but the contacts I’ve made and pieces I’ve crafted have grown into a foundation I get to leverage everyday.</li>\n  <li><strong>Writing gives you a license to explore and organize your thoughts.</strong> This is the fun bit. Chasing down an idea that interests you, forming questions and then investigating them; it’s a joy. The second most common question I get about my writing is, “How do you motivate yourself to write?” This is the answer. There are so many drafts that live, dormant in my draft folder. So many times I start a piece and lose interest. And then: something will <em>click</em> and I’ll draft, investigate, and finish a piece in an hour (here’s <a href=\"https://www.dbreunig.com/2025/12/19/how-model-use-has-changed-in-2025.html\">two</a> <a href=\"https://www.dbreunig.com/2025/10/20/speeds-and-swarms.html\">examples</a>). These aren’t always the most substantive pieces, but they keep the practice going and the momentum up.</li>\n</ol>\n\n<p>It’s hard to form new habits. But writing is s the best investment you can make <em>today</em>. Here’s a few tips for getting started:</p>\n\n<ol>\n  <li><strong>Be okay with bad writing.</strong> Most writing isn’t great! If my hit rate is 1 out of 5, I’m <em>thrilled</em>. Get comfortable publishing things that aren’t perfect. I know many people who wait too long to publish and, well, never do. They do this for <em>years</em>. If they’d gotten the ball rolling back then, they’d be better writers today. It’s weird: you’d think regular private writing would be sufficient to get better. But it isn’t. There’s no stakes. No feedback. The only way to get better is to ship. Some people worry about the risk of bad writing. I think the biggest risk comes from being an asshole (so don’t be an asshole!) But the actual risks are quite low: most bad writing is neutral, it remains unread.</li>\n  <li><strong>You need to do the writing. Not AI.</strong> Writing is exercise. If I brought a forklift to the gym and used it to lift weights, what would be the point?</li>\n  <li><strong>But AI is a wonderful editor.</strong> When you’re getting started, it’s intimidating to ask people for feedback on drafts. Thankfully, AI is great at this! Paste in your draft and prompt it with something like, “This is a blog draft where I am trying to argue X, read the piece and identify any spelling or grammar errors, places where I am not being clear or where a reader might be confused, or areas where my argument is weak.” Take it with a grain of salt, but this is usually very, very helpful.</li>\n  <li><strong>Don’t overthink where to publish.</strong> Make pages public on Notion. Use Github pages. Use Substack, if you must. The only thing you cannot omit is an easy contact form and a way for someone to subscribe. I screwed this up for too long. RSS is not sufficient. Comments don’t count (in fact, turn them off). Let people email you with a form, one-on-one. The other thing to keep in mind is to pick something with low friction. If it takes too many steps to create a new post, you won’t.</li>\n</ol>\n\n<p>I hope you start a blog this year. Or revive an old one.</p>\n\n<p>If you’d like some further advice, <a href=\"https://www.dbreunig.com/contact.html\">feel free to reach out</a>!</p>\n\n<hr />\n\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/dbreunig\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <label for=\"bd-email\">Enter your email to receive the occasional update.</label>\n  <div class=\"form-input\">\n    <input id=\"bd-email\" name=\"email\" type=\"email\" />\n    <input type=\"submit\" value=\"Subscribe\" />\n  </div>\n</form>"
            ],
            "link": "https://www.dbreunig.com/2025/12/27/why-i-write.html",
            "publishedAt": "2025-12-27",
            "source": "Drew Breunig",
            "summary": "Publicly writing is one of the most valuable things you can do. It improves your thinking, ability to communicate, and connects you to interesting people.",
            "title": "Why I Write (And You Should Too!)"
        },
        {
            "content": [
                "<p>I've been using <a href=\"https://linear.app\">Linear</a> as the project and issue tracking tool on a new project.</p>\n<p>No wait, that's not quite right. My AI coding agents have been using Linear as the project and issue tracking tool on a new project. I've opened Linear's web interface...twice? And I'm pretty sure I've logged into the mobile client. But Claude and friends? They use Linear every day.</p>\n<p>To date, I've been using the first-party Linear MCP and a third party one that I'd found before Anthropic started publishing an &quot;official&quot; Linear plugin in partnership with Linear.</p>\n<p>It works great.</p>\n<p>There's just one problem. The official Linear MCP has 25 tools, using a total of 19,659 tokens of context on every single session. The third-party MCP is a little slimmer at 17k and change. But that's still nearly 10% of the full context window. For <em>every</em> context window.</p>\n<p>This morning, after breakfast, I sat down and started chatting with Claude about what a better Linear tool might look like. We discussed just using a unix commandline tool. We discussed using a unix commandline tool + a <a href=\"https://agentskills.io\">skill</a>. We discussed a Skill + a single-tool MCP client that was <em>just</em> a pure GraphQL client.</p>\n<p>I asked Claude to read <a href=\"https://blog.fsck.com/2025/10/19/mcps-are-not-like-other-apis/\">my blog post on MCP design</a>.</p>\n<p>We ended up with something nice and streamlined. It totals out at 975 tokens, including instructions for how to learn more about how to use the tool. I ended up talking Claude into making the MCP fully self-documenting by including a 'help' action.</p>\n<p>We ended up compromising on tool design. Claude really thought that it would be fine always reading the instructions and just using raw GraphQL for everything. I overruled it and decided that the most common operations (working with tickets) merited first-class actions. Everything else is GraphQL backed up by the 'help' action.</p>\n<p>It's called <a href=\"https://github.com/obra/streamlinear\">Streamlinear</a>. Ultimately, I'm responsible for the name. I didn't say no. I asked Claude to come up with a list of punny names. Everything else it suggested was being used for a Linear client already.</p>\n<p>I asked Claude to talk about the new tool and what it's like:</p>\n<p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251227-132229.png\"><img alt=\"pasted image 20251227 132229\" src=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251227-132229.png\" /></a></p>\n<p>This is the tool loadout for the 'official' MCP:</p>\n<p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251227-134359.png\"><img alt=\"pasted image 20251227 134359\" src=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251227-134359.png\" /></a></p>\n<p>And this is what Streamlinear looks like:</p>\n<p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251227-134628.png\"><img alt=\"pasted image 20251227 134628\" src=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251227-134628.png\" /></a></p>\n<p>Give it a spin and let me know how it goes.</p>"
            ],
            "link": "https://blog.fsck.com/2025/12/27/streamlinear/",
            "publishedAt": "2025-12-27",
            "source": "Jesse Vincent",
            "summary": "<p>I've been using <a href=\"https://linear.app\">Linear</a> as the project and issue tracking tool on a new project.</p> <p>No wait, that's not quite right. My AI coding agents have been using Linear as the project and issue tracking tool on a new project. I've opened Linear's web interface...twice? And I'm pretty sure I've logged into the mobile client. But Claude and friends? They use Linear every day.</p> <p>To date, I've been using the first-party Linear MCP and a third party one that I'd found before Anthropic started publishing an &quot;official&quot; Linear plugin in partnership with Linear.</p> <p>It works great.</p> <p>There's just one problem. The official Linear MCP has 25 tools, using a total of 19,659 tokens of context on every single session. The third-party MCP is a little slimmer at 17k and change. But that's still nearly 10% of the full context window. For <em>every</em> context window.</p> <p>This morning, after breakfast, I sat down and started chatting with Claude about what a better Linear tool might look like. We discussed just using a unix commandline tool. We discussed using a unix commandline tool + a <a href=\"https://agentskills.io\">skill</a>. We discussed a Skill + a single-tool MCP client that was <em>just</em> a pure GraphQL",
            "title": "Streamlinear, a new MCP for Linear"
        },
        {
            "content": [],
            "link": "https://ludic.mataroa.blog/blog/merry-christmas-ya-filthy-animals-2025/",
            "publishedAt": "2025-12-27",
            "source": "Nikhil Suresh",
            "summary": "<p><em>It’s my last day of writing for the year, so I’m going to try keep this one quick – it was knocked out over three hours, so I hope you can forgive me if it’s a bit clumsier than my usual writing.</em></p> <p>For some strange reason, one of the few clear memories I have from growing up in Malaysia is a particular moment when I was seven years old. It was the first day of school for the year, and I was studying at <em>Sekolah Kebangsaan Batu Lanchang</em>, which in English is “Batu Lanchang National School”. When you’re seven years old, being told that you’ve got to wait an hour to see your best friend is an insurmountable obstacle. It feels like <em>forever</em>. The year it would take to go up another grade is, accordingly, so long that it’s not even imaginable.</p> <p>I recall thinking, probably in simpler language, “I probably won’t make it to eight years old. A year is way too much time for something random to happen. I’ll get hit by a car or something.” To round out this brief moment of uncharacteristic sobriety, is it very likely that my next thought “Blastoise is obviously better Pokemon",
            "title": "Merry Christmas, Ya Filthy Animals (2025)"
        },
        {
            "content": [
                "<p><a href=\"https://www.metaculus.com/tournament/ACX2026/\">This year&#8217;s prediction contest</a> is live on Metaculus. They write:</p><blockquote><p>This year&#8217;s contest draws directly from that community, with all questions suggested by ACX readers. Both experienced forecasters and newcomers are invited to participate, making predictions across U.S. politics, AI, international affairs, and culture.</p><p>To participate, submit your predictions by January 17th at 11:59 PM PT. At that time, we will take a snapshot of all standing forecasts, which will determine the contest rankings and the allocation of the $10,000 prize pool. While you are encouraged to continue updating your predictions throughout the year, forecasts made after January 17th will only affect site leaderboards, not contest rankings.</p><p>You are welcome to create a bot account to forecast and participate in addition to your regular Metaculus account. Create a bot account and get support building a bot <a href=\"https://www.metaculus.com/aib/\">here</a>. </p></blockquote><p>And they&#8217;ve also announced this year&#8217;s winners for best questions submitted. Congratulations to:</p><blockquote><ol><li><p><strong>Gumbledalf</strong> ($700)</p></li><li><p><strong>espiritu57</strong> ($500)</p></li><li><p><strong>setasojiro843047</strong> <em>(Substack handle)</em> ($400)</p></li><li><p><strong>sai_39</strong> ($300)</p></li><li><p><strong>nicholaskross</strong> ($250)</p></li><li><p><strong>(Anonymous)</strong> ($200)</p></li><li><p><strong>(Anonymous)</strong> ($200)</p></li><li><p><strong>RMD</strong> ($150)</p></li><li><p><strong>(Anonymous)</strong> ($150)</p></li><li><p><strong>Hippopotamus_bartholomeus</strong> ($150)</p></li></ol></blockquote><p>To participate in the tournament or learn more, <strong><a href=\"https://www.metaculus.com/tournament/ACX2026/\">go to Metaculus</a></strong>.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/acxmetaculus-prediction-contest-2026",
            "publishedAt": "2025-12-27",
            "source": "SlateStarCodex",
            "summary": "<p><a href=\"https://www.metaculus.com/tournament/ACX2026/\">This year&#8217;s prediction contest</a> is live on Metaculus. They write:</p><blockquote><p>This year&#8217;s contest draws directly from that community, with all questions suggested by ACX readers. Both experienced forecasters and newcomers are invited to participate, making predictions across U.S. politics, AI, international affairs, and culture.</p><p>To participate, submit your predictions by January 17th at 11:59 PM PT. At that time, we will take a snapshot of all standing forecasts, which will determine the contest rankings and the allocation of the $10,000 prize pool. While you are encouraged to continue updating your predictions throughout the year, forecasts made after January 17th will only affect site leaderboards, not contest rankings.</p><p>You are welcome to create a bot account to forecast and participate in addition to your regular Metaculus account. Create a bot account and get support building a bot <a href=\"https://www.metaculus.com/aib/\">here</a>. </p></blockquote><p>And they&#8217;ve also announced this year&#8217;s winners for best questions submitted. Congratulations to:</p><blockquote><ol><li><p><strong>Gumbledalf</strong> ($700)</p></li><li><p><strong>espiritu57</strong> ($500)</p></li><li><p><strong>setasojiro843047</strong> <em>(Substack handle)</em> ($400)</p></li><li><p><strong>sai_39</strong> ($300)</p></li><li><p><strong>nicholaskross</strong> ($250)</p></li><li><p><strong>(Anonymous)</strong> ($200)</p></li><li><p><strong>(Anonymous)</strong> ($200)</p></li><li><p><strong>RMD</strong> ($150)</p></li><li><p><strong>(Anonymous)</strong> ($150)</p></li><li><p><strong>Hippopotamus_bartholomeus</strong> ($150)</p></li></ol></blockquote><p>To participate in the tournament or learn more, <strong><a href=\"https://www.metaculus.com/tournament/ACX2026/\">go to Metaculus</a></strong>.</p>",
            "title": "ACX/Metaculus Prediction Contest 2026"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-27"
}