{
    "articles": [
        {
            "content": [
                "<p>I got suckered into paying attention to multiple non-AI political stories this month: The shooting of the messenger, in violation of the most sacred principles, via firing the head of the USA’s Bureau of Labor Statistics, and the Online Safety Bill in the UK.</p>\n<p>As a reminder, feel no obligation whatsoever to engage with either of these.</p>\n<p>There are tons of other things worth paying attention to that are not that.</p>\n\n\n<h4 class=\"wp-block-heading\">Highly Effective Altruism</h4>\n\n\n<p>I realize philanthropy has been handed quite a few sinking ships lately, but if you exclude AI there is one crisis I would prioritize above the rest, which is mRNA.</p>\n<div>\n\n\n<span id=\"more-24660\"></span>\n\n\n</div>\n<p>Which is: <a href=\"https://x.com/JesseJenkins/status/1952866676724158833\">We have entered the War on Cancer, future pandemics and other diseases on the side of cancer</a> and future pandemics and those other diseases, because we decided <a href=\"https://x.com/SecKennedy/status/1952851097019633766\">to hand this power over to RFK Jr</a>.</p>\n<p>As Rick Bright puts it in the New York Times, <a href=\"https://www.nytimes.com/2025/08/18/opinion/mrna-vaccines.html\">America Is Abandoning One of the Greatest Medical Breakthroughs</a>. We don’t have to let that happen.</p>\n<blockquote><p><a href=\"https://x.com/JesseJenkins/status/1952866676724158833\">Albert Pinto</a>: Holy moly trump killed Moderna in US!!</p>\n<p>“The U.S. Department of Health and Human Services (HHS) today announced the beginning of a coordinated wind-down of its mRNA vaccine development activities&#8230;.&#8221;</p>\n<p>“The projects — 22 of them — are being led by some of the nation’s leading pharmaceutical companies like Pfizer and Moderna to prevent flu, COVID-19 and H5N1 infections.”</p>\n<p>Jesse Jenkins: Project Warpspeed was probably the most consequential and unqualified success of Trump&#8217;s first term, and mRNA vaccines one of the most exciting medical advances of the 21st century. But this time, Trump 2.0&#8217;s anti-vax HHS Secretary (Kennedy) is cancelling all federal funding for 22 active mRNA development initiatives. There just aren&#8217;t enough facepalm gifs for all this stupidity.</p>\n<p>Alc Stapp: mRNA technology is miraculous and has so much potential.</p>\n<p>This is such a massive own goal.</p>\n<p><a href=\"https://x.com/ExistentialEnso/status/1953080107054121327\">Thorne</a>: We&#8217;re fairly close to being able to very effectively treat cancer with mRNA, and this will be a huge setback</p>\n<p>To be blunt: people you care about will die of cancer because of this decision</p>\n<p>It&#8217;s deeply delusional to think that just because this announcement is about respiratory viruses, it won&#8217;t greatly impact mRNA vaccine tech as a whole.</p>\n<p>mRNA companies get way less funding now and have strong signals that other mRNA vaccines might face regulatory hurdles.</p>\n<p>Also, a lot of people are responding as if I&#8217;m saying such a tech cannot possibly be developed without public funding. No, I said it was a huge setback. And that means people who could&#8217;ve been cured will die waiting for it.</p></blockquote>\n<p>A huge portion of optimism about new medical technology, and even about the future in general discounting AI, is mRNA vaccine development. They’re trying to kill it.</p>\n<p>Private investment can and must come in and over. The funding gap here is only $500 million. Certainly some combination of billionaires (and perhaps others) should step up and their make grants or invest as needed to fix it.</p>\n<p>The cost-benefit ratio here is absolutely absurd. When we think of the futures that aren’t transformed by AI, mRNA is one of the technologies giving us the most hope. If those who heave the means do not pick up the slack here, flat out.</p>\n<p>This comes on the heels of various forms of <a href=\"https://x.com/KepecsLab/status/1894575968137667006\">amazing news</a> about mRNA, such as this:</p>\n<blockquote><p>Kepecs Labs: Huge cancer breakthrough! mRNA vaccine (similar to COVID vaccine tech) shows stunning results against pancreatic cancer! <a href=\"https://t.co/NhpkJeaQYb\">75% of responsive patients STILL cancer-free at 3 yr, normally 80% recur</a>. Could revolutionize treatment for one of deadliest cancers! Funded in part by @NIH</p>\n<p>The thread is full of the kinds of graphs you see when a treatment works really well.</p>\n<p>A. Do responders still have better outcome?</p>\n<p>Left = 1.5 yr follow-up</p>\n<p>Right = 3.2 yr follow-up</p>\n<p>Yes! <img alt=\"👇🏽\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f447-1f3fd.png\" style=\"height: 1em;\" /></p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!E7No!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F27464315-ce9a-4c5b-a7d8-1dc354830fe3_1200x675.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>16. TAKE HOME</p>\n<p>In #PDAC, RNA NA vaccines make CD8 T cells of</p>\n<p>&#8211; multiyear longevity</p>\n<p>&#8211; substantial magnitude</p>\n<p>&#8211; durable effector function</p>\n<p>whose presence</p>\n<p>&#8211; correlates with delayed recurrence at 3-yr follow-up</p></blockquote>\n<p>The worries are politics and game theory.</p>\n<p>In terms of game theory, if we step in and save this situation, did we effectively let the government steal $500 million? Won’t they then have every reason to do it again and target the best programs? Won’t this willingness to fund (acasually) be the reason this got cut?</p>\n<p>My answer here is no, because this cut was intended not to steal the money but to stop the research. The people who are cheering this have bought into their own paranoia or perverse incentives so much that they actually want mRNA dead. In such cases, it is relatively safe to step up, although it does carry some risk of giving people ideas.</p>\n<p>In other situations, the dynamics are different. Either the motivation was indeed to save or steal money, getting others to pick up the slack. Or it was to use a wrecking ball to kill a wide variety of things, knowing the best ones would then gets saved. Then you have to look at these questions a lot more carefully.</p>\n<p>The politics means both that the administration might then use other means to stop mRNA or at least not be helpful, or that this might mark one as an opponent of the administration.</p>\n<p>I would not worry much about the administration not playing further ball. This is a long term fight, and also we have reports Trump himself is not thrilled about the cuts. It is also quite a lot harder to turn down the life-saving medicine when the time comes than it is to deny the initial funding. The pressure would be immense, and also there are places besides America to start deployment if you need to do that for a bit.</p>\n<p>I also don’t worry too much about this alienating the Trump administration. You’re investing in America, Trump was reportedly not thrilled about the cuts, and he definitely isn’t a true believer on this like he is on tariffs. He knows that being against mRNA is about placating crazy people, so if it happens without him, that is fine. That assumes, of course, that you are worried about this dynamic in the first place. Some people very much aren’t.</p>\n\n\n<h4 class=\"wp-block-heading\">Variously Effective Altruism</h4>\n\n\n<p><a href=\"https://x.com/PAHoyeck/status/1947288689710637229\">This</a> pattern is common. I think centralizing suffering is a critical mistake, so you can substitute various things for ‘utilitarianism’ and also various things for ‘suffering.’</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!rZGo!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5cb08fe1-b372-4a51-857f-4a7de3326830_727x788.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!F-Eb!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9c165c06-aff0-4636-927c-6e48f220aed4_690x362.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Although also, yes, at reasonable prices, and while factoring in other things we also care about, we should reduce suffering.</p>\n<p>Also, yes, <a href=\"https://x.com/LemmySmackett/status/1947459499326894157\">this is about how well most people deal with hypotheticals</a>.</p>\n<p>This is also a central common pattern, and the difference that matters.</p>\n<blockquote><p><a href=\"https://x.com/dioscuri/status/1949188965480988998\">Henry Shevin</a>: Many years ago, I went to two animal welfare events with very different types of philosophers.</p>\n<p>The conclusion of the first was “we need to have another bigger conference next year, with animals present.”</p>\n<p>The conclusion of the second was “we need to fund in-ovo chicken sexing.”</p></blockquote>\n<p>I would not go to either conference. But, if you did go to one such conference, you would want it to be that second one.</p>\n<p>I will note that there is already lots of talk about making the new in-ovo chicken sexing technology mandatory, starting in Europe. There will always, always be a push to make such things mandatory.</p>\n<p>Some more making fun of how awful Cate Metz is and how much he got everything wrong yet again:</p>\n<blockquote><p><a href=\"https://x.com/leilavclark/status/1953508106325103066\">Leila Clark</a>: on the lighthaven drama, from a friend:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!mcFw!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa6d7f6d8-75ed-409d-8437-c278b8b1690b_988x260.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p><a href=\"https://x.com/tszzl/status/1954802794122326033\">A true statement</a>:</p>\n<blockquote><p>Roon: Public goods are often expensive gifts to yourself scaled up.</p>\n<p>David Manheim: Yes &#8211; and this is a reason that wealth inequality often leads to public benefit.</p>\n<p>The cheapest way for wealthy firms to have educated workers is public education, and the cheapest way for the rich to reduce climate risk is fixing emissions globally, etc.</p></blockquote>\n<p>This is also why I refer to the ‘chasm of personal utility.’</p>\n<p>Once you hit f*** you money, there is remarkably little that additional money buys on a personal level. Marginal returns drop dramatically. It takes quite a lot of additional money to get remarkably little benefit. The things people buy for themselves that actually get expensive, like boats and lavish private parties, really aren’t that great.</p>\n<p>If you actually want your life to get better, the only way to do so becomes improving the world, since you and those you care about have to live in it. Hence, public goods.</p>\n<p>As a toy example, as a gamer, I could basically buy whatever I want and not bat an eye, unless I wanted things like Vintage Magic decks, and even that has an upper bound. So at that point, if I want better gaming, what do I have to do? Commission games.</p>\n\n\n<h4 class=\"wp-block-heading\">Bad News</h4>\n\n\n<blockquote><p><a href=\"https://x.com/benlandautaylor/status/1951014424057356367\">Elizabeth von Nostrand</a>: Lots of people want my job. No one wants the part where I spent five years doing this job for free.</p>\n<p>Ben Landau-Taylor: Most of my friends with weird jobs could say the same.</p>\n<p>Eliezer Yudkowsky: Word.</p></blockquote>\n<p>Nefarious Jobs will, for a remarkably small fee that usually is only four figures, <a href=\"https://slate.com/life/2025/07/jobs-professional-revenge-hire-cheating-fired.html\">go out and ruin someone’s life</a>, in ways that they say are technically legal, with the ‘Total Annihilation’ package only costing $10k. In addition to the other obvious reasons it is terrible, one strong reason not to do this is that it can be done back to you.</p>\n<p><a href=\"https://x.com/JordanOnRecord/status/1957151677070356567\">Reservations at DC restaurants plunge 31% compared to 2024</a> in the wake of the police takeover.</p>\n<p>The trucking industry reports it is experiencing the dreaded double whammy, <a href=\"https://x.com/supertrucker/status/1947779994345701479\">intense labor shortages combined with declining wages</a>. Um, yes, you did read that correctly.</p>\n<p>RIP Hulk Hogan, <a href=\"https://x.com/dilanesper/status/1948757550993998192\">a lawyer from Bollea v. Gawker offers a retrospective on the case</a> that took Gawker down.</p>\n<p>Reminder, once again: When people tell you who they are, believe them. <a href=\"https://x.com/KelseyTuoc/status/1949626839221281229\">Kelsey Piper is latest to confirm</a> that people who identify themselves as evil, or with Hitler or as a fascist or a Nazi, will universally prove to indeed suck immensely.</p>\n<p><a href=\"https://x.com/zdch/status/1950179992542880047\">It appears to not be a strawman</a> that some disability activists oppose treating disability via gene editing because this would mean there would be fewer disabled people, which would weaken their ability to exert political pressure.</p>\n<blockquote><p>Rebekah Westenra: Begging the average disabled person to understand that it’s not about you. You will never ever get access to this kind of tech. This will never be a cure for YOU. This is about eliminating disability from the upper class which will reduce support &amp; resources directed towards YOU.</p></blockquote>\n<p>She is of course directly incorrect, developing cures for the rich is how you develop the technology, after which it leads to cures for everyone else, but even if she were somehow correct, consider what don’t even count as the implications, just the outright telling people if they are rich then it is good they are disabled, my lord.</p>\n<p>Oh, and then the follow-up is, maybe curing your disability would be bad, yo, and if you disagree with this than you’re not really a disabled person so you have no right to talk, there are those who can make this up yet I remain not one of them.</p>\n<blockquote><p>Also begging people to understand the differences between various disorders and to think about what makes you YOU and if your disorder can be completely separated from that then maybe just shut the hell up for now.</p></blockquote>\n<p>Those corporate ‘icebreaker’ and ‘team building’ events? <a href=\"https://x.com/oscredwin/status/1950547342878196205\">Yeah, they are pretty important to your success at your job.</a> You need to go all out with faking sincerity.</p>\n<blockquote><p>Simon Fruit: One of my favorite employment phenomenons is this retarded idea that if you do your job very well but don’t participate in stupid, time-consuming, and useless ice breakers then you’re not a “team player” because you made Brenda feel bad that you didn’t care for her weekend.</p>\n<p>Andrew Rettek: I got fired for this once.</p>\n<p>Patrick B: Three phrases to remember: Oh wow crazy. That’s amazing. Oh no he didn’t.</p></blockquote>\n<p>This is effectively a large reason to seek out coworkers you like hanging out with, since you’re going to be forced to do that if you want to succeed.</p>\n<p>I never had a problem with such work exercises, because the offices I did join for any length of time &#8211; Jane Street and Wizards of the Coast &#8211; selected for people I would have been happy hanging out with anyway.</p>\n<p>I did however kind of get fired as a student at a Dojo for this. For a while I would go to class twice a week and had moved up one rank. I was informed by Sensei that as I kept going, they expected me to participate more in the community. I found the other students to be nice people, I didn’t at all mind training with them and making small talk, but burning evenings socializing? Oh, hell no. That was essentially that.</p>\n<p><a href=\"https://x.com/jburnmurdoch/status/1953811277463122162\">Well, this seems not awesom</a>e:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!63io!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fceb7a0bc-26b0-46dc-a2b7-61a8e15dfcc8_1200x815.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!xPpz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F794ec92e-e8d0-4d7e-a2dd-b31328d9fd14_1200x702.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The farther you go downthread the worse it gets.</p>\n<p><a href=\"https://x.com/TypeForVictory/status/1955204550622577011\">It seems in Cairo</a> (and presumably many other places) Uber drivers flat out ignore the fare they accept and then you have to haggle. Like James here I absolutely cannot stand small stakes haggling. Transaction costs are very high and it makes sense that the Anglosphere <a href=\"https://x.com/peterrhague/status/1955206946899812356\">has long had a big advantage everywhere it doesn’t haggle</a>, but struggles on housing which is the one place we still do it and have to hire people to advise us on optimal haggling techniques.</p>\n\n\n<h4 class=\"wp-block-heading\">Whisper Networks</h4>\n\n\n<p><a href=\"https://x.com/wfenza/status/1949499456308531263\">Whisper networks are terrible, but what is the alternative</a>? Ideally actual fact finding, but that is expensive. You cannot play that card so often, and indeed you need a whisper network or something similar to know when to invest in fact finding. Next up would be creating common knowledge and only saying things in the open, which also has obvious limitations. If nothing else, it means that if you can make the victim or witness not want to come forward, in one of any number of ways, you get away with it, and it is not obvious how to go from ‘whisper networks are bad’ to preventing one from spontaneously arising unless you have an effective alternative mechanism. Also, if you cannot say anything negative about anyone without telling them directly, that leads to heavily biased information and also various games where silence starts to be highly meaningful. I don’t see any good solutions?</p>\n<blockquote><p>Wes: Whisper networks are bad, for obvious reasons.</p>\n<p>Xenia: unfortunately also good for obvious reasons.</p>\n<p>Wes: Alas. The bad parts tend to eat the good parts.</p>\n<p>Sparr: In my intentional community organizing efforts, I have tried and failed a few times to establish this rule/norm:</p>\n<p>Say nothing negative about someone behind their back that you don&#8217;t say to their face, unless it should get them kicked out of the house.</p>\n<p>Wes: Why does it fail?</p>\n<p>Sparr: People refuse to honor/follow it. If I could find a core group of 3-5 people who would adopt this norm, new people could be acculturated. But I have never found that core group.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Opportunity Knocks</h4>\n\n\n<p>Recommended: <a href=\"https://usefulfictions.substack.com/p/50-things-i-know?manualredirect=\"><strong>Cate Hall tells us 50 things she thinks she knows</strong></a>. The list is as excellent as everyone says it is. Many of these are exceptionally valuable if you don’t know them or needed a reminder. A number of them are in my opinion false, actively unhelpful or both, but that keeps you on your toes and a list where all 50 were true and useful would not be as interesting. Like her I could probably write a post about most of these if I wanted to (especially the one I think are wrong).</p>\n<p><a href=\"https://usefulfictions.substack.com/p/in-praise-of-quitting\">Cate Hall also offers praise for quitting</a>, especially quitting when you realize that you don’t want the results of walking down a long term path. Some people of course <a href=\"https://slatestarcodex.com/2014/03/24/should-you-reverse-any-advice-you-hear/\">need to reverse this advice</a>.</p>\n<p>Recommended: <a href=\"https://x.com/ohabryka/status/1951723846685634709\"><strong>The Inkhaven Residency</strong></a> <a href=\"https://www.inkhaven.blog/\"><strong>at Lighthaven in Berkeley, happening November 2025</strong></a>. If you attend you will write 30 blog posts, one per day, or leave, with advice and mentorship from Scott Alexander, Scott Aaronson, Gwern and more. Cost to attend is $2,000, housing is available as low as $1,500 ($2,500 for a private one).</p>\n<p>(I do not currently have a plan to make an appearance myself, I only have so many trips in me per year, but certainly there is some chance I will choose to do so.)</p>\n<p><a href=\"https://x.com/ZoharAtkins/status/1949853443834720338\">Zohar Atkins</a> presents <a href=\"https://www.alexandria.wiki/home\">a new Library of Alexandria</a>, 4000+ great books combined with an AI tutor, called of course Virgil, to converse with.</p>\n\n\n<h4 class=\"wp-block-heading\">Government Working</h4>\n\n\n<p>I am doing my best to avoid commenting on politics. As usual my lack of comment on other fronts should not be taken to mean I lack strong opinions on them. Yet sometimes, things reach a point where I cannot fail to point them out.</p>\n<p>If you are looking to avoid such things, I have split out this section, so you can skip it.</p>\n<p>This month, that applies to the following two sections as well.</p>\n<p>Because this is the realm of things like this:</p>\n<blockquote><p><a href=\"https://x.com/TetraspaceWest/status/1955045713093579192\">Tetraspace</a>: Reading another thread of people replying to &#8220;this law should be changed&#8221; with &#8220;but it&#8217;s the law&#8221; and being thankful that democracy achieving good outcomes doesn&#8217;t rely on people understanding policy details.</p></blockquote>\n<p><a href=\"https://x.com/rSanti97/status/1947287500612870171\">Replacing the H-1B visa lottery with a system based on ‘seniority or salary</a>’ predicted to raise the program’s economic value by 88%. I would worry that ‘seniority’ is too easy to fake, so I would go with salary as much as possible. It is also argued that this would prevent the driving down of wages for native workers. Even better would, of course, be to straight up auction off the visas themselves, or set a market clearing price (ideally with much higher supply, perhaps the level that maximizes revenue), which is the obvious solution.</p>\n<blockquote><p><img alt=\"🚨\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f6a8.png\" style=\"height: 1em;\" /> <a href=\"https://x.com/allenanalysis/status/1950333315812372804\">BREAKING</a>: A bill to ban politicians from trading stocks is getting pushback from the White House, per Axios.</p></blockquote>\n<p>The pushback seemed to be they did not like that it applied to the President and Vice President. I can’t imagine why. I only report the news.</p>\n\n\n<h4 class=\"wp-block-heading\">Censorship In The UK</h4>\n\n\n<p>The good news first. The <a href=\"https://x.com/NewsWire_US/status/1947071617781121412\">UK backed down from the encryption standoff with Apple amid US pressure</a>.</p>\n<p>Then they went and did all the other stuff they did this month. Oh no.</p>\n<p><a href=\"https://www.thefp.com/p/britains-war-on-speech-comes-for\">The free speech situation in the UK seems about to get somehow even worse</a> on multiple fronts at once?</p>\n<p>The situation has reached the point where if I lived in the UK, I would feel it necessary to leave, because I would otherwise not feel safe doing my job.</p>\n<blockquote><p>Dominic Green: On the night of Wednesday, July 16, the Labour government’s Employment Rights Bill passed its <a href=\"https://bills.parliament.uk/bills/3737\"><strong>second reading</strong></a> in the House of Lords.</p>\n<p>If the bill goes into law in its current form—and there is not much to stop it now—Britons can be prosecuted for a remark that a worker in a public space overhears and finds insulting.</p>\n<p>The law will apply to pubs, clubs, restaurants, soccer grounds, and all the other places where the country gathers and, all too frequently, ridicules one another.</p></blockquote>\n<p>Meanwhile <a href=\"https://x.com/Telegraph/status/1949198233797857448\">an ‘elite police squad’ is monitoring anti-migrant posts on social media</a>.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ZlYg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F15f080c5-928e-4ce8-9ce4-98fd3a133b7d_1096x868.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Oh, and on the first day of the ‘Online Safety Act’ they were already on the verge of shutting down Wikipedia. Could there be any clearer sign things are extremely bad?</p>\n<blockquote><p>Evolve Politics: Wikipedia is currently in a legal battle with the UK government to try and stop the platform being censored in the UK &#8211; or even completely blocked &#8211; thanks to the Online Safety Act.</p>\n<p>Under the new law, the UK media regulator Ofcom is poised to label Wikipedia as a “Category 1” platform.</p>\n<p>This would impose the strictest content rules possible &#8211; such as:</p>\n<p>&#8211; age verification for users</p>\n<p>&#8211; identity verification for contributors</p>\n<p>&#8211; censorship of ‘harmful’ topics.</p>\n<p>Wikipedia has already stated they will not implement any of these rules, arguing they would be forced to censor crucial facts, and potentially expose their volunteer contributors to real-world harm &#8211; such as political harassment, or worse &#8211; purely for documenting the truth.</p>\n<p>In addition, Wikipedia says that bad actors could easily abuse the new laws &#8211; by filing fake complaints or exploiting vague “harm” rules to force them into entirely removing articles that people &#8211; or the UK government/corporations &#8211; simply disagree with.</p>\n<p>Wikipedia’s legal case was heard at the Royal Court of Justice on July 22-23, and a ruling is expected within a month or so. However, if their legal arguments are rejected and they refuse to implement Category 1 rules, the UK government could block access to Wikipedia entirely.</p></blockquote>\n<p>It is a great relief to confirm that Wikipedia is not going to give in here, especially on censorship of ‘harmful’ topics even for adult users. <a href=\"https://www.reuters.com/sustainability/society-equity/wikipedia-operator-loses-court-challenge-uk-online-safety-act-regulations-2025-08-11/\">They have since lost their court case.</a></p>\n<p><a href=\"https://x.com/ChrisMid/status/1948770778586988641\">Chris Middleton</a> lays out what the Online Safety Act does in general.</p>\n<blockquote><p>Chris Middleton: It creates a new “duty of care” on all online services to police user content. This means:</p>\n<p><img alt=\"✅\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/2705.png\" style=\"height: 1em;\" /> Platforms must proactively detect and remove &#8220;illegal&#8221; and &#8220;harmful&#8221; content.</p>\n<p><img alt=\"✅\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/2705.png\" style=\"height: 1em;\" /> Age verification to block under-18s from adult material.</p>\n<p><img alt=\"✅\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/2705.png\" style=\"height: 1em;\" /> Private messaging apps must scan messages for banned content.</p>\n<p>WhatsApp and Signal warn this poses an unprecedented threat to encryption and privacy.</p>\n<p>Age checks and the death of anonymity:</p>\n<p>Any site with adult content must now implement &#8220;highly effective&#8221; age verification. That means:</p>\n<p><img alt=\"📸\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f4f8.png\" style=\"height: 1em;\" /> Face scans</p>\n<p><img alt=\"📅\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f4c5.png\" style=\"height: 1em;\" /> Government IDs</p>\n<p><img alt=\"💳\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f4b3.png\" style=\"height: 1em;\" /> Credit card checks</p>\n<p>This applies far beyond just porn to any user-generated platform. The law covers any site that allows users to share or interact. That includes forums, messaging apps, cloud services, open-source platforms, even Wikipedia.</p>\n<p>Proton VPN: Just a few minutes after the Online Safety Act went into effect last night, Proton VPN signups originating in the UK surged by more than 1,400%.</p>\n<p>Unlike previous surges, this one is sustained, and is significantly higher than when France lost access to adult content.</p>\n<p><a href=\"https://x.com/dril/status/372720390369726465\">Wint (August 28, 2013</a>): lets set some realistic goals here : jokes banned by 2016. sex banned by 2020. a cop in every household by 2025</p></blockquote>\n<p>What kind of things are being censored,<a href=\"https://x.com/regularaugust/status/1950518223218085981\"> in addition to Spotify</a>, which is also threatening that it might have to delete your account?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!sQcz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2533b3a9-e6ce-4afd-8d34-ec908341a9a6_1025x1460.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/Saruei_/status/1950522692689449242\">Saruei</a>: I can’t believe Spotify now requires age verification. Today it’s music, tomorrow it could be books, films, or even news articles. It&#8217;s the first step into a dystopian reality we’ve seen in movies, where access to culture is gated by surveillance and the illusion of security.</p>\n<p><a href=\"https://x.com/christiancalgie/status/1950458199280095579\">Calgie</a>: Your Spotify account is getting deleted unless you do age verification.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!kwf6!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F53356764-5a5f-481d-8b2e-97f4ad1b35df_1170x938.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/G0ADM/status/1948850625850089493\">Adam Wren</a>: For everyone that was saying “it’s just to stop kids watching porn” very first day of the restrictions it’s been used to censor “violence” which in this case means police arresting people at protests, well done. The very first day. Not even a ‘slippery slope’ at this point, more of a wet cliff.</p>\n<p>Benjamin Jones: If you have a standard X account in the UK &#8211; presumably the vast majority of British users &#8211; you cannot see any protest footage that contains any violence tonight. Because of the Online Safety Act. A relative in America sent me this screenshot of <a href=\"https://x.com/KieraDiss/status/1948804332960579816\">one blocked post</a>.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!VENo!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f7e71a8-1e57-4df5-b10d-d57e5ef94579_738x737.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/matbogus/status/1950215857964982287\">Matvey</a>: It&#8217;s frankly disgusting that the Online Safety Act is being hidden behind the pretence of &#8216;child protection&#8217; when it&#8217;s already being used to hide political content from non-age-verified uses, and next year will be able to take IP from tech companies at no notice.</p>\n<p>Draconian.</p></blockquote>\n<p>It was a bold move, Cotton, to go directly after Wikipedia and coverage of police and protests and testimony before Parliament on day one. They did not want there to be any illusions what their true target was.</p>\n<blockquote><p><a href=\"https://x.com/CharlesD353/status/1950997552225996865\">Charles</a>: I just got asked to submit ID to view a Reddit wine forum.</p>\n<p>Immediately thought &#8220;I&#8217;ve got to get out of this country (the UK)&#8221; and bought a VPN subscription.</p>\n<p>Now I&#8217;m digitally in the much more free nation of &#8220;checks notes&#8221; Belgium.</p>\n<p>But the impulse to physically get out remains. This is not a place that feels hopeful or optimistic or like it&#8217;s going to change for the better soon.</p></blockquote>\n<p>Would I <a href=\"https://x.com/shellenberger/status/1949231889539379352\">call this new UK a ‘police state’?</a> Well, it is a place where they censor and potentially jail you if you criticize the police. I mean, if you’re censoring Wikipedia and you’re blocking videos of police arresting protesters, <a href=\"https://x.com/tracewoodgrains/status/1950026831307870559\">I realize Wikipedia does do some rather nasty politically motivated things</a> <a href=\"https://x.com/tracewoodgrains/status/1949878973410005180\">like whitewash Mao as if it was defending him in court</a>, but what more is there to say?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ZZz2!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa5914e76-7748-4332-813b-699c7dc80bcb_1061x825.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The community note is incorrect. This very obviously was exactly what the act was for. I’m not a pure ‘the purpose of a system is what it does’ person, but yes very obviously the purpose of this system is to censor speech authorities dislike.</p>\n<blockquote><p><a href=\"https://x.com/cremieuxrecueil/status/1950224600333234394\">Cremieux</a>: The Online Safety Act censored one of my posts on lactose intolerance. It censored another where I mentioned donkeys, and my friend can&#8217;t see one of my posts on Neanderthals processing fat. If you support the Online Safety Act, you are an imbecile.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!cr7D!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F962382c3-4f05-4183-ae15-b41beb2adced_934x1086.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Nigel Farage and the Reform Party would get rid of the Online Safety Act, <a href=\"https://x.com/Sam_Dumitriu/status/1949805223414763661\">or as the Labour Party calls it</a>, ‘scrap vital protections for young people online, and recklessly open the floodgates to kids being exposed to extreme digital content,’ the same way they were so exposed before and are so exposed in other countries, and thus he is ‘not serious.’ They also say you are ‘<a href=\"https://x.com/peterkyle/status/1950092871614230571\">on the side of the predators</a>’ while, censoring official discussions about investigation of <a href=\"https://x.com/rosbifenth10032/status/1950097578927779942\">actual</a> <a href=\"https://x.com/G0ADM/status/1950095586926956687\">predators</a>.</p>\n<p>Many such cases.</p>\n<blockquote><p><a href=\"https://x.com/crush_crime/status/1950127481245102412\">Crush Crime:</a> <a href=\"https://x.com/crush_crime/status/1933889683076886749\">Our post</a> with a screenshot of a House of Commons amendment, setting terms of reference for an inquiry into the grooming gangs cover-up, has been censored by the Online Safety Act. The state must spend less time policing speech and more time catching rapists and thieves.</p></blockquote>\n<p>Here is that post:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!lzUf!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F637eebe6-0ab5-40ab-9320-2817ab1f5e98_1035x934.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/Sam_Dumitriu/status/1949805223414763661\">Sam Dumitriu</a>: &#8220;Nigel Farage would give teenagers access to material on drinking cider, owning hamsters, and speeches from Conservative Members of Parliament. He is simply not serious.&#8221;</p></blockquote>\n<p><a href=\"https://x.com/TheWorthyHouse/status/1949926687258378481\">Charles Haywood compares the situation to that in Eastern Europe in 1989</a>, as in it has become clear that the government will not respond to the public’s views except by trying to censor the public, including censoring statements that the majority agrees with and statements about police conduct, political opinions and the coordination of protests, now including on social media, in pubs and in private chats.</p>\n<p>It can always get worse. <a href=\"https://x.com/Pirat_Nation/status/1950896353522958711\">Australia is going to make you prove your identity in order to access search engines</a> as in Google and Bing, and <a href=\"https://x.com/9NewsAUS/status/1950177173916033355\">they want to ban YouTube for kids under 16</a> as part of their social media ban, WTAF.</p>\n<p><a href=\"https://x.com/PositivFuturist/status/1950852480008331661\">The UK is seeking to pass a law</a> enabling the issuance of ‘respect orders’ to prevent someone from engaging in ‘anti-social behavior’ that can ‘prohibit the respondent from doing anything described in the order’ or ‘require the respondent to do anything described in the order.’ The court can simply order you to do or not do actual anything? So I suppose they spell respect T-Y-R-A-N-N-Y.</p>\n<blockquote><p><a href=\"https://x.com/IsaacKing314/status/1951110794508378169\">Isaac King</a>: &#8220;The text of my new bill, the End All Bad Things Act, is as follows:</p>\n<p>* I can do whatever I want.</p>\n<p>This will allow me to make people stop doing bad things. Thus if you oppose this bill, you are in favor of bad things.&#8221;</p></blockquote>\n<p>Then again, what did we expect from <a href=\"https://x.com/senatorshoshana/status/1952720751284384128\">a country that censored the Teenage Mutant Ninja Turtles</a>?</p>\n<blockquote><p><a href=\"https://x.com/RSI/status/1952430416087974392\">R Street</a>: The U.K.’s Office of Communications (Ofcom) explains in detail what each category of prohibited content includes—even “[c]ontent which realistically depicts serious violence against a fictional creature.”</p>\n<p>Such a definition would not only prohibit minors from accessing historical and newsworthy content about wars—but many episodes of SpongeBob (if posted to social media), including but not limited to “No Weenies Allowed.”</p></blockquote>\n<p><a href=\"https://x.com/Klint_Izwudd/status/1950300625897746489\">Meanwhile, YouTube is now going to ‘use AI’ to ‘interpret a variety of signals</a>,’ including account longevity and which types of videos a user is searching for and watching, to ‘estimate’ whether a user is 18 and thus age restrictions must be imposed.</p>\n<blockquote><p>Klint Izwudd: Isn&#8217;t it fucking amazing how worldwide all of these incredibly sophisticated censorship measures are literally appearing in the last week.</p></blockquote>\n<p>The direction of this move is ambiguous. If the previous regime was that everyone was treated as a minor until proven otherwise, and now you have a second way to get the regime to stop doing that, and how minors are treated does not change, then This Is Good, Actually. Alas, this likely goes hand in hand with worse treatment of minors. <a href=\"https://www.dexerto.com/youtube/youtube-brings-age-protections-to-us-and-some-users-will-need-to-show-id-3231708/\">From this article</a>, it sounds like this will effectively mean an expansion of restrictions.</p>\n<p>Also note that the actual changes listed are (they use the word ‘including’):</p>\n<blockquote>\n<ol>\n<li>Disabling personalized advertising</li>\n<li>Turning on digital wellbeing tools</li>\n<li>Adding safeguards to recommendations, including limiting repetitive views of some kinds of content</li>\n</ol>\n</blockquote>\n<p>All of those seem like they could be straightforward upgrades? Can I choose to turn on those features?</p>\n<p>What they of course fail to mention is that the main change is age restricting videos. I do notice that I have an alt Google account, I definitely did not provide Google my ID there, and when I use YouTube on it I have yet to run into age restrictions on videos.</p>\n<p>A fun note is, if you were trying to ‘look like an adult,’ what would you do? You would among other things try to make your consumption as age inappropriate as possible?</p>\n<p><a href=\"https://x.com/ArthurB/status/1950517680047374513\">I would very much like to see this handed as follows</a> by the tech companies:</p>\n<blockquote><p>Arthur B: If Meta and Google had the courage to entirely drop service for the UK, the government would fold in two weeks and repeal the OFA. The EU, Australia, etc would start to backtrack. Two weeks is all it takes, it could be done.</p></blockquote>\n<p>Wikipedia has the right idea. By all means sue, but make it clear that if push comes to shove you will simply cut the country off. Even if the governments held firm, fine, so be it, let everyone use a VPN.</p>\n<p>The traditional way such stories end, when they don’t end in revolution, is this:</p>\n<blockquote><p><a href=\"https://x.com/Devon_OnEarth/status/1950119694305837506\">Devon</a>: This is what current polling looks like when you don&#8217;t include LeftParty_Final. I&#8217;m sorry but anyone making the &#8220;you’re gonna split the vote and let Farage in&#8221; argument has their head in the sand and can be safely and derisively ignored.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!4LZU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb11d9736-eaab-4a15-9d8c-23513cefccd5_1165x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>In particular I would not have simultaneously severely censored the internet for 16-and-17 year olds and also given them the vote. That’s just me.</p>\n<p><a href=\"https://x.com/ATabarrok/status/1951830688325353779\">Here’s the strongest argument I’ve seen yet that actually Brexit was a mistake</a>. You might need to get away from the EU but that doesn’t help if you then act even worse:</p>\n<blockquote><p>Alex Tabarrok: The British would never have tolerated this if it came from Brussels and EU bureaucrats.</p>\n<p>Once regulation was seen as self-imposed, the floodgates opened.</p>\n<p>Mr. Obvious: BREAKING: Zoomers cannot adjust their Nvidia graphics cards settings on their gaming PCs anymore because they aren&#8217;t 18 thanks to the Online Safety Act.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!MnmC!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fae9d26f0-80dc-46b0-ac63-bbe0ecd0ae60_898x521.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>To be fair, if you can’t get a VPN working then you shouldn’t be using Nvidia apps.</p>\n<blockquote><p><a href=\"https://x.com/NekoMichiUBC/status/1951705267491803515\">Michi:</a> UK App Store charts be like</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!qzkg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2bb48bec-f6d8-4ad4-8f42-9efed1b933ca_1183x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Guess who is also downloading those apps, also billing the public for them?</p>\n<blockquote><p><a href=\"https://x.com/freddienew/status/1951894358317252784\">Freddie New</a>: Peter Kyle suggesting that using a VPN will put children at risk (a laughably luddite suggestion, as he probably uses one himself every time he works from home)&#8230; At the same time that Business Secretary Jonathan Reynolds (famously confused as to whether he is or is not a lawyer) <a href=\"https://www.politico.eu/article/britain-mps-charge-vpns-expenses-minister-caution-tech-jonathan-reynolds-data/\">is billing his use of a VPN to YOU, the taxpayer.</a></p>\n<p>Why doesn&#8217;t Jonathan Reynolds just verify his age instead?</p>\n<p>I honestly wish someone was making this all up.</p></blockquote>\n<p><a href=\"https://x.com/jeremykauffman/status/1951814541324812654\">Ultimately, yes, this is the choice and the choice is #1</a>:</p>\n<blockquote><p>Jeremy Kauffman: Most people won&#8217;t state this so bluntly, but if the choices are:</p>\n<ol>\n<li>kids sometimes access pornography on the internet</li>\n<li>a federal ID system to access the internet</li>\n</ol>\n<p>Then #1 is the better choice.</p></blockquote>\n<p>Well, actually the #2 choice is you have a federal ID system and the kids access the porn anyway, but it was never about the porn. The porn is an excuse.</p>\n<blockquote><p><a href=\"https://x.com/drethelin/status/1952053378902892706\">Misha</a>: The dangers to children of potentially seeing porn are trivial compared to the benefits of being able to freely access the internet</p>\n<p><a href=\"https://x.com/KelseyTuoc/status/1952189788267872400\">Kelsey Piper</a>: And the most overwrought hysterical &#8220;this is the first step towards requiring government ID before you read or talk online at all&#8221; predictions have been borne out in full so swiftly that I don&#8217;t see how you can possibly feel certain it won&#8217;t happen here.</p>\n<p>like, I&#8217;m sorry! I too really hate how hard it is to give kids a healthy online experience! and I will oppose every effort to enshrine age verification in either the law or in company policy on any level for any reason.</p>\n<p><a href=\"https://x.com/matthewlesh/status/1951939103068668142\">Matthew Lesh</a>: The Online Safety Act debate was a lonely place for free speech advocates. Anyone who dared to question the law was treated as a child-hating pariah. Yet as key provisions have come into force our warnings have proven eerily accurate.</p>\n<p>Institute of Economic Affairs: There was shock that anyone might dare to question a law designed to ‘protect children.’</p>\n<p>In a separate meeting with a senior Ofcom official responsible for implementing the law, I was politely assured that excessive implementation is never a problem with regulation, leaving me utterly dumbfounded.</p></blockquote>\n<p>If those implementing a law tell you ‘excessive implementation is never a problem with regulation’ and you let them continue implementing, you know what you will get.</p>\n<p>There was a period where we were constantly told that those concerned about AI killing everyone would impose dystopian authoritarian nightmare surveillance states because we wanted to impose some restrictions on who could train or distribute future frontier AI models potentially smarter than humans.</p>\n<p>Instead, things far worse for freedom than anyone was talking about are being imposed because otherwise ‘you are not serious about protecting children from predators’ or what not, and being used to suppress dissent and also settings on Nvidia cards on day one. Somehow most of the same voices are being a lot less loud about it.</p>\n<p><a href=\"https://x.com/ArthurB/status/1957064524848058567\">They are even going after good old free speech Americans like 4Chan</a>, whose response letter correctly said they would fight any and all attempts and calling upon the State Department to step up its game, but seemed altogether too polite. Let 4Chan be 4Chan, at least this one time.</p>\n<p>Also, frankly, go ahead, go after 4Chan and see what happens. It’ll be fun.</p>\n<p>Then they went after Twitter for censoring in the UK too much, because it made the UK government look bad.</p>\n<blockquote><p><a href=\"https://x.com/prestonjbyrne/status/1957492082257359239\">Preston Byrne</a>: I was asked to comment on a story today about this. Apparently Ofcom wants to punish X for &#8220;over-censoring&#8221; user content, making the UK government look bad. In their view, X violates the Online Safety Act by over-complying.</p>\n<p>&#8220;If Ofcom goes after X, I hope Elon kicks their ass.&#8221;</p>\n<p>Also, I’m not sure what Ofcom is smoking, but there is no rule in English law which requires a website to platform lawful speech.</p>\n<p>Maybe the UK is taking an expansive view of Article 10, but that’s just more evidence that Article 10 is vague and crap and should be abolished.</p>\n<p>Forever Scept: TRANSLATION: You were supposed to censor without them knowing.</p>\n<p>Preston Byrne: Right. &#8220;You&#8217;re supposed to censor only what we want you to censor, and we aren&#8217;t going to tell you what we want you to censor until you get an enforcement notice for censoring incorrectly.&#8221; Yeah, no. Absolutely not.</p>\n<p>Patrick McKenzie: This is a recipe for censorship by “Come on, you know what we want.” followed by zero point zero democratic accountability. “All independent decisions of firms made for commercial reasons; we have no orders.”</p>\n<p>We have seen this movie before, depressingly frequently.</p></blockquote>\n<p><a href=\"https://x.com/StateDRL/status/1951372373598544116\">America’s State Department has spoken up at least a little</a>.</p>\n<blockquote><p>Bureau of Democracy, Human Rights and Labor (DRL): The UK’s Online Safety Act undermines the right to free expression by imposing censorship on vague grounds. Suppression of criticism of illegal immigration or the criminal justice system is completely unacceptable in a free society.</p>\n<p>These laws will also create immense pressure on American companies to kowtow to the censors. Foreign laws must not undermine the right to freedom of expression of Americans.</p></blockquote>\n<p>There was then an escalation.</p>\n<blockquote><p><a href=\"https://x.com/prestonjbyrne/status/1955594285631619310\">Preston Byrne</a>: The US State Department&#8217;s report <a href=\"https://news.sky.com/story/us-accuses-uk-of-significant-human-rights-issues-and-restricting-free-speech-13410873?dcmp=snt-sf-twitter\">specifically notes the UK/Ofcom has been targeting Americans</a> with no corporate presence in the UK for censorship.</p>\n<p>I am proud to have supplied the US government with all relevant documentation on this point.</p></blockquote>\n<p><a href=\"https://x.com/levelsio/status/1951353697880936873\">Meanwhile over in the EU they mandate TVs</a> to lock the brightness at 30%-50% for sustainability reasons, as in ‘eco mode,’ and you have to dig deep into settings to fix it. But that’s nothing compared to what is coming, you are to hold their beer or wine.</p>\n<blockquote><p><a href=\"https://x.com/mmjukic/status/1952395041604813190\">Marko Jukic</a>: The EU intends to automatically scan every private message sent over a phone, including encrypted ones, for &#8220;child abuse material&#8221; by this October. No prizes for guessing what else they will scan for in a few more months or years. Final death of free speech and free internet.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Don’t Shoot the Messenger</h4>\n\n\n<p>If you have one rule, this is it. Also, if you must shoot the messenger, <a href=\"https://x.com/mark_dow/status/1951347116799914305\">do not shout ‘THIS IS SPARTA’ like it is a good thing that you are doing so</a>.</p>\n<p>Alas, we have chosen to shoot the messenger along with a bold post that says ‘we are shooting the messenger,’ as in we got revisions to a jobs report that Trump didn’t like so he fired the Commissioner of Labor Statistics and accused her of ‘faked job numbers.’</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Zh6Y!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9002e7cb-b65b-41d2-b8a1-3ab17d7694ca_964x1202.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/mark_dow/status/1951347116799914305\">Dow</a>: Banana, meet Republic.</p>\n<p><a href=\"https://x.com/JonahDispatch/status/1951822888262152419\">Jonah Goldberg</a>: It’s like a pilot smashing the altimeter because he doesn’t like the altitude reading.</p>\n<p>To the extent the people angrily responding to this are A) People and not bots B) Sincere and not partisan hacks or C) Not complete idiots:</p>\n<p>Trump blamed the bad numbers on political bias. The same head of BLS delivered terrible numbers on the eve of the election (a fact Trump now lies about). She also delivered great numbers earlier under Trump. So the argument she was biased is just stupid.</p></blockquote>\n<p>Those trying to justify this keep getting details wrong and having others turn out rather inconveniently for them, <a href=\"https://x.com/mattyglesias/status/1952705788096471522\">such as the number he says was ‘rigged’ right before the election later being revised upwards rather than downwards</a>, meaning the error favored him.</p>\n<blockquote><p>Nick Timiraos: Trump to CNBC on the jobs numbers before the election: &#8220;The numbers were rigged.&#8221;</p>\n<p>He&#8217;s getting his dates wrong. He&#8217;s saying the jobs numbers looked good before the election but were revised down after the election. The big downward revision in August, before the election.</p>\n<p>Kernan to Trump: You&#8217;re undermining confidence in the numbers by firing the BLS commissioner.</p>\n<p>Trump: &#8220;When they say nobody was involved, that it wasn&#8217;t political&#8230;. Give me a break.&#8221;</p>\n<p>Trump: &#8220;It&#8217;s a highly political situation. It&#8217;s totally rigged.&#8221;</p>\n<p>Kernan: Which number do you believe? The chances of a Fed rate cut are going *up* because of these weak numbers.</p>\n<p>A slight slowdown in labor &#8220;will get you what you want&#8221; on the Fed.</p></blockquote>\n<p>This of course compounds the undermining of confidence. It seems actively designed to undermine confidence in the numbers.</p>\n<p>Here is the director of the NEC outright saying that the data ‘has to be something you can trust’ and by ‘you can trust’ he means a high number that makes people do the things we want them to do. As in, the job of the numbers is to lie.</p>\n<p>I appreciate the candor about the intent, sir.</p>\n<blockquote><p><a href=\"https://x.com/atrupar/status/1952001504354673000\">Kevin Hassett</a> (Director of the National Economic Council): &#8220;The data can&#8217;t be propaganda. The data has to be something you can trust, because decision-makers throughout the economy trust that these are the data that they can build a factory because they believe, or cut interest rates because they believe. And if the data aren&#8217;t that good, then it&#8217;s a real problem for the US.&#8221;</p>\n<p><a href=\"https://x.com/JustinWolfers/status/1952012555909779816\">Justin Wolfers</a>: Minister for Propaganda says the data can&#8217;t be propaganda once his Ministry has had a chance to vet them and ensure they&#8217;re even true-er.</p>\n<p><a href=\"https://t.co/YZ6npKN72H\">Matt Darling</a>: The White House anti-BLS webpage is basically nonsense. They claim a &#8220;consistent pattern&#8221; of &#8220;overly optimistic numbers&#8221; in 2024, but neglect that 2024 had 6 upward revisions and 6 downward revisions.</p>\n<p><a href=\"https://x.com/atrupar/status/1953078455542624488\">Aaron Rupar:</a> Kevin Hassett suggests the Bureau of Labor Statistics rigged the 2012 election for Barack Obama.</p>\n<p><a href=\"https://x.com/arindube/status/1953585200207638567\">Arin Dube:</a> It’s critical to push back against baseless claims about data revisions, like those by Kevin Hassett. These falsehoods smear the integrity of professionals such as @brent_moulton, who have spent their careers ensuring the public has access to reliable economic data.</p>\n<p>Brent Moulton: In 2012, I was the associate director at the Bureau of Economic Analysis (*not BLS*) and was responsible for preparing the estimates of gross domestic product. Mr. Hassett gets several things wrong here.</p>\n<p>First, I would like to assure you that in the 19 years I was responsible for the GDP estimates (from 1997 to 2016), the estimates were NEVER politically manipulated, nor did anyone ever ask me to adjust them for political reasons.</p>\n<p>At BEA we made a concerted effort to openly explain to our data users the data sources for the GDP, what methodologies were used in the estimation, and be as transparent and &#8220;open source&#8221; as possible. We provided source data tables, methodologies, technical notes, etc.</p>\n<p>I disagree with Hassett&#8217;s allegation that the advance GDP estimate for the 3rd quarter of 2012 was unexpectedly large. That first estimate said that GDP grew at a 2.0% rate &#8211; just about what it had been averaging for the prior two years.</p>\n<p>A number of forecasters try to predict the GDP estimate, often using much of the same source data as used by BEA (albeit usually calculated in less detail). For example, the Atlanta Fed&#8217;s GDPNOW forecast (one of the better ones) was 1.8%, close to BEA&#8217;s 2.0% estimate.</p>\n<p>[thread continues as you would expect]</p></blockquote>\n<p>Then, as the replacement, Trump nominated E.J. Antoni, which seems like a caricature of the worst possible nominee.</p>\n<blockquote><p><a href=\"https://x.com/BrendanPedersen/status/1955037145078567108\">Brendan Pedersen</a>: Trump makes the nomination of EJ Antoni to lead the Bureau of Labor Statistics official after firing the last commissioner over job report revisions. Antoni is chief economist at the Heritage Foundation.</p>\n<p><a href=\"https://x.com/BrianCAlbrecht/status/1955060570878615733\">Brian Albrecht</a> (Chief Economist, Law and Economics Center, lacking imagination): Worse than I could have imagined 24 hrs ago</p>\n<p><a href=\"https://www.axios.com/2025/08/12/trump-bls-antoni-jobs?utm_source=chatgpt.com\">Ben Berkowitz, Emily Peck (Axios</a>): President Trump&#8217;s nominee to head the Bureau of Labor Statistics, <a href=\"https://www.axios.com/2025/08/11/trump-bls-jobs-labor-statistics-ej-antoni\">E.J. Antoni</a>, suggested the possibility of suspending the bureau&#8217;s flagship monthly jobs report.</p>\n<p><a href=\"https://apnews.com/article/trump-jobs-inflation-labor-statistics-antoni-ee8ed2b08369d9e292a70f326db0f423\">Christopher Rugaber (AP)</a>: Jason Furman, a top economist in the Obama administration, wrote on X: “I don’t think I have ever publicly criticized any Presidential nominee before. But E.J. Antoni is completely unqualified to be BLS Commissioner. He is an extreme partisan and does not have any relevant expertise.”</p>\n<p><a href=\"https://x.com/RealEJAntoni/status/1805978967385444604\">E.J. Antoni</a> (June 26, 2024):</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!xgV_!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2f2bdc1e-00b3-448e-90b2-79aa5319035d_1011x1302.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>His Twitter feed is, shall we say, sobering throughout.</p>\n<p>The National Review summary of the situation is ‘<a href=\"https://www.nationalreview.com/the-morning-jolt/trump-wants-a-bureau-of-maga-statistics/\">Trump Wants a Bureau of MAGA Statistics</a>.’ The National Review.</p>\n<blockquote><p>Dominic Pino: What Trump would like is a BLS that is biased in his favor. The latest proof of that is his nominee to be the next commissioner, E. J. Antoni.</p>\n<p>Antoni is the chief economist at the Heritage Foundation. He has been a relentless booster of Trump’s policies on social media. And he has demonstrated time and again that he does not understand economic statistics.</p></blockquote>\n<p><a href=\"https://www.nationalreview.com/the-morning-jolt/trump-wants-a-bureau-of-maga-statistics/\">Dominic then provides various receipts</a> about Antoni. He is maximally unqualified, as in far more unqualified than Jon Snow, who knows nothing.</p>\n<p>This is all a whole different level of absurd and awful than usual.</p>\n<p>Technically it is illegal to suspend the report but do you expect that to stop them?</p>\n<blockquote><p><a href=\"https://x.com/conorsen/status/1955066488039043356\">Conor Sen</a>: The BLS thing just sucks, anyone who tries to sugarcoat it at best doesn’t know what they’re talking about.</p></blockquote>\n<p><a href=\"https://www.natesilver.net/p/trumps-jobs-data-denialism-wont-fool\">Not that it will work, as Nate Silver explains at length</a>, no one is going to be fooled. Destroying the reliability of our economic data only makes everything worse. <a href=\"https://www.derekthompson.org/p/trumps-war-on-economic-data-will\">Derek Thompson calls it part of ‘the war against reality</a>.’</p>\n<p><a href=\"https://www.washingtonpost.com/opinions/2025/08/05/trunp-bls-firing-mistake-mankiw/\">Greg Mankiw, a conservative economist and chair of the Council of Economic Advisors under George Bush</a> who I’ve had on my RSS feed for a decade joined fellow former CEA chair Cecilia Rouse to warn that this firing will backfire and hurt the ability to analyze the state of the economy and develop the best policies, with the headline warning this will ‘come back to haunt’ Trump. You can smell the forced politeness.</p>\n<p>It’s a relatively minor point relative to not shooting the messenger, but the defenses claiming the messager was terrible have just been so absurdly bad.</p>\n<blockquote><p><a href=\"https://x.com/chamath/status/1951631686417924120\">Chamath Palihapitiya</a> (All-In Podcast): Non Farm Payrolls are total garbage so I asked Grok:</p>\n<p>“Hey Grok, go look at the Bureau of Labor Statistics website for their non farm payrolls data. Tell me how many times their original forecasts have been revised since Jan 2020. And, of those revisions, how many times the data was revised up versus down. Categorize this during the Biden versus Trump presidencies.”</p>\n<p>Bottom line is that BLS isn’t so much conspiratorial as it is inadequate in its approach. They are all over the place and add little directional signal. They constantly revise and in both directions.</p>\n<p>The sampling techniques they use are brittle and don’t work for a large and dynamic economy like the US.</p>\n<p>Trump was right to fire the head of BLS because she ran a critical aspect of the US economic machinery in an unpredictable, haphazard and sloppy way.</p>\n<p>There needs to be a new, oracle-like data provider for this critical information.</p>\n<p>Alex Tabarrok: Amazing. Expects to find bias. Finds none. Which is what you would expect if BLS is doing their job well.</p>\n<p>Reverses course and claims BLS lack of bias means their forecasts have no “signal” and that is bad? Incoherent. Ends with gratuitous call for better methods.</p>\n<p><a href=\"https://x.com/EconChrisClarke/status/1952436880072658974\">Christopher Clarke</a>: BLS preliminary estimates have actually increased their accuracy over time. There is always room for improvement and survey responses have decreased. Improved accuracy requires more resources, not less.</p></blockquote>\n<p>What BLS does is they provide an early estimate, because that is valuable even when it is noisy, and then a later estimate. This Is Good, Actually.</p>\n<p>Tyler Cowen, who has had some very let’s say creative defenses of various administration decisions, flat out made it is very bad to behave this way, and <a href=\"https://marginalrevolution.com/marginalrevolution/2025/08/in-which-ways-is-the-bls-biased.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=in-which-ways-is-the-bls-biased\">that BLS is not biased</a> except in favor of following established procedures, as in it is biased towards being above reproach about potential biases. Which is wise, and means if you want to account for other things you need to do that on top of their estimates.</p>\n<p>On top of everything else, the whole thing happens to be backwards in two distinct ways.</p>\n<p>As in, the first way is that downward revisions mean the numbers were initially overstated, which makes you ‘look good,’ and no one involved is buying the galaxy brain (but kind of correct) take that you want to ‘look bad’ to get a fed rate cut.</p>\n<blockquote><p><a href=\"https://x.com/ernietedeschi/status/1952477109458448413\">Ernie Tedeschi:</a> The average revision to monthly payroll employment during the Biden Admin&#8211;from 1st estimate to final/latest&#8211;was -0.05%. For the 1st Trump Admin, it was -0.10% (same including the pandemic or not). These are both small revisions, but the &#8220;overstatement&#8221; was greater under Trump.</p></blockquote>\n<p>The second way this is backwards is that low numbers mean you can get the Fed to lower interest rates, which is what Trump wants, so he should welcome that.</p>\n<blockquote><p><a href=\"https://x.com/NickTimiraos/status/1955381732208939441\">Nick Timiraos:</a> Treasury Secretary Scott Bessent suggested that the Fed should consider cutting interest rates by a half percentage point at its September meeting in light of recent labor-market data showing a slower pace of job growth</p>\n<p><a href=\"https://x.com/BharatRamamurti/status/1955418139715572033\">Bharat Ramamurti</a>: The job numbers are all fake and Mr. Trump’s economy is actually BOOMING! But also the Fed should cut by 50 bps despite accelerating inflation because the job market is so bad.</p></blockquote>\n<p>This is very much not an isolated incident. <a href=\"https://www.propublica.org/article/trump-doge-data-collection-hhs-epa-cdc-maternal-mortality?utm_campaign=propublica-sprout&amp;utm_content=1755226805&amp;utm_medium=social&amp;utm_source=twitter\">The Trump Administration is cutting our ability to measure things across the board</a>.</p>\n<p>It is easy to say to all of this ‘oh this is at this point entirely unsurprising’ or dismiss it as unimportant. I believe that would be a mistake. This type of action is a big deal, and falls into the list of things you absolutely never do. Do not shoot the messenger, violate a flag of truce or break guest right. Ever. If you do, The North Remembers.</p>\n<p>As in, recently I finally got around to watching The Godfather, and then it was clear that everyone involved expected everyone in their culture to go around shooting messengers (and shooting people at peace talks) and that’s when I lost the ability to sympathize with the characters.</p>\n\n\n<h4 class=\"wp-block-heading\">Jones Act Watch</h4>\n\n\n<p><a href=\"https://x.com/cpgrabow/status/1950590985584394281\">Colin Grabow offers a central thread outlining the forces</a> keeping the Jones Act in place and how they work to prevent America from shipping goods between ports. If you’re following Balsa then you know most of this already.</p>\n\n\n<h4 class=\"wp-block-heading\">The Incorrect Contrarian Cluster</h4>\n\n\n<p>There exist true things that are forbidden to talk about.</p>\n<p>There also exist a lot of false things that are forbidden to talk about.</p>\n<blockquote><p>Peter Boghossian: One deliverable from Peter Thiel’s talk: If it’s forbidden to be spoken about, it’s likely true.</p>\n<p>Emmett Shear: We taboo all kinds of claims, and only some of them are true. For example, claiming the earth is flat will get you excluded from society, but that doesn’t make it true. If only finding truth was as easy as inverting taboos!</p>\n<p>Zac Hill: I mean that’s just straightforwardly not the case right? Also who is doing the forbidding and why are people running around like simps preoccupied about what is and isn’t sanctioned? “Ahh the Arian Heresy is obviously 100% factually accurate.” Just seems like a red herring idk.</p>\n<p><a href=\"https://x.com/daniel_271828/status/1951771868798890336\">Daniel Eth</a>: This is very obviously false to anyone who thinks about it for more than a couple seconds. There’s a related point that EVEN THOUGH most things that are “forbidden” to be spoken about are false, we should taboo less b/c SOME are true and important. But that ain’t this</p>\n<p>Arthur B: There&#8217;s sadly a cohort of people who defend hyperbole or outright nonsense so long as the direction is correct because it makes the message punchier, as if the rhetorical end justified the means. But such discourse habits destroy the commons.</p>\n<p><a href=\"https://x.com/paulg/status/1952154425759588834\">Paul Graham</a>: It&#8217;s not true that if you can&#8217;t say something, there must be a kernel of truth in it. It&#8217;s trivially easy to think of counterexamples.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Talent Search</h4>\n\n\n<p>What’s the best model of being unable to ‘work your way up from the mailroom’?</p>\n<p>Here is one attempt.</p>\n<blockquote><p><a href=\"https://www.thediff.co/archive/what-happened-to-working-your-way-up-from-the-mailroom/\">Byrne Hobart</a>: One way to frame this is to ask what would have to happen to have a modern Sidney Weinberg-style career, which is mostly a list of what would have to <em>not</em> happen. He&#8217;d have to:</p>\n<ul>\n<li>Avoid finishing high school.</li>\n<li>Avoid taking any standardized test.<a href=\"https://www.thediff.co/archive/what-happened-to-working-your-way-up-from-the-mailroom/#fn1\"><sup>[1]</sup></a></li>\n<li>Kept his early business hustle under wraps.<a href=\"https://www.thediff.co/archive/what-happened-to-working-your-way-up-from-the-mailroom/#fn2\"><sup>[2]</sup></a></li>\n<li>Avoided college.</li>\n<li>Not found a company where there&#8217;s a career track that starts at &#8220;unskilled worker earning subsistence wages&#8221; and somehow has a path to the top.</li>\n</ul>\n<p>Another way to say that is is that you only get Sidney Weinberg stories when the market for talent is fairly inefficient.</p>\n<p>…</p>\n<p>But you can flip that around and give it a grim corollary: the measure of how efficiently talent is allocated in a society is how young you are when your dreams are crushed. A world where 99.9th percentile talent immediately gets snapped up by whichever employer can make the best use of that talent is one where 99.8th percentile people learn early on that they just don&#8217;t have what it takes.</p>\n<p>…</p>\n<p>There is still a path for dropouts with few legible skills to work their way up to the top of a Fortune 500 company: start at the top, and stick around until your company is on the Fortune 500.</p></blockquote>\n<p>I think this is mostly a case of romanticizing a path that was never great in the first place. It’s not that it is impossible to ‘work your way up’ in this fashion, if you actually are good enough that you would deserve it, it’s that if you could impress enough to actually pull it off working your way up then you have much better paths, with or without going through college. That’s also largely about the great news that we have much better skill and reputation transfer, so you’re not permanently at the mercy of the firm and your boss.</p>\n<p>I also very much don’t think it means your dreams die quickly if you are ‘only’ 99th percentile or 99.8th percentile talent. A hypothetically perfect sort where relative talent is static would do that, but neither half of that is true. Nor do you get locked out of most ‘dreams’ worth having if you get somewhat off track. There are certainly some that do have strict tracks, but they are that way because they are oversubscribed and mostly generic dreams and even then you mostly have redraws if you care enough.</p>\n\n\n<h4 class=\"wp-block-heading\">While I Cannot Condone This</h4>\n\n\n<p>John Wentworth offers <a href=\"https://www.lesswrong.com/posts/naAeSkQur8ueCAAfY/generalized-hangriness-a-standard-rationalist-stance-toward\">Generalized Hangriness: A Standard Rationalist Stance Towards Emotions</a>. Being angry because you are hungry means your anger is ‘wrong’ in its explicit claims, but it contains the useful information that you are hungry. Thus, the correct stance towards experiencing an emotion is to ask what information it actually provides you. A strong emotion is trying to tell you something is important, but you have to figure out what is the proper something.</p>\n<blockquote><p>Elizabeth: <a href=\"https://slatestarcodex.com/2014/03/24/should-you-reverse-any-advice-you-hear/\">For readers who need the opposite advice</a>: I don&#8217;t think the things people get hangry about are random, just disproportionate. If you&#8217;re someone who suppresses negative emotions or is too conflict averse or lives in freeze response, notice what kind of things you get upset about while hangry- there&#8217;s a good chance they bother you under normal circumstances too, and you&#8217;re just not aware of it.</p>\n<p>Similar to how standard advice is don&#8217;t grocery shop while hungry, but I wouldn&#8217;t buy enough otherwise.</p>\n<p>You should probably eat before doing anything about hangry thoughts though.</p>\n<p>Benquo: Unless you&#8217;ve observed that you tend to unendorsedly let things slide once you&#8217;re fed. In that case, better do something about the problem while you&#8217;re hangry.</p></blockquote>\n<p>I would generalize this even further than Ben Pace does here:</p>\n<blockquote><p>Ben Pace: This rhymes with how one treats feature recommendations from users. It is typically the case that a user advising you to make a change does indeed have a problem when using your product that they&#8217;re trying to solve, and you should figure out what that problem is, but their account of how to solve it (what &#8216;improvement&#8217; to make) is usually worth throwing out the window.</p></blockquote>\n<p>Emotions also have practical effects beyond their information content, so you want to watch out for and optimize those as well. One aspect John does not get into is that you need not take your emotional responses as givens.</p>\n<p><a href=\"https://www.lesswrong.com/posts/xPrL2xF9iYWpPmu6B/my-empathy-is-rarely-kind#7YscAPfjLYKdMP9qh\">John Wentworth also notes that his empathy is rarely kind</a>, that trying to imagine things from someone else’s perspective can easily lead to the exact opposite of empathy if you would then view their decisions, in particular their lack of effort or willingness to apply effort to fix things, with disgust. Several comments point out that this could be seen as a failure to model their actual cognitive state, but why should we presume that should lead to empathy? The general case version of this resonates with me quite a lot.</p>\n<p><a href=\"https://x.com/rSanti97/status/1952418353307427139\">Diverse workforces do not seem to lead to greater (or lesser) profits</a>, and the supposed McKinsey study people keep citing to claim the contrary, as far as we can tell, fake.</p>\n<blockquote><p>Santi Ruiz: The McKinsey study that claimed diverse workforces lead to bigger profits was always fake (they won&#8217;t share data, it doesn&#8217;t replicate for the S&amp;P 500 or other settings, and it doesn&#8217;t make sense). But fake social psych research is a demand problem, not just a supply problem.</p></blockquote>\n<p>I disagree that the finding doesn’t make sense. Like many things in social psych, you can tell a plausible story of effects in either direction, or of no effect.</p>\n<p><a href=\"https://tropicsofmeta.com/2025/08/01/jury-in-a-box-justice-and-democracy-in-georgias-dekalb-county/?utm_source=substack&amp;utm_medium=email\">A firsthand report of a jury trial (for molestation) in Georgia</a>.</p>\n<p><a href=\"https://x.com/CJHandmer/status/1952977599464165684\">True story</a>:</p>\n<blockquote><p>Patrick McKenzie: I think many people would be surprised at the difficulties billionaires have in converting money into smart people and/or their outputs.</p>\n<p>C<a href=\"https://x.com/CJHandmer/status/1814819893092753427\">asey Handmer</a>: It is so hard that for essentially anything non trivial it still has to be done personally.</p>\n<p>The examples of this are too numerous to count. Musk&#8217;s companies could not have succeeded unless he was in the driver&#8217;s seat for much of the time. By contrast, Google X, Virgin rockets, Blue Origin all had the best people and tech that money could buy &#8211; but it wasn&#8217;t nearly enough.</p>\n<p>I see this on an almost weekly basis now. Anything sufficiently interesting is not fungible in money. The supply is extremely inelastic.</p>\n<p>You must have an army of stringently curated and boldly led mechanical engineers.</p></blockquote>\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5279403\">Paper offers a bizarre thesis</a>, that algorithmic collusion between sellers on a platform like Amazon helps consumers because they collude to lower advertising costs and this outweighs the effect of colluding directly on price. I notice my skepticism because if within-platform ads raise less revenue the platform should reclaim those costs via higher commissions, which should raise prices by the same amount. I note that o3 thought that there wasn’t room for Amazon to do this, but that’s weird.</p>\n<p><a href=\"https://model-thinking.com/p/the-sun-never-leaves\">Did the UK’s dominance fail because of emigration away from the home islands</a>? The argument here is that developed economies don’t diverge that much on GDP per capita, but I don’t think this means the UK keeps similar GDP per capita in the alternative world, especially if we’re not on the margin and talking about 200 million people living there. The OP admits those people staying home would be a loss of welfare but I also assume it would have made the UK a lot poorer and also that population would have balanced largely in other ways.</p>\n<p>A much better and simpler story is that the UK home islands simply didn’t have enough land and natural resources, which is why there was so much emigration in the first place? Europe was never going to be able to sustain its economic advantages indefinitely.</p>\n<p>And of course in recent times, the UK has been dying mostly of self-inflicted wounds, such as effectively banning the construction of housing, and now the saying of words.</p>\n<p>An excellent point:</p>\n<blockquote><p><a href=\"https://x.com/ByrneHobart/status/1954733058998898745\">Byrne Hobart</a>: An interesting corollary to this is that the more words it takes for someone to explain a concept to you, the greater the proportion of jobs you&#8217;ll dismiss as &#8220;bullshit jobs.&#8221; I&#8217;ve observed this, too!</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!C2WA!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8a40a464-d293-4d62-8b75-e5ad237b57f8_573x696.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Note that the jobs here could be described in three words just fine, all you have to do is lose a little detail, on the level that ‘I catch fish’ simplifies fisherman. He doesn’t catch all fish everywhere, after all.</p>\n<ol>\n<li>Software sales analyst.</li>\n<li>Improve automated capabilities.</li>\n<li>Create blockchain recorders.</li>\n</ol>\n<p>Only three words is largely about negative space. Observe these job descriptions I brainstormed quickly:</p>\n<ol>\n<li>Sit at desk.</li>\n<li>Let boss yell.</li>\n<li>Fetch the coffee.</li>\n<li>Pitch investors.</li>\n<li>Diversity training monitor.</li>\n<li>Cash the check.</li>\n</ol>\n<p><a href=\"https://x.com/RizomaSchool/status/1954693752557011232\">Also some good ones in the replies</a>, like ‘I send emails’ or ‘creating shareholder value.’</p>\n<p>Also note that it’s ‘if you can’t do it, it’s bullshit’ not ‘if you can do it, it’s not bullshit.’</p>\n<p>Why does the trick still mostly work? Because the fact that you have a bullshit job predicts not that you can’t describe it in three words, but that you will choose not to.</p>\n\n\n<h4 class=\"wp-block-heading\">Predictions Are Hard Especially About The Future</h4>\n\n\n<p>Polymarket is on its way back to (being fully legal in) America, baby!</p>\n<blockquote><p><a href=\"https://x.com/shayne_coplan/status/1947322129654927465\">Shayne Coplan</a>: Polymarket has acquired QCEX, a CFTC-regulated exchange and clearinghouse, for $112 million.</p>\n<p>This paves the way for us to welcome American traders again.</p>\n<p>I&#8217;ve waited a long time to say this:</p>\n<p>Polymarket is coming home <img alt=\"🇺🇸\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f1fa-1f1f8.png\" style=\"height: 1em;\" /><img alt=\"🦅\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f985.png\" style=\"height: 1em;\" /></p>\n<p>Owning a DCM and DCO will let us serve all American traders and brokerages.</p>\n<p>This acquisition isn&#8217;t just about a license; it’s Polymarket&#8217;s homecoming, returning stronger and ready to serve American users once again.</p></blockquote>\n<p>The best part about this is that this comes on the heels of the BBB plausibly making professional sports betting essentially illegal in America, since you can only deduct 90% of losses while being taxed on 100% of gains. If that is applied to individual wagers, then no one has an edge big enough to overcome it, so gamblers would have to either give up the gambling or give up on paying their taxes.</p>\n<p>But if you buy a sports futures contract under CFTC rules, then you get normal tax treatment, and you’re back in business.</p>\n<p>This could all end up being a blessing in disguise. The current licenced sportsbooks in America offer highly non-competitive pricing, focus on pushing you towards predatory behaviors and products, and aggressively limit winners. Once Polymarket gets sufficient liquidity, trading there is remarkably cheap, and you are naturally pulled towards behaviors that have little cost even if you are betting at random.</p>\n<p>However bad you think companies like FanDuel are, they’re worse.</p>\n<blockquote><p><a href=\"https://x.com/ButlerBets/status/1953553510739689533\">Ryan Butler</a>: FanDuel reports 16.3% sportsbook gross gaming revenue margin in June, the highest mark in company history</p>\n<p>This is roughly triple Nevada sportsbooks&#8217; historic hold percentage from before FanDuel launched its book in 2018.</p></blockquote>\n<p>There is no way to make 16.3% profit on wagers in general without being deeply, deeply predatory, even if all of your customers are suckers. Someone betting a normal NFL line fully at random only loses 5%.</p>\n\n\n<h4 class=\"wp-block-heading\">Good News, Everyone</h4>\n\n\n<p><a href=\"https://x.com/Bangershell11/status/1946616188727136691\">Argentina’s salaries outgrow profits as share of GDP</a>, despite the fact that real public sector wages have been falling.</p>\n<p>Whenever there is <a href=\"https://x.com/Duderichy/status/1946099435701727707\">a graph that blows your mind every time you see it</a>, chances are good it turns out to need a correction. Despite that, the corrected graph (the one shown below) is still rather mind blowing.</p>\n<blockquote><p>The Rich: people have no idea what life was like before they were born</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!cVCK!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F84a923ae-c5ac-4c8d-b4bf-5cbbf9d26168_1079x597.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>If a statistic or claim sounds absurd and wrong, <a href=\"https://x.com/IsaacKing314/status/1950997879797195038\">you can check the sources</a>. Often this reveals the whole thing was bogus. Thread has some examples, several of which I can confirm because I too checked the sources or otherwise know the story.</p>\n<p><a href=\"https://viewfromthewing.com/83-billion-wasted-showing-up-at-the-airport-3-hours-before-your-flight-is-a-system-failure-no-ones-trying-to-fix/\">We could stop spending so much time at airports</a> simply by <a href=\"https://marginalrevolution.com/marginalrevolution/2025/08/time-theft-at-the-terminal.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=time-theft-at-the-terminal\">not telling people to spend so much time at airports</a>. Who is telling people to get there 2.5-3 hours before their flights? Why in the world? I am in the ‘never miss a flight’ camp, and even then one hour is fine if it is reliable (e.g. you are taking trains).</p>\n<p>Remember those claims that gas stoves caused large increases in asthma cases? <a href=\"https://x.com/cremieuxrecueil/status/1952477793570464237\">That study had a major conflict of interest and also didn’t hold up</a>, once corrected the impact was not significant.</p>\n<p>You can identify outlier people by <a href=\"https://x.com/oyhsu/status/1954656313935376487\">noticing you cannot predict what they are going to say next</a>. That is not always good, but it often is very good. Whereas most people rarely break out of predictable scripts. Which in many circumstances is also good.</p>\n\n\n<h4 class=\"wp-block-heading\">For Your Entertainment</h4>\n\n\n<p><a href=\"https://x.com/mattyglesias/status/1948689826095792513\">The theory that all the abundance and YIMBY progress can largely thank the MCU version of Thanos</a>, as in Marvel finally making a Population Bomb Guy the villain.</p>\n<p>Whereas yes, a large portion of children’s media has been for decades or more straight up eco propaganda and says the ultimate evil is humans wanting to build and do things, or even wanting to exist.</p>\n<blockquote><p><a href=\"https://x.com/romanhelmetguy/status/1946060144283967757\">Roman Helmet Guy:</a> “Remember that the Earth’s resources are limited. You do not need to have a big family, because all the world’s people are your brothers and sisters.” You live in the most propagandized society in history.</p>\n<p><a href=\"https://x.com/JTLonsdale/status/1946667889689538573\">Joe Lonsdale</a>: A top kids’ show for much of the ‘90s had Malthusian / anti-natalist, globalist nonsense alongside its eco proselytizing.</p>\n<p>It’s not a coincidence; if you go into its main backer Ted Turner’s office, a huge painting has his head in the sky, nearby a US flag turned into a UN flag.</p>\n<p><a href=\"https://x.com/CharlesFLehman/status/1946670422574997615\">Charles Fain Lehma</a>n: As my older son moves on from picture books, it&#8217;s stunning to me how much children&#8217;s media is just non-stop eco propaganda. &#8220;Humans are bad for the earth, you should feel guilty about this&#8221; is the constant message.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1946677633854345521\">Matthew Yglesias</a>: Paisley Paver did nothing wrong.</p></blockquote>\n<p>It is getting a lot easier to avoid. There is so much to choose from, so you don’t get whatever is on broadcast TV forced upon you, and similarly you can filter the books, and also the broader marketplace seems to be pulling things back. It’s still rough out there.</p>\n<p>I love that yes, <a href=\"https://www.washingtonpost.com/style/2025/07/24/south-park-trump-episode-paramount-season-27-premiere/\">Trey Parker and Matt Stone can indeed keep getting away with this</a>, and I love that Trump’s response to being attacked like this was to accuse the left of hypocrisy for being happy about it. That’s the spirit.</p>\n<p><a href=\"https://www.washingtonpost.com/opinions/2025/07/23/stephen-colbert-late-show-cancellation/\">Megan McArdle on the cancellation of Steven Colbert’s The Late Show</a> as reflecting the loss of shared culture. She oddly ties this to the extra 99 minutes a day we don’t leave the house, which historically was how people ended up watching late night, but now we watch more tailored content. Which in general is an improvement.</p>\n<p>I do think there have been some fantastic late shows that I was happy to watch, in particular Taylor Tomlinson’s After Midnight and previously Craig Ferguson’s Late Late Show, or early Daily Show and Colbert Report, but I found most late shows bad and essentially unwatchable. That includes Colbert’s Late Show run, and I’m actually really happy for him to get a new show or podcast instead where he can do more interesting things. Free Colbert, as it were.</p>\n<p><a href=\"https://panamaplaylists.com/\">The Panama Playlists</a>, see what various people listen to. Remember that Spotify playlists are public by default.</p>\n<p><a href=\"https://www.wsj.com/lifestyle/travel/now-you-can-travel-for-less-by-buying-someone-elses-vacation-a41c3648\">You can buy nonrefundable vacations from other people at a discount</a>, typically 20%-30%, sometimes more especially with a last minute sale. According to WSJ’s Mark Ellwood the top sites that do this are legit and guard against fraud, pointing to <a href=\"https://sparefare.net/\">SpareFare</a>, <a href=\"https://www.roomertravel.com/\">Roomer</a>, <a href=\"https://www.planschange.com/\">Plans Change</a> and <a href=\"https://www.transfertravel.com/\">Transfer Travel</a>, and on the high end <a href=\"https://eluxit.com/\">Eluxit</a>.</p>\n<p>A discount does not mean a ‘good deal.’ Vacation markets are super duper inefficient. But also these are going to mostly be forced sellers, without natural buyers, and buyers might have gotten discounts to begin with by booking in advance, so if you can figure out what is a good deal (use AI for this?) you can probably find pretty good bargains.</p>\n<p>The best part is that you have to buy one of a small number of particular packages. You avoid choices, and as we all know Choices Are Bad. Instead of comparing this vacation to all possible choices, and sweating planning and decisions, you take what is available and you show up and that is it. If something isn’t a great fit for your preferences, you have an excuse to go outside your comfort zone and you don’t feel like you punted. It actually sounds nice.</p>\n\n\n<h4 class=\"wp-block-heading\">Game Theory</h4>\n\n\n<p><a href=\"https://www.lesswrong.com/posts/3xjgM7hcNznACRzBi/the-jackpot-age\">Thiccy Thot calls this ‘the jackpot age,’</a> with people not valuing survival or optimizing for mean results like they should, and urges people not to chase jackpots. As an illustration he offers this game, which is effectively a St. Petersburg paradox variant. The EV on each flip is great but the more you flip the more likely it is that you lose.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!WvK7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9d129b0d-f4b9-446f-9296-df483bb6eb52_1162x932.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Assuming I cannot hedge the flip and no tax implications? I do notice I am past the point where I would flip, the marginal value of money is declining too rapidly.</p>\n\n\n<h4 class=\"wp-block-heading\">Gamers Gonna Game Game Game Game Game</h4>\n\n\n<p><a href=\"https://www.tcgplayer.com/content/article/Should-MTG-s-Vivi-Ornitier-Be-Emergency-Banned-in-Standard/c6cac280-dde2-4fef-bea4-89d5a0f70efa/\">Should Magic: The Gathering emergency ban</a> either Agatha’s Soul Cauldron (galaxy-level move) or Vivi Ornitier (safe and obvious play), or accept that all the good players in Standard will be playing the same deck until the next window?</p>\n<p>There is a long history in Magic of players discussing the need for emergency bans, and then mostly not getting such bans, as Wizards has placed very high value in sticking to its announcement windows outside of true emergencies. They’ve shown time and again they’d rather let Standard wither and be terrible for months on end. Usually there is a lot of talk about letting the players find a solution, long after it is clear that there exists no solution.</p>\n<p>I have long disagreed with this policy. I disagree with it even more today, as information is found and spreads faster and there is tons of statistical data. Drop the ban hammer. Do it now.</p>\n<p>Chess.com has a team of 30 people that <a href=\"https://kotaku.com/chess-cheaters-100k-banned-monthly-chess-com-anal-beads-1851786443\">ban 100,000 accounts per month for cheating and unfair play</a>, 40% of the accounts get banned within their first two weeks. The article presumes this means they are doing a good job catching cheaters, but even if you assume minimal false positives that is not obvious. If we were doing a better job catching cheaters presumably people would be doing it less?</p>\n<p>Optimization for thee but not for me, I insist:</p>\n<blockquote><p><a href=\"https://x.com/JoINrbs/status/1945812347815387575\">Jorbs</a>: looked something up about a game and someone posted that you should resolve an issue a certain way unless &#8220;you enjoy making suboptimal decisions&#8221; and that is such a funny thing for a human who spends their time answering rules questions on forums for board games to write.</p></blockquote>\n<p>Clair Obscura Expedition 33 continues to go well as I move into Act 3, despite some frustrating design mistakes.</p>\n<p>One that I’m rather annoyed by is that at some point (not a meaningful spoiler) there is a character you pick that the game is telling you that you need to have in your party or they won’t learn their skills, similar to for example a Blue Mage in Final Fantasy V. I find this really annoying because that’s not who I enjoy having in the party on an aesthetic level, but it feels bad missing out, and even worse not knowing if any given battle is a place you would miss out. Grr. I’ve mostly decided I don’t care.</p>\n<p>Even if you ignore that issue, the way upgrades work, both with Color of Lumina and weapon upgrades, effectively locks you into a party. I chose Luna and Maelle because I find that fun and more central to the plot. I’m happy with my choices but sad that the game punishes experiment like this.</p>\n<p>Another main complaint is that balance is often lacking. Decisions that should be interesting instead feel forced. There’s also a big ‘too awesome to use’ problem with certain resources, especially Color of Lumina.</p>\n<p>My biggest complaint is that it is very easy to get turned around, or for it to be otherwise unclear how to move on to the next area. Several times I have been extremely frustrated and effectively stuck, including right now as I type this inside the monolith. I am fine with navigation as an interesting puzzle or decision, but this does not feel like that.</p>\n<p>There are a bunch of things in Act 3 that are deeply confusing or rediculous, but all of them seem highly optional. If you want to go completionist that’s your call.</p>\n<p><a href=\"https://mail-attachment.googleusercontent.com/attachment/u/0/?ui=2&amp;ik=8393096aec&amp;attid=0.1&amp;permmsgid=msg-f:1839195321748926758&amp;th=198622669167b126&amp;view=att&amp;disp=inline&amp;realattid=f_mdru4agh0&amp;zw&amp;saddbat=ANGjdJ-jOjNsQJcTQkT4qavkGv0jxmcKFIcGsSbhedhc_HoA50JUb1zDMePa-vQuBddimJhupXu2AUFoKlbfzzrRJ8UIuJs27dmm1aNUFCDK8IXkdVIEQCs7MGzjLAax3F4DM8kdga7MdPayOG6ruk6kbCRbWKTJVhxOP_qaOObA6HX15RRGQtKhAUueh6hEWuz64ER2khr14e5OknxITeISuGJuA6eeVijtOfCunLIslKBK0G-w7JFa1BIt6LbgLx_60rK8M5s-g81Vl1yyLQfCOSsUCgTNdY0HewY7pcNBbpUUyDpE_pDATooBehH_SCsFFtgQbwoA-VL6XZ1DFNc4re7EDOCevaCMG02Ma7bgg_aFO8M-CSOGgyxWsQC34wSqPE16lWpTj9jw87wiDvlFOkhrfnViaJhDvv6_GWgnFSRBKtf15PS3vv1LTKHHMFOfnPai0bTkDcR6ZEyo7QA6989LG0YGVOplLwO7nnsxTB2dhuxu_epbTX-r3e9BoYKixYvVSP80Nx_YsdrXrtO0cnh3Hfz2g_G24fifN37vFGh2ChQOE7H_wwYvVqkzUaSJJBhBYEbsP26gEaVDf8xlO9mdcfpfI4W6fazQtM5ARH_8o8UworZvbeTnwbW3djpXc01puxGzclUdfSWESWeWXoaqCWt4WzBAu1yTDPakmI-N4bqCcW5pXSmCW1z-Tg0P2okctLCEFPZQgIySMy5e4zDYFwmLYt65Jtyky5WBGGCIAIgTbNKQIx-qZP19iz58nTbtdypUcGYZCJR2WRNFKbfMMuavDkmCTNDizaZpYT0irz29qImShqFIz5Uf0BtXo_EdQxKMT8I0GKWbXhuOdN_6OKSkM9zQ-gR8GJ3_CCouAkaBRFbS_rMujwValQe-Wp0BdYD7f-HsbaL83kXK40SjODkVvdP8QlwDVAa10ajDO-gLYYjmVPGCnr-4uW1AqLkas7_1VmRxFpvpKCSWvCOTPXHETCsU475Z9AF4WQuXE1d7GQAMIcCpNSaFKhz22Aj8cyCu6nS1N0EB7wCKEK6IWvJpPJAAhYkWIg\">I think I largely buy this argument that one job RPGs</a> have big advantages over RPGs where you choose your class. They can do a lot more fun customization.</p>\n<p><a href=\"https://www.rockpapershotgun.com/itchio-apologise-for-frustration-and-confusion-after-delisting-thousands-of-nsfw-projects\">Itch.io apologises after, to satisfy its payment processor, nuking thousands of WSFW games with no notice</a>. Those who have purchased the games report they cannot download them and no refunds are being offered, although <a href=\"https://x.com/itchio/status/1948446679788888275\">itch.io claims they can still be downloaded</a>. Payouts are halted. <a href=\"https://itch.io/updates/update-on-nsfw-content\">Itch.io claims the delistings will mostly be temporary and can be individually cured once they get their new house in order.</a></p>\n<p><a href=\"https://www.rockpapershotgun.com/major-payment-firm-behind-itch-adult-game-cull-say-they-themselves-face-restrictions-from-another-banking-firm\">Then it turns out Stripe is only clamping down</a> because their own banking partner is threatening to clamp down on Stripe, and they are themselves seeking a way out.</p>\n<p><a href=\"https://x.com/ediskrad327/status/1948280918210134422\">To summarize</a>, this keeps happening:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!73eD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc0649df7-2f9e-4e31-8ada-08734f1868bb_528x490.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>To be fair to itch.io, they are over a barrel and do intend to bring the banned games back. <a href=\"https://www.rockpapershotgun.com/itchio-are-seeking-out-new-payment-processors-who-are-more-comfortable-with-adult-material\">They are looking for a new payment processor as a way out</a>.</p>\n<p><a href=\"https://www.reddit.com/r/Steam/comments/1mkha72/russ_vought_is_behind_the_latest_push_threatening/\">It seems Ross Vought might be behind all this</a> push, including a general push to effectively ban pornography?</p>\n<p><a href=\"https://x.com/woke8yearold/status/1948556073272529343\">Worlds Beyond is doing amazingly well for Magic: The Gathering</a>. Final Fantasy made them $200 million in one day, and doing far better than any previous set, so much so that they could not meet demand. I didn’t love the flavor details of many of the cards, clearly the market disagrees or cares little, and everyone says the limited format is great.</p>\n<p>Even Lord of the Rings took six months to get to that point, and that set is still selling several years later. Spiderman is up next. They see Japan as a ‘potential gold mine’ for more material.</p>\n<p>Perhaps this was always the endgame for Magic. We had decades of our own storylines and worlds, but once Magic went sufficiently big and mainstream and moved away from competition and two-player games towards Commander, being the meta-IP for all of fantasy (and perhaps beyond it) makes too much sense, and it will only feed on itself until and unless it wears the product out.</p>\n<p>This also seems like a solution for running out of design space. There’s no shame in it after three decades. Magic has mostly fully mined the simple stuff that works, forcing complexity to drift higher and the mechanics that work are getting continuously recycled, even if they get new names. If you want to have higher complexity and repeat mechanics forever, top down is where it is at.</p>\n<p>Boen seems largely correct here:</p>\n<blockquote><p><a href=\"https://x.com/BOENSAW/status/1955097686618878161\">Boen</a>: we used to joke about this, but gambling mechanisms, metagame progression, interaction extenders, timewasting filler etc has all become so commonplace that most people genuinely just think that that&#8217;s what videogames are now &amp; get confused/angry when you say that stuff is bad.</p>\n<p>&#8220;metagame progression&#8221; is specifically like call of duty where a leveling system strings players along with little upgrades to keep playing. many stop after reaching max lvl, which betrays the fact that the &#8220;real game&#8221; is unfortunately shallow and boring absent external incentive</p>\n<p>Andre Treiber: I’m with you on a lot of these, but I actually really enjoy meta progression as a mechanic. I really enjoy roguelite experiences and unlocking new things and making old challenges grow trivial is a rewarding part of the gameplay.</p>\n<p>Boen: Yeah there&#8217;s some subtlety here. I think that the type of thing people mean by &#8220;meta progression&#8221; in the context of roguelikes and stuff like that, is actually much more akin to regular game progression, not meta at all, which is of course a pillar of game design &amp; not a problem.</p></blockquote>\n<p>Roguelite metagame progression can be very good. I especially like it when you are unlocking additional abilities over time while you are not close to winning the run, and when the amount of progression you make determines what you unlock and is part of strategic decision making.</p>\n<p>What annoys me quite a bit are situations in which you are reliably winning runs, there are higher difficulties that would be interesting, and the game wastes a bunch of your time getting to them. The worst version of this is when you are winning your runs but also unlocking capabilities faster or almost as fast as the extra difficulty kicks in, so the game doesn’t get harder for a long time and you’re skilling up on top of that. The central example of this I remember is Roguebook.</p>\n<p>The other stuff is really terrible. The thing is, you could simply not do these things? Unless you are getting them on microtransactions there is no real advantage to keeping a player playing Call of Duty for 100 hours instead of 50 hours, not having any fun. Many games are using these techniques without the microtransactions. Stop it.</p>\n\n\n<h4 class=\"wp-block-heading\">I Was Promised Flying Self-Driving Cars</h4>\n\n\n<p>As per Manifold, <a href=\"https://manifold.markets/JoshYou/how-many-paid-driverless-waymo-ride\">current expectations are for roughly 600k Waymo rides per week by EOY 2025</a>, and perhaps 1.5 million per week by EOY 2026. I’m definitely sad we cannot go faster.</p>\n<p><a href=\"https://www.understandingai.org/p/unions-want-to-ban-driverless-taxiswill\">Boston’s unions attempt to ban driverless taxis</a>, because They Took Our Jobs. The statements at the debate were even more absurd than I expected, which is on me.</p>\n<blockquote><p>Timothy Lee: Mejia considered it “very triggering” for Waymo to use the term “driver” to describe a technology rather than a person.</p>\n<p>…</p>\n<p>City Councilor Benjamin Weber found it “concerning to hear that the company was making a detailed map of our city streets without having a community process beforehand.” He added that “it’s important that we listen when we hear from the Teamsters and others who feel as though they’re blindsided by this.”</p>\n<p>“I think it’s important that we pause—sometimes we rush—and make sure everyone’s voice is heard before anything happens that we can’t turn back from and that protections are in place for our workers,” said City Councilor Erin Murphy.</p>\n<p>The next day, Murphy <a href=\"https://erinforboston.com/f/ordinance-opposing-deployment-of-autonomous-vehicle-operations?blogcategory=Public+Safety\">announced legislation</a> requiring that a “human safety operator is physically present” in all autonomous vehicles—effectively a ban on driverless vehicles. Given the near-unanimous hostility Waymo faced at the hearing, I wouldn’t be surprised if Murphy’s proposal became law in Boston.</p></blockquote>\n<p>There is good news elsewhere:</p>\n<blockquote><p>On the other hand, legislators in <a href=\"https://www.axios.com/local/washington-dc/2025/07/16/driverless-cars-dc-bill-waymo-robotaxis\">Washington DC</a> and <a href=\"https://www.nysenate.gov/legislation/bills/2025/S344/amendment/A\">New York State</a> have introduced bills to open the door to driverless vehicles—though it’s not clear if these bills will become law. Legislators in New Jersey, Maryland, and Virginia could also act on driverless vehicle technology in the next year or two.</p></blockquote>\n<p>Timothy Lee, who is an expert at following developments here, fears that blue states and cities might indeed ban self-driving cars, and we could get to a 2035 where red states had tons of autonomous vehicles and blue states and cities have none.</p>\n<p>It is not impossible, and certainly some amount of delay is in general likely, but I think we are going to win this one rather easily over time. It is impossible not to notice how much Waymo has improved San Francisco and other cities, and how much more it will improve it when supply goes up and thus costs and wait times go down. The lifestyle impact is dramatic and I do not expect the public in blue cities to accept being left behind.</p>\n<blockquote><p><a href=\"https://x.com/AlecStapp/status/1953638284170867166\">Alec Stapp</a>: We should be much more explicit about the tradeoff here:</p>\n<p>The Teamsters are demanding that we let thousands of people die in car crashes in order to protect their jobs.</p>\n<p><a href=\"https://x.com/cafreiman/status/1953570433699393761\">Chris Freiman</a>: When Teamsters try to block life-saving technology to protect their jobs.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!TJru!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fba3362a0-4e67-4895-ba62-38bd0d58ebc8_640x480.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Alec is not wrong about self-driving cars preventing deaths, yet I would prefer to not make that the main argument. Quite often the protectionist laws, including union rules and things that destroyed childhood in America, are imposed in the name of that same ‘otherwise people will die’ style of rhetoric. What we should focus on are the far more important and massive other transformative benefits.</p>\n<p>The jobs that they are trying to ‘protect’ are worse than useless. We would be requiring that people be paid to sit in cars and drive them all day, mostly not enjoying doing this or otherwise benefiting, doing the task worse than the AI could, in order to justify a transfer of wealth to those people.</p>\n<p><a href=\"https://www.rstreet.org/commentary/america-drives-act-addresses-need-for-a-national-autonomous-vehicle-policy-framework/\">Adam Thierer, together with Mark Dalton</a>, proposes Federal-level regulation on self-driving, allowing Level 4-5 automated driving systems (ADS) nationwide under a new safety framework under the extremely poorly named ‘<a href=\"https://fong.house.gov/sites/evo-subsites/fong.house.gov/files/evo-media-document/fong_010_xml.pdf\">America Drives</a>’ act (since this involves America not driving, that is the entire point).</p>\n<p>The parallels and contrast to the insane AI moratorium are obvious, with concerns about ‘patchworks of state and local laws’ and localities doing crazy things like requiring a human driver be present as per Boston above.</p>\n<p>Here I am fully on board. We know what self-driving looks like and do not expect it to change in unexpected ways. We are creating a new federal standard and set of regulations that would work well. We have extremely strong evidence that expanding self-driving increases safety and saves lives. We also do not have to worry about existential or catastrophic risks, or that things could develop to a point where our mistakes could not be fixed once we notice them.</p>\n<p>Whereas all these considerations go the other way with respect to AI.</p>\n<p><a href=\"https://x.com/Tesla_AI/status/1950779736365686890\">This below would be quite the exciting area to cover</a>. I am curious how they got (if they got?) permission to cover SFO and cross the bridges and such.</p>\n<blockquote><p>Tesla AI: Invites to our Bay Area ride-hailing service are going out now</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!FcnK!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8036a68e-9557-4f6e-b809-1deea8937d9f_1219x2048.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">Sports Go Sports</h4>\n\n\n<p>I’ve taken a break, but I’m hoping to make my comeback as per usual in September. Football! Football! Football! Football! Football! Football! Football! Football! Football!</p>\n<p><a href=\"https://www.sbnation.com/college-football/2025/7/17/24469317/president-trump-nil-executive-order-college-football?utm_campaign=dhtwitter&amp;utm_content=%3Cmedia_url%3E&amp;utm_medium=social&amp;utm_source=twitter\">Trump reportedly is going to sign an executive order to limit NIL money for players</a>? Funny how he thinks he can just order things to happen like this.</p>\n<p><a href=\"https://www.wsj.com/sports/football/nfl-kickoff-rules-strategy-effff496?mod=wknd_pos1\">NFL teams are trying out bizarre angled kickoff strategies</a> now that a touchback puts the ball all the way at the 35 yard line. This sounds like it would have been great last year too, which highlights how often there are big gains lying around that no one bothers to try and exploit until they are forced into it, even in places like the NFL.</p>\n<p><a href=\"https://stratechery.com/2025/netflix-earnings-apple-and-f1/\">Apple is trying to get the rights to Formula 1</a>, <a href=\"https://www.nytimes.com/athletic/6489201/2025/07/11/f1-tv-rights-apple-espn/\">bidding substantially higher than ESPN</a>. Reportedly MLS regrets making a similar deal, as dealing with Apple causes fewer people to watch the games, which is a risk for F1 although I agree with Ben Thompson that no one was watching much of MLS anyway.</p>\n<p>I suspect it works the other way around. More and more households are giving up cable. If you are want to watch F1 and are told you need a cable package you would not otherwise get, that is super expensive. Apple TV is a lot cheaper and you can flip it on and off as needed.</p>\n<p>Where I have a bunch bigger concern is the interface. It is absurdly terrible. They don’t give you an easy way to find what you want. When they do, they ruin it. I went to watch a Mets game on Apple TV and the icon for the game in question literally spoiled the final score, prominently, on purpose. Well, so much for that, and I think that played a substantial part in me giving up on watching the Mets this season.</p>\n<p>The better question is, shouldn’t they be making a deal with Netflix? F1 has grown so much lately because of Drive to Survive. The synergies there seem fantastic. Netflix is optimizing for engagement and working on selling ads, and has a larger viewing base, so they should be happy to double down and match the $120m-$150m per year bid.</p>\n\n\n<h4 class=\"wp-block-heading\">Antisocial Media</h4>\n\n\n<p>On the one hand, I stand by the claim that most of the moral panics about social media were directionally accurate. Social media wrecked quite a lot of things.</p>\n<p>I agree that some of the accusations in hindsight <a href=\"https://www.conspicuouscognition.com/p/the-case-against-social-media-is\">went too far</a>, and we should be skeptical of claims of the form ‘social media broke America,’ the same way you should be skeptical that television ‘broke America,’ or even that America is broken at all. I still think it is clear there are quite a lot of downsides at the personal and societal levels.</p>\n<p>On the other hand, we should not dismiss the upsides. It really is much easier to meet, keep up with, talk with and coordinate with your friends. Our access to information of all sorts is vastly better if you know how to filter it. I couldn’t do what I do in this form without Twitter. They took a lot from us, but we got a lot in return.</p>\n<p>A lot of this comes down to whether what they took from us was good, actually. Do you actually want to socialize with the people who happen to be physically proximate? Do you actually want to invest the required time?</p>\n<blockquote><p><a href=\"https://x.com/tenobrus/status/1948193779896467657\">Tenobrus</a>: everybody&#8217;s in the replies like &#8220;but i found all my communities and friends with social media!!&#8221; sure but the counterfactual isn&#8217;t u being isolated, it&#8217;s returning to the era where irl socializing was common and easy and ur best friend was some guy u met in a park.</p>\n<p>Social media is largely what *caused* all that to fail. it created the problem it&#8217;s now &#8220;solving&#8221; for you.</p>\n<p><a href=\"https://x.com/tracewoodgrains/status/1948256351408324806\">Tracing Woodgrains</a>: I grew up in a strong community with many opportunities for in-person socializing with the normal, pleasant people around me.</p>\n<p>As a result, I was desperately lonely until I found all the weird people like me online. my social life has been exceptionally good since</p>\n<p>There&#8217;s something to be said for that sort of community. a lot to be said for it, really! I was glad to grow up in it and there&#8217;s a lot about it that I miss.</p>\n<p>But it could never have been anywhere near as good as niche online communities for the sorts of socialization I like.</p>\n<p>Not here to call anyone &#8220;NPCs&#8221; or anything. I just have niche interests and basically only those interests, and it turns out it&#8217;s much easier and more pleasant to find conversations with people who share those interests online than in-person</p></blockquote>\n<p>Since I moved in, I’ve had a chance to meet a handful of our neighbors in this building. They are, without exception, lovely people who would be good friends. And yet, I do not invest time in trying to hang out with them, because even though they are great and we are living in the same place we (with one exception of someone I know from elsewhere where I do want to make the time but it hasn’t worked out yet) have little in common.</p>\n<p>I once met my (for about 10 years) best friend in the park. But that was because the park had a chess club.</p>\n<p>I’m still very interested in connecting with other families with kids, to help my kids make friends. And sometimes there’s a great match. But mostly? I’m good. Yes, social media caused the old system to fail. Largely that’s because the old system wasn’t great, especially for unusual people. The thing is, it still beats the hell out of nothing, or not having any friends at all.</p>\n<p><a href=\"https://newsroom.tiktok.com/en-us/rolling-out-tiktok-footnotes-in-the-us\">TikTok</a>, the illegality of which we really should enforce, <a href=\"https://x.com/_jaybaxter_/status/1950603003117064228\">to its credit institutes a Community Notes style feature</a> called Footnotes.</p>\n<p>I continue to be on the ‘For You is bad tech never use it’ side.</p>\n<blockquote><p><a href=\"https://x.com/davidmanheim/status/1952273302803956158\">David Manheim</a>: Update: [Twitter’s For You feed] does provide additional interesting tweets, but I&#8217;ve decided that the cost (both engagement-maximizing bullshit rabbit holes and opportunity costs of what I&#8217;d be looking at in my other lists) is much too high.</p>\n<p>Der B: Using &#8220;not interested in that post&#8221; for engagement maximizing bullshit solves this, in my experience.</p>\n<p>David Manheim: I tried that for a month, alas. You can push against specific types, which works a bit, but the system keeps working to find some new type of discussions to hook you.</p></blockquote>\n<p>The algorithm is not your friend. Ultimately it is your enemy. Do not engage.</p>\n<p><a href=\"https://x.com/stanfordNYC/status/1954580969077215468\">Only 7% of time on Instagram and 17% of time on Facebook</a> involves consuming content from friends. They have become primarily few-to-many sharing businesses, with an emphasis on video. The question is, how much is that displacing consuming friend content versus supplementing it?</p>\n<p>I don’t love the dynamic that following someone on Twitter or elsewhere does several things at once. In addition to you seeing their posts and interactions, it is social proof for the person you follow, and also informs others about you.</p>\n<blockquote><p>David Manheim: The impact of following someone on twitter is not only to show your their content, but also (critically) it functions as social proof about them to others who follow you.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!IjRp!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa45bb36f-23c1-4796-85e0-bcc44a57ee80_286x41.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>In other contexts I’ve seen various dramas around who does or does not follow or unfollowed or blocked who on Instagram, and I presume there is fear of being caught following someone who was cancelled, it is this whole todo. Luckily in the Twitter worlds I know this gets ignored except for very high profile follows like Elon Musk.</p>\n\n\n<h4 class=\"wp-block-heading\">Stop Deboosting Links On Twitter</h4>\n\n\n<p>There are many legitimate problems to have with OpenAI but Elon Musk instead has chosen to be in a glass house throwing stones towards a brick one.</p>\n<p>Stop deboosting links on Twitter. Especially stop penalizing Substack, including any mention of the word ‘substack.’ Then maybe we can talk.</p>\n<blockquote><p>Elon Musk: Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation. xAI will take immediate legal action.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!KWQ9!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F24853fef-67f5-4832-9054-061df284a939_1013x416.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Meta AI has also briefly been #1 in the app store, so quality is also unnecessary.</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1955094792804720660\">Sam Altman</a>: This is a remarkable claim given what I have heard alleged that Elon does to manipulate X to benefit himself and his own companies and harm his competitors and people he doesn&#8217;t like.</p>\n<p>Lots has been said about this, <a href=\"https://www.platformer.news/yes-elon-musk-created-a-special-system/\">here is one thing</a> [that points out Elon Musk created a special system for showing you all his Tweets first.]</p>\n<p>I hope someone will get counter-discovery on this, I and many others would love to know what&#8217;s been happening. But OpenAI will just stay focused on making great products.</p>\n<p>Nikita Bier: Perhaps it is you who is manipulating your products to your benefit, by putting warnings on every link to a competitor?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!qu3_!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F93525f7f-f137-40d9-8cbf-b0d418b218aa_945x2048.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/devahaz/status/1955277345163464930\">Dve Hazarika:</a> I agree with Nikita that apps should not manipulate behaviors to discourage linking to other sites.</p>\n<p>jpa: they do this for every url sent in the chat text.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!93Qp!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F59db0e4f-e7d6-4c7b-be04-de6d82839097_660x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!E5oG!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F711ef579-e8ee-44e0-932b-09a7727d24e9_680x671.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>And of course:</p>\n<blockquote><p><a href=\"https://x.com/xlr8harder/status/1955143813611069527\">xlr8harder</a>: Fix the specifically targeted Substack links before you point any fingers.</p>\n<p><a href=\"https://x.com/oscredwin/status/1955218243183857980\">Andrew Rettek</a>: STOP DEBOOSTING LINKS ON [TWITTER].</p></blockquote>\n<p>Also, <a href=\"https://x.com/cb_doge/status/1955184364351897946\">when you see things like this from a highly Musk-aligned account with 1.5 million followers</a>…</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!9IZR!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4626b4df-ae00-4657-9e39-d45baf948e8c_1042x1156.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>You start to wonder how much of this is pure expression of dominance play that indicates loss of any connection to reality or the idea that words have meaning?</p>\n<p>There is a sense in which, because Elon Musk helped create OpenAI, ‘I am your father’ is not a crazy statement to make. But then that’s… bad, right? Since Elon Musk is constantly saying Sam Altman and OpenAI are terrible? And this metaphor kind of makes Elon Musk into Darth Vader?</p>\n<p>I agree this could be a growing worry, but let’s not get ahead of ourselves:</p>\n<blockquote><p><a href=\"https://x.com/SullyOmarr/status/1955307952623194160\">Sully Omar</a>: Good chance the internet becomes *extremely* closed in the next few years.</p>\n<p>We already see it with x/openai/anthropic (and most social media companies) where they actively discourage other companies from sharing/using links etc to other platforms.</p>\n<p>And it likely will get worse as the platform does not want external agents using their data</p>\n<p>Why? Because a competitor could create a better ai agent, and the user would never touch that platform again, and that’s pretty bad for business</p>\n<p>so instead of making a better product, it will either charge for the data (making it $$), or just make their apis significantly worse/ shut off external access directly</p>\n<p>Either way sucks for consumers if we go down this path.</p></blockquote>\n<p>Then again, we are also seeing MCP connectors and AI by default will make integration and automation and getting around any and all of this easier. What OpenAI and Anthropic do to ‘discourage’ clicking on links is at most very light, and those links are links they are choosing to provide. I just did a GPT-5-Thinking query that provided links, and I clicked on the links, and it was fine.</p>\n<p>It is a dangerous game to shut AI agents out of your website. Right now, the AI agents are not good enough, so I would shrug and go to your website manually. But a year from now, I am probably going to be using an AI agents to book flights and make basic purchases and so on. What happens if Orbitz shuts me out and Kayak doesn’t, or vice versa? The answer isn’t ‘oh then I will be forced to go to one manually.’</p>\n<p>Even Amazon should worry about this. Currently my default is Amazon to buy things, but Amazon needs to outcompete all of AI search if they want to keep that position.</p>\n<p>There are two distinct sources of restriction here. We have restriction of access, especially via API, to shut out AIs. And then we have restriction of exit, discouragement of links. The first could be forced upon many because the alternative lets you be eaten. I am very confident the second one is mostly a mistake, but a lot of people seem determined to repeat it.</p>\n<p>To be fair to Musk and xAI, for all the problems I have with both how they handle Twitter and what they’ve done with Grok, Grok does seem to take the whole ‘speak truth’ thing rather seriously when it isn’t being directly fed a particular ‘truth.’</p>\n<blockquote><p>Aian McLaughlin (OpenAI): i think it&#8217;s under-discussed how grok really is a pretty good truth maximizer. kudos to the team. training smart models is hard</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!MAru!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7a9ec5b5-8230-4fc9-a305-07db72ecc766_870x900.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/Simeon_Cps/status/1955381156280668225\">Simeon</a>: Yes! Congrats xAI team for maintaining a fairly truth seeking chatbot! I&#8217;d be really excited if xAI managed to keep improving on their core mission. As the informational footprint of these rising sapients grows, we&#8217;ll increasingly need it.</p></blockquote>\n<p>It also is rather telling that Elon’s response to claims he mainpulates Twitter is to point out an example where it was not manipulated, as proof.</p>\n\n\n<h4 class=\"wp-block-heading\">Technology Advances</h4>\n\n\n<p>Here’s a funny question,<a href=\"https://x.com/patio11/status/1947566315163767018\"> do you need your bookstore to have cashiers</a> in order for it not to simply be Amazon But We Made Everything Worse? I get the instinct but my answer is no, the thing you are being offered is the ability to browse the books and see how they’ve chosen to highlight them and lay things out, and perhaps sit and read. But I say this as someone who cannot remember the last time he’s set foot in a physical bookstore.</p>\n<p>(Also at the link, there is appreciation for a bakery providing a free piano.)</p>\n<p>The errors made in the<a href=\"https://thezvi.substack.com/p/spilling-the-tea\"> Tea app</a> that let it get hacked multiple times<a href=\"https://medium.com/@jankammerath/tea-app-hack-disassembling-the-ridiculous-app-source-code-bc585e15bf4f\"> were even stupider than they appeared</a>.</p>\n<p>Right after writing about Tea I was informed they <a href=\"https://www.404media.co/a-second-tea-breach-reveals-users-dms-about-abortions-and-cheating/\">had a second far more damaging data breach</a>, again due to a very stupid bug, this time exposing DMs and other activity on the site, in ways trivial to trace back to real identities. Given that has happened, I would treat Tea the way you would information that someone could leak or subpoena, as in I wouldn’t type anything into Tea you wouldn’t want on the front page of The New York Times.</p>\n<p>Then someone went out and made TeaOnHer, as in Tea for men to spill about women. It got to number 2 in the lifestyle app section behind Tea. And then, of course, and let me tell you I feel bad for zero of the people involved in this:</p>\n<blockquote><p><a href=\"https://x.com/senatorshoshana/status/1953462931712000364\">Shoshana Weissmann</a>: FINALLY true gender equality for men and women! This is what we have fought for!!!</p>\n<p>ICYMI someone made a Tea app for men and it has basically no security and everyone&#8217;s IDs and info is leaked.</p></blockquote>\n<p><a href=\"https://techcrunch.com/2025/08/13/how-we-found-teaonher-spilling-users-drivers-licenses-in-less-than-10-minutes/?utm_campaign=social&amp;utm_source=bluesky&amp;utm_medium=organic\">Techcrunch walked</a> <a href=\"https://x.com/senatorshoshana/status/1956011548846981165\">through the Tea for Him leak</a>, where they managed to speedrun in 10 minutes by accessing the API they weren’t supposed to access and which allowed unauthenticated access to user data. Yep. Then it proved remarkably difficult to tell the app about the flaw. This particular gaping hole has since been fixed.</p>\n<p>There is a fun debate between ‘no human would be so stupid as to, this must have been vibe coding’ and ‘no AI would be so stupid as to do this, it can’t be vibe coding.’</p>\n<p>For those in the first camp, I refer them to the Sixth Law of Human Stupidity, which states that if you say ‘no one would be so stupid as to’ then you know someone is indeed so stupid as to.</p>\n<p>I do not understand how <a href=\"https://www.wsj.com/tech/personal-tech/a-bug-allowed-kids-to-visit-x-rated-sites-apple-took-three-years-to-fix-it-17e5f65d\">Apple’s Parental Controls could remain fully jailbroken by a constant text string for three years</a>, while the time limit settings doesn’t work and the screen usage charts were inaccurate and so on. Complete failure. When combined with the debacle that was Apple Intelligence, one can’t help but wonder if Apple is largely a broken company without Steve Jobs.</p>\n<blockquote><p><a href=\"https://x.com/garrytan/status/1949230811401920559\">Garry Tan</a>: Steve Jobs was a real one.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!_QQc!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3baa656c-6a51-41df-8003-50e6e3c8d1be_1200x1120.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Then again, <a href=\"https://medium.com/business-erin/you-are-not-steve-jobs-9ae1727d2479\">we have this response</a> saying that the MobileMe debacle was because the team told everyone it wasn’t ready and asked for permission to trim features and were told no, then when it fell over they all got yelled at and it was highly demotivating to say the least. Who is to say, also it is possible that this strategy was effective in general even if it failed in that case.</p>\n<p>I am still confused that <a href=\"https://x.com/AlecStapp/status/1953605973517709474\">many people actually think that Amazon, Uber and Netflix made America worse</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">The Lighter Side</h4>\n\n\n<p><a href=\"https://x.com/caryatis/status/1945922690616827963\">IYKYK</a>.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!k8PF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0aec548b-fec7-4dcc-a895-3b7605ffeb3f_1027x537.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/TurnerNovak/status/1950631485507318118\">Turner Novak:</a> Anyone have her @? She&#8217;d be an incredible VC associate.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!4Jrv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc5fa8662-1472-488b-b265-b27bce076682_790x1026.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I mean that’s a lot but can’t we filter the messages? Prison seems like a lot.</p>\n<p><a href=\"https://x.com/GOP/status/1951060331888889869\">The community has a note.</a></p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!PS-L!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4110be6a-8f1d-41e1-8617-078ba1b995b5_1030x1802.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Don’t let the haters tell you different, this graph is awesome, and points out two important facts about the world.</p>\n<p>First, that we need to build a lot more houses where people want to live.</p>\n<p>Second, and this is important, if you want to buy a house you’ll probably have to work for more than a week to buy it.</p>\n<blockquote><p><a href=\"https://x.com/BernieSanders/status/1953127666153820382\">Bernie Sanders</a>: It is insane that in the richest country in the world, millions cannot afford a home and hundreds of thousands are homeless every night. We need major investments in affordable housing, not tax breaks for billionaires</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!0Xro!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff64dda56-2ae6-4e67-b4b5-85291850b2b5_1120x1390.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p><a href=\"https://x.com/paulg/status/1955426206796615770\">I was this close</a>.</p>\n<blockquote><p>Tracing Woods: the people I find trickiest to handle online are ones who are clearly not stupid and sometimes raise good points, but pair whatever they say with a lot of belligerent mockery. avoiding responding with substance feels like a dodge, responding tends to lead to trading unproductive barbs while thinking that surely if you explain it just a bit better they&#8217;ll get the point</p>\n<p>easier when someone is obviously just nasty</p>\n<p>there are four or five people who travel in the same spheres as me online who fit this category, and I tend to wind up having a bunch of increasingly frustrating exchanges before blocking and moving on. but it leaves a bad taste in my mouth every time</p>\n<p><a href=\"https://x.com/paulg/status/1955426206796615770\">Paul Graham</a>: Just block them. Life is too short. They never rise above moderately smart anyway.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/08/19/monthly-roundup-33-august-2025/",
            "publishedAt": "2025-08-19",
            "source": "TheZvi",
            "summary": "I got suckered into paying attention to multiple non-AI political stories this month: The shooting of the messenger, in violation of the most sacred principles, via firing the head of the USA’s Bureau of Labor Statistics, and the Online Safety &#8230; <a href=\"https://thezvi.wordpress.com/2025/08/19/monthly-roundup-33-august-2025/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Monthly Roundup #33: August 2025"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-08-19"
}