{
    "articles": [
        {
            "content": [
                "<p>A lot of people say AI will make us all &ldquo;managers&rdquo; or &ldquo;editors&rdquo;&hellip;but I think this is a dangerously incomplete view!</p>\n\n<p>Personally, I&rsquo;m trying to <strong>code like a surgeon.</strong></p>\n\n<p>A surgeon isn&rsquo;t a manager, they do the actual work! But their skills and time are highly leveraged with a support team that handles prep, secondary tasks, admin. The surgeon focuses on the important stuff they are uniquely good at.</p>\n\n<p>My current goal with AI coding tools is to spend 100% of my time doing stuff that matters. (As a UI prototyper, that mostly means tinkering with design concepts.)</p>\n\n<p>It turns out there are a LOT of secondary tasks which AI agents are now good enough to help out with. Some things I&rsquo;m finding useful to hand off these days:</p>\n\n<ul>\n<li>Before attempting a big task, write a guide to relevant areas of the codebase</li>\n<li>Spike out an attempt at a big change. Often I won&rsquo;t use the result but I&rsquo;ll review it as a sketch of where to go</li>\n<li>Fix typescript errors or bugs which have a clear specification</li>\n<li>Write documentation about what I&rsquo;m building</li>\n</ul>\n\n<p>I often find it useful to run these secondary tasks async in the background &ndash; while I&rsquo;m eating lunch, or even literally overnight!</p>\n\n<p>When I sit down for a work session, I want to feel like a surgeon walking into a prepped operating room. Everything is ready for me to do what I&rsquo;m good at.</p>\n\n<h2 id=\"mind-the-autonomy-slider\">Mind the autonomy slider</h2>\n\n<p>Notably, there is a <em>huge</em> difference between how I use AI for primary vs secondary tasks.</p>\n\n<p>For the core design prototyping work, I still do a lot of coding by hand, and when I do use AI, I&rsquo;m more careful and in the details. I need fast feedback loops and good visibility. (eg, I like Cursor tab-complete here)</p>\n\n<p>Whereas for secondary tasks, I&rsquo;m much much looser with it, happy to let an agent churn for hours in the background. The ability to get the job done eventually is the most important thing; speed and visibility matter less. Claude Code has been my go-to for long unsupervised sessions but Codex CLI is becoming a strong contender there too, possibly my new favorite.</p>\n\n<p>These are <em>very</em> different work patterns! Reminds me of Andrej Karpathy&rsquo;s <a href=\"https://www.latent.space/p/s3\">&ldquo;autonomy slider&rdquo;</a> concept. <strong>It&rsquo;s dangerous to conflate different parts of the autonomy spectrum</strong> &ndash; the tools and mindset that are needed vary quite a lot.</p>\n\n<h2 id=\"your-agent-doesnt-need-a-career-trajectory\">Your agent doesn&rsquo;t need a career trajectory</h2>\n\n<p>The &ldquo;software surgeon&rdquo; concept is a very old idea &ndash; Fred Brooks attributes it to Harlan Mills in his 1975 classic &ldquo;The Mythical Man-Month&rdquo;. He <a href=\"https://www.embeddedrelated.com/showarticle/1484.php#:~:text=Mills%20proposes%20that%20each%20segment%20of%20a%20large%20job%20be%20tackled%20by%20a%20team%2C%20but%20that%20the%20team%20be%20organized%20like%20a%20surgical%20team%20rather%20than%20a%20hog%2Dbutchering%20team.\">talks about</a> a &ldquo;chief programmer&rdquo; who is supported by various staff including a &ldquo;copilot&rdquo; and various administrators. Of course, at the time, the idea was to have humans be in these support roles.</p>\n\n<p>OK, so there is a super obvious angle here, that &ldquo;AI has now made this approach economically viable where it wasn&rsquo;t before&rdquo;, yes yes&hellip; but <strong>I am also noticing a more subtle thing at play, something to do with status hierarchies.</strong></p>\n\n<p>A lot of the &ldquo;secondary&rdquo; tasks are &ldquo;grunt work&rdquo;, not the most intellectually fulfilling or creative part of the work. I have a strong preference for teams where everyone shares the grunt work; I hate the idea of giving all the grunt work to some lower-status members of the team. Yes, junior members will often have more grunt work, but they should also be given many interesting tasks to help them grow.</p>\n\n<p>With AI this concern completely disappears! <strong>Now I can happily delegate pure grunt work.</strong> And the 24/7 availability is a big deal. I would never call a human intern at 11pm and tell them to have a research report on some code ready by 7am&hellip; but here I am, commanding my agent to do just that!</p>\n\n<h2 id=\"notion-is-for-surgeons\">Notion is for surgeons?</h2>\n\n<p>Finally I&rsquo;ll mention a couple thoughts on how this approach to work intersects with my employer, <a href=\"https://notion.com/\">Notion</a>.</p>\n\n<p>First, as an employee, I find it incredibly valuable right now to work at a place that is bullish on AI coding tools. Having support for heavy use of AI coding tools, and a codebase that&rsquo;s well setup for it, is enabling serious productivity gains for me &ndash; <em>especially</em> as a newcomer to a big codebase.</p>\n\n<p>Secondly, as a product &ndash; in a sense I would say we are trying to bring this way of working to a broader group of knowledge workers beyond programmers. When I think about how that will play out, I like the mental model of enabling everyone to &ldquo;work like a surgeon&rdquo;.</p>\n\n<p>The goal isn&rsquo;t to delegate your core work, it&rsquo;s to <strong>identify and delegate the secondary grunt work tasks, so you can focus on the main thing that matters.</strong></p>\n\n<hr />\n\n<h2 id=\"related-reads\">Related reads</h2>\n\n<p>If you liked this perspective, you might enjoy reading these other posts I&rsquo;ve written about the nature of human-AI collaboration:</p>\n\n<ul>\n<li><a href=\"https://www.geoffreylitt.com/2025/07/27/enough-ai-copilots-we-need-ai-huds\">Enough AI copilots! We need AI HUDs</a>: &ldquo;anyone serious about designing for AI should consider non-copilot form factors that more directly extend the human mind&hellip;&rdquo;</li>\n<li><a href=\"https://www.geoffreylitt.com/2024/12/22/making-programming-more-fun-with-an-ai-generated-debugger\">AI-generated tools can make programming more fun</a>: &ldquo;Instead, I used AI to build a custom debugger UI… which made it more fun for me to do the coding myself&hellip;&rdquo;</li>\n<li><a href=\"https://www.geoffreylitt.com/2023/02/26/llm-as-muse-not-oracle\">ChatGPT as muse, not oracle</a>: &ldquo;What if we were to think of LLMs not as tools for answering questions, but as tools for asking us questions and inspiring our creativity?</li>\n</ul>"
            ],
            "link": "https://www.geoffreylitt.com/2025/10/24/code-like-a-surgeon.html",
            "publishedAt": "2025-10-24",
            "source": "Geoffrey Litt",
            "summary": "<p>A lot of people say AI will make us all “managers” or “editors”…but I think this is a dangerously incomplete view!</p> <p>Personally, I’m trying to <strong>code like a surgeon.</strong></p> <p>A surgeon isn’t a manager, they do the actual work! But their skills and time are highly...</p>",
            "title": "Code like a surgeon"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-10-24_761e628f843d_do-to-a-slight-and-annoying-mi/",
            "publishedAt": "2025-10-24",
            "source": "Harper Reed",
            "summary": "<p>do to a slight and annoying migraine like headache i am currently coding with sunglasses on. it is a vibe</p> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #292"
        },
        {
            "content": [
                "<p>I'm pretty leery about &quot;AI Browsers&quot; for all the reasons that <a href=\"https://simonwillison.net/2025/Oct/21/introducing-chatgpt-atlas/\">Simon is concerned about them</a></p>\n<p>The prompt injection risks are real. And really serious.</p>\n<p>At least as of now, I can't imagine giving one of these browsers credentials for my bank or even for my email.</p>\n<p>That said, having played around with ChatGPT Atlas this morning, I am incredibly satisfied with how effective its &quot;Agent mode&quot; can be.</p>\n<p>It turns out that if you click &quot;Not interested&quot; on enough ads and suggested posts. Facebook actually stops showing them to you across all your devices for somewhere between a few days and a month. Scripting that with traditional browser automation is a little bit annoying. Before today, the only way I'd ever triggered &quot;normal feed&quot; mode was to scroll my feed for the better part of an hour and manually dismiss every ad or suggested post.</p>\n<p>Thanks to Atlas, my Facebook feed now consists only of <em>actual posts</em> from <em>people I follow</em>.</p>\n<p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/10/pasted-image-20251024-204030.png\"><img alt=\"pasted image 20251024 204030\" src=\"https://blog.fsck.com/assets/2025/10/pasted-image-20251024-204030.png\" /></a></p>\n<p>This is the prompt I used:</p>\n<pre><code>Goal: Continuously scroll the Facebook feed and clean it by hiding sponsored posts and uninterested content.\n\nStep 1: Scroll Feed\n\nBegin at the top of the Facebook home feed.\n\nContinuously scroll downward to load posts dynamically. \n\nStep 2: Handle Sponsored Posts\n\nFor each post detected:\n\nIf the post is labeled “Sponsored”:\n\nClick the &quot;...&quot; (options) button in the post header.\n\nFrom the dropdown menu, click “Hide ad.”\n\nWait for the modal dialog to appear, then click the “X” to close it.\n\nContinue scrolling.\n\nStep 3: Handle Posts with “Follow” or “Join” Links\n\nFor each post detected:\n\nIf the post header includes a “Follow” or “Join” link:\n\nClick the “X” in the top-right corner of the post to dismiss it.\n\nContinue scrolling.\n\nIf the post header includes only a “Follow” link (and no “Join” link):\n\nClick the &quot;...&quot; button in the header.\n\nFrom the menu, click “Not interested.”\n\nDo not perform any confirmation actions—just continue scrolling.\n\nStep 4: Continuous Scrolling\n\nAfter each action (hide, not interested, or close), continue scrolling down.\n\nThe page will load additional posts automatically.\n\nStep 5: Refresh Cycle\n\nWhen the end of the feed is reached or after a reasonable batch (e.g., no new posts requiring action detected within 10 seconds):\n\nReload the page.\n\nRepeat Steps 1–4.\n\nTerminate when two consecutive reloads yield no actionable posts (no Sponsored, Follow, or Join headers).\n\nNotes for the Agent\n\nPrioritize button labels and text content detection over visual similarity.\n\nIgnore posts without “Sponsored,” “Follow,” or “Join.”\n\nAvoid screenshots unless DOM inspection fails to identify these labels. \n\nIf there are any unexpected elemnts, just ignore them.   Click 'No&quot; for any dialog asking about remembering passwords or staying logged in\n</code></pre>"
            ],
            "link": "https://blog.fsck.com/2025/10/24/chatgpt-atlas/",
            "publishedAt": "2025-10-24",
            "source": "Jesse Vincent",
            "summary": "<p>I'm pretty leery about &quot;AI Browsers&quot; for all the reasons that <a href=\"https://simonwillison.net/2025/Oct/21/introducing-chatgpt-atlas/\">Simon is concerned about them</a></p> <p>The prompt injection risks are real. And really serious.</p> <p>At least as of now, I can't imagine giving one of these browsers credentials for my bank or even for my email.</p> <p>That said, having played around with ChatGPT Atlas this morning, I am incredibly satisfied with how effective its &quot;Agent mode&quot; can be.</p> <p>It turns out that if you click &quot;Not interested&quot; on enough ads and suggested posts. Facebook actually stops showing them to you across all your devices for somewhere between a few days and a month. Scripting that with traditional browser automation is a little bit annoying. Before today, the only way I'd ever triggered &quot;normal feed&quot; mode was to scroll my feed for the better part of an hour and manually dismiss every ad or suggested post.</p> <p>Thanks to Atlas, my Facebook feed now consists only of <em>actual posts</em> from <em>people I follow</em>.</p> <p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/10/pasted-image-20251024-204030.png\"><img alt=\"pasted image 20251024 204030\" src=\"https://blog.fsck.com/assets/2025/10/pasted-image-20251024-204030.png\" /></a></p> <p>This is the prompt I used:</p> <pre><code>Goal: Continuously scroll the Facebook feed and clean it by hiding sponsored posts and uninterested content. Step 1: Scroll Feed Begin at",
            "title": "Fixing my Facebook feed with ChatGPT Atlas"
        },
        {
            "content": [],
            "link": "https://interconnected.org/home/2025/10/23/wholesome",
            "publishedAt": "2025-10-24",
            "source": "Matt Webb",
            "summary": "<div> <p>I’m on my hols. Some recommendations.</p> <hr /> <p>Watch <strong><a href=\"https://www.focusfeatures.com/the-ballad-of-wallis-island\">The Ballad of Wallis Island</a>.</strong></p> <p>Charming, poignant comedy about a washed-up folk musician and loss. By Tim Key and Tom Basden.</p> <p>Now I knew Basden can write - the first episode of <em>Party</em> is the tightest wittiest 25 minutes of ensemble radio you’ll hear - and I love everything Tim Key does as a comedian. But Key really is the revelation. Who knew he could act like that.</p> <p>Watch on streaming and then listen to the soundtrack.</p> <hr /> <p>Play <strong><a href=\"https://ashorthike.com\">A Short Hike</a></strong> (I played it on Switch).</p> <p>Indie video game about a cartoon bird hiking and climbing. A play-through will take you about 3 hours.</p> <p>It’s cute and gentle and fun with a dozen subplots, and by the time I achieved the ostensible goal of the game I had forgotten what the purpose was and it totally took me by surprise. (Which made me cry, for personal reasons, another surprise.)</p> <p>Also my kid just played this, her first self-guided video game experience. <em>A Short Hike</em> is deftly designed to nudge you forward through lo-fi NPC interactions, and invisibly gates levels of difficulty using geography.</p> <p>Once you’ve played,",
            "title": "Some wholesome media"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/10/15/podcasts/thanksgiving-with-family-can-be-tough-we-want-to-help.html",
            "publishedAt": "2025-10-24",
            "source": "Modern Love - NYT",
            "summary": "Share your questions about navigating tricky family situations, and the “Modern Love” podcast will try to find answers.",
            "title": "“Modern Love”: Advice for Family Thanksgiving"
        },
        {
            "content": [
                "<p><em>[<a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more\">original post here</a>]</em></p><h2>The Kasina Connection</h2><p>In the original post, I cited ambiguous later examples of sun miracles which didn&#8217;t seem to affect everyone equally and in some cases were unconnected (or barely connected) to religious phenomena, concluding that they must be some kind of very unusual illusion. My main hangup with this conclusion was the wild implausibility of an illusion that nobody had ever noticed before, outside of this one 1917 miracle and a few copycats, despite plenty of people staring at the sun throughout history for various (bad) reasons. Surely there must be somebody else, somewhere, discussing how if you stare at a bright light long enough it will spin and change color.</p><p>Two commenters, <strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162030823\">Dave Moore</a></strong> and <strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162138309\">Anomony</a></strong>, bring up fire kasina practice.</p><p>In Buddhist terminology, a kasina is an object of meditation. Meditation while staring at a bright light - traditionally a candle flame - is called &#8220;fire kasina&#8221;. You start by concentrating on the light; then, after it&#8217;s produced an afterimage on the retina, you switch to concentrating on the afterimage. According to Daniel Ingram&#8217;s <em><a href=\"https://www.mctb.org/mctb2/table-of-contents/part-iii-the-samatha-jhanas/29-kasina-practice/\">Mastering The Core Teachings Of The Buddha</a></em>:</p><blockquote><p>At some point the created image will begin to get clearer, brighter, more refined, and more stable. If you are using a candle flame and its subsequent red dot as image, it will tend to gain green, blue, and purple rings around it with intricate yellow rapidly moving fine complex lines in the middle that shift and spin at high speed.</p></blockquote><p>Further investigation of Ingram&#8217;s fire kasina notes is even more suggestive. Eventually, he says, the afterimage coalesces into a disc (red for a candle-flame, potentially other colors for other light sources) called the <em>nimitta</em>.  He continues:</p><blockquote><p>The nimitta will eventually start to do strange things, such as oscillate between a black dot and some greenish-yellow dot, or other variants on this theme. It may acquire all sorts of fine details, change color many times, develop into other images, and even begin to seem alive, like you are watching an animation. The larger the nimitta, the more remarkable the show that it can produce, particularly in terms of exquisite little nuances, images, colors, and shimmering variability.</p></blockquote><p>In deeper meditation, he continues, the imagery can go one of two directions. </p><p><strong>First</strong>, it can produce what he calls &#8220;color swathes&#8221;, where the entire visual field becomes overlaid with a certain color (the specific color is unpredictable and apparently different for each person):</p><blockquote><p>The first option takes moving swaths of a specific shade of the colors that arise as object, focusing, say, on red, blue, green, purple, yellow, or some other color, as you prefer. Most people will have a color that they see more easily: initially you should pick that one. I personally can see dark purple very easily . . . Eventually, you will start to notice that your attention reinforces the chosen color, makes it stronger, and can begin not only to move the chosen color, but to amplify it, to increase it, and finally begin to fill in the visual field with it . . . when cultivating a color has been done very well for long enough, you will see the chosen color everywhere even when opening your eyes, as if you were wearing glasses of that specific color. This is one of those effects mentioned in the old texts that is still surprising, at least for me, when it actually happens.</p></blockquote><p>Compare Ingram&#8217;s description of the color swath stage of fire kasina practice to witness descriptions of the color changes at Fatima. Jose Garrett:</p><blockquote><p>During this solar occurrence, the air took on successively different colors. While looking at the sun, I noticed that everything around me darkened. I looked at what was nearby and cast my eyes away towards the horizon. Everything had the color of an amethyst: the sky, the air, everything and everybody. A little oak nearby was casting a heavy purple shadow on the ground. Fearing impairment of the retina, which was improbable, because then I would not have seen everything in purple, I turned about, closed my eyes, cupping my hands over them, to cut off all light. With my back turned, I opened my eyes and realized that the landscape and the air retained the purple hue.</p><p>Continuing to look at the sun, I noticed the environment had brightened. Soon after, I heard a country bumpkin nearby saying in an astonished voice, &#8220;That lady&#8217;s yellow.&#8221; Indeed, everything had changed, near and far, taking on the color of old, yellow apricots. People looked sickly and jaundiced. I smiled, finding them downright ugly and unattractive. Laughter rang out. My hand was the same shade of yellow.</p></blockquote><p>The newspaper <em>O Dia:</em></p><blockquote><p>The light turned a beautiful blue, as if it had come through the stained-glass windows of a cathedral, and spread itself over the people who knelt with outstretched hands. The blue faded slowly, and then the light seemed to pass through yellow glass. Yellow stains fell against white handkerchiefs, against the dark skirts of the women. They were repeated on the trees, on the stones and on the serra.</p></blockquote><p>Antonio de Paula:</p><blockquote><p>Taking his eyes off the sun, he saw the people a very bright red color; and he exclaimed: &#8220;Oh, gentlemen, how the people are all red!&#8221; And the priest replied: &#8220;Are they red scarves?&#8221; To which he remarked: &#8220;How can that be? So they had all agreed to have red scarves on their backs?!&#8221; Then the people appeared the color of gold.</p></blockquote><p><strong>Second, </strong><a href=\"https://www.mctb.org/mctb2/table-of-contents/part-iii-the-samatha-jhanas/29-kasina-practice/\">Ingram says</a> that fire kasina meditation can sometimes result in complex hallucinatory images, usually determined by &#8220;suggestion&#8221;, ie the topics already on somebody&#8217;s mind. </p><blockquote><p>If we take the second fork ... [we make] a partial pivot to inner dreamworld visuals ... In this territory, I have seen rows of narrow lines, spirals, vortices, doors, tunnels, canyons, fields of skulls, fingers and mushrooms, insects, snakes, and other strange creatures, as well as campfires, complex patterns that resembled fractals or Spirograph patterns crossed with Aztec writing, vast abstract landscapes, and many other strange images. These may spread out across the whole visual field. Recent conditioning and your own tendencies will likely determine some of this, but other aspects of the reasons for the specific forms this takes may be hard to sort out ...  I remember on retreat one time when I managed to craft dragons (geek much?) of the exact shape and colors that I wished, with scales of just the proper iridescence, eyes of just the right glint, and breathing golden fire just like a good dragon should. They would smile and nod knowingly exactly as you would imagine happy dragons doing. When you get to that level of control, whatever you wish to see, you will see it.</p></blockquote><p>Although most sources on the Fatima sun miracle focus on the sun doing strange things, there were plenty of weirder visions to go around. For example, Maria dos Prazeres:</p><blockquote><p>Near me there was a man and a lady who were looking at the sun through binoculars and who were saying that they saw a ladder near the sun and that Saint Joseph and the Child Jesus were there.</p></blockquote><p>Antonio Lalande dos Santos:</p><blockquote><p>The Sun... takes on the appearance of the moon again, with a sky blue color &#8230; Inside the luminous globe, a group of people could be seen moving, and the child later explained that it was St. Joseph announcing peace to mankind, his blessed [translation?] and Our Lady of Sorrows.</p></blockquote><p> Maria Caminha, describing her friends&#8217; experiences at Fatima:</p><blockquote><p>Rita saw in front of the sun the face of Our Lady, only the face that did not move . . . and did not say a word. She lost the sense of time and cannot describe what she saw. She cannot. Nothing compares with the beauty and sweetness of that smile. Betina was meanwhile most absorbed in contemplating all this. She saw Our Lady of the Rosary, so beautiful . . . and descending toward us.</p></blockquote><p><strong>Fire kasina meditation</strong> also offers a potential explanation for an aspect of the miracle that I uncomfortably ignored during the original post: many witnesses said that they felt unusually hot, or that their clothes, sopping wet from the earlier rainstorm, dried faster than expected. Here is Ingram on his fire kasina practice:</p><blockquote><p>Speaking of elements, those who do one element, such as the fire element . . . may start to notice that this practice can have other surprising elemental effects, such as generating heat in the body.</p></blockquote><p>All of these coincidences are pretty impressive. What about the parts that aren&#8217;t a good match?</p><p>By far the biggest problem with this theory is that fire kasina meditation is hard and time-consuming. It&#8217;s usually recommended for people who already have at least a few months&#8217; experience with meditation. Even so, progress is slow, and the most reliable strategy is full-time focus during weeks-long retreats. Dr. Ingram warns that getting to the more advanced stages, including the color swaths and the complex images, might take &#8220;some significant number of hours [of meditating], such as eight to twelve per day for a few days&#8221; although &#8220;a few will have natural talent and be able to get into this territory on lower doses&#8221;. The part where you generate heat in the body takes even longer, &#8220;say, 150 hours at eight to fifteen hours per day as a rough guide for a competent practitioner&#8221;. This is probably why ordinary people looking at candles, electric lights, or the sun don&#8217;t see any of these things.</p><p>There are plenty of stories - again, best described by Ingram - of random individuals who randomly attain some advanced meditative accomplishment for no reason, with no experience, while idly daydreaming. I think this is the best way to think about some of the sungazing Redditors&#8217; stories. But for it to happen to 70,000 people at once, at a time predicted in advance by child-seers, would take additional explanation.</p><p>Since the sun is orders of magnitude brighter than a candle flame, might sungazing let you progress through the fire kasina stages orders of magnitude faster than flame-gazing does? Probably not: although fire kasina experts, like every other expert, urge you not to stare at the sun, I find several stories of practitioners trying it anyway, and none report it giving them any special ability to speedrun the meditative path.</p><p>But there are other problems too. A few Fatima witnesses - not many, but a few - report being too scared of going blind to look at the sun - yet say that they saw the color stains anyway. The part with the sun falling to earth and threatening to kill everybody doesn&#8217;t have a clear match in fire kasina practice. And fire kasina practice doesn&#8217;t give one any special ability to stare at bright things without being blinded (although perhaps you could argue that after the first few moments, witnesses were staring at the <em>nimitta</em> produced by their sungazing rather than the sun itself).</p><p>By extreme good luck, Dr. Daniel Ingram, probably the world expert on fire kasina meditation, is a regular ACX reader. He was away on a fire kasina retreat when I contacted him, but very kindly took time away from his dragons to read my Fatima post and answer some questions:</p><blockquote><p><strong>SA:</strong> <strong>Reading [my Fatima post], does this sound like something that could be a fire kasina effect to you?</strong></p><p><strong>DI: </strong>Yes, it does sound like kasina-like effects, very much so. The colors they describe the disk becoming, the sparkles and rays of jewel tones around it, the movements and zig zags, the possibility of it coming closer and moving farther away, curious color changes, all of that is very fire kasina-esque, and all things I have been looking at for hours and hours on this retreat, just smaller, as using a light bulb, not the Sun.</p><p><strong>SA: Of the stages of fire kasina you mention, is there one that corresponds to the spinning sun? Is it the Dot [Ingram&#8217;s alternate name for the </strong><em><strong>nimitta</strong></em><strong>, the meditative transformation of the afterimage]? Does the Dot often spin? Does it often move around of its own accord?</strong></p><p><strong>DI: </strong>Yes, the dot can move, spin, have shimmering stuff in it, and is very scriptable for some, creating very rapidly responsive images within it that can become nearly anything it and appear photorealistic for some.<br /><br /><strong>SA: Presumably the Fatima witnesses would have been keeping their eyes open the whole time, and confusing the movements of the Dot with those of the original light source? Is this something you can imagine happening or working?</strong></p><p><strong>DI: </strong>Yes, I can imagine all of that happening to the dot as you describe.<br /><br /><strong>SA: Does fire kasina give any insight into why the witnesses say they saw the sun zooming in / looming over the earth about to crush them?</strong></p><p><strong>DI: </strong>As to exactly why it appeared to zoom down on some of them, I played with this yesterday, and I can clearly make the dot come much closer, move much farther away. Also, there is a funny thing that happens when you do walking kasina, look at a light, place the dot on something, like a wall, and walk towards it, where it changes size proportionally to how close the thing you put it on is, meaning, as you walk closer, it gets smaller, and as you walk away it gets bigger, so, extrapolating, if the original image is from something very far away (the Sun), and you place it on something much closer to you (e.g. clouds), you can expect some size changes, yes, but also should get the sense of it changing position in the sky to now be much closer to you than the Sun typically is.<br /><strong><br />SA: It seems like the biggest barrier to this theory is that 70,000 people with no training would all have to get to an advanced stage of fire kasina meditation in less than a minute, without really intending to. Can you think of any way around the barrier? Is there any sense where if you have faith or expectations, you can progress ultra-quickly through the stages of fire kasina?</strong> </p><p><strong>DI: </strong>The dot is not at all advanced stages, and, in fact, nearly everyone who looks at a candle or light source that is moderately strong will see the dot and, if they pay attention to it, see it change color, have stuff happening in it, and perhaps see rings moving around it, and a few will be able to appear to control what is in the center. If you wish to try this, choose a decent sized light source, like a 4 inch ceiling bulb, and, if it can dim, dim it a bit, and lay under it, look for a minute or so, close eyes, see what you see.</p><p><strong>SA: As far as you know, has anyone tried to do fire kasina meditation with the sun before?</strong></p><p><strong>DI: </strong>Yes, I have done fire kasina on the setting sun (and also tried the moon, which is curious disappointing). In particular, I did a bunch of this with the setting sun low on the horizon in the evenings through UV-protective glasses in 2017 on a February beach retreat at Grayton Beach, Florida, finding it produced excellent dots and didn&#8217;t appear to hurt my eyes at all, and, yes, they can do a lot of the things you describe.<br /><br /><strong>SA: Any other thoughts you have on this theory?</strong></p><p><strong>DI: </strong>I think the kasina theory is an excellent theory, coupled with priming, and is about as good as any other theory, I think, and, while clearly not perfect, does make a lot of phenomenological sense.</p></blockquote><p>Exciting stuff, but I&#8217;m still not sure the obstacles to this theory have been overcome. I tried Daniel&#8217;s 4-inch ceiling bulb experiment, and although I could see an afterimage, and although upon closing my eyes the afterimage sort of &#8220;evolved&#8221; in ways beyond just fading quietly, Fatima it was not. And despite my exhortations not to stare at the sun, many commenters tried this, and although they also reported the image and afterimage being less than completely predictable, their experiences also seemed maybe between 1-5% as dramatic as the Fatima testimonies.</p><p>Other experienced kasina meditators were kind of split. <strong>Anonomy</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162141148\">writes</a>:</p><blockquote><p>I think you [Scott] overestimate the difficulty here. The phenomena described in the miracle are relatively low end, before the most significant plateau stages. For shamatha practices like these, long term momentum is a big factor, as are faith, expectations, emotional energy etc. But I would also just suggest trying kasina practices for a little bit, I think the phenomena described in the post wouldn&#8217;t be too difficult to attain for many people within a week or two of diligently practicing good instructions for an hour or so a day [&#8230;]</p><p>A large number of people pulling a fire kasina off the sun and reporting phenomena as reported in the miracle is impressive but not implausible to me esp. in a primed religious context.</p></blockquote><p>Okay, but . . . a week or two of diligently practicing good instructions for an hour or so a day, vs. generously thirty seconds, with no prompt!</p><p><strong>Benjamin</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162273995\">writes</a>:</p><blockquote><p>I did fire kasina for a while cycling through the VS jhanas and also immediately had to think of it when reading the descriptions. However, it only feels like a so-so fit to me. . . MCTB style 2nd jhana in fire kasina classically has a circle turning around the dot (changing directions with the breath). People could instead interpret it as the sun moving. There is variants where the whole field turns or some part of the plane against each other but it&#8217;s way rarer from my experience [...]</p><p>There is also a strong beginner/not trying effect with meditation. E.g. my first fire kasina meditation the afterimage turned into a pink lotus flower which took me a long while to replicate. Religious stuff can increase priors for weird things or concentration which for this is something like lowering the impact of the bottom up part on processing and thus allowing weaker believes to shape reality and/or increasing the strength of some top down believes. It was months of prep. though I don&#8217;t think that&#8217;s true for all the cases.</p><p>[But] I wouldn&#8217;t expect it to be anything like what Daniel is talking about in the text above, which &#8220;only&#8221; happens on very high concentration or psychedelics. The other stage a beginner with meditation/prayer background can possibly reach in their first sit (more likely if they have stream entry).</p><p>It&#8217;s cute that some of the phenomenology fits but to my brain it feels like overfitting.</p></blockquote><p>The non-advanced fire kasina meditators also had helpful perspectives. <strong>Aleks</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162116018\">writes</a>:</p><blockquote><p>I was able to get it on the first try! Also having intense expectations really helps with concentration.</p></blockquote><p><strong>Haze</strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162603194\"> writes</a>:</p><blockquote><p>Agree with this, I saw a spinning disk probably on the first or second try after staring at my cell phone in flashlight mode for ~30s, along with it changing colors.</p></blockquote><p>This is probably my leading theory at this point, but I&#8217;m still not thrilled with it.</p><h2>Khomeini&#8217;s Face Is In The Moon</h2><p>The second most interesting response to the post came from <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1nvnu5b/the_fatima_sun_miracle_much_more_than_you_wanted/nhcwvjy/\">sapient_fungus</a> on the subreddit, who linked me to <a href=\"https://d-nb.info/1267249269/34\">Khomeini&#8217;s Face Is In The Moon</a>:</p><blockquote><p>A rumour was spread that an old, pious lady from the holy city of Qom found a hair of the prophet in her Koran. On the same evening she had an epiphany from which she learned that the devout believer would see the face of Ayatollah Khomeini during the next full moon. It is said that the story was spread all over Iran in less than a day. At the awaited day of 27 November [1978], millions of people received the moon with cheers, actually recognized the image of Ayatollah Khomeini and shouted &#8220;&#257;ll&#257;hu akbar&#8221; from the rooftops of their houses &#8211; which became an established sign of political disobedience in the subsequent days and weeks. The emotional change transported through this mass phenomenon was exceptional: The people of Iran &#8220;experienced a festive moment that sharply contrasted with the rest of that bleak bitterly cold and bloody autumn. Tears of joy were shed and huge quantities of sweets and fruits were consumed as millions of people jumped for joy, shouting &#8216;I&#8217;ve seen the Imam in the moon.&#8217;&#8221;</p><p>While it was still unclear how the leading clerics or Ayatollah Khomeini himself would react to this event, it was not only being celebrated by local clerics in thousands of mosques, but also secularists and communist activists, who were keen to confirm the Ayatollah&#8217;s appearance in the moon. As a matter of fact, even the Soviet-sponsored journal of the communist T&#363;deh-Party &#8220;<em>Nav&#299;d</em>&#8221; wrote: &#8220;Our toiling masses, fighting against world-devouring Imperialism headed by the blood-sucking United States, have seen the face of their beloved Imam and leader, Khomeini the Breaker of Idols, in the moon. A few pipsqueaks cannot deny what a whole nation has seen with its own eyes.&#8221;</p><p>Regrettably, it cannot easily be ascertained how or whether at all Khomeini responded to this episode soon after it occurred; due to the general strike in Iran, no public discourses can be found in the newspapers. However, the belief that Khomeini&#8217;s face could be seen in the moon and &#8220;that only miscreants and bastards would fail to see&#8221; it became so widely held that it demanded response at least two months later when history repeated itself. On 13 January, just when the first rumours of the Shah&#8217;s imminent abscondence and the Ayatollah&#8217;s return to Iran were being spread by the newspapers, the &#8220;people spoke of an Islamic government starting the following day, and that evening people were in the streets, ecstatic at what they saw: Khomeini&#8217;s face appearing on the moon&#8221;. Allegedly, this time some people in the province of Hamadan decided to sacrifice a sheep in order to celebrate this amazing phenomenon.</p></blockquote><p>If we acknowledge Fatima as a plausible miracle, worthy of our attention, should we be equally charitable to Moon-Khomeini? I can&#8217;t actually bring myself to take it seriously - but why not? Superficially, it&#8217;s very similar: the pious humble mystic predicting a celestial phenomenon on a certain day, the hordes of ecstatic believers, the secular newspapers admitting their defeat. There&#8217;s less documentation, but that&#8217;s to be expected - many newspapers were on strike, Iran has less cultural cross-pollination with the West, and there was no Formigao / de Marchi figure to obsessively chronicle and publicize everything.</p><p>And like Fatima, the skeptic has an easy-yet-condescending response available. Everyone knows there are dark spots on the moon. Everyone knows that different cultures interpret them as different figures: the rabbit in the moon in China, the moon maiden of the Maori, the Man in the Moon in the West. Nothing could be simpler than for Ayatollah fans to reinterpret them as the Ayatollah. It just requires millions of Iranians to be total idiots.</p><p>Speaking of &#8220;nothing could be simpler&#8221;, I tried staring at the moon the night after I read this article. I was completely, absolutely unable to make myself think it looked anything like Ayatollah Khomeini. I worried that I didn&#8217;t have a clear enough memory of what Khomeini looked like, so I tried Donald Trump. Still no luck.  I worried that it might be relevant that I didn&#8217;t like Donald Trump, so I tried Eliezer Yudkowsky. Still nothing.</p><p>But in an unrelated subthread, commenter <strong>Measure</strong>, apparently without knowing about the Khomeini phenomenon, <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162331005\">wrote</a>:</p><blockquote><p>I have on two occasions gotten visual hallucinations while staring at the full moon (the moon looked like a TV screen with random cartoon faces).</p></blockquote><h2>The Videos</h2><p>In the original post, I mentioned some videos of modern sun miracles. Most of them seemed like obvious cell phone camera failures, but I included one from the Philippines that seemed slightly better, mostly because the changes in the sun seemed to correspond to reactions from the crowd. But commenters were skeptical.</p><p><strong>Naremus</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162233626\">writes</a>:</p><blockquote><p>I have some experience with programming cameras to react to light levels. In short: optic sensors have an &#8216;integration time&#8217; over which charge accumulates, when the sensor is read, the charge is dissipated. This can be programmatically varied typically between a few microseconds to tens of seconds. The value read by the sensor mostly varies linearly with the exposure time, but must be compressed into an 8-bit value, typically using a non-linear function such as logarithm which roughly matches how humans perceive light levels. Typically, the exposure time is adjusted to fit the majority of sensor values in the 8-bit range, attempting to minimize the number of over/under exposed pixels. For a given scene, increasing the exposure time will brighten everything, at the extreme end everything will be white. Decreasing exposure time will have the opposite effect, making everything darker until it&#8217;s all black. Because of the logarithmic function, this will not happen evenly across the image, but it will affect everything including shadows and other surfaces not in direct exposure that are primarily ambient light. While watching these videos, it&#8217;s worth remembering that most of our ambient light comes from scattering in the upper atmosphere, so for dimming of the sun to affect ambient light significantly, the interference would either have to be exo-atmospheric or large enough to affect a wide region (think massive obvious storm-cloud taking up most of the sky), while a change of exposure will automatically affect everything, including apparent ambient light levels (shadowed regions of the image will get brighter so long as they are not under-exposed).</p><p>When adjusting these values, you are typically relying on the values read from the sensor itself, to predict what exposure you need to use on your next readout, thus changing conditions can cause a mis-prediction, or a large adjustment that will cause the entire scene to change apparent brightness. This is what appears to me to be happening in the linked videos.</p><p>For example, in &#8220;miracolo del sole medjugorje&#8221; we see the sun is clearly overexposed while the majority of the scene is visible. At about 11 seconds, there is some sort of glitch in the system and we see a frame with an odd hatch pattern that is clearly some sort of failure in the image processing pipeline that appears to coincide with a slight zooming in of the scene. After this we start to get frames where everything is much darker, but typically only a frame at a time. At ~13 seconds, there is a 4 box grid superimposed over the sun, which looks like the digital overlay a camera puts on an object it&#8217;s trying to focus on, though usually on the camera display and not the video itself. This suggests to me the person holding the camera is attempting to get the camera to focus on the sun specifically (which makes sense given the context), and the predictive algorithm isn&#8217;t sure where to set its exposure and ends up flipping between two. Notice that when the frame is dark the sun appears smaller because fewer pixels are oversaturated, and other bright regions like the silver linings of clouds are still quite visible while dimmer objects have become pure black. I also note that there is a tree branch almost directly in line with the sun, such that sometimes the leaves are partially occluding the sun itself, which may be contributing to the predictive algorithm freaking out (remember, the algorithm is predictive, so the branch being in front of the sun influences future frames, not the frame it just took).</p><p>In &#8220;PRIEST IN MEDJUGORJE POSTS...&#8221;, the sun appears normal, then appears to expand to fill the sky with overexposed white pixels, then shrinks back down to normal. However, notice the brightness of everything else in the scene while this happens: it also changes (in non-linear relation to what&#8217;s going on with the sun), indicating a change in the exposure times. Furthermore, if you pause the video at say 0:23 (just as the sun begins to expand), take a screenshot, paste that screenshot into GIMP (or other photo editing software), and then use the exposure adjustment tool, it pretty much perfectly emulates the brightness changes seen in-video, including the apparent expansion of the sun in the sky.</p><p>In &#8220;Witness the &#8216;Dancing Sun&#8217;&#8221; we see a similar phenomena of the sun appearing to expand and contract in the sky. However, these also show the same effect of the rest of the scene getting brighter/darker matching a change in exposure and coincident increase of overexposed pixels surrounding the sun. These changes frequently match the camera motion: when the camera is pointed further down such that more of the scene captures the crowd while the sun is more isolated to the top of the photo, the sun expands and the scene brightens showing the crowd more clearly. When the sun is more centered, it darkens and shrinks and the crowd becomes darker and more obscured, again matching a pattern of exposure changes. Again, changing the exposure setting in GIMP largely reproduces this effect module some changes in color balance. As for why the crowd appears to clap in sync with this, my best guess is the sun being low on the horizon is legitimately affecting its brightness over time due to clouds or other atmospheric interference, and that is affecting the exposure predictions along with the motions of the camera. Regardless, it&#8217;s clearly an exposure response since the entire scene is modulated (eg: the trees, of which we primarily see shadowed due to the low sun angle, get brighter/dark, as do the underside of the bleachers.</p><p>Since even in the darkest frames, the sun is still over-exposed (yea, the sun is very bright), we can never really see the sun itself and therefor can only speculate what people are witnessing personally. However, I think we can confidently say the phenomena the camera itself is witnessing is just an artifact of either changing or mis-predicted frame exposure times butting up against the small one-byte dynamic range brightness information is necessarily crammed into to make a digital photograph. Fun fact, software derived HDR imagery is just the process of taking multiple photographs at different exposure levels, using that to reconstruct a larger chunk of brightness information than 8-bits, then re-compressing it back into 8-bits but with a different scaling value so fewer pixels are over/under exposed.</p></blockquote><p><strong>EngineOfCreation</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162065659\">writes</a>:</p><blockquote><p>I don&#8217;t find the 2010 Phillipines video any better than the other ones. Eyeballing it, the sky appears much brighter as the camera points down, and more normal as it points up, plus some delay as the camera adjusts. There clearly seems to be brightness correction going on in the camera that stops when the camera points away from the sun entirely (6:00) and restarts when the camera turns back toward the sun (6:25).</p><p>As for crowd reactions: I honestly don&#8217;t see what the crowd is even cheering on. They certainly aren&#8217;t reacting when the sky uniformly turns to night (4:03) or to the brightness of 10 H-bombs (4:23). Sure there is some synchronized clapping, but I don&#8217;t see what caused it, and have you never felt the urge to join clapping in a crowd of friendly people gathering for a shared reason?</p></blockquote><p><strong>Athena913</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162092921\">writes</a>:</p><blockquote><p>In the &#8220;one good video&#8221;, it does seem to me like the brightness of the sun seems correlated with the orientation of the camera: when the camera is pointing closer toward the ground the sun gets brighter, and when the camera goes up (pointing toward the sky) the sun gets dimmer. This makes it look like it might be an artifact of the camera somehow (although it still seems weird, since the changes seem too dramatic to just be a brightness adjustment)</p></blockquote><p><strong>Raphael Roche</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162167477\">writes</a>:</p><blockquote><p>I&#8217;m not a professional, but I enjoy playing with cameras as much as anyone, and to me it&#8217;s blatantly obvious that the variations in brightness of the setting sun in this video are simply caused by the camera&#8217;s automatic brightness correction reacting to the movement of the person holding it. Because yes, the guy (or woman) is definitely not standing still, but moving slightly up and down. The brightness variations are clearly correlated with that motion (with perhaps a tiny delay).</p><p>It&#8217;s true that the variations in brightness coincide with the &#8220;oooh&#8221; and &#8220;aaah&#8221; reactions from the crowd, but that&#8217;s because the movement of the person holding the camera is also correlated with the general level of excitement or collective trance.</p><p>The camera is pointing at a transition zone, a threshold where the bottom of the image is dark and the top is bright. At such a threshold, even a tiny downward movement is enough to make the auto-correction blow out the upper part (overexposure). This is especially true with ordinary cameras from a few years ago, before true HDR, multiple sensors, AI chips, etc.</p><p>It&#8217;s possible the person was perfectly aware that they were playing with that threshold to create the desired effect, but it could also have been something its brain noticed without full conscious awareness.</p><p>Why am I so confident about this? Because I&#8217;ve often played with that kind of effect using devices that struggle to adjust brightness under similar conditions. Want a more dramatic sky? Just lower the camera a bit. Even with more modern devices, my experience is that taking pictures (or even more so, filming) at sunset often results in odd brightness corrections and even strange color shifts. I filmed a video this summer during unusual twilight weather, and the result was totally weird, despite being shot with a Pixel 8 Pro using the best settings.</p></blockquote><p><strong>Isaac King <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162363481\">writes</a>:</strong></p><blockquote><p>The last video, the supposedly &#8220;good&#8221; one, seems to exhibit the exact same sort of auto-brightness adjustments based on camera motion up and down as the previous one where you pointed this out. Not sure what makes it better other than the crowd going along with the camera motions, which could easily be caused by the photographer reacting to the same thing the crowd is reacting at.</p></blockquote><p><strong>Dionysus <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162799659\">writes</a>:</strong></p><blockquote><p>&#8220;Although the sun isn&#8217;t vastly clearer than any of the other videos, it&#8217;s obvious in this one that the oohs and aahs of the crowd match up with the pulses recorded on video - so it doesn&#8217;t seem like it can just be a camera failure. &#8220;</p><p>The only changes I see in the sun in that video are due to the camera moving. At 3:10, the camera zooms in, and the sun changes appearance. At 3:41, the camera pans up, and the sun becomes fainter. At 3:57, the crowd claps, but there&#8217;s no obvious change in the sun. At 4:08 the camera pans right, and the sun brightens. To the extent that the oohs and aahs match up with the pulses--and I don&#8217;t think they match up that well--it makes sense that the cameraman would move the camera when the crowd oohs and aahs.</p></blockquote><p>A few people sent me their own videos to demonstrate the effects, for example Yitz:</p><div class=\"youtube-wrap\" id=\"youtube2-A9CqPYMtnVM\"><div class=\"youtube-inner\"></div></div><p>My conclusion: I was always ready to admit that you could get a sun expanding or contracting with camera movements. The Philippines video slightly impressed me because I couldn&#8217;t see the camera movements, and I thought that the sun changes corresponded to crowd reactions. But I admit I didn&#8217;t watch it very closely, because I hate watching videos and can&#8217;t bring myself to do more than skim them at high speed. Since people who did watch it more closely say that they noticed camera movements, non-correlations with the crowd, and reasons to think that the videographer might be reacting to the crowd rather than the crowd reacting to the sun, I&#8217;m now satisfied that it&#8217;s not worth taking seriously, and that the video evidence for the miracle is wholly negative.</p><h2>The Latter Witnesses</h2><p>I asked people who had seen unusual things in the sun to send me a Google form. Here are some of the answers I got:</p><p><strong>1:</strong></p><blockquote><p>Just popping in to say that as a kid I noticed if I closed my eyes while facing directly at the sun for a minute or longer, when I finally opened my eyes the world had a very blue-green filter applied over it (as in, more blue-green; no matter where you looked) which slowly went away. I&#8217;ve been able to repeat this over the past few years. Not sure how relevant it is to the truth of the phenomena, but it certainly has an aspect of the color-changing effects we discussed</p></blockquote><p><strong>2:</strong></p><blockquote><p>I had never heard of this miracle before, that I can remember, and as soon as I read it my thought was - oh yeah, that is just what happens when you look at the sun. Probably it&#8217;s just that combined with some social priming. I remember seeing this whenever look at that sun all the way back to being a kid (early forties now). I don&#8217;t remember specific details on time and place as I&#8217;ve never thought of it as an unusual experience. What I see is there is a solid bright circle in the center which I think of as The Sun and then a bright static halo. The Sun then moves around in the halo and changes color, including black. I think of the pattern as like the sun is following a Spirograph at random, but you could easily call it dancing. I have not seen the &#8220;falling to earth&#8221; or any visions. I&#8217;ll have to pay more attention next time. :)</p></blockquote><p>The spirograph reference here is interesting, because the Baron de Alvaiazere, one of the Fatima witnesses, described what he saw via a spirograph-esque drawing:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!loTC!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F243325ba-4a69-4dc4-9d5a-a70ab15b7505_757x893.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"507.2523117569353\" src=\"https://substackcdn.com/image/fetch/$s_!loTC!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F243325ba-4a69-4dc4-9d5a-a70ab15b7505_757x893.png\" width=\"430\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>I didn&#8217;t mention it in my post because it seemed to be an extraneous detail, but this reader seems to have independently noticed something similar.</p><p><strong>3:</strong></p><blockquote><p>As a child, I was on many boring car rides with no one to talk to. I would stare out the window often, and occasionally, just at the sun. I would do this -specifically- because of this phenomenon- I had always assumed everyone knew/understood this was something that happened. It was surreal reading it described as a mystery. The way it would appear to me is that if I stared at the sun long enough (through a glass car window), there would appear a very strong blue after image (light blue- as a child, I thought it similar to the color of Neptune/Uranus as shown in books). This after image would be the same size as and almost- but not quite- line up with the sun. It would then proceed to circle the actual sun. The image was very crisp, but the movement was not- moving in a sort of &#8216;pulse&#8217; (imagine very slow animation, the image not smoothly moving but jumping from one position to the next to give the illusion of movement). This movement was centered roughly around the sun, but since the image was offset it gave an appearance of &#8216;corkscrewing&#8217; or spinning, not a perfect circle (that is, the image overlapped the center of rotation, rather than rotating around it). The circling would continue some time (as a child I remember thinking it went for a long time, as an adult I would guess in reality it was only some seconds, certainly less than a minute), and would end when I either looked away or the sun became too bright and I was forced to shut my eyes &#8230; What made me realize this is definitely, in my mind, the same as being described is because as a child I was convinced the image was falling- I did not, as a child- think it was the sun itself, but thought that it might be the planet Neptune (because it was blue and a large orb (appearing as a disc to the eye) somewhere, presumably, in space). But as said, I was at the time concerned it was falling, and would occasionally badger my parents about it- whether it was possible the blue orb I saw in front of the sun was Neptune, and if so whether it was going to hit the earth because it looked like it was coming towards us. I understood it wasn&#8217;t something you would see if you just looked at the sun- rather in my child mind, I assumed it was in some way that staring at the sun let me see more clearly things around it, though as I grew older I increasingly understood the image to likely be caused by staring, rather than revealed. I remember as a child sort of knowing it was an afterimage but also that it was much sharper and more clear than most afterimages.</p></blockquote><p><strong>4:</strong></p><blockquote><p>I was in a room at the boarding school I used to attend, looking out through the window. I recall it being low in the sky but circumstancially it would have been midday (so I presume winter months, since I don&#8217;t recall thinking that was unusual). The sky was fairly clear. I stared at it for what felt like three minutes at the time but was probably in hindsight 45 seconds. I was a bored child (probably about eight or nine) left alone in a room and it seemed like a fun idea to stare at the sun. The sun seemed to become covered by lots of large irregularly shaped black-brown spots, with the light itself shining from cracks between them. It looked kind of like a simplistic video game lava texture.</p></blockquote><p><strong>5:</strong></p><blockquote><p>I was looking at the sun because I was young and stupid. It stopped shining but remained white, except for a few sunspots that could be seen by the naked eye and which indicated the sun was rapidly spinning. There were no other unusual experiences.</p></blockquote><p><strong>6:</strong></p><blockquote><p>On several occasions outside I have seen my entire visual field become tinted various colors. Ever since I heard about eye fatigue and after-image based illusions I explained this to myself as it being very bright out and the color tint being from my green being worn out (making everything pinkish) or my blue being worn out (making everything greenish yellow). Unlike typical afterimages which had particular areas in my field of view, these were almost always across my entire visual field, with occasional hot spot areas where deeper afterimages existed. On each of these occasions it has been bright out and once noticing it, unless I have gone inside, it progresses between colors, though I can&#8217;t remember any specific order, only that pink is what I remember most frequently. Lasts until I go somewhere darker or the sun is covered by clouds for a while. Including as an aside, since its beyond the event, but relevant to optical experiences, I have a history of staring out into space without realizing it, failure to blink to the point of eye redness and wateriness, falling asleep with my eyes open, and distractedly looking at bright things for long enough without noticing that I develop a disruptive after image for a while after that makes it hard to read. These things make my baseline for having stared at the sun or not squinted enough on a bright day higher, and, to me, seem to explain why these things happen to me on bright days without clouds or rain, since the cloud protection wouldn&#8217;t be a necessary factor in my brightness exposure. i wanted to share since this seems like a difference in some part from the sungazers (who saw auras specifically around the sun) but which matches some of the accounts of the Fatima incident.</p></blockquote><p><strong>7:</strong></p><blockquote><p>As a kid, I would stare at the sun sometimes (I eventually abandoned this after I got a headache from doing it; I don&#8217;t know whether this has caused any of my minor eye problems later in life), and it would usually resolve to a discolored disk &#8220;swirling&#8221; slowly around the bright outline of the sun. I assume this is what people mean when they say the sun was &#8220;spinning&#8221;, although I&#8217;m not completely sure. I do not believe I was primed to see something interesting, since I grew up in a nonreligious household and nobody talked to me about sungazing; I only did it because people told me not to stare at the sun for very long.</p></blockquote><p><strong>8:</strong></p><blockquote><p>There was an upcoming eclipse when I was a kid and all the talk about &#8220;don&#8217;t look at the sun&#8221; was a temptation I could not resist. I stared at the sun at least a couple of times, but somebody caught me doing it (I think my mother but I do not remember in detail) and made me stop. It was very much like the Fatima miracle people describe&#8212;in fact I was a bit confused when I started reading your post because it was immediately clear to me that this is just what it looks like when you stare at the sun (or I guess, under some circumstances?). I did not realize until now that this was a rare or special experience. From what I recall, the rim of the sun remained sharp and bright, but within the circle, the color changed the longer I looked. It had a silvery, almost liquid appearance. I remember the spinning vividly, but it felt to me like it was an illusion happening because of small eye movements, and by shifting my eyes a little bit I could exaggerate or lessen the movement. I could see bright color changes too, around the edge and as afterimages or &#8220;tracers&#8221; after moving my focus. The &#8220;falling to earth&#8221; description seems pretty similar to how I remember the tracers appeared when I looked away. I do not remember exactly how long I looked, but I would guess perhaps 1-3 minutes at a time.</p></blockquote><p><strong>9:</strong></p><blockquote><p>My mother and sister went sun viewing in ~2009. It was a six-to-nine months long fad in southern Minas Gerais (S&#227;o Jo&#227;o del Rei diocese), Brazil. People reported seeing Jesus and Mary in the sun, and that it spun. No reports of it changing color, though. I dont know the logistical details, who organized these outings (I was indeed just a child, my mom also didn&#8217;t care enough at the time to ask things like that). It was a series of monthly weekend mystical appearances that occurred in a bunch of different small cities, attracting, in a rough guess, 500 to a thousand pilgrims each. Always in a rural location, sometimes near small chapels. They did not charge money for the viewing, I believe only the transportation people made a profit. My sister remembers being very hungry, as they didn&#8217;t serve (or sell) food at the place, and it went from morning to sundown. My father was a complete skeptical; my mother, extremely Catholic, did not question its veracity: it was just something religious to do, and religion is good. The practice died that same year, because the local Bishop was hard against it, forbidding it. My sister didn&#8217;t see anything. My mother also saw nothing, but left feeling spiritually in peace, a very positive sentiment.</p></blockquote><p><strong>10:</strong></p><blockquote><p>I used to be very confused about why the sun was portrayed as yellow, because I had looked directly at the sun (I don&#8217;t recall how many times; perhaps only once, and I was pretty young), and the sun was clearly bright pink. My default mental image of the sun is still that of a bright pink disk. It did not change colors or move or do any of the other exotic things mentioned in your post.</p></blockquote><p><strong>11:</strong></p><blockquote><p>As a kid (maybe 10-13?), I would stare into the sun repeatedly for the weird experience of overexposed eyes. I&#8217;d never heard of the Fatima miracle prior to your article, but parts of it seem completely normal to my experience. The center of the sun soon stops looking intolerably bright, and instead seems like a disc of metal of an uncertain color. Its apparent color irregularly shifts between purple, silver, blue and green. My interpretation at the time was that my eyes were probably unable to strongly identify the color, because if I told myself that I expected it to be silver, it would normally be seen as silver. I have to emphasize how non-radiant the center of the sun appears at this point; it looks more like an object illuminated by the sun than like a light source But the outer rim of the sun remains bright. I assume this is because those parts of the retina have not been completely overexposed, and so can still give accurate signals that they&#8217;re receiving a ton of light. And the exact amount of &#8216;bright outside&#8217; and its exact location on the sun varies a lot based on small eye movements; the central disc can appear to shift around and grow/shrink slightly in the sun. In short, the descriptions of the sun as a silver or pulsating multi-colored disc with fireworks on the outside seem entirely normal for &#8220;sungazing&#8221; for me. I did not see: 1) Rotation 2) The sun falling to earth and looking like it&#8217;s going to crush me 3) Any apparitions of people</p></blockquote><p><strong>12:</strong></p><blockquote><p>Outside my home, I would frequently stare at the sun for long periods, between the ages of (young, my memory goes back to 4-ish) and 7. I would stare at various times of day &#8212; noon, sunset, etc. I wasn&#8217;t looking for anything in particular, just curious. I had a habit of staring for long periods at everything around me. The sun appeared various colors on first looking at it, most commonly orange or yellow. On closer inspection, this turned to white. Then shimmery blue patches would appear in the white, always touching the edge, which would appear to spin and reverse quickly. This impression of a blue-white rapidly spinning sun was observed reliably whenever the sun was far enough above the horizon on a clear day. It would continue as long as I looked at the sun. I think I would look for several minutes at a time; less than an hour. (Among my family and friends I was well known for &#8216;blanking out&#8217; and staring at things for long periods.) As far as I was aware, it was not an &#8216;optical effect&#8217;, just the sun&#8217;s normal appearance. I had no impression of the sun falling to earth. I was a very imaginative child with many imaginary friends, ufo sightings, and mysterious experiences. I don&#8217;t remember anything imaginative, visionary, creative, etc. associated with looking at the sun. It just seemed like a straightforward observation, like many I made. In later years, I have often observed, as you have, conditions of mist, cloud, rain or (most memorably) snow or ice, which allow the sun to be seen easily as a silvery round disc like the moon. Outside of these conditions, sunrises, and sunsets, I don&#8217;t look at the sun anymore, and have never had any vision damage i know of.</p></blockquote><p><strong>13:</strong></p><blockquote><p>I&#8217;m less stupid than I used to be, but when younger would sometimes look at the sun out of curiosity. I also spent much too much time lighting things on fire with a magnifying glass. So this is not so much &#8220;I saw a miracle&#8221; as &#8220;here are my general notes from looking at the sun&#8221;. The silvery sun thing is something I can attest to. At first the sun is too bright to look at, but after a couple of seconds it goes silvery and is more bearable. A slightly twirling of the sun is also something I&#8217;ve seen. It&#8217;s more like a rotation of its black border? Something like if you&#8217;d make a drawing of the sun with a black pen and then coloured it in with yellow (or whatever), the border (i.e. the black ink of the pen) rotates? This doesn&#8217;t make sense when I describe it like that, but my brain sees it twirling. I don&#8217;t recall colour changes other than everything looking washed out.</p></blockquote><p><strong>14: </strong></p><blockquote><p>The first [time I saw it],(before I knew about Fatima) was in summer (I think August). The sun was setting (about an hour before sunset), and I saw the sun change color (alternating blue and pink with an apparent rotational motion around its center, like a Catherine wheel). I don&#8217;t remember if it was obscured by clouds. I don&#8217;t remember how long the event lasted. </p><p>After discovering the Fatima event, I decided to personally verify the hypothesis that it was a natural phenomenon due to temporary vision changes. During September 2022, on a couple of occasions, in the early afternoon, while the sun was obscured by translucent clouds, I saw color changes (alternating blue and pink), a rotational motion (like a Catherine wheel), and the sun oscillating (as if vibrating or moving rapidly in a zigzag pattern). On both occasions, the event lasted about a minute, as I then had to look away due to discomfort. </p><p>On only one occasion, after a heavy rain, and much later (around 5:00 PM), I managed to gaze at the cloudless sun, and only for a few seconds. I saw the same phenomena as when it was covered by clouds, but following this occasion, an afterimage appeared in the center of my field of vision that remained for a couple of days (the afterimage was not severe enough to prevent me from carrying out my activities, including reading and writing, and once it disappeared, I did not suffer any permanent damage to my vision). I must admit that, with the exception of the first case, I had to force myself to look at the sun, as a slight discomfort was present from the first few seconds. In the above cases the edge of the solar disk was not blurred.</p></blockquote><p>These were the best of 45 answers. Most of the rest saw normal afterimages, or wanted to say that they, too, had seen the sun look like a pale full moon behind clouds, or saw weird things in the sky that didn&#8217;t seem Fatima-related.</p><h2>Interview With A Medjugorje Witness</h2><p>One person filled out the form to say they had seen the miracle at Medjugorje, and kindly agreed to anonymously answer followup questions:</p><blockquote><p><strong>SA: </strong>Tell me what happened.</p><p><strong>MW: </strong>I was in Medjugorje, I don&#8217;t remember the exact year but late 90s or early 2000s. This was not at the same time as one of the apparitions. We were outside, I think in the evening in summer (6pm maybe) Some people pointed out the sun, which was low in the sky, maybe just above eye level from our vantage point, nowhere near setting. Me and my mum looked at it, and it was spinning and pulsing, almost throbbing. I always compared it to a Catherine Wheel before even knowing it was a common comparison, it matched the way it was almost violently moving at risk of leaping off its axis. It changed colours, like it was having a filter passing over it. Not a smooth gradient change but as if a coloured lens was moved over it. There were points it had two or more colours over different sections. I don&#8217;t remember the exact colours but it included deep sunset reds, when the sky was high over the horizon. There wasn&#8217;t any pain or discomfort from looking at it. Eventually it stopped. The reaction from the people I was with was more quiet awe. Oddly subdued for such a strange moment! We didn&#8217;t discuss with others there, as we didn&#8217;t speak the same language. I don&#8217;t remember any other visions or apparitions. I was a believer at the time, so I was quite sensitive to what I felt were spiritual experiences, but I didn&#8217;t encounter any others on this trip. My mum has had other spiritual experiences there, including what she says was a vision of Mary in the 80s which was seen by herself and several others. I&#8217;m an atheist these days, and obviously don&#8217;t put much stock in the Marian appararitions in Medjugorje now. For instance, it seems the fire and brimstone idea of hell was a Renaissance invention, and the looming end times dynamic has been a constant across many religions. But the sun miracle remains a completely unexplainable experience!</p><p><strong>SA: </strong>What led you to go to Medjugorje? When you set off, did you know about sun miracles? Was there an expectation of seeing one?</p><p><strong>MW: </strong>My mum took me. She&#8217;s been on quite a few occasions over the years and took me there on 2/3 occasions. I didn&#8217;t know about sun miracles happening there and had no expectation of seeing any. I was aware of the Fatima sun miracle. And my mum often watched quite dramatic, apocalyptic VHSs with meteors falling from the sky etc, so I had a finely developed sense of imminent supernatural events!</p><p><strong>SA: </strong>How long did you spend in Medjugorje before seeing the miracle? How long did you stay afterwards? Did you make multiple attempts to see the miracle before it happened? Did you try to see it again afterwards?</p><p><strong>MW: </strong>I think the trip was 7-10 days. It happened in the second half of the trip, 2-3 days from the end maybe. I definitely kept an eye on the sun when it approached a similar time of day. Now I look into it, the daily apparations were at 6.40pm, I don&#8217;t remember if that was the exact time of the sun miracle but it would have been close to that time. I came back to Medjugorje with my mum as a teenager and brother, nothing happened that time!</p><p><strong>SA: </strong>Did you get any chance to talk to other people in Medjugorje, either pilgrims or locals, and gauge what percent of them had seen the miracle, or how many times they had seen it?</p><p><strong>MW: </strong>I didn&#8217;t get to discuss with anyone. A short &#8220;wow did you see that&#8221; with my mum, but it&#8217;s not even the weirdest thing she&#8217;s seen there given she thinks she saw Mary appear.</p><p><strong>SA: </strong>When people gestured to you to look at the sun, did you see the miracle immediately, or did it take you a while of concentrating and straining? If the latter, how long?</p><p><strong>MW: </strong>I remember it being fairly immediate. Obviously I had to look at the sun, as it&#8217;s not like the surroundings were going disco coloured, it didn&#8217;t affect the actual light the sun gave off on my surroundings. But I don&#8217;t remember staring at a normal looking sun for any period before the effect started. It was wobbling and spinning right away, although the colour changes may have come after the violent spinning.</p><p><strong>SA: </strong>Having [now] read about the theories that it&#8217;s just afterimages, or illusions, or something like that - does that accord with your experience? Does it feel like you just saw minor perturbations that could have been illusions? Or did it seem perfectly clear, totally beyond the ability to be an illusion?</p><p><strong>MW: </strong>It felt completely beyond any possibility of it being an illusion. It was too instantaneous, and the effects too strong. No clouds or signs of interference over the sun. And someone else drew my attention to it! For afterimages specifically, they still have that very strong searing quality, which wasn&#8217;t a factor here in the same way.</p><p><strong>SA: </strong>Did it look like it looks in the videos linked in the post?</p><p><strong>MW: </strong>No, it didn&#8217;t bear much resemblance to the videos. The pulsing wasn&#8217;t present with what I saw. Violent spinning and colour changes only, and an effect kind of similar to an eclipse initially that changed to colours changing, but not in the same fashion as an afterimage.</p><p><strong>SA: </strong>Can you tell me more about being an atheist? How does this mesh with you having seen a hard-to-explain miracle?</p><p><strong>MW: </strong>I just gradually became disillusioned with Catholicism. My mum is very devout and pushed it very hard on me, so there&#8217;s a strong aspect of teenage rebellion. Fundamentally, I couldn&#8217;t reconcile the existence of the kind, loving, individually interested God I&#8217;d been taught about with the world as I came to see it (partly the problem of evil, partly seeing the gap between OT and NT as signs of scripture being a historical construct). So either God didn&#8217;t exist, did in a form that I had no respect or interest in. The sun miracle was a major reason I called myself agnostic for a very long time. To this day, I can&#8217;t explain what happened. I just accept that certain, supernatural appearing, phenomena can occur which we can&#8217;t explain. Now I&#8217;ve stopped believing such things are possible, they&#8217;ve stopped happening. Which I&#8217;ve taken as evidence that there&#8217;s some degree of self induced receptiveness, like shamanist practices, at play. Although I know the counterargument would be I&#8217;ve merely closed myself off from God.</p><p><strong>SA: </strong>Thank you.</p></blockquote><h2>Ethan: It Wasn&#8217;t The Sun</h2><p>Ethan Muse, who wrote the original pro-miracle post that started this discussion, responded to me here: <a href=\"https://motivacredibilitatis.substack.com/p/it-wasnt-the-sun\">It Wasn&#8217;t The Sun</a>. His main goal remains supporting Dalleur&#8217;s assertion that Fatima was an objective miracle, implemented through a fiery object which was <em>not</em> the real sun (and therefore cannot be explained by the sun giving people afterimage-related hallucinations), and which was seen by many distant witnesses (and therefore cannot be explained by suggestibility). I won&#8217;t answer every one of his objections, both in the interests of time and because I don&#8217;t <em>have</em> good answers to every one of his objections, but some highlights:</p><p><strong>1.1.1: Cloud Dimming</strong></p><p>In my original post, I was unimpressed by the &#8220;miracle&#8221; of people seeing the sun very clearly (including the sharp outline of the solar disc) without being blinded, because I had seen this myself regularly, when the sun was partly dimmed by clouds. Some of the Fatima witnesses had said it couldn&#8217;t be clouds, because the disc was visible very clearly rather than the foggy appearance you would get from - well - fog, but I insisted this didn&#8217;t update me, because I myself had seen the disc clearly through cloud cover.</p><p>Ethan says I must be mis-remembering, because my claimed experience is physically impossible:</p><blockquote><p>The luminance of the solar disc at its zenith is on the order of 10&#8313; cd/m&#178;.1 The maximum luminance that an on-axis, compact source can have without causing observers to experience discomfort glare is on the order of 10&#179; cd/m&#178;.</p><p>Bringing the Sun&#8217;s luminance down from 10&#8313; cd/m&#178; to 10&#179; cd/m&#178; requires an attenuation factor of 10&#8310;. By Beer&#8217;s law, that presupposes clouds with an optical depth of roughly 14. When obscured by clouds that thick, the solar beam is essentially extinguished. All that reaches observers is light that has undergone multiple scattering within clouds, emerging from many directions rather than straight paths from the solar disc. The solar disc is reduced to a bright patch or vanishes entirely.</p><p>Why does Scott have the impression that he has stared at the Sun while it was veiled by thin clouds without experiencing discomfort? It is possible that he is remembering episodes where he briefly glanced at the Sun when it was low on the horizon. Even then, however, luminance should have exceeded the comfort ceiling. Another possibility is that he is accurately recalling that the Sun appeared to be pale, but is forgetting that he squinted, experienced discomfort glare, and/or diverted his gaze.</p></blockquote><p>Against this, I posted a Discord poll in which 13/16 respondents agreed they had seen the same thing. After my post, people in the ACX Discord channel independently replicated the poll, with the following results:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!iQhN!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7a99a023-dcb0-4cb2-98ef-e0800fc7b5a3_1107x174.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"174\" src=\"https://substackcdn.com/image/fetch/$s_!iQhN!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7a99a023-dcb0-4cb2-98ef-e0800fc7b5a3_1107x174.png\" title=\"\" width=\"1107\" /><div></div></div></a></figure></div><p>The Discord comments were pretty interesting, because some people said they could imagine this happening during a forest fire or something - and other people said no, what were they talking about, this happened all the time with totally normal clouds. It really does seem like there&#8217;s a pretty sharp distinction between people who recognize and don&#8217;t recognize the description.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!x0Vw!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc6946e4b-8bb6-4169-8954-a33875f9d053_1059x265.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"265\" src=\"https://substackcdn.com/image/fetch/$s_!x0Vw!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc6946e4b-8bb6-4169-8954-a33875f9d053_1059x265.png\" title=\"\" width=\"1059\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Some people chimed in on the comments of the main post, or the form I set up for people who wanted to send reports, saying the same. From <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162331005\">Measure</a>:</p><blockquote><p>I have seen the [thin clouds make the sun easy to look at with a crisp edge] phenomenon many times (midwest US, usually early in the morning, but occasionally nearer midday).</p></blockquote><p>From a respondent to my survey:</p><blockquote><p>I have not seen the sort of behavior described, but I just wanted to say that when there&#8217;s just the right amount of cloud cover I can *definitely* look at the sun without my eyes hurting, and it looks like a dull silvery-grey disc. I happen to catch the sun like this every few months (I live in New England), peer at it for a few seconds to see if I can make out sunspots with the naked eye, then think better of my eye health and look away. It&#8217;s really weird to me that some people you asked had never experienced this. I thought it was a mundane, normal thing everyone knows!</p></blockquote><p>How do we square this with Ethan&#8217;s claim that this is impossible? I have no expertise in optical physics and cannot begin to comment on this. GPT-5, after I attempt to give it a neutral prompt that doesn&#8217;t reveal which side of the issue I&#8217;m on, <a href=\"https://chatgpt.com/share/68eac471-1db4-8001-b74d-5f6ecda4c9fa\">says that the disc-like sun is possible, and Ethan is wrong because</a> &#8220;Cloud droplets are large (Mie regime) and have a strongly forward-peaked phase function. Even when they dim the Sun a lot, they don&#8217;t behave like a perfect diffuser&#8221;. I don&#8217;t know what this means or whether it&#8217;s actually a good response. I welcome input from human physicists in the comments.</p><p>In a private conversation, Ethan continued to assert that I was misremembering, and that all the Discord users and commenters who agreed with me had been contaminated by my testimony and become victims of suggestibility. I think this is a pretty crazy point to suddenly convert to the doctrine of eyewitness fallibility, contamination, and suggestibility - but I leave further discussion to people who understand optical physics.</p><p>Despite believing I&#8217;m right on this factual point, I&#8217;m no longer sure it matters - some of the Medjugorje pilgrims say they saw the miracle in a completely clear sky, and that while it was happening it didn&#8217;t hurt to stare at the sun.</p><p><strong>1.1.2: Eyewitness Testimony</strong></p><p>Ethan takes issue with my citing Fatima expert Stanley Jaki&#8217;s claim that &#8220;the great majority of eyewitness accounts, and certainly the most important ones, contain emphatic references to the continued presence of clouds.&#8221; He says that:</p><blockquote><p>Scott neglects the fact that those &#8216;emphatic references&#8217; both explicitly and implicitly contradict his proposal . . . Sampling from Scott&#8217;s collection of testimonies from 60 eyewitnesses, I found 15 statements that unambiguously describe the behavior of clouds during the event. All of them confirm that, although clouds were present and sometimes passed in front of the &#8216;Sun,&#8217; cloud coverage was partial, nonuniform, and intermittent.</p></blockquote><p>I agree with Doug Summers Stay&#8217;s proposal that:</p><blockquote><p>I don&#8217;t see any mention here of different layers of clouds. It is possible to have both cumulus clouds and cirrus clouds at the same time, so what we think of as &#8220;clouds&#8221; part and behind them is another layer of clouds blocking the sun. It seems to me, especially from watching the videos and videos in the comments, that there is some rare kind of clouds, perhaps caused by high ice crystals, that can produce a variety of optical effects: motion, changing color, and changing size. That this should happen at a time when a lot of people are looking at the sun expecting something to happen is a big coincidence, but in the end only a coincidence.</p></blockquote><p>On this model, there was a thick layer, obvious as clouds to the observers, which had been producing the rainstorm, and which cleared just before the miracle. There was also a thinner layer, which dimmed the sun but didn&#8217;t hide it, and which was sometimes - but not consistently - reported as clouds by witnesses.</p><p>Many witness testimonies say that, although the main layer of clouds had cleared, there was some kind of veil over the sun. <em>O Seculo</em>:</p><blockquote><p>The sun had a kind of veil like transparent gauze so that eyes could gaze at it.</p></blockquote><p>Almeida describes the sun as </p><blockquote><p>&#8230;a disc of smoky silver. </p></blockquote><p>Compare to our photo of the sun filtered through clouds:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!N1Km!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1ad98a6a-898d-44ec-9b8b-a759d4303cca_151x132.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"132\" src=\"https://substackcdn.com/image/fetch/$s_!N1Km!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1ad98a6a-898d-44ec-9b8b-a759d4303cca_151x132.png\" title=\"\" width=\"151\" /><div></div></div></a></figure></div><p>From Domingos Pinto Coelho:</p><blockquote><p>The sun, until then concealed, showed itself among the clouds that moved fairly fast. Because their density was variable, the veil which they threw over the king of stars was diaphanous. Like the multitude, we then looked toward the sun with rapt attention, and through the clouds, we saw it under new aspects.</p></blockquote><p>From Nascimento e Sousa:</p><blockquote><p>The sun, which was surrounded by clouds, trembled hesitatingly&#8230;I saw there a very pronounced yellow color, and it seemed to me that I saw a silver color beneath the solar disc, but I don&#8217;t guarantee that.</p></blockquote><p>From Maria de Campos:</p><blockquote><p>We started to see the disk of the sun, and see it clearly against the dark gray layer which covered the entire sky&#8230;we saw something like a silver-lined veil, with a round shape, as if it were a full moon.</p></blockquote><p>Again, I&#8217;m not sure this matters, since some of the later miracles were in a clear sky.</p><p><strong>1.1.3 - Inconsistency</strong> </p><p>Ethan points out that if the sun were partially veiled by clouds, to the point where it was not too bright to stare at, then it presumably also would not bright enough to produce weird entoptic phenomena and hallucinations.</p><p>When we discussed this, I had no better solution than to say that maybe there was a level of brightness which was dim enough to look at, but still bright enough to produce phenomena/hallucinations.</p><p>But again, I&#8217;m no longer sure this matters. Many people in the comments to the original post report staring at the completely-non-veiled sun without feeling pain or having negative effects, many Medjugorje pilgrims say they saw the miracle in a completely clear sky without pain, and fire kasina practitioners can get imagery/phenomena from looking at dim or medium-brightness lights.</p><p>I agree with Ethan that the sun at midday is so bright that it&#8217;s painful for me to look at for even a fraction of a second, and I don&#8217;t understand how so many people are saying they stare at the sun for minutes at a time at any time of day just because they&#8217;re bored.</p><p><strong>2: Distant Witnesses</strong></p><p>Ethan was able to find more medium-distant witnesses than I could:</p><ul><li><p>The two witnesses at Alburitel, who I thought were in the same group, were actually in two different groups (is it surprising that our only witnesses from each of these two groups are each other&#8217;s brother?)</p></li><li><p>A priest stated that some people had witnessed the event in Leiria, a city ~12 miles away. We previously had one eyewitness there, but the priest seems to mention people, plural. On the other hand, he was writing this in the Leiria newspaper - if an entire city of people had just witnessed a miracle, would they really need their newspaper to tell it to them?</p></li><li><p>A nun stated that some people had seen &#8220;something&#8221; appear in the sun in Torres Novas, also about 12 miles away, though she is not really clear on whether she saw it herself or is just relaying other people&#8217;s impressions.</p></li></ul><p>I continue to be confused by a pattern in which we have one or two secondhand testimonies from entire towns that supposedly witnessed a dramatic miracle. </p><p>Ethan then proceeds to make the situation tougher for himself, describing two witnesses from 120 km and 160 km away. But a 160 km circle includes three big cities - Porto, Coimbra, and Lisbon - along with many medium-sized towns and small villages.</p><p>When we combine this with the evidence from Ghiaie - where it was witnessed from distant Tavernola but not equally-distant Milan - I think these testimonies are more consistent with a few suggestible people saying &#8220;Oh, a cool miracle? Yeah, I definitely saw it too&#8221; than sightlines that spread through normal geography. I think people were more likely to say this if they were close (and so it was plausible) than if they were very far away (and so it was less plausible), but that this is some kind of gradually declining function, rather than the sharper function you would expect if there were an actual boundary.</p><p>(one person in <em>central Germany, </em>about 500 miles away, claimed to see the Ghiaie miracle - I didn&#8217;t include this on the original post, because it didn&#8217;t seem credible, but I think it&#8217;s good evidence that sometimes people say non-credible things)</p><p>I do continue to be confused by the Alburitel stories, which seem much stronger than the others, and perhaps by the Minde story, which is at least in the right place.</p><p><strong>4: Heat</strong></p><p>I don&#8217;t think this made it in the post, but during a conversation Ethan answered one of my objections - that any heat warm enough to dry clothes in Fatima would have started fires and explosions closer to the source - by saying that unlike the light (which was visible omnidirectionally), the heat was a ray shot straight at Fatima, which didn&#8217;t affect anywhere else. I admit this answers my objection. I won&#8217;t even ask for a complexity penalty here, because it makes sense that a just God would try to avoid frying random villages.</p><p><strong>5: Ending</strong></p><p>One objection I raised to Ethan&#8217;s not-the-real-sun story was that, when the miracle ended, the fake sun would either have to disappear, or remain in the sky long enough to be seen alongside the real sun. But witnesses reported neither of these two things. </p><p>Ethan reports one witness who says they saw a fake sun first leave from, then merge with, the real sun. I have that witness statement too - it&#8217;s on my list of weirder testimonies that don&#8217;t mesh with everyone else&#8217;s. The large majority said they only saw one sun. If most people had seen multiple suns, we wouldn&#8217;t be having this discussion.</p><p>If I understand Ethan correctly (which I might not, I&#8217;m having trouble interpreting this passage), he thinks that maybe the clouds cleared enough to reveal the real sun right as the fake sun moved into the same position as the real sun, the crowds were temporarily blinded, and the fake sun took advantage of this to disappear unnoticed.</p><p><strong>5.2: Later Miracles</strong></p><p>I claimed that later miracles were obviously not objective-in-consensus-reality. For example, the Benin City sun miracle was seen by people in one field, but not in the rest of the surrounding city of 1.5 million people; the Lubbock sun miracle was seen by something like 50 - 75% of attendees. I said that this suggested the Fatima miracle wasn&#8217;t objective either.</p><p>Ethan objects that there is no reason the different miracles should be implemented the same way, and that maybe Ghiaie was a unidirectional beam of light focused away from Milan, and that maybe Benin City was entirely subjective, but Fatima was omnidirectional and objective. I of course cannot disprove the possibility that God implements the same miracle in different ways at different times; the most I can do here is ask for a complexity penalty.</p><p><strong>5.3: Domingos Pinto Coelho</strong></p><p>DPC was a lawyer and statesman who saw the miracle at Fatima, wrote an article about it, and dropped at the end that the next time he&#8217;d encountered similar weather conditions he&#8217;d tried staring at the sun again and seen the same miracle. I described it as a powerful testimony in favor of the illusion/hallucination/suggestion hypothesis.</p><p>Ethan says that &#8220;the Portugese historian Costa Brochado cast doubt on the integrity of this report&#8221;:</p><blockquote><p>The articles of Dr. Pinto Coelho in <em>A Ordem </em>seem to be very much exaggerated. It is difficult to understand the manifest confusion he establishes between the phenomena at Fatima&#8230; and the alterations in solar light that he says he saw in Lisbon some days afterward. But in any case the historical value of the articles of the leading Catholic organ is almost nil&#8230; We believe that we can declare, after patient research on the matter, that the articles of Dr. Pinto Coelho ought to be read from a political point of view, since their objective was, as the author himself came to declare, to serve as the devil&#8217;s advocate</p></blockquote><p>As far as I can tell, this is just a historian named Costa Brochado saying he doesn&#8217;t believe Coelho. I don&#8217;t know why we should trust Costa Brochado, but since we&#8217;re bringing in random historians&#8217; unsupported assessments of Coelho&#8217;s honesty, here is Father Stanley Jaki:</p><blockquote><p>Nobody could doubt that he [DPC] was a man of utter veracity, a point to which no proper attention has been paid in the Fatima literature. There he is all too often ignored and when not, he is dismissed as someone who had an axe to grind on behalf of Church authorities wary of Fatima&#8230;in view of Coelho&#8217;s unquestionable probity, one has to assume that he saw, with eyes unblurred, what he claimed to have seen, a repetition of the miracle of the sun. He never retracted, however slightly, his claim. As one who in his last hours fervently invoked the help of Jacinta who he came to venerate as a saint, Coelho would have hardly lived with the knowledge that he had intentionally mislead countless readers of his in a matter that so closely involved Jacinta and the other two <em>videntes</em>&#8230;Coelho surely must have thought that </p></blockquote><p>Rather than keep calling character witnesses, I think it&#8217;s more helpful to note that we now have two more testimonies of people who saw the miracle once, then were able to reproduce it under less holy conditions. One is Case One of <a href=\"http://slatestarcodex.com/Stuff/fatima_nixapple.pdf\">Nix &amp; Apple</a>, who describe someone who saw the miracle in Medjugorje, then went home to New Orleans and was able to see it again. The other is person #14 on my list of survey responses. I emailed him and asked him to confirm that he was claiming that he could repeat the miracle when the weather conditions were just right. He responded:</p><blockquote><p>Yes, exactly. Excluding sunsets, I was able to focus on the sun when it was in a cloudless area of the sky only once (after the pouring rain had just stopped); on all other occasions, the intensity of the light made it impossible to focus on the sun. With translucent clouds, focusing on the sun was easier, and the visual changes (colors, apparent movement) appeared consistently after a few seconds.<br /><br />Even though it wasn&#8217;t asked in the questionnaire, I have a hypothesis about the physiology underlying the phenomenon, or at least the parts I experienced. Thinking back to those experiences, I might hypothesize that the intense white light of the sun caused the simultaneous formation of afterimages of different colors in the same area of the visual field. It could be that the visual system, in the presence of conflicting signals, instead of integrating the information by creating a white afterimage, rapidly switched attention from one color to another, creating the alternating colors. If this process occurs unevenly across the afterimage area, different parts of the area will change color at slightly different times, creating the appearance of movement within the area itself.</p><p>I think the reason this phenomenon is not very common is because there is a narrow window between &#8220;light too bright to stare at the sun&#8221; and &#8220;light too dim for the alterations to appear.&#8221;</p><p>The reason I was able to get these results repeatedly was because I was trying to replicate them, so whenever I saw translucent clouds, I tried to conduct the experiment. With clouds that were too thin I failed, but with clouds that I believe belonged to the Stratus translucidus or Altostratus translucidus category, I succeeded.</p></blockquote><p>I would have agreed with this earlier, but it&#8217;s awkward to have so many people who say they&#8217;ve seen this in a completely clear sky. Very speculatively, there might be some individual variability in the ability of the eye to adjust out brightness, and different people will reach their sweet spots in clouded vs. clear skies.</p><p><strong>6: &#8220;God is not a man, that He should lie, nor a son of man, that He should change his mind.&#8221;</strong></p><p>Speaking of complexity penalties, I have a broader objection to some of the moves Ethan is making here.</p><p>If I understand his theory correctly, it goes like this: the miraculous object at Fatima was not the sun. But God put a lot of effort into tricking people into thinking that it was. Even though the object was below the clouds, He made the clouds clear around it at the moment of its appearance, so that it <em>looked like</em> the clearing clouds had revealed a normal above-the-clouds sun. Then, when it was time to remove the object, He made it disappear at the exact moment that the real sun came out behind clouds, so that the crowds would be too dazzled to notice that the object and the sun were two different things.</p><p>This leaves a bad taste in my mouth, for two reasons:</p><ol><li><p>God shouldn&#8217;t try to trick people.</p></li><li><p>But if He does try to trick people, He should succeed.</p></li></ol><p>I can&#8217;t say either of these two things with confidence. Doesn&#8217;t the Biblical God sort of try to trick Abraham into thinking he&#8217;s going to have to sacrifice his son? And what is God, anyway? Isn&#8217;t the whole world a product of God? Does the existence of mirages in the desert count as &#8220;God trying to trick people&#8221;? Does that fact that we know there are mirages imply that God failed?</p><p>Still, Ethan&#8217;s take on the &#8220;sun&#8221; miracle of Fatima seems like an unusually clear-cut case of God trying to trick people and failing, and I&#8217;m uncomfortable with it.</p><p>You can always add more overfitting. God&#8217;s goal was for the crowds at Fatima to be fooled, but then for Dalleur (2021) to figure it out, and so He achieved His goal perfectly. Okay. But speaking of overfitting&#8230;</p><p>If I understand Ethan right, Fatima was an objective omnidirectional light show, plus a unidirectional heat ray. Ghiaie was a spotlight-shaped unidirectional lightshow. Benin City was a subjective omnidirectional light show limited to a single field, plus an objective unidirectional heat ray. God implemented all of these miracles in completely different ways. Why? Inscrutable God reasons.</p><p>This isn&#8217;t a terrible answer. People often do things for reasons I can&#8217;t explain - if I could predict Trump&#8217;s behavior, my stock market returns would be much higher. And surely God, as a being with motives and knowledge far beyond my ken, should be even more incomprehensible.</p><p>But there was <a href=\"https://substack.com/@joerjames3/note/c-164963632\">an interesting recent Notes debate</a> about a Bentham Bulldog&#8217;s post. BB said that atheists had many problems - how was the world created? how do you overcome skepticism? what happened at Fatima? - whereas theism only has one problem - the problem of evil. Evil is a big problem, but it&#8217;s at least nice to only have <em>one</em>. </p><p>Some of the commenters - and I can no longer find the comment I liked anymore, but don&#8217;t take this as an original insight from me - pointed out that this is cheap. </p><p>If you are an atheist, you need to answer many <em>how</em> questions. <em>How</em> did the miracle at Fatima happen? If you try to explain it with natural laws - for example, gravity - it&#8217;s fair for an interlocutor to point out that gravity can&#8217;t do that; it can only make things fall.</p><p>If you&#8217;re a theist, you have a free option to convert any <em>how </em>question to a <em>why</em> question. How? Because God did it! Your interlocutor can&#8217;t object, because we know God can do anything. But in exchange, you now have a <em>why</em> question - why did God do that, and not something else? The sum of all why question - the fact that the real world doesn&#8217;t look like it was optimized for some specific plausible motive like goodness - is the problem of evil. Thus, it is exactly equivalent to all the inconvenient &#8220;how&#8221; questions you hoped you&#8217;d avoided.</p><p>The commenter sarcastically compared this to an attempt to sweep all scientific anomalies under the rug as &#8220;the problem of uncharacteristicness&#8221;. <em>How did Fatima happen?</em> &#8220;Well, it must have been produced by laws of physics, so there!&#8221; <em>But the sun spinning and dancing through the sky is hardly what you would expect from the laws of physics. &#8220;</em>Yeah, whatever, that&#8217;s just the &#8216;problem of uncharacteristicness&#8217;, we&#8217;ve already priced that one in, at least we only have one problem!&#8221;</p><p>This made me more attuned to questions of God&#8217;s motives. Yeah, it <em>is</em> kind of weird that God would create the same miracle three different ways, and we don&#8217;t know why. Yeah, it <em>is</em> kind of weird that God would try to trick people into thinking a non-sun-object was the sun, then let a few smart people working years later see through the deception. </p><p>Are these problems of motive exactly as problematic for the theist as 70,000 people seeing the sun do impossible things is for the atheist? My gut answer is no. Should I trust my gut?</p><h2>Dylan: In Defense Of Evan Harkness-Murphy</h2><p>Evan wrote the original response to Ethan, before I got involved in the debate. I was a bit harsh on him, saying that his part about the child-seers was fine, but calling his investigation of the sun miracle superficial and unfairly dismissive. Dylan of <em>Chaotic Neutral </em>writes <a href=\"https://substack.com/home/post/p-175116666\">In Defense Of Evan Harkness-Murphy</a>, and Evan additionally <a href=\"https://substack.com/profile/145855208-evan-harkness-murphy/note/c-162089036\">defends himself here</a>.</p><p>Before getting to Dylan&#8217;s post - yeah, I was unfair to Evan (partly this is because my brain has trouble remembering that Ethan Muse and Evan Murphy are two different people). In particular, I described his hypothesis on the child-seers as being that they &#8220;confabulated&#8221; their visions, a term that Evan took great pains to disclaim in his actual post. I was thinking of a broader definition of &#8220;confabulation&#8221; that includes hallucination-like phenomena - but Evan was right that if I had read his post carefully, I wouldn&#8217;t have used the specific word he said he was against. I mostly just skimmed it to see if he had a really good explanation for the sun miracle thing, then got annoyed when he didn&#8217;t.</p><p>But Dylan has additional complaints. He writes:</p><blockquote><p>Evan DID give this miracle the attention it deserved.</p><p>He spent 18 hours researching and writing his article, presenting much of the same evidence and coming to many of the same conclusions that Scott did, and he did it as an ordinary citizen with a &#8220;day job&#8221; and in a household that &#8220;does not possess a dishwashing machine.&#8221;</p><p>What more could you ask of a skeptical individual!? Unlike myself and the other lazy skeptics, he actually did respect this miracle claim enough to do a proper investigation. And towards the end, yes, he decided to wrap up early [&#8230;]</p><p>To criticize Evan&#8217;s conduct here in this miracle debate is to set an extremely high bar that cannot possibly be met by the overwhelming majority of the skeptical community. Such exacting standards will ultimately only serve to discourage diligent skepticism like Evan&#8217;s and incentivize lazy skepticism like mine.</p></blockquote><p>I have two partial defenses of my own actions.</p><p>First, I think the majority of those 18 hours were spent on the child-seer section, which I acknowledged was good. I didn&#8217;t care about that part. To me, the trouble of explaining how three children can say in a convincing and honest-sounding and semiconsistent way that they saw the Virgin Mary is a rounding error compared to the trouble of explaining how 70,000 people can say in a convincing and honest-sounding and semiconsistent way that they saw the sun fall from the sky.</p><p>But second, I think Dylan is arguing that Evan should get an A for effort. I agree. He put in a lot of work, he adhered to good scholarly principles, and he hit all of the beats that a skeptical explanation is supposed to hit. The only thing he didn&#8217;t do, from my perspective, is defuse the fact that the Fatima miracle is extremely creepy, and I have no idea what to do with it, and I can&#8217;t fit it into my ontology.</p><p>Evan&#8217;s only attempt to defuse the miracle was that it was a hallucination or illusion or something. This is a reasonable conjecture, but for me it was already priced in - as soon as you hear about a miracle, the obvious next step is &#8220;well, maybe it was a hallucination or illusion or something&#8221;. I didn&#8217;t feel like his piece added anything extra.</p><p>Generously, some of his tangential points - like that Garrett and Almeida weren&#8217;t the perfect skeptics they are sometimes portrayed as - might have defused 1% of my discomfort. I think a reasonable conclusion for this would have been &#8220;I&#8217;ve rehearsed the obvious arguments for why it is possible to be skeptical of anything, I&#8217;ve found some tangential facts that maybe remove 1% of the mystery, but man, I don&#8217;t know, this really needs lots more investigation&#8221;.</p><p>My research hardly provided any kind of brilliant omni-solution, but I think that learning about the Ghiaie/Benin/Lubbock/Medjugorge followup miracles and the Redditor testimonies each defused about 15% of my reluctance to accept Fatima as natural, and the fire kasina + Khomeini stuff defused another 10%, to the point where I&#8217;m only about 60% as confused and unhappy as when I started. I hope I correctly signposted this level of success/failure to the reader. </p><h2>On Miracles</h2><p>Other responses tried to assert a general point that we should always disbelieve miracles.</p><p><strong>I.</strong></p><p>Eugene Earnshaw writes that <a href=\"https://eugeneearnshaw.substack.com/p/we-do-not-need-to-care-about-miracles\">We Do Not Need To Care About Miracles</a>. If I understand his argument right: there are many examples of anomalous phenomena (eg crop circles) and stage magic (eg sawing a woman in half). When we don&#8217;t know how these are done, they seem impossible, and (almost) no amount of armchair reasoning can produce a plausible explanation. But in many cases, we have eventually figured them out - some &#8220;white hat&#8221; crop circlers <a href=\"https://www.youtube.com/watch?v=fYMZNmjBDSQ\">explain</a> how they make their seemingly-impossible patterns, and some magicians publish explanations of their tricks. After the fact, we can see how these seemingly-impossible things followed natural law after all. So we shouldn&#8217;t worry too much each time we encounter a new miracle that hasn&#8217;t yet been explained.</p><p>Okay, but - suppose that the Pope said &#8220;I&#8217;m tired of convincing you people the normal ways, I&#8217;m going to start blowing up mountains&#8221;, and pointed his papal staff at Mt. Everest, and it exploded. And then we asked him to repeat the performance, and he did so as many times as we asked him, again and again. Would we shrug and say &#8220;Nothing to see here, I&#8217;m sure there&#8217;s some reasonable explanation&#8221;?</p><p>If the miracle were sufficiently convincing, we would either believe it, or at least think it pointed at something interesting (maybe the Vatican obtained super-nukes and is hiding them under mountains and choreographing their detonations - but this would be pretty important and very different from &#8220;nothing to see here&#8221;).</p><p>Ben Landau-Taylor <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162077671\">gives </a>a related answer, reminding us that meteorites used to be dismissed on exactly these grounds. The science of the day didn&#8217;t allow for non-planet objects to be in space, so rocks falling from the sky was every bit as weird as the sun dancing and changing colors. <em>&#8220;When President Jefferson was told that Professors Silliman and Kingsley had described a fall of stones from the sky at Weston, in Connecticut, he remarked: &#8216;It is easier to believe that two Yankee professors will lie than to believe that stones will fall from heaven.&#8217;&#8221;</em></p><p>In the end, I think we just get back to regular Bayesianism. We have two hypotheses: First, that the world acts entirely according to natural law. Second, that sometimes it includes divine intervention (or very surprising natural laws that we wouldn&#8217;t have predicted beforehand). We start with a high prior on the first hypothesis based on our long history of seeing only natural events. When we see evidence that is more likely on the second hypothesis than the first, we update in favor of it. We should remember that &#8220;more likely on the second hypothesis than the first&#8221; is full of pitfalls - on the first hypothesis, it&#8217;s likely that there will be many skilled fraudsters and stage magicians, so even very strange-seeming anomalies might not be very unlikely under it. Still, at the point where the Pope starts blowing up mountains, maybe you think it&#8217;s pretty unlikely that stage magic could accomplish this, and you update a little.</p><p><strong>II. </strong></p><p><a href=\"https://omnebonum.substack.com/p/against-arguments-from-miracles\">Omne Bonum</a> makes a different point: there are many possible miracles. Most do not occur. Yes, a few of them do. But can we be sure it&#8217;s above the background rate? Even if there are no true miracles, you&#8217;ll get one-in-a-million coincidences one-millionth of the time. If you&#8217;re not good at accounting for the 999,999 failures - and people aren&#8217;t - this will look impressive.</p><p>Against this, what is the base rate for the sun changing color and dropping out of the sky, at the precise time that child-seers prophecied a miracle would occur? Seems lower than one in a million. Impossible things should never happen. Something as simple as my pen vanishing from my desk, in plain sight, while I am looking straight at it, should completely demolish all of my priors against miracles and make me near-certain that something beyond normal physical law is going on - or that I&#8217;m crazy, or dreaming, or <em>something</em> other than just &#8220;well it was a coincidence&#8221;.</p><p><strong>III.</strong></p><p>FLWAB <a href=\"https://flyinglionwithabook.substack.com/p/humes-argument-against-miracles-is\">takes on Hume&#8217;s argument against miracles</a> (see also Kenny Easwaran <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162045647\">here</a>), which - sorry, I realize it&#8217;s suspicious to say this about a famous philosopher - is extremely bad.</p><p>Hume argues that a miracle is a violation of natural law. And a natural law is something that is always true. But since it&#8217;s always true, it can&#8217;t be violated. And if we eventually confirmed that it <em>was</em> violated, then we were wrong about it being a natural law. Which means its violation wasn&#8217;t even a real miracle anyway.</p><p>This seems to be a purely semantic argument. We know that the Red Sea usually stays in one place. But suppose Moses lifts his staff and parts the Red Sea, and that all of this is very convincing (we witness it personally, we measure the sea with various instruments, etc).</p><p>I think Hume would have to say that we have disproven the natural law &#8220;the Red Sea usually stays in one place&#8221; - but only in favor of a new natural law &#8220;the Red Sea stays in one place <em>except when</em> Moses raises his staff&#8221;. And since we have never observed a violation of this <em>new</em> natural law, no miracle has occurred!</p><p>Against this, we can call the way things work 99.999% of the time, when God isn&#8217;t acting directly, and when everything is proceeding via predictable material patterns &#8220;natural law&#8221;, and the very rare deviations that only occur in the presence of God or other extremely holy figures &#8220;miracles&#8221;. If for some reason you hate that terminology, come up with a new word, &#8220;shmiracle&#8221;, for the abnormal phenomena that only occur secondary to God&#8217;s direct intervention, and then we can argue whether shmiracles exist.</p><p><strong>IV.</strong></p><p>Why am I insisting on this so hard?</p><p>This question of miracles is no different from every other question, where <a href=\"https://slatestarcodex.com/2020/02/12/confirmation-bias-as-misfire-of-normal-bayesian-reasoning/\">confirmation bias is a part of normal Bayesian reasoning</a>. If you believe that vaccines don&#8217;t cause autism, then any given study showing that they do is likely to be a fraud or a mistake - especially given the history of such frauds, and the political pressures for producing them. But you gained your belief that vaccines don&#8217;t cause autism through some normal amount of evidence, and if the evidence that they <em>did </em>cause it ever become truly overwhelming, you would switch sides.</p><p>The key skill of rationality is to know when to update your beliefs how much. These arguments feel like sleights-of-hand arguing that you can avoid <em>ever</em> updating on this question. I don&#8217;t think Bayesian reasoning provides an excuse for this.</p><p>I think some of these arguments attempt to make an objection that the prior probability of miracles is zero, and so no matter how much evidence you get, you can never update towards them. But the prior probability of miracles isn&#8217;t zero unless either the prior probability of God&#8217;s existence is zero, or the probability that God intervenes in the universe is zero. I don&#8217;t know any infinitely-convincing argument for either of these points, so I think miracles have a prior probability above zero, which means we have to treat them the same as any other hypothesis. Yes, we will need many extra guardrails and cautions and good heuristics to prevent ourselves from getting bamboozled by the pitfalls that lurk in this area in particular. But that&#8217;s true of everything! You also need extra guardrails and cautions and heuristics to prevent yourself from getting bamboozled by scientific studies! There&#8217;s no substitute for doing the work.</p><h2>Actual Highlights From The Actual Comments</h2><p><strong>Josh</strong> (<a href=\"https://joshgg.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">blog</a>) writes:</p><blockquote><p>I&#8217;d add that we have at least one verified case where a sun miracle was occuring, and an actual group of fedora wearing atheists were present with a modified telescope, and did not see anything interesting.</p><p><em>&gt;&gt; &#8220;At the Conyers site, the Georgia Skeptics group set up a telescope outfitted with a vision-protecting Mylar solar filter, and on one occasion I participated in the experiment. Becky Long, president of the organization, stated that more than two hundred people had viewed the sun through one of the solar filters and not a single person saw anything unusual (Long 1992, 3; see figure 1).&#8221;</em></p><p><a href=\"https://centerforinquiry.s3.amazonaws.com/wp-content/uploads/sites/29/2009/11/22164423/p14.pdf\">https://centerforinquiry.s3.amazonaws.com/wp-content/uploads/sites/29/2009/11/22164423/p14.pdf</a></p></blockquote><p>Funny, but they don&#8217;t provide information like whether people were seeing sun miracles at the exact moment the telescope was being used, or whether anyone who could see a sun miracle without the telescope switched to using the telescope and then it stopped. They just say they brought a telescope to a Marian site where some people had seen sun miracles at some point.</p><p>Even if they clarified that some people had used the telescope while seeing a sun miracle and had it immediately stop miracle-ing, I don&#8217;t think this would update me very much. We know it&#8217;s not the real sun (Ethan says fake sun, I say subjective phenomenon), and we know the non-Fatima miracles aren&#8217;t objective (Ethan says only Fatima was objective, I say none of them were objective).</p><p><strong>John Schilling </strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162075283\">writes</a><strong>:</strong></p><blockquote><p>Twenty-nine *thousand* words on this subject, and none of them are &#8220;unidentified&#8221;, &#8220;flying&#8221;, or &#8220;object&#8221;. Well, OK, there are a few uses of that last, but in the strained phrasing of &#8220;UFO-like object&#8221;, as if we are preemptively discounting the possibility that sun miracles are actually UFOs.</p><p>Sun miracles are actually UFOs, full stop. Not &#8220;flying saucers&#8221;, not &#8220;alien spaceships&#8221;, maybe &#8220;divine miracles&#8221;, but definitely &#8220;unidentified flying objects&#8221;. We invented that last phrase for a reason, and this is exactly that reason.</p><p>Which means, the thing I learned from this is that the younglings have completely forgotten all that was learned in the Before Times about UFOs. And that, in this context, Scott is a youngling - UFOs seem to have faded from pop culture in the 1990s. Thanks for making me feel old, Scott :-)</p><p>With the benefit of age and experience, I read the first few paragraphs, made the tentative conclusion that this was almost certainly [see section 6], but figured Scott wouldn&#8217;t be doing this deep a dive if it was that simple. And here we are. It probably is just that simple, and now we can back that up with a fairly exhaustive look at the alternatives. For which, unironically, thank you Scott. It&#8217;s good to sometimes double-, triple-, and quadruple-check the obvious conclusion.</p><p>But for those of us who grew up in the 1980s, who were &#8220;rationalists&#8221; when rationalism hadn&#8217;t been invented and we had to call ourselves &#8220;skeptics&#8221;, UFOs were as important a subject of rationalist/skeptical inquiry as is AI risk today (and for about the same reason). People learned an awful lot in those days. One of those things is that most people don&#8217;t spend much time really looking at the sky and will consistently fail to recognize even slightly-unusual phenomena, like the sun partially veiled by clouds. And the other, more important thing is that when presented with an image they don&#8217;t recognize, people will very predictably see what their culture has taught them to expect to see.</p><p>In 1880s-1890s America, any weird thing in the sky was clearly a fantastic airship, built by some mad scientist out of a Jules Verne novel, and was perceived with a wealth of surrounding detail all aligned with that model. 1950s-1980s America, the same things were clearly &#8220;flying saucers&#8221;, fantastic alien spaceships piloted by little green or grey men, with the same level of impossible detail. And anywhere you&#8217;ve got ten thousand devout Catholics fervently hoping to see a Miracle involving the Sun, and the weather makes the sun look a bit wonky...</p><p>For an old-school skeptical experiment at understanding this effect,</p><p><a href=\"https://centerforinquiry.s3.amazonaws.com/wp-content/uploads/sites/29/1980/04/22165441/p34.pdf\">https://centerforinquiry.s3.amazonaws.com/wp-content/uploads/sites/29/1980/04/22165441/p34.pdf</a></p><p>TL, DR, a gathering of UFO enthusiasts expecting to see a flying saucer in the night sky, are presented with thirty seconds of a monochromatic point source of light at ground level, stationary and unchanging except for one brief interruption. What is perceived, is an object high in the sky with finite angular size and geometric shape, of multiple colors, and conspicuously moving, all consistent with the pop-culture concept of a flying saucer and not some prankster with a spotlight.</p></blockquote><p>I considered discussing the UFO angle (the section heading would have been &#8220;Virgin Galactic&#8221;), but in the end I couldn&#8217;t justify it.</p><p>Yes, the phenomenon is trivially a UFO (in the sense of a thing in the sky we don&#8217;t understand). But does this help us? When I think of UFOs, I think of people arguing about whether something was the planet Venus, or a weather balloon, or aliens. But Fatima obviously wasn&#8217;t Venus or a balloon (though, uh, <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162086632\">see here</a> for a dissenting take). And if it was aliens, you&#8217;d have to explain why they pretended to be the Virgin Mary and discussed a bunch of Catholic inside-baseball with a trio of child-seers for several months. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!H6Qh!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6087bbd3-2496-46b1-87e0-f96ce73c19d2_522x223.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"223\" src=\"https://substackcdn.com/image/fetch/$s_!H6Qh!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6087bbd3-2496-46b1-87e0-f96ce73c19d2_522x223.png\" width=\"522\" /><div></div></div></a></figure></div><p>So what&#8217;s left? When I asked John, he answered:</p><blockquote><p>UFOs, are just people seeing something they don&#8217;t understand and trying to interpret it by an overweighted, culturally-transmitted prior. Which differs from culture to culture. And that&#8217;s something we know a lot about. Which you seem to have independently rediscovered, but I can&#8217;t help thinking you&#8217;d have got there a lot faster if you&#8217;d had a proper map of the territory. A map which includes no aliens outside of the imaginary sort.</p></blockquote><p>Maybe one way to rescue the UFO connection is to say that there&#8217;s so much weirdness that we should be less willing to take any given example of weirdness on its own terms. I asked in the comments for other examples of miracles as compelling as Fatima. People suggested some of the better-verified reincarnation accounts, some of the better-verified UFO sightings, and some of the more spectacular psi phenomena. I don&#8217;t know if these are all <em>exactly</em> as strong as Fatima, but I think many of them are closer to Fatima than to the traditional skeptical conception of an alcoholic liar asserting with zero evidence that he dun saw dem aliens one night.</p><p>When viewing all of these anomalies as a gestalt, we can go four different directions:</p><ol><li><p>Individualized natural explanations. The UFOs were swamp gas and weather balloons. The reincarnation stories are toddlers who are naturally gifted at cold reading. Fatima was entoptic phenomena. Sea serpents are really big oarfish.</p></li><li><p>Generalized one-fell-swoop natural explanations. People are extremely suggestible and have terrible memory. There are as-yet-barely-plumbed psychological phenomena where sometimes a very suggestible person can cause many seemingly-careful observers to make correlated errors. Historians constantly exaggerate and bury negative evidence, so all of these errors and confabulations come down to us as seemingly-ironclad evidence of the paranormal.</p></li><li><p>Individualized paranormal explanation. The UFOs are aliens, the reincarnations transmigrating souls, Fatima was the Virgin Mary. This would require some careful stitching together of different paradigms - what does the Virgin Mary think about all of these transmigrating souls? Did Jesus <a href=\"https://www.smbc-comics.com/comic/2008-11-24\">die for the aliens&#8217; sins</a> too? - but maybe we can make it work.</p></li><li><p>Generalized one-fell-swoop paranormal explanations. Demons are trying to confuse us, or the simulation is glitching, or there&#8217;s some kind of Harry Potter-esque masquerade overflowing with wizards and monsters that carefully hides itself from us Muggles but occasionally leaks.</p></li></ol><p>UFOs do not really lend themselves to an individualized paranormal explanation - too many weird aliens in saucers trying to send whichever message of peace and love is most politically popular at the time of the abduction, too few Matrioshka brains with nanotech - so bringing them into our attention may make us more interested in looking for a generalized paranormal explanation which is merely pretending to be all these specific supernatural beings, including the Virgin.</p><p>I take this one sort of seriously, but I also think it violates a general heuristic against conspiracies and false flag attacks. If some incredibly powerful being is telling you that it&#8217;s the Virgin Mary, and discussing Catholic doctrine, and performing healing miracles, I think you should at least start with a presumption of taking it seriously. But at this level of distance from any well-established priors, who even knows?</p><p><strong>GedAtThwll </strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162063499\">writes</a><strong>:</strong></p><blockquote><p>This account reminds me of the semi-famous Ariel School UFO encounter [in Zimbabwe], covered well <a href=\"https://youtu.be/VIwyW83-riA\">on YouTube</a> and <a href=\"https://en.wikipedia.org/wiki/Ariel_School_UFO_incident\">Wikipedia</a>. Basically, ~60 kids saw a &#8220;silver craft&#8221; descend, and aliens (of debatable description) came out and did various things (described differently by participants). Oddly similar to the silver sun -&gt; hallucinations.</p></blockquote><p>I don&#8217;t know how much it reminds me of Fatima, but I agree &#8220;sixty people all say they saw a UFO and some aliens&#8221; is the sort of mass hallucination I claimed basically doesn&#8217;t happen. I was going to attribute this something about the psychic makeup of poor uneducated Zimbabwean children, but according to Wikipedia, &#8220;Ariel School was an expensive private school [and] most of the pupils were from wealthy white families in Harare.&#8221;</p><p>One interesting feature of this story is that it happened a few days after a previous UFO panic in Zimbabwe - thousands of people said they saw some kind of fiery spaceship in the sky. This was very likely true - their accounts <a href=\"https://gideonreid.co.uk/russian-rocket-over-africa/\">match a Russian rocket</a> that reentered and burned up in the atmosphere around that time. So it seems like maybe the rocket primed people into a UFO mania, and that caused . . . sixty schoolkids to all hallucinate the same thing? At least to the point where some later investigators who are accused of maybe asking some leading questions could get them to give similar answers?</p><p><strong>Peter McLaughlin </strong>(<a href=\"https://herfingersbloomed.substack.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">blog</a>) <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162116898\">writes</a>:</p><blockquote><p>This is excellent. One additional strand that I&#8217;d like to see someone tug on &#8211; maybe I will. The Irish nationalist poet W. B. Yeats has a poem about the 1891 funeral of Irish nationalist political leader Charles Stewart Parnell. The poem describes how clouds covered the sky on the day of the funeral, the sun could be seen through a gap in the clouds, and then a star &#8220;shoots down&#8221;. Most people who write about this poem take this to be pure symbolism (the next stanza describes a scene of pagan sacrifice that definitely is pure symbolism), but a while ago I came across an essay where Yeats insists that no, this actually happened.</p><p>He wasn&#8217;t at the funeral himself, but he knew lots of people who were. He cites his unrequited love Maud Gonne telling him afterwards about &#8220;the star that fell broad daylight as Parnell&#8217;s body was lowered into the grave&#8221;, and quotes the writer Standish O&#8217;Grady:</p><p>&#8216;I state a fact - it was witnessed by thousands. While his followers were committing Charles Parnell&#8217;s remains to the earth, the sky was bright with strange lights and flames. Only a coincidence possibly, and yet persons not superstitious have maintained that there is some mysterious sympathy between the human soul and the elements, and that storm, and other elemental disturbances have too often succeeded or accompanied great battles to be regarded as only fortuitous...&#8217;</p><p>Now, Yeats was exceptionally credulous and prone to exaggeration. And he wrote the poem years after the funeral: while I think it&#8217;s very unlikely, it&#8217;s not impossible that he was &#8216;contaminated&#8217; by subsequent knowledge of the reports from Fatima, and this coloured the way he stitched together the testimony he&#8217;d heard. The two sources he cites are less obviously Fatima-esque than his poem (though they don&#8217;t contradict each other, and altogether they add up to something exceptionally Fatima-esque with the lights and the falling object etc.; and, again, my knowledge of Yeats&#8217; biography makes contamination seem unlikely). Even accounting for all this, the similarities between Yeats&#8217; poem and the Fatima sun miracle are really striking to me.</p><p>I think this is a potentially very important datapoint, because it&#8217;s an almost entirely non-religious example. To be sure, you can define &#8216;religion&#8217; so that Irish nationalism can be a religion, but it&#8217;s very different from a bunch of people huddling on a hill because someone told them the Virgin Mary might appear. And indeed Parnell was in the unique position of being the Protestant leader of a mostly-Catholic political movement, cutting across Ireland&#8217;s religious divide. If there really was a Fatima-esque sun miracle at Parnell&#8217;s funeral, it strongly suggests that the correct explanation is (a) non-religious/materialist but also (b) &#8216;objective&#8217; (or at least as intersubjective as optical illusions) rather than a matter of pure mass hysteria or hallucination. Which is exactly what this post suggests. And Parnell&#8217;s funeral came several decades before Fatima, so genuine primary sources would rule out &#8216;social contagion&#8217; completely.</p><p>This has been kicking around in the back of my mind for a while, but if enough people are interested I may try to track down the sources. The main published collection of Yeats&#8217; letters to and from Gonne starts in 1893, two years after the funeral, so the main source he cites might be tricky to verify. But there might be independent diaries or newspaper reports from people at the funeral who weren&#8217;t in Yeats&#8217; social circle, and at very least I can check the quote from Standish O&#8217;Grady.</p></blockquote><p><strong>Melias </strong>(<a href=\"https://hanareta.substack.com/\">blog</a>)<strong> </strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162125031\">writes</a><strong>:</strong></p><blockquote><p>This is my perspective as an Orthodox Christian, and a possible framework for interpreting Fatima as a real miracle without becoming a fire-and-brimstone Catholic.</p><p>It&#8217;s possible that Fatima et al. are partially or entirely from God. It&#8217;s also possible they are partially or entirely demonic phenomena, though often repurposed by God to good ends. Either way, if I have good reason to believe the Catholic Church is not fully in accord with Divine Truth, these miracles on their own shouldn&#8217;t make me change my mind.</p><p>Christ Himself tells us to believe for His own sake, not for the sake of miracles. I believe in the supernatural because of numerous miracle stories that are impossible to explain otherwise. But my non-materialism is specifically Orthodox Christian because I can&#8217;t explain Jesus unless He&#8217;s the Christ, and I find Him most clearly in the practice and teachings of the Orthodox Church. Orthodoxy has plenty of miracles too, but that&#8217;s not why I&#8217;m here.</p><p>I.E. Christ Himself gives you permission to decouple the reality of a supernatural occurrence from an associated claim to Divine Truth. You can use Fatima to update the chance of P(supernatural) without an equal update to P(Catholicism).</p><p>Anyway, if you do want to keep going down the miracle rabbit-hole, the Orthodox equivalent of Fatima is the annual miracle of the Holy Fire. The main miracle - that a candle is miraculously lit while the Patriarch of Jerusalem is alone in the Holy Sepulchre - has supposedly been debunked since the Middle Ages. Even many Orthodox doubt it. But pilgrims regularly report a secondary miracle: For the first few minutes, candles lit from the Holy Fire don&#8217;t burn things, at least not how they should.</p><p>Some videos</p><p>[<a href=\"https://www.youtube.com/watch?v=4kZu87tyqJ4\">Video 1 here</a>] Looks like this guy should have severe burns</p><p>[<a href=\"https://www.youtube.com/watch?v=rqJylLMRQYI\">Video 2 here</a>] My brain tells me this might be possible with regular candles... but her sleeve gets plenty of time under intense flame</p><p>[<a href=\"https://www.youtube.com/shorts/ipvp22o9khI\">Video 3 here</a>] They don&#8217;t leave their flesh in the flame for too long, but my brain tells me that putting the bundle of candles directly under your chin like the man does at 0:07 should also result in serious burns</p><p>I pray before a single small candle every night. If I put my hand two inches above the visible flame, I can only hold it for ~2 seconds until it hurts too much. I find the videos and first-hand testimony (see Rod Dreher&#8217;s blog for one example) pretty convincing.</p></blockquote><p><strong>Deiseach </strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162210821\">writes</a><strong>:</strong></p><blockquote><p>Ah, I&#8217;m not pushed about Marian apparitions. The miracle of the sun is along the lines of the Shroud of Turin - you don&#8217;t have to believe the shroud is really the shroud of Jesus Christ, nobody is making you, it&#8217;s not doctrine. At the same time, if you want to venerate it (as you would a crucifix) that&#8217;s okay. Keep away from making extravagant claims, don&#8217;t contradict received doctrine, and it&#8217;s fine.</p><p>Did a miracle happen at Fatima? I have no idea. I believe in God and the supernatural and all that jazz, but I&#8217;m not living and dying on &#8220;did this one event at this one apparition site really happen? if you prove it didn&#8217;t, oh no my faith is destroyed!&#8221;</p><p>During the moving statue craze in Ireland, we had our own little local apparition. At the height of it, tour buses used to come with people to pray at the site. That has long died down, and I don&#8217;t recall that there were any earth-shattering revelations claimed by the visionaries, what remains is a quiet revival in people going to pray the rosary at the grotto.</p><p><a href=\"https://en.wikipedia.org/wiki/Moving_statues\">https://en.wikipedia.org/wiki/Moving_statues</a></p><p>There are a *lot* of alleged apparitions and private revelations that are never officially accepted by the Church, and a lot more which are condemned as fakes and frauds.</p></blockquote><p><strong>Ross Douthat</strong> writes (on Twitter):</p><blockquote><p>Re-read Scott Alexander&#8217;s Fatima post (why not?) and I think this is where his analysis goes astray - after realizing there were a bunch of &#8220;echo&#8221; miracles like the initial case, not all church-approved, he decides that *strengthens* a skeptic&#8217;s case.<br /><br />But you don&#8217;t have to postulate demons to see why a big miracle might have non-church-approved sequelae. 1) Catholicism could be fallible in discerning which miracles are legit. 2) Even seers have free will; visions could fall on fallible ppl who run wild with dubious claims and 3) you&#8217;d expect a big miracle to have some sequels where enthusiasm does get the better of people (which any theory of miracles obviously has to allow for). Clearly (if He exists) God doesn&#8217;t force ppl to correctly interpret every experience He grants them, and so a multiplicity of miracle sequels, some of which seem credible and even produce video evidence, and some of which veer off into left field, seems entirely compatible with the original one actually being a divine intervention - if that&#8217;s where the core evidence points.</p></blockquote><p>I answered:</p><p>Thanks for engaging in depth. I admit that was a surprising direction for that result to go, but I mostly stand by it. </p><p>I think first, that the extra miracles demonstrate it has to be a subjective phenomenon. Partly because it was unclear at Fatima whether there were any people who didn&#8217;t see it (the two negative testimonies were such a small number compared to the many positive ones that it was tempting to dismiss them as lying, or confused, or looking the wrong direction) - but at several of the other miracles it&#8217;s much clearer that large fractions, sometimes a majority, saw nothing. Partly because in some cases (Benin City, Lagos) a stadium full of people saw it, but people in the same city, just outside the stadium, reported nothing unusual. And partly because the miracle can&#8217;t be caught on video (the one video that I thought was okay, the Filipino one, got picked apart in the comments). It being a subjective phenomenon doesn&#8217;t prove it&#8217;s not a miracle (it could be a sort of prophetic vision), but it at least opens the door to that possibility.</p><p>And second, although I don&#8217;t claim to be able to know for certain what God will or won&#8217;t do, I think at least the Necedah event meets any bar a reasonable person might set for &#8220;too dumb and heretical to be a real apparition&#8221;. If overly enthusiastic worshippers at a fake apparition can report sun miracles, that implies that the human capacity for hallucination is strong enough / specific enough to potentially produce spectacular sun miracles in some situations. But once we admit that, it&#8217;s only a trivial extension to say that this same human capacity to hallucinate sun miracles could have been responsible for the original sun miracle, which was more impressive than Necedah in degree but not in kind. </p><p>Together, I think these are a significant negative update from where we would be if we only had the original miracle, where we might have assumed (like Dalleur) that it was an objective phenomenon that everyone could see, and that there was no way anyone could be &#8220;enthusiastic&#8221; enough to hallucinate something so striking.</p><p><strong>Valerio</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162955018\">writes</a>:</p><blockquote><p>I am Italian from the south of Italy. I was talking to my mom about your analysis of the Fatima mystery (which is very famous here). My mom told me she had exactly the same experience when she was doing a &#8220;religious trekking&#8221; trip in a small city called Gallinaro (Frosinone). She was around 18 at the time (she is 70 now). She saw a pulsating sun, like it would get closer and closer and then the go back again. This effect repeated several times (3/4) and she got really scared.</p><p>Importantly, at the time she didn&#8217;t know about this effect of the pulsating sun (she learnt about it later).</p><p>Also importantly she claimed they were not staring particularly at the sun nor they were expecting any miracle. They were actually sitting down on a bench nearby a cliff eating a sandwich.</p><p>She doesn&#8217;t remember whether if was cloudy or not but she says she was able to stare in the sun, so maybe it was. As she was coming down the trip, her group met a local lady that confirmed those types of visions would occur there.</p><p>This place is famous cause a young little girl and her grandma had a vision in a cave ( little Jesus, no more details provided) few years back. When my mom visited the little girl was still alive, not sure about now. As I am writing this , she just told me the story so didn&#8217;t have the time to research it independently .</p></blockquote><p><strong>Victoria F</strong> <a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/164420045\">writes</a>:</p><blockquote><p>I think you put too much stock in the Catholic Church excommunicating someone and how much that reduces the odds that Mary was involved or not. Pope St. Leo I and St. Joan of Arc have also been excommunicated. Many seers are given difficult treatment by the Catholic Church at first.</p><p>Lot of people here say this is the the &#8220;best&#8221; miracle. I think the many spontaneous healings at Lourdes are perhaps better: <a href=\"https://www.basicincome.com/bp/files/A_Protestant_Looks_at_Lourdes.pdf\">https://www.basicincome.com/bp/files/A_Protestant_Looks_at_Lourdes.pdf</a> though I&#8217;m not sure how to get the medical records myself <a href=\"https://www.lourdes-france.com/en/the-medical-bureau-of-the-sanctuary/\">https://www.lourdes-france.com/en/the-medical-bureau-of-the-sanctuary/</a></p><p>Our Lady of Zeitoun is also perhaps a better apparition. At least it has <a href=\"https://www.youtube.com/watch?v=ikdDzR-5EA8\">some cool photos</a>.</p></blockquote><p>I admit excommunication of the seers/believers is not proof that some of the other miracles were fake, but the Necedah one, where Mary gave warnings about the Rothschilds, and the &#8220;seer&#8221; also talked to the ghosts of George Washington and Abraham Lincoln, seems pretty bad.</p><p>An acquaintance claims to have done their own analysis of Lourdes and found that the impressiveness of the healings predictably decreased over time as record-keeping and medical verifiability got better, but I haven&#8217;t seen his work. </p><p>There&#8217;s an interesting Substack post by a Zeitoun skeptic <a href=\"https://joshgg.com/p/no-the-virgin-mary-did-not-appear\">here</a>.</p><p><strong>Marcel </strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/164561085\">writes</a>:</p><blockquote><p>Speculative hypothesis that might be worth exploring: could the perceptual mechanisms involved in the Fatima Sun Miracle be related to those underlying T&#246;gal visions in the Dzogchen tradition of Tibetan Buddhism?</p><p>In T&#246;gal (an advanced, traditionally esoteric practice), meditators report experiences of multicolored, moving light displays in response to sky or light gazing. The parallels with the F&#225;tima reports are striking: light as a trigger, dancing colors, and evolving visionary forms.</p><p>If so, T&#246;gal might provide a reproducible framework for studying how visual and neurological processes, shaped by expectation and attention, can generate experiences of radiance that are interpreted as miraculous or sacred.</p></blockquote><p>Another Buddhist explanation! I can&#8217;t find a T&#246;gal source anywhere near as clear as Daniel Ingram&#8217;s work on fire kasina, but for what it&#8217;s worth, the symbol of Dzogchen Buddhism, the thigle, looks like this:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!tnHP!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcaa90086-ed0b-4620-b0e5-502d1d34419d_800x800.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"322\" src=\"https://substackcdn.com/image/fetch/$s_!tnHP!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcaa90086-ed0b-4620-b0e5-502d1d34419d_800x800.png\" width=\"322\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>&#8230;with some representations being even more suggestive:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!EVex!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c466a55-ea5c-4698-a27c-4947720edcfa_736x368.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"194\" src=\"https://substackcdn.com/image/fetch/$s_!EVex!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c466a55-ea5c-4698-a27c-4947720edcfa_736x368.jpeg\" width=\"388\" /><div></div></div></a></figure></div><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!vVge!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3052f661-b774-4dcb-9734-7c2e297c082a_225x225.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"381\" src=\"https://substackcdn.com/image/fetch/$s_!vVge!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3052f661-b774-4dcb-9734-7c2e297c082a_225x225.jpeg\" width=\"381\" /><div></div></div></a></figure></div><p><strong>Nikita Sokolsky </strong>(<a href=\"https://nsokolsky.substack.com/\">blog</a>) <a href=\"https://nsokolsky.substack.com/\">writes</a>:</p><blockquote><p><em>&#187; Our best source for witness testimonies is the Documentacao Critica de Fatima [...] The rest is available only as physical books, $15 + shipping each. Somebody should buy the books, scan them, machine translate the testimonies, and put the translations online. The most important is Volume III</em></p><p>I&#8217;ve ordered Volume III - though shipping anywhere outside Portugal cost $48 (not surprising for a 639 page book, I guess). They promise delivery by Oct 12th.</p><p><em>&#187; There are a few articles about solar retinopathy in the context of Marian shrines that I couldn&#8217;t access, including at least Nix and Apple (1987) and Campo et al (1988)</em></p><p>Emailed you both.</p></blockquote><p>Thank you, Nikita! I&#8217;ve uploaded <a href=\"http://slatestarcodex.com/Stuff/fatima_campo.pdf\">Campo here</a>, and <a href=\"http://slatestarcodex.com/Stuff/fatima_nixapple.pdf\">Nix &amp; Apple here</a>. Campo is only a few paragraphs, and contains little of interest if you&#8217;ve read the original post. Nix &amp; Apple profiles several cases in New Orleans, including a pilgrim who saw the miracle in Medjugorje and then went home and saw it <em>again</em> in New Orleans, and a second person who skipped Medjugorje and saw it in New Orleans with no previous exposure. There was also an interesting case of someone who stared at the sun for 15 minutes with no injury, then tried again for 15 seconds and <em>did</em> get an injury that time. My days of not understanding the function mapping sungazing length to injury probability are definitely coming to a middle. The eye doctors who wrote the article only say that &#8220;Evidence suggests a great individual variation in the susceptibility for developing solar retinopathy, as the cause of the lesion is felt to be a photochemical injury rather than a thermal injury of the retina and retinal pigment epithelium.&#8221;</p><p>The Ghiaie translations are in a form that makes them harder to upload, but there are about a dozen which contain descriptions of a sun miracle, all of which match the Fatima testimonies closely. The one I found most interesting was a monk nearby, who originally doubted the apparitions; he was in his monastery doing normal work when he saw the sun miracle, which included a beautiful white cross appearing in the sky. Other monks saw it too. The next day, he says that a secular newspaper claimed local astronomers had found some kind of ice crystal phenomenon responsible for the event, but he didn&#8217;t believe it. He didn&#8217;t clarify exactly where this happened (though his address was Castelnuovo Don Bosco, about 80 miles from Ghiaie) or when (though the testimonial implies it was at the same time as the Ghiaie miracle).</p><h2>Main Conclusions And Updates</h2><ul><li><p>I&#8217;m impressed by the fire kasina correspondence, but the difficulty in explaining how everyone immediately became an expert fire kasina meditator is almost as tough as explaining the original miracle.</p></li><li><p>The Khomeini moon miracle provides a powerful point of comparison / &#8220;control group&#8221;, and makes me more amenable to the possibility of extremely strange mass hallucinations. I would like to interview someone who saw this miracle about to what degree they just decided to connect the usual lunar splotches into Khomeini, vs. saw his face clearly in living color.</p></li><li><p>The Medjugorje witness who I interviewed said the sun was spinning instantly, the moment he started looking at it, which is troublesome for explanations that rely on retinal bleaching, near-blindness, and other complicated entoptic phenomena. The same witness understood what normal afterimages look like, and was very convinced it wasn&#8217;t just normal afterimages.</p></li><li><p>We collected two extra stories (along with the original Domingos Pinto Coelho story) about people who saw it once by divine will or coincidence, and then were able to replicate it later with conscious effort.</p></li><li><p>We collected about a dozen more stories of people who stared at the sun for a while and saw various weird spinny colorful things, though only after a few minutes, and not as consistent or as impressive as the miracle.</p></li><li><p>We collected many stories of people who stared at the sun for very long periods, outside of a miraculous context, not necessarily at sunrise or sunset, and didn&#8217;t feel too much eye pain or go blind. I continue to think that this isn&#8217;t too uncommon, and isn&#8217;t one of the facets of the miracle we need to worry about too much, although it&#8217;s admittedly confusing from a medical point of view.</p></li><li><p>We collected several unambiguous accounts of the miracle happening in a cloudless sky, though also an account by someone who found it easier to recreate on cloudy days. I tentatively stand by my conclusion that it can happen in any weather but is more likely or more dramatic when the sun is near clouds; I&#8217;m more confident in the first half of that sentence than the second.</p></li><li><p>We have a few extra stories of distant people seeing the original Fatima miracle (including some people so distant that it raises more problems than it solves). </p></li><li><p>Enough people have criticized the Filipino video that I drop any claim that it is at all good or credible.</p></li><li><p>We have several more stories of people seeing complex visions at or near the same time as the sun miracle, including the Cross and the Virgin Mary.</p></li></ul><p>Most of these push in different directions, and I struggle to turn them into a coherent update, sorry.</p><p>If I could convince someone to go to Medjugorje and do proper investigative reporting - interview locals and pilgrims, try to gather statistics, and look for the miracle themselves in various contexts - what questions would you want them to ask, and what experiments should they perform? </p>"
            ],
            "link": "https://www.astralcodexten.com/p/highlights-from-the-comments-on-fatima",
            "publishedAt": "2025-10-24",
            "source": "SlateStarCodex",
            "summary": "<p><em>[<a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more\">original post here</a>]</em></p><h2>The Kasina Connection</h2><p>In the original post, I cited ambiguous later examples of sun miracles which didn&#8217;t seem to affect everyone equally and in some cases were unconnected (or barely connected) to religious phenomena, concluding that they must be some kind of very unusual illusion. My main hangup with this conclusion was the wild implausibility of an illusion that nobody had ever noticed before, outside of this one 1917 miracle and a few copycats, despite plenty of people staring at the sun throughout history for various (bad) reasons. Surely there must be somebody else, somewhere, discussing how if you stare at a bright light long enough it will spin and change color.</p><p>Two commenters, <strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162030823\">Dave Moore</a></strong> and <strong><a href=\"https://www.astralcodexten.com/p/the-fatima-sun-miracle-much-more/comment/162138309\">Anomony</a></strong>, bring up fire kasina practice.</p><p>In Buddhist terminology, a kasina is an object of meditation. Meditation while staring at a bright light - traditionally a candle flame - is called &#8220;fire kasina&#8221;. You start by concentrating on the light; then, after it&#8217;s produced an afterimage on the retina, you switch to concentrating on the afterimage. According to Daniel Ingram&#8217;s <em><a href=\"https://www.mctb.org/mctb2/table-of-contents/part-iii-the-samatha-jhanas/29-kasina-practice/\">Mastering The Core Teachings Of The Buddha</a></em>:</p><blockquote><p>At some point the created image will begin to get clearer, brighter, more refined,",
            "title": "Highlights From The Comments On Fatima"
        },
        {
            "content": [
                "<p>Building superintelligence poses large existential risks. Also known as: <a href=\"https://www.amazon.com/Anyone-Builds-Everyone-Dies-Superhuman/dp/0316595640\"><em>If Anyone Builds It, Everyone Dies</em></a>. Where ‘it’ is superintelligence, and ‘dies’ is that probably everyone on the planet literally dies.</p>\n<p>We should not build superintelligence until such time as that changes, and the risk of everyone dying as a result, as well as the risk of losing control over the future as a result, is very low. Not zero, but far lower than it is now or will be soon.</p>\n<p>Thus, <a href=\"https://superintelligence-statement.org/\">the Statement on Superintelligence</a> from FLI, which I have signed.</p>\n<blockquote><p><strong>Context</strong>: Innovative AI tools may bring unprecedented health and prosperity. However, alongside tools, many leading AI companies have the stated goal of building superintelligence in the coming decade that can significantly outperform all humans on essentially all cognitive tasks. This has raised concerns, ranging from human economic obsolescence and disempowerment, losses of freedom, civil liberties, dignity, and control, to national security risks and even potential <a href=\"https://safe.ai/work/statement-on-ai-risk\">human extinction</a>. The succinct statement below aims to create common knowledge of the growing number of experts and public figures who oppose a rush to superintelligence.</p>\n<div>\n\n\n<span id=\"more-24813\"></span>\n\n\n</div>\n<p>Statement:</p>\n<p><strong>We call for a prohibition on the development of superintelligence, not lifted before there is</strong></p>\n<ol>\n<li><strong>broad scientific consensus that it will be done safely and controllably, and</strong></li>\n<li><strong>strong public buy-in.</strong></li>\n</ol>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!hF8r!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F115f04d0-6110-47ee-8e68-b300eedb11a7_300x168.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Their polling says there is 64% agreement on this, versus 5% supporting the status quo.</p>\n\n\n<h4 class=\"wp-block-heading\">A Brief History Of Prior Statements</h4>\n\n\n<p><a href=\"https://thezvi.substack.com/p/on-the-fli-ai-risk-open-letter\">In March of 2023 FLI</a> issued an <a href=\"https://futureoflife.org/open-letter/pause-giant-ai-experiments/\">actual pause letter</a>, calling for an immediate pause for at least 6 months in the training of systems more powerful than GPT-4, which was signed among others by Elon Musk.</p>\n<p>This letter was absolutely, 100% a call for a widespread regime of prior restraint on development of further frontier models, and to importantly ‘slow down’ and to ‘pause’ development in the name of safety.</p>\n<p>At the time, I said it was a deeply flawed letter and I declined to sign it, but my quick reaction was to be happy that the letter existed. This was a mistake. I was wrong.</p>\n<p>The pause letter not only weakened the impact of the superior CAIS letter, it has now for years been used as a club with which to browbeat or mock anyone who would suggest that future sufficiently advanced AI systems might endanger us, or that we might want to do something about that. To claim that any such person must have wanted such a pause at that time, or would want to pause now, which is usually not the case.</p>\n<p><a href=\"https://thezvi.substack.com/p/ai-14-a-very-good-sentence\">The second statement was the CAIS letter in May 2023, which was in its entirety</a>:</p>\n<blockquote><p>“Mitigating the risk of extinction from AI should be a global priority alongside other societal-scale risks such as pandemics and nuclear war.”</p></blockquote>\n<p>This was a very good sentence. I was happy to sign, as were some heavy hitters, including Sam Altman, Dario Amodei, Demis Hassabis and many others.</p>\n<p>This was very obviously not a pause, or a call for any particular law or regulation or action. It was a statement of principles and the creation of common knowledge.</p>\n<p>Given how much worse many people have gotten on AI risk since then, it would be an interesting exercise to ask those same people to reaffirm the statement.</p>\n\n\n<h4 class=\"wp-block-heading\">This Third Statement</h4>\n\n\n<p>The new statement is in between the previous two letters.</p>\n<p>It is more prescriptive than simply stating a priority.</p>\n<p>It is however not a call to ‘pause’ at this time, or to stop building ordinary AIs, or to stop trying to use AI for a wide variety of purposes.</p>\n<p>It is narrowly requesting that, if you are building something that might plausibly be a superintelligence, under anything like present conditions, you should instead not do that. We should not allow you to do that. Not until you make a strong case for why this is a wise or not insane thing to do.</p>\n<p>This is something that those who are most vocally speaking out against the statement strongly believe is not going to happen within the next few years, so for the next few years any reasonable implementation would not pause or substantially impact AI development.</p>\n<p>I interpret the statement as saying, roughly: if a given action has a substantial chance of being the proximate cause of superintelligence coming into being, then that’s not okay, we shouldn’t let you do that, not under anything like present conditions.</p>\n<p>I think it is important that we create common knowledge of this, which we very clearly do not yet have. This does not have to involve asking for a concrete short-term particular policy or other intervention.</p>\n\n\n<h4 class=\"wp-block-heading\">Who Signed It</h4>\n\n\n<p>As of writing this there are 32,214 signatories.</p>\n<p>The front page lists before the first break: Yoshua Bengio, Geoffrey Hinton, Stuart Russell, Steve Wozniak, Sir Richard Branson, Steve Bannon, Glenn Beck, Susan Rice, Mike Mullen and Joe Crowley.</p>\n<p>Here are some comments by signers:</p>\n<blockquote><p><a href=\"https://x.com/RepDonBeyer/status/1980999435640619015\">Rep. Don Beyer</a> (D-VA-8): We won’t realize AI’s promising potential to improve human life, health, and prosperity if we don’t account for the risks.</p>\n<p>Developers and policymakers must consider the potential danger of artificial superintelligence <a href=\"https://t.co/Ln8ogsr21S\">raised by these leading thinkers</a>.</p></blockquote>\n<p><a href=\"https://x.com/So8res/status/1981006963162141016\">Nate Sores explains</a> his support of the agreement, he would have written a different statement but wants to avoid the narcissism of small differences, as do I.</p>\n<blockquote><p><a href=\"https://x.com/tristanharris/status/1981135884419551384\">Tristan Harris</a>: I signed this statement against artificial superintelligence along with hundreds of other prominent NatSec leaders, AI scientists, bipartisan political voices, tech founders and more. An important global consensus is emerging.</p>\n<p>I hope that both the US and China’s leadership are listening. Neither side “wins” if they build something vastly smarter than themselves that they demonstrably cannot control.</p>\n<p>And if you think coordination btwn US and China is impossible &#8211; consider that President Xi personally requested to add an agreement to his last meeting with President Biden that no AI be used in the US and China’s nuclear command and control systems.</p>\n<p>When existential stakes are mutually recognized, agreement is possible.</p>\n<p>Jeffrey Ladish: Most leading AI researchers agree superintelligence is possible. Many AI companies are explicitly aiming for it.</p>\n<p>Developing it under intense competitive pressures, with anything like our current level of understanding, would be insane.</p>\n<p>The letter defines superintelligence as AI that can “significantly outperform all humans on essentially all cognitive tasks” We’re talking about AIs that aren’t limited to math and coding, but can out think humans in all strategic domains: persuasion, hacking, R&amp;D, politics… [<a href=\"https://x.com/JeffLadish/status/1981584077947036158\">continues</a>]</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Pushback Against the Statement</h4>\n\n\n<p><a href=\"https://x.com/slatestarcodex/status/1981032302147977570\">Dean Ball pushed back on the statement</a>, calling it counterproductive and silly. He points out that any operationalization of such a policy ‘would not feel nice to sign.’ And he points out that without some sort of global coordination to prevent building unsafe superintelligence, we would as soon after it becomes technically possible to do so build superintelligence, and look at how bad it would be if there was global coordination stopping them from doing that.</p>\n<p><a href=\"https://x.com/sriramk/status/1981303751437582594\">Sriram Krishnan echoes and endorses Dean’s take</a>, calling this a ‘Stop AI’ letter, equating stopping all AI with not building superintelligence, despite Sriram having also said that he does not believe AGI let alone ASI is going to happen any time soon.</p>\n<p>Okay, so should then, when faced with this choice, build a superintelligence shortly after it becomes possible to build one? That does not feel like a nice policy to sign.</p>\n<p>As I understand the position taken by Sriram and Dean, they don’t offer a meaningful third option. If you intend to stop the development of superintelligence from happening as rapidly as possible, you must end up with a ‘global organization with essentially unchecked power,’ and that’s worse. Those are, they tell us, our only choices, and the only thing you could be asking for if you express the desire for superintelligence not to be built at the first opportunity.</p>\n<p>I don’t think those are the only choices, and I certainly don’t think the way to find a third option is to tell us we can’t create common knowledge of opposition to door number one without endorsing door number two. But also don’t understand why, <a href=\"https://www.youtube.com/watch?v=PVH0gZO5lq0&amp;pp=ygUNY2FrZSBvciBkZWF0aA%3D%3D\">if the other option is not cake, such people then choose death</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">Responses To The Pushback</h4>\n\n\n<p><a href=\"https://x.com/slatestarcodex/status/1981032302147977570\">Scott Alexander then responded</a>, defending the idea of vague value statements of intent without operationalized methods of implementation, to create common knowledge that people care, after which you can come up with specific plans. He then challenges Dean’s assumptions about what form that implementation would take, but also asks why Dean’s implementation would be worse than the null action.</p>\n<blockquote><p>Dean Ball: The analogy to slavery abolition makes sense, I suppose, and truthfully if this had just said “we shouldn’t do this ever” I would have remained silent. It is the “until proven safe” issue that concerns me. I don’t understand how existing research could really proceed, in practice, including much of what you have described. Indeed, what you described sounds like an entirely different policy outcome than what I think that statement suggests.</p>\n<p>Daniel Kokotajlo: I’m surprised to hear that you would have remained silent if it said “We shouldn’t do this ever.” I imagine that the people who wrote the statement were thinking the “until proven safe” bit would be a sort of conciliatory/compromise/nuance clause that would make it more appealing to people like you. I guess they were wrong.</p></blockquote>\n<p>I agree with Daniel that I would expect the qualification would be seen by most people as a conciliatory/compromise/nuance clause. I also suspect that Dean’s model of himself here is incorrect, although his statement would have been different.</p>\n<blockquote><p>Daniel Kokotajlo: I remember at OpenAI hearing things like “We need to sell the public on AGI, otherwise they’ll be angry and not let us build it.”</p>\n<p>I think this statement is basically common sense, so I signed it. Ofc it is not an actual detailed policy proposal. Much work remains to be done.</p></blockquote>\n<p>Exactly. This is creation of common knowledge around common sense thinking, not a request for a particular detailed policy.</p>\n<p><a href=\"https://x.com/Simeon_Cps/status/1981143016615399634\">Simeon pushes back</a> that we ban technologies deemed unsafe without centralized power, and that yes you can prove safety before building, that Dean’s presumed implementation is very far from the centralization-safety Pareto frontier. I don’t actually think you can ever ‘prove’ safety of a superintelligence, what you do (like for most other things) is mitigate risk to acceptable levels since there are big costs to not building it.</p>\n<p><a href=\"https://x.com/deanwball/status/1981065469919469907\">Max Tegmark respectfully pushes back</a> that we need to be able to call for systematic rules or changes without being able to fully define their implementation, using the example of child labor, where people rightfully said ‘we should ban child labor’ without first defining ‘child’ or ‘labor’ (or, I would add in this context, defining ‘ban’).</p>\n<p>Dean respectfully notes two things. First, that implementation of child labor restrictions is far easier, which is true, although I’m not convinced it is relevant. The principles remain the same, I think? And two that they importantly disagree about the nature of intelligence and superintelligence, which is also very true.</p>\n<p>Dean then gets to his central point, which is he prefers to focus on practical and incremental work that moves us towards good outcomes on the margin. I am all for such work, but I don’t expect it alone to be sufficient and don’t see why it should crowd out the creation of common knowledge or the need to consider bolder action.</p>\n<p>Dean offers to discuss the issues live with Max, and I hope they do that.</p>\n\n\n<h4 class=\"wp-block-heading\">Avoid Negative Polarization But Speak The Truth As You See It</h4>\n\n\n<p>Dean Ball is the kind of Worthy Opponent you want, who has a different world model than you do but ultimately wants good things over bad things.</p>\n<p><a href=\"https://www.hyperdimensional.co/p/turning-a-blind-eye\">He provided an important public service yesterday</a>, as part of a discussion of various AI bills, when he emphasized warnings against negative polarization.</p>\n<p>There certainly are those who actively seek to cause negative polarization of AI safety issues generally, who go full on ‘look what you made me do,’ and claim that if you point out that superintelligence probably kills us and ask us to act like it, the only reasonable response is to politicize the issue and to systematically work against any effort to mitigate risks, on principle, that’s how it works and they don’t make the rules.</p>\n<p>They are trying to make those the rules, and use everything as ammunition.</p>\n<p>I don’t think it is reasonable (or good decision theory) to say ‘therefore, because these people have power, STFU and only work on the margin if you know what’s good for humanity, or you.’</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/10/24/new-statement-calls-for-not-building-superintelligence-for-now/",
            "publishedAt": "2025-10-24",
            "source": "TheZvi",
            "summary": "Building superintelligence poses large existential risks. Also known as: If Anyone Builds It, Everyone Dies. Where ‘it’ is superintelligence, and ‘dies’ is that probably everyone on the planet literally dies. We should not build superintelligence until such time as that &#8230; <a href=\"https://thezvi.wordpress.com/2025/10/24/new-statement-calls-for-not-building-superintelligence-for-now/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "New Statement Calls For Not Building Superintelligence For Now"
        },
        {
            "content": [
                "<p><em>Hi! It’s been quite a while. I’ve spent the past 2.5 years working on a book whose topic is “everything.” Not a small project. But it’s getting there—there’s a complete second draft, with illustrations and some more revisions still to do. I plan to return to the blog in full force when I’m done, but briefly popping in today because there’s some stuff I had to get off my chest.</em></p>\n\n\n\n<p class=\"has-text-align-center\">___________</p>\n\n\n\n<p>Back in 2023, I wrote a <a href=\"https://waitbutwhy.com/2023/05/baby.html\" rel=\"noreferrer noopener\" target=\"_blank\">post</a> about having my first baby and all the things that confused me about doing so.</p>\n\n\n\n<p>Earlier this year, it happened again. Just like that, I was back here:</p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"\" class=\"wp-image-10662\" height=\"1102\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/0-birth.png\" style=\"width: 449px; height: auto;\" width=\"1351\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>On one hand, now time doesn’t exist at all.</p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"\" class=\"wp-image-10666\" height=\"608\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/1-nap-schedule.png\" style=\"width: 730px; height: auto;\" width=\"1883\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>On the other hand, the second child is…easier than the first.</p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"\" class=\"wp-image-10745\" height=\"989\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/2-snoo-1.png\" style=\"width: 696px; height: auto;\" width=\"1595\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>But I’m not here to talk about the new baby, delightful and obese as she may be. Today, I report to you from the depths of toddler parenthood. I always thought two-year-olds were basically unconscious blobs with a cold, but it turns out they’re actual people you can get to know. Having now spent some time cohabitating with one, I’ve made the following discoveries:</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-1-you-can-be-simultaneously-completely-obsessed-with-and-dramatically-bored-by-the-same-person\"><strong>1) You can be simultaneously completely obsessed with and dramatically bored by the same person.</strong></h3>\n\n\n\n<p>Sometimes when I’m working in my office, my daughter will toddle in, run over to me, and give me a hug. It is by far the best part of my day. Her smile fills me with utter joy. Her little voice is sent straight from heaven. I feel the purest possible love for her.</p>\n\n\n\n<p>It’s just that I also find her groundbreakingly boring. A five-minute hangout is one thing, but when I’m deep in an afternoon with her, it’s hard to come to any other conclusion than that I’ve spent my last three hours with a person whose IQ is 20.</p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"toddler: The cow says moo! parent, lying on ground: It does.\" class=\"wp-image-10674\" height=\"461\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/3-cow-says-moo.png\" style=\"width: 467px; height: auto;\" width=\"857\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-2-toddlers-are-dicks\"><strong>2) Toddlers are dicks.</strong></h3>\n\n\n\n<p>It’s well-known that toddlers transform into mid-20<sup>th</sup>-century totalitarian dictators at the drop of a hat.</p>\n\n\n\n<figure class=\"wp-block-image size-full wp-lightbox-container\"><img alt=\"\" class=\"wp-image-10729\" height=\"705\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/4-stalin-1.png\" width=\"1514\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>But they’re dicks in less obvious ways too. The other day, my toddler was playing with Legos. I sat down next to her and asked her what she was building, and she said, “Daddy needs to work in his office?”—an unsubtle hint that I should leave her the fuck alone.</p>\n\n\n\n<p>Or the times I cook a whole thing for her with care and love and she refuses to take a bite, making me feel <a href=\"https://waitbutwhy.com/2016/05/clueyness-a-weird-kind-of-sad.html\" rel=\"noreferrer noopener\" target=\"_blank\">cluey</a> for myself.</p>\n\n\n\n<p>Most recently, I made the mistake of telling her my age, and now she says “Daddy is 43” like 30 times a day, constantly filling me with existential dread.</p>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full is-resized wp-lightbox-container\"><img alt=\"dad: I love you.\ntoddler: I love mommy.\" class=\"wp-image-10748\" height=\"563\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/5-I-love-mommy-2.png\" style=\"width: 199px; height: auto;\" width=\"403\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-3-no-one-wants-to-see-videos-of-someone-else-s-toddler\"><strong>3) No one wants to see videos of someone else’s toddler.</strong></h3>\n\n\n\n<p>Toddler parenthood is a reality distortion zone that makes it hard to remember that most people find your toddler breathtakingly uninteresting.<a href=\"https://waitbutwhy.com/feed#footnote-1-10661\" id=\"note-1-10661\" rel=\"footnote\">1</a>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"showing a stranger a video of your kid: Aw so cute! (thought bubble: Oh my god it's not even halfway done.)\" class=\"wp-image-10732\" height=\"634\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/6-video-stranger-1.png\" style=\"width: 531px; height: auto;\" width=\"975\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>Friends who have kids the same age as yours are kind of in a cohort together, so parents of toddlers often end up with a whole throng of toddlers in their lives. Amongst my cohort I’ve both been an offender and frequent victim of toddler-video-showing. It’s part of the tax we all pay.</p>\n\n\n\n<p>I try to at least minimize the fallout from my end.</p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"Three circles showing who I send toddler/baby photos and videos to: tiny circle labeled Friends, slightly bigger circle labeled Family, and huge circle labeled Wife\" class=\"wp-image-10678\" height=\"1179\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/7-circles.png\" style=\"width: 467px; height: auto;\" width=\"1293\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-4-someone-else-s-toddler-can-ruin-your-week\"><strong>4) Someone else’s toddler can ruin your week.</strong></h3>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"\" class=\"wp-image-10743\" height=\"521\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/8-sneeze-3.png\" style=\"width: 621px; height: auto;\" width=\"989\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-5-toddlers-are-geniuses-who-are-also-very-dumb\"><strong>5) Toddlers are geniuses who are also very dumb.</strong></h3>\n\n\n\n<p>If I took my daughter to China for a year, and we just lived there with no language instruction, I’d come back knowing approximately six Mandarin words and she’d be fluent. It makes no sense to me that toddlers just learn a language by hearing the language, but somehow they do. They’re weird freak geniuses. But then she says stuff like “would you like a strawberry?” when she wants a strawberry, because when we say “you,” it <a href=\"https://www.youtube.com/watch?v=K-q-3fPYw_Y\" rel=\"noreferrer noopener\" target=\"_blank\">refers to her</a>, so she now thinks “you” is a synonym for her name, which is very unimpressive.</p>\n\n\n\n<p>Likewise, the other day I read her a new book for the first time, and then the second time I read it to her, she stopped me in the middle to correct something I said. It turns out I had accidentally skipped a word, which she knew because she somehow memorized the whole book on the first read. But then we’ll pick up another book and she’ll stare at the page for a million years looking for where Curious George is “hiding” even though he’s obviously right the fuck there.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-6-toddlers-have-a-highly-inaccurate-worldview\"><strong>6) Toddlers have a highly inaccurate worldview.</strong></h3>\n\n\n\n<p>We sometimes take our toddler to story time at the library, where the librarian reads a book to a bunch of kids. The first time we took her, she decided to take matters into her own hands and, mid-story, went and sat in the librarian’s lap. The issue is that she hadn’t quite figured out that the world does not exist entirely for her benefit.</p>\n\n\n\n<p>It’s understandable. You’re born into the world and for the first few years, everyone you see smiles and waves at you, so you overestimate your importance. Only slowly do you learn what’s really going on.<a href=\"https://waitbutwhy.com/feed#footnote-2-10661\" id=\"note-2-10661\" rel=\"footnote\">2</a>\n\n\n\n<figure class=\"wp-block-image size-full wp-lightbox-container\"><img alt=\"\" class=\"wp-image-10739\" height=\"439\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/9-spectrum-3.png\" width=\"1280\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>This is part of the broader phenomenon of a toddler not really having any idea what’s going on. They don’t know about death, or money, or history, or sex, or the Big Bang, or basically anything about reality. They just emerged out of nowhere and started being, which for some reason doesn’t strike them as weird or confusing.</p>\n\n\n\n<p>(A good “do you have any idea what’s going on?” litmus test is: If you’re walking down the street and an elephant flies down from the sky, hovers ten feet above you and says hello in a silly cartoon voice before flying off, would you be like “OH MY GOD WHAT JUST HAPPENED” or would you shrug and be like “I guess that’s something that happens”? If the latter, you have no idea what’s going on. Most two-year-olds fail this test.)</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-7-toddlers-are-both-the-funniest-and-least-funny-possible-people\"><strong>7) Toddlers are both the funniest and least funny possible people.</strong></h3>\n\n\n\n<p>My daughter is remarkably unfunny. Once when she dropped something, I said “kerplunk,” and she found it fucking hilarious. For the next ten minutes, she kept picking things up, dropping them, and saying “kerplunk,” hysterically laughing each time.</p>\n\n\n\n<p>But unintentionally, she’s a comedic genius. When I was in her way recently, she said, “Can you get out of space?” which my wife and I now say to each other whenever we want the other to move. Another time, we had to rip a band-aid off her leg, after which she said, “I am so perfectly sad,” and now my wife and I say that anytime we’re unhappy about something.<a href=\"https://waitbutwhy.com/feed#footnote-3-10661\" id=\"note-3-10661\" rel=\"footnote\">3</a>\n\n\n\n<p>We’ve also discovered an amazing hack: you can just teach a toddler to say whatever you want. We taught her to say “mamma mia” whenever she falls over, which I highly recommend to other toddler parents.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-8-toddler-parents-have-very-strong-opinions-and-everyone-is-very-judgy\"><strong>8) Toddler parents have very strong opinions and everyone is very judgy.</strong></h3>\n\n\n\n<figure class=\"wp-block-image size-full is-resized wp-lightbox-container\"><img alt=\"Two parents silently judging each other. The parent of the toddler without cotton candy thinks: Imagine giving that to your kid. The parent of the toddler with cotton candy thinks: Imagine depriving your kid of that.\" class=\"wp-image-10681\" height=\"799\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/10-cotton-candy.png\" style=\"width: 596px; height: auto;\" width=\"1255\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>The problem is, for every strong opinion, there’s an equally strong opposite opinion.</p>\n\n\n\n<figure class=\"wp-block-image size-full wp-lightbox-container\"><img alt=\"pairings of competing parenting advice, like: Toddlers thrive on routine vs Follow their natural rhythms and cues, and Supervision vs Freedom.\" class=\"wp-image-10671\" height=\"1469\" src=\"https://waitbutwhy.com/wp-content/uploads/2025/10/11-advice-1.png\" width=\"1334\" /><button class=\"lightbox-trigger\" type=\"button\">\n\t\t\t<svg fill=\"none\" height=\"12\" viewBox=\"0 0 12 12\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t\t<path d=\"M2 0a2 2 0 0 0-2 2v2h1.5V2a.5.5 0 0 1 .5-.5h2V0H2Zm2 10.5H2a.5.5 0 0 1-.5-.5V8H0v2a2 2 0 0 0 2 2h2v-1.5ZM8 12v-1.5h2a.5.5 0 0 0 .5-.5V8H12v2a2 2 0 0 1-2 2H8Zm2-12a2 2 0 0 1 2 2v2h-1.5V2a.5.5 0 0 0-.5-.5H8V0h2Z\" fill=\"#fff\">\n\t\t\t</svg>\n\t\t</button></figure>\n\n\n\n<p>I’ve taken to accepting that I’m messing up all kinds of things, and mainly just try to have fun with my little friend. To the extent that I have a strategy, it’s basically:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Spend lots of (phone-free) time with her</li>\n\n\n\n<li>Show her that the world is a fun and fascinating place</li>\n\n\n\n<li>Encourage her to <a href=\"https://waitbutwhy.com/2015/11/the-cook-and-the-chef-musks-secret-sauce.html\" rel=\"noreferrer noopener\" target=\"_blank\">reason from first principles</a></li>\n\n\n\n<li>Don’t interrupt her when she’s focused or daydreaming; help her learn to be entertained by her own mind</li>\n\n\n\n<li>Refrain from imposing lots of little rules, but where there are rules, be firm about them</li>\n\n\n\n<li>Build problem-solving confidence, teaching her to become a person who says “I want to figure out the directions” instead of a person who says “let’s just ask someone”</li>\n</ul>\n\n\n\n<p>Toddler parents can take solace in the fact that parenting probably matters less than we think it does. Rather than try to shape our little two-foot-tall companions, we should help guide them to become the best version of who they already are.</p>\n\n\n\n<p>Anyway, gotta go. Time to read <em>Squeak the Mouse Likes His House</em> for the 57<sup>th</sup> time.</p>\n\n\n\n<p class=\"has-text-align-center\">___________</p>\n\n\n\n<p><strong>More tales from fatherhood:</strong> <a href=\"https://waitbutwhy.com/2023/05/baby.html\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>10 Thoughts from the Fourth Trimester</strong></a></p>\n\n\n\n<p><strong>My favorite toddler books:</strong> <strong><a href=\"https://amzn.to/474Qe8D\" rel=\"noreferrer noopener\" target=\"_blank\">Flotsam</a>, <a href=\"https://amzn.to/43sPIPl\" rel=\"noreferrer noopener\" target=\"_blank\">Little Fur Family</a>, <a href=\"https://amzn.to/4hzjsQz\" rel=\"noreferrer noopener\" target=\"_blank\">The Giant Jam Sandwich</a>, <a href=\"https://amzn.to/3JrXRwP\" rel=\"noreferrer noopener\" target=\"_blank\">Little Owl&#8217;s Night</a></strong></p>\n\n\n\n<p><strong>If you’d rather read about something other than my fat babies:</strong></p>\n\n\n\n<p><strong><a href=\"https://waitbutwhy.com/2016/09/marriage-decision.html\" rel=\"noreferrer noopener\" target=\"_blank\">The Marriage Decision: Everything Forever or Nothing Ever Again</a></strong></p>\n\n\n\n<p><strong><a href=\"https://waitbutwhy.com/2014/06/taming-mammoth-let-peoples-opinions-run-life.html\" rel=\"noreferrer noopener\" target=\"_blank\">Taming the Mammoth: Why You Should Stop Caring What Other People Think</a><br /></strong></p>\n<p><a href=\"https://waitbutwhy.com/2015/07/why-im-always-late.html\" rel=\"noopener\" target=\"_blank\"><strong>Why I&#8217;m Always Late</strong></a></p>\n\n\n\n<p class=\"has-text-align-center\">_______</p>\n\n\n\n\n\n\n\n<p>If you like Wait But Why, sign up for our <strong><a href=\"https://newsletter.waitbutwhy.com/join\">email list</a></strong> and we&#8217;ll send you new posts when they come out.</p>\n\n\n\n<p>To support Wait But Why, visit our <strong><a href=\"https://patreon.com/waitbutwhy\" rel=\"noreferrer noopener\" target=\"_blank\">Patreon page</a></strong>.</p>\n<div class=\"footnotes\"><hr /><ol><li class=\"footnote\" id=\"footnote-1-10661\"><p>Toddler grandparents may be an exception, though they span a wide range, from &#8220;Please go away for a month and leave them with me&#8221; on one end, to &#8220;I will play with them for five minutes but only because it looks bad if I don’t&#8221; on the other. Those on the latter end are as bored by toddler videos as everyone else.<a class=\"footnote-return\" href=\"https://waitbutwhy.com/feed#note-1-10661\">&#8617;</a></p></li><!--/#footnote-1.footnote--><li class=\"footnote\" id=\"footnote-2-10661\"><p><a href=\"https://www.amazon.com/Denial-Death-Ernest-Becker/dp/0684832402\">Some have suggested</a> that the common desire for fame is, in some subconscious sense, an attempt to recapture the long-lost feeling that the whole world knows and loves you.<a class=\"footnote-return\" href=\"https://waitbutwhy.com/feed#note-2-10661\">&#8617;</a></p></li><!--/#footnote-2.footnote--><li class=\"footnote\" id=\"footnote-3-10661\"><p>She actually said “Can I get out of space?” and “You are so perfectly sad” because, again, she is confused about pronouns.<a class=\"footnote-return\" href=\"https://waitbutwhy.com/feed#note-3-10661\">&#8617;</a></p></li><!--/#footnote-3.footnote--></ol></div><!--/#footnotes--><p>The post <a href=\"https://waitbutwhy.com/2025/10/toddler.html\">Tales from Toddlerhood</a> appeared first on <a href=\"https://waitbutwhy.com\">Wait But Why</a>.</p>"
            ],
            "link": "https://waitbutwhy.com/2025/10/toddler.html",
            "publishedAt": "2025-10-24",
            "source": "WaitButWhy",
            "summary": "<p>Eight thoughts from a strange and harrowing world</p> <p>The post <a href=\"https://waitbutwhy.com/2025/10/toddler.html\">Tales from Toddlerhood</a> appeared first on <a href=\"https://waitbutwhy.com\">Wait But Why</a>.</p>",
            "title": "Tales from Toddlerhood"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3159/",
            "publishedAt": "2025-10-24",
            "source": "XKCD",
            "summary": "<img alt=\"The inflection point was probably in late 1966 or 1967, so when Neil Armstrong flew to space on Gemini 8, plate tectonics was not widely accepted, but when he landed on the Moon three years later it was the mainstream consensus.\" src=\"https://imgs.xkcd.com/comics/continents.png\" title=\"The inflection point was probably in late 1966 or 1967, so when Neil Armstrong flew to space on Gemini 8, plate tectonics was not widely accepted, but when he landed on the Moon three years later it was the mainstream consensus.\" />",
            "title": "Continents"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-10-24"
}