{
    "articles": [
        {
            "content": [
                "<p><a href=\"https://grumpy.website/media/2025/1690_full.jpeg\"><img height=\"257\" src=\"https://grumpy.website/media/2025/1690.jpeg\" style=\"width: 550px; height: 257px;\" width=\"550\" /></a></p><p><strong>nikitonsky: </strong>Pro tip: most users are unable to see invisible controls</p><p>Thanks <a href=\"https://grumpy.website/search?q=%40James_Kirk\">@James_Kirk</a> for the picture</p><p><a href=\"https://grumpy.website/search?q=%23Form\">#Form</a> <a href=\"https://grumpy.website/search?q=%23TextArea\">#TextArea</a> <a href=\"https://grumpy.website/search?q=%23InvisibleControls\">#InvisibleControls</a> <a href=\"https://grumpy.website/search?q=%23Minimalism\">#Minimalism</a></p>"
            ],
            "link": "https://grumpy.website/1690",
            "publishedAt": "2025-08-15",
            "source": "Grumpy UX",
            "summary": "<p><a href=\"https://grumpy.website/media/2025/1690_full.jpeg\"><img height=\"257\" src=\"https://grumpy.website/media/2025/1690.jpeg\" style=\"width: 550px; height: 257px;\" width=\"550\" /></a></p><p><strong>nikitonsky: </strong>Pro tip: most users are unable to see invisible controls</p><p>Thanks <a href=\"https://grumpy.website/search?q=%40James_Kirk\">@James_Kirk</a> for the picture</p><p><a href=\"https://grumpy.website/search?q=%23Form\">#Form</a> <a href=\"https://grumpy.website/search?q=%23TextArea\">#TextArea</a> <a href=\"https://grumpy.website/search?q=%23InvisibleControls\">#InvisibleControls</a> <a href=\"https://grumpy.website/search?q=%23Minimalism\">#Minimalism</a></p>",
            "title": "nikitonsky is being grumpy"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Aug/15/the-summer-of-johann/#atom-entries",
            "publishedAt": "2025-08-15",
            "source": "Simon Willison",
            "summary": "<p>Independent AI researcher <a href=\"https://embracethered.com/blog/\">Johann Rehberger</a> (<a href=\"https://simonwillison.net/tags/johann-rehberger/\">previously</a>) has had an absurdly busy August. Under the heading <strong>The Month of AI Bugs</strong> he has been publishing one report per day across an array of different tools, all of which are vulnerable to various classic prompt injection problems. This is a <em>fantastic and horrifying</em> demonstration of how widespread and dangerous these vulnerabilities still are, almost three years after we first <a href=\"https://simonwillison.net/series/prompt-injection/\">started talking about them</a>.</p> <p>Johann's published research in August so far covers ChatGPT, Codex, Anthropic MCPs, Cursor, Amp, Devin, OpenHands, Claude Code, GitHub Copilot and Google Jules. There's still half the month left!</p> <p>Here are my one-sentence summaries of everything he's published so far:</p> <ul> <li>Aug 1st: <a href=\"https://embracethered.com/blog/posts/2025/chatgpt-chat-history-data-exfiltration/\">Exfiltrating Your ChatGPT Chat History and Memories With Prompt Injection</a> - ChatGPT's <code>url_safe</code> mechanism for allow-listing domains to render images allowed <code>*.window.net</code> - and anyone can create an Azure storage bucket on <code>*.blob.core.windows.net</code> with logs enabled, allowing Markdown images in ChatGPT to be used to exfiltrate private data.</li> <li>Aug 2nd: <a href=\"https://embracethered.com/blog/posts/2025/chatgpt-codex-remote-control-zombai/\">Turning ChatGPT Codex Into A ZombAI Agent</a> - Codex Web's internet access (<a href=\"https://simonwillison.net/2025/Jun/3/codex-agent-internet-access/\">previously</a>) suggests a \"Common Dependencies Allowlist\" which included <code>azure.net</code> - but anyone can run a VPS on <code>*.cloudapp.azure.net</code>",
            "title": "The Summer of Johann: prompt injections as far as the eye can see"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Aug/15/inconsistent-performance/#atom-entries",
            "publishedAt": "2025-08-15",
            "source": "Simon Willison",
            "summary": "<p>Artificial Analysis published <a href=\"https://artificialanalysis.ai/models/gpt-oss-120b/providers#aime25x32-performance-gpt-oss-120b\">a new benchmark</a> the other day, this time focusing on how an individual model - OpenAI’s gpt-oss-120b - performs across different hosted providers.</p> <p>The results showed some surprising differences. Here's the one with the greatest variance, a run of the 2025 AIME (American Invitational Mathematics Examination) averaging 32 runs against each model, using gpt-oss-120b with a reasoning effort of \"high\":</p> <p><img alt=\"Performance benchmark chart showing AIME25x32 Performance for gpt-oss-120B model across different AI frameworks. Chart displays box plots with percentile ranges (Min, 25th, Median, 75th, Max) for each framework. Title: &quot;AIME25x32 Performance: gpt-oss-120B&quot; with subtitle &quot;AIME 2025 N=32 Runs: Minimum, 25th Percentile, Median, 75th Percentile, Maximum (Higher is Better)&quot;. Legend indicates &quot;Median; other points represent Min, 25th, 75th percentiles and Max respectively&quot;. Y-axis ranges from 0 to 1.2. Frameworks shown from left to right: Cerebras (93.3%), Nebius Base (93.3%), Fireworks (93.3%), Deepinfra (93.3%), Novita (93.3%), Together.ai (93.3%), Parasail (90.0%), Groq (86.7%), Amazon (83.3%), Azure (80.0%), CompectAI (36.7%). Watermark shows &quot;Artificial Analysis&quot; logo.\" src=\"https://static.simonwillison.net/static/2025/aim25x32-gpt-oss-120b.jpg\" /></p> <p>These are some varied results!</p> <ul> <li>93.3%: Cerebras, Nebius Base, Fireworks, Deepinfra, Novita, Together.ai, vLLM 0.1.0</li> <li>90.0%: Parasail</li> <li>86.7%: Groq</li> <li>83.3%: Amazon</li> <li>80.0%: Azure</li> <li>36.7%: CompactifAI</li> </ul> <p>It looks like most of",
            "title": "Open weight LLMs exhibit inconsistent performance across providers"
        },
        {
            "content": [
                "<p><em>[This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked]</em></p><h1>I. The Men Are Not Alright</h1><p>Sometimes I&#8217;m convinced there&#8217;s a note taped to my back that says, &#8220;PLEASE SPILL YOUR SOUL UPON THIS WOMAN.&#8221; I am not a therapist, nor in any way certified to deal with emotional distress, yet my presence seems to cause people to regurgitate their traumas.</p><p>This quirk of mine becomes especially obvious when dating. Many of my dates turn into pseudo-therapy sessions, with men sharing emotional traumas they&#8217;ve kept bottled up for years. One moment I&#8217;m learning about his cat named Daisy, and then half a latte later, I&#8217;m hearing a detailed account of his third suicide attempt, complete with a critique of the food in the psychiatric ward.</p><p>This repeated pattern in my dating life has taught me three things:</p><ol><li><p>I am <em>terrible</em> at small talk.</p></li><li><p>Most men are not accustomed to genuine questions about their well-being, and will often respond with a desperate upwelling of emotion.</p></li><li><p>The men are not alright.</p></li></ol><p>This is a review of dating men in the Bay Area. But more than that, it&#8217;s an attempt to explain those unofficial therapy sessions to people who never get to hear them. It&#8217;s a review of the various forms of neglect and abuse society inflicts upon men, and the inevitable consequences to their happiness and romantic partnerships.</p><p>A warning: I have no solid solutions to these problems. I have theories and suggestions, but these problems are far beyond my realm of expertise.</p><p>That fact has kept me from writing about my thoughts for years, because it seems insulting to expound on men&#8217;s lived experiences, when being a man is so foreign to me. But it seems when men try to speak up about these things, they are often derided for being ungrateful, weak, hateful, narcissistic&#8230; the list of accusations goes on.</p><p>The fact is, men enjoy some privileges that women do not in Western society. This seems to have convinced many that they&#8217;re doing perfectly alright, or at least good enough to shut up about their issues until women and other minorities get their problems ironed out.</p><p>Most of &#8220;polite society&#8221;&#8211;the elite individuals who often influence narratives in the media and academia&#8211;seem locked in a zero-sum mindset, convinced that discussing the pain of men requires ignoring the problems of others.</p><p>I believe the opposite is true; the pain facing both men and women is evidence of a wounded society, and you cannot heal an injury by only stitching half of it. The rest of the wound will fester and spread infection, and then your stitches are of no use.</p><p>If half the population isn&#8217;t provided proper care and attention, there&#8217;s no hope to heal the problems facing the rest of us. Thus the pain of men needs a massive increase in attention.</p><p>Yet not everyone is ready to listen to men, so I&#8217;ll try to act as a translator, using my identity as a feminist twenty-something woman as a bridge. I&#8217;ll explain the pain that&#8217;s so obvious to me, yet hidden to many others, and try to provide some insight for both genders on how these issues impact dating, and what can perhaps be done to address them.</p><h1>II. The Lost Generations</h1><p>Historically, &#8220;rites of passage&#8221; for genders have been practically ubiquitous throughout cultures, and for good reason. Cisgender men and women are biologically different. Men are built to be strong and to use that strength for physical protection and combat. Women are built to be mothers, an activity that is arguably even more physically gruelling, yet in an entirely different manner.</p><p>Groups of humans who rejected these roles didn&#8217;t last long. Send the women out to combat on a regular basis, and your tribe&#8217;s future population would be demolished. After all, when it comes to reproduction, having many wombs is more vital than having many penises.</p><p>Thus girls and boys had to be carefully cultivated into women and men using strict gender norms and rites of passage. These rites provided a series of stepping-stones toward womanhood and manhood; follow the steps, and you&#8217;d become a true woman or man, roles that existed as the foundation of personal identity.</p><p>There is a large amount of debate about when exactly gender roles evolved, but for at least the past 10,000 years, the majority of cultures have provided their sons with very similar maps to manhood: your youth is to be enjoyed, but once you hit puberty, you take on the responsibilities of a man. A man guards his people, procreates with his wife (or wives), and provides resources for his family. He is to be physically strong and intellectually capable, but humble enough to respect the wisdom of his ancestors and their religion. When disrespected or threatened, he must stand up for himself by using physical or emotional punishment.</p><p>This map was well known and widely accepted; there was never any question as to the purpose of a man. Priests, parents, mentors, and friends all preached the same set of expectations.</p><p>In return for fulfilling these many requirements, a man would be given respect, romantic and sexual companionship, devotion from friends and family, the right to take part in a spiritual tradition, the honor of his legacy being passed down through children, and the physical and emotional safety of a community.</p><p>There&#8217;s much that can be critiqued about this old model; indeed, thousands of works of critique have been produced in recent centuries, and many damning flaws have been exposed. But this old model provided men with a purpose and a path, ensuring they couldn&#8217;t get lost, as long as they met the clear, unified expectations.</p><p>Enter modern Western society, a cultural force unlike any the world has ever seen. Modern technology and novel social structures have altered the fabric of our society, ripping apart the old model of manhood in the process.</p><p>The old map to womanhood was also damaged, and indeed, many excellent books and essays have been written about this topic. But the map to womanhood was left more intact than the map for men; being a mother is still a largely respected role in society.</p><p>In contrast, there is little room left for warriors and combatants, and women can now provide for themselves without needing the help of men. The clear-cut map to becoming a man is gone.</p><p>In its place is a hodge-podge of ideals from a variety of sources. We no longer have one tribal leader or religious clergy to tell us how a man should act; the unified messaging has vanished. A boy may receive one definition of manhood from his father, another from his teacher, another from his brother, another from Hollywood, and endless more on YouTube. And if the definition is murky, the path to achieving manhood is even more confused.</p><p>In modern America, a minority of boys are born swaddled in communities that actively guide them through the process of becoming a man. However, most of those communities are religious and conservative, adjectives that the Bay Area actively repels. You won&#8217;t find many of those men around here.</p><p>Instead, the men in the Bay&#8217;s dating scene mostly represent the modern majority category&#8211;men who weren&#8217;t provided a clear map by their immediate community, and instead depended on society at large to teach them about manhood.</p><p>The elite social strata, which I refer to as &#8220;polite society,&#8221; has taken the lead in providing this modernized &#8220;map to manhood,&#8221; using their strong influence on the media and academics as their primary tools. Gone are the days of carefully defined rituals, initiations, expectations, and stepping stones; now young men are expected to figure out the map through a bewildering mixture of movies, TV, social media, video games, books, news articles, and school.</p><p>S<em>ometimes</em> it&#8217;s okay to also learn from your family and friends&#8230; but only if they agree with the map crafted by polite society.</p><p>And as for religion? Absolutely not. Throw it in the trash and light the trashcan on fire.</p><p>The first rule of the Modern Map to Manhood is that you don&#8217;t talk about the Modern Map to Manhood. Defining &#8220;manhood&#8221; is reinforcing gender roles and thus strengthening the patriarchy. Men are just supposed to &#8220;be decent people,&#8221; end of story.</p><p>&#8230;except it&#8217;s not, because there are still certain manners and conventions that men in particular are supposed to follow. And, like it or not, the core of your identity in modern society still largely revolves around your gender.</p><p>So if you squint hard enough at the murky sea of conversation about gender, you can make out the following steps to become a man:</p><ol><li><p><strong>Reject toxic masculinity.</strong></p><ol><li><p>It&#8217;s your job to understand what this means, despite the definition of &#8220;toxic masculinity&#8221; being nebulous and ever-changing.</p></li><li><p>If you&#8217;re uncertain whether you fit the definition, you&#8217;re probably doing something wrong and should feel ashamed. To play it safe, act as demure as possible and avoid risk-taking.</p><ol><li><p>If you adopt these mannerisms and it harms your romantic pursuits, do not complain.</p></li></ol></li></ol></li></ol><ol start=\"2\"><li><p><strong>Be your authentic self!</strong></p><ol><li><p>Your authentic self should not be: dominant, highly interested in sex, competitive, emotionally reserved, prone to risk-taking, bad at reading emotions, stoic, or interested in power.</p></li><li><p>You should consider many of your &#8220;masculine&#8221; personality traits to be symptoms of a poisoned society, rather than potentially inborn characteristics, and feel ashamed if they exist within you.</p><ol><li><p>Don&#8217;t bring up the multitude of scientific studies that question this belief.</p></li></ol></li><li><p>Once you figure out how to repress unwanted traits, people may still decide that Yourself &#8482; is unwanted or problematic. It&#8217;s <em>your </em>responsibility to figure out their concerns and how to accommodate them.</p></li></ol></li></ol><ol start=\"3\"><li><p><strong>Provide for and protect others.</strong></p><ol><li><p>It&#8217;s your duty to use your privileges and strength as a man to defend the weak and uplift the less-privileged.</p></li><li><p>Understand that &#8220;providing&#8221; doesn&#8217;t mean making money and &#8220;protecting&#8221; doesn&#8217;t mean physical protection; those are outdated concepts that reinforce the patriarchy. Provide <em>emotionally </em>and protect against <em>systemic injustices</em>.</p><ol><li><p>If you fail to provide money and physical protection (or at least a physically capable physique), you&#8217;ll be locked out of many relationships. But don&#8217;t complain about this discrepancy between stated and actual expectations.</p></li></ol></li></ol></li></ol><ol start=\"4\"><li><p><strong>Stop obsessing over &#8220;being a man.&#8221;</strong></p><ol><li><p>Gender roles are toxic, especially masculine ones, and it&#8217;s pathetic to care so much about being manly.</p><ol><li><p>Yes, gender is so vital to our self-identity that many trans individuals would rather commit suicide than be forced to repress their gender. But it&#8217;s toxic for biological men to adopt manhood as a vital part of their identity, so just stop it.</p></li></ol></li></ol></li></ol><ol start=\"5\"><li><p><strong>Don&#8217;t expect anything in return for fulfilling these requirements.</strong></p></li></ol><ol><li><p>This would be demanding a reward for meeting the bare minimum requirements, and that would make you gross and entitled.</p></li></ol><p>This is the new guidance we&#8217;re tossing at young men. It&#8217;s the equivalent of taking away GPS from a driver and handing them a map scrawled by a half-blind cartographer tripping on acid.</p><p>The obvious result is getting disastrously lost; the only question is which type of lostness will impact a man.</p><h1>III. Patterns Within the Pain</h1><p>Over the years, I&#8217;ve developed mental categories for the varieties of lostness men are faced with. Each one comes with its own unique troubles that stymie the health of men and the success of their relationships.</p><p>There is no science behind my categories; they are merely my attempt to find patterns within the misery of others. Their boundaries are fuzzy, so men may belong to multiple categories, or may transition from one to another.</p><p>I find it impossible to review dating in the Bay Area without utilizing these categories. My experiences with each category are wildly different; some cause me to walk away from a date feeling sad, some scared, some hopeful.</p><p>Below, I offer a description of five of the most common categories I&#8217;ve encountered, the paths that lead to these particular forms of lostness, and what happens to men who fall into these categories. I also offer my review of dating men from each category and discuss how their lostness impacts relationships.</p><p>I hope my experiences can be enlightening to individuals who may find themselves trapped in these categories; sometimes a third-party viewpoint can be helpful for finding yourself. I also hope to provide some insight for how women navigate dating and what red and green flags we may be picking up on. (This, of course, is merely anecdata and should be taken with a massive grain of salt.)</p><p>But more importantly, I hope this framework can help people to have more empathy for men who fall into these categories. The public commons are filled with lamenting about &#8220;floundering,&#8221; &#8220;immature,&#8221; &#8220;selfish,&#8221; &#8220;hateful&#8221; men who are &#8220;toxic to society.&#8221; While much of the concern is deserved, channeling it into spite and disgust toward individuals is a waste of energy.</p><p>These men did not wake up one day and intentionally decide to be filled with anger, anxiety, and apathy toward society; society failed them, and when they tried to point this out, their concerns were shrugged off.</p><p>Our broken system for raising young men deserves spite and disgust; the individuals trapped in that system deserve empathy and help. I hope this framework can help to shift conversations about these lost men toward finding solutions, rather than blaming young men for their troubles.</p><p>So without further ado, I present my categories of lostness.</p><h1>IV. The Categories of Lostness</h1><h2>THE MAN WHO IS NOT</h2><p>The Man Who Is Not isn&#8217;t the sort of person you&#8217;d expect to get lost, at least not if you knew him when he was young. He was a pretty normal kid with a pretty normal childhood. Good friends, decent family, stable home life. Yeah, there were a few rough spots, but who didn&#8217;t have those?</p><p>He&#8217;s not exactly a stand-out success, but he gets good enough grades that get him into a good enough college. He&#8217;s reluctant to go; he doesn&#8217;t enjoy school all that much. But his parents push him to get a degree, and after he arrives, he decides college life isn&#8217;t half bad&#8211;he makes some friends, dates a couple girls casually, and enjoys plenty of parties.</p><p>The worst stressor seems to be the nagging question of his degree concentration and what career he&#8217;s going to pursue. He&#8217;s changed his mind three times already, unsure what he <em>really</em> wants from his life, and his guidance counselor and parents are starting to lose their patience.</p><p>He finally settles on Economics. It&#8217;s certainly not his passion, but he&#8217;s always been good at math, and this seems like a decent way to make money from that talent. He still has no idea what he wants from life, but at least now he&#8217;ll have time and resources to figure it out.</p><p>He graduates with his bachelors and takes a job as a data analyst at a big bank in the city. He&#8217;s excited; he&#8217;s been promised by mentors and Hollywood and Instagram that this is going to be a magical time of his life, full of new adventures and self-discovery.</p><p>What he finds isn&#8217;t nearly so exciting. Work is boring and draining, consisting of the same tasks every day with a workload that grows ever larger, and he has zero emotional attachment to the end product. He quickly starts to suspect he chose the wrong major, or maybe the wrong job, although mentors shrug off his concerns.</p><p><em>Work isn&#8217;t supposed to be fun,</em> they say. <em>Get used to it.</em></p><p>It&#8217;s not uplifting advice, to say the least. He tries to distract himself from his miserable job with his social life, but it&#8217;s not as easy as he expected. All his college friends moved to different cities, and their texts grow increasingly rare. The city is huge, filled with hundreds of thousands of people, but it feels like they're a swarm of NPCs.</p><p>Few people talk to him unless he approaches first, and the dialogue is always transactional. He would like to buy a cup of coffee. They would like to know where the bus stop is. He wants to sign up for a gym membership.</p><p>Sometimes he tries to steer the conversations to more personal topics, and he manages to get a few phone numbers and promises to hang out sometime. But when he texts them, they never reply.</p><p>He&#8217;s lonely. He doesn&#8217;t like admitting it, not even to himself, because it feels pathetic. After all, there&#8217;s nothing <em>wrong</em> with him. He&#8217;s a perfectly pleasant individual, and people have said he&#8217;s smart and funny, and he&#8217;s never struggled to make friends in the past. Yet the thousands and thousands of people who surround him couldn&#8217;t care less about his existence, and their apathy begins to grow a heavy lump of despair within him.</p><p>He consults the internet, and Reddit tells him to find a community. This seems like solid advice, so he tries to form stronger relationships with his coworkers. After all, work is the closest replacement he has to the structured community he had at college. Back in school, being trapped on campus together just naturally led to friendships and relationships, and he assumes the same will happen at work.</p><p>He&#8217;s wrong. People don't have time to chat during the day, and they don&#8217;t want to hang out after work. They have partners and families and hobbies to get to, and besides, what happens if they have a falling out? That would make office interactions weird. The office is a place for <em>friendliness</em>, but not <em>friends</em>, and certainly not romantic relationships.</p><p>The rejection stings, but he&#8217;s not about to give up. He joins a running club and a book club and starts attending group classes at his local gym. He&#8217;s not really sure if he <em>enjoys</em> any of these activities, but they seem like good ways to meet people and join new communities.</p><p>As the weeks tick past, people start to remember his name, and he gets added to some group chats for scheduling activities. Suddenly, his calendar is full of events, and his evenings are no longer an endless churn of YouTube and video game binges.</p><p>He feels better. Still not <em>great</em>, exactly, but the despair has begun to recede, and he can breathe without feeling the primal fear of being alone and isolated.</p><p>There&#8217;s still something missing; he still goes to work wondering why the hell he&#8217;s there and leaves wondering what the hell he&#8217;s achieved, and he has no idea what he&#8217;s trying to do with his life. But he knows he&#8217;s still young and is pretty sure there&#8217;s still time to figure it out.</p><p>A life crisis occurs. It's small, but something he&#8217;d appreciate some support through. He reaches out to a few of his new friends, and they offer condolences, but none of them have time to meet up. He gets one friend to agree to a phone call, but he&#8217;s barely done explaining the issue before she insists she&#8217;s &#8220;not really sure she can help&#8221; and suggests he maybe talks to a therapist.</p><p>The dismissal comes as a shock. His old friends would have made time for him and carefully listened and offered advice. It&#8217;s not like he&#8217;s asking a huge favor; this is basic friendship stuff. What kind of friends refuse to give such basic forms of help?</p><p>A cold, creeping reality dawns on him: friends <em>wouldn&#8217;t </em>do that. Those &#8220;communities&#8221; he&#8217;s joined are just loose groups of acquaintances who enjoy the same activities. He&#8217;s never had the opportunity to have deep, emotionally-bonding discussions with any members, and that&#8217;s how they like it. After all, true communities come with effort and commitment, and who has time for that these days?</p><p>His new &#8220;friends&#8221; are nothing of the sort. For them to be friends, they'd have to actually know him. And they don't. They know Running Club Him and Book Club Him and Gym Him, but none of them understands the <em>whole</em> of him.</p><p>He starts to question whether that version of himself even exists. After all, humans are social creatures, and if you don&#8217;t have a community or a partner or a purpose, can you even call yourself a whole person?</p><p>Logically, he knows he is, but it doesn&#8217;t feel like it. There&#8217;s a growing void in his soul, an absence that chokes the breath from his chest. It&#8217;s odd that a void could weigh anything, but it seems to be a black hole sucking in his emotions, condensing them in a pit of gravity until his limbs struggle to carry the weight.</p><p>During a soulless work icebreaker, someone asks him how he&#8217;d describe himself. He stutters out a short answer that sounds decent enough, but he realizes he&#8217;s not sure what the honest answer is. He&#8217;s smart, he supposes, although his recent performance at work doesn&#8217;t prove it. He used to consider himself funny, but jokes don&#8217;t come easily these days.</p><p>He&#8217;d never dare to say it out-loud, but the truth is he&#8217;d describe himself as sad and lost and alone and frankly rather scared, like some sort of abandoned child.</p><p>It&#8217;s pathetic, and he knows it. After all, he&#8217;s not a child; he&#8217;s a grown man.</p><p>Or is he? He doesn&#8217;t fit the old-fashioned definition of manhood offered by the right, nor does he fit the modern definition offered by polite society, which is basically just a stereotypical woman with a beard and muscle. He doesn&#8217;t feel like a grown man, but he doesn't feel like anything at all. He feels empty, devoid of a core identity, and uncertain how to plug that hole.</p><p>He may not know what he is, but he knows what he is not: not happy. Not whole. Not satisfied. Not purposeful. Not connected. Not loved.</p><p>There seems to be an obvious solution to at least the last problem: he can get another girlfriend. He hasn&#8217;t had one since college, and that was a few years ago, but he&#8217;s certain he can find another one. A girlfriend is guaranteed to offer him love and support. That&#8217;s the entire point of having a romantic relationship, after all.</p><p>But dating isn&#8217;t easy in the Bay Area. The apps are soul-crushing, his jadedness and bitterness growing with each swipe and conversation with a bot. He manages to land a few dates, but they all seem to focus on the same set of questions: <em>what are your passions? What are your friends like? What do you want from your future?</em></p><p>It feels like a stomach-churning interview, and the judgemental frowns from the women make it clear he didn&#8217;t pass. He starts to dread dates when he lands them, and begins to cancel them last-minute, unable to face the anxiety and rejection they lead to.</p><p>He feels increasingly desperate with each day that passes. Desperation isn&#8217;t attractive, and he knows it, but he&#8217;s not sure how to tamp down the emotion. The void is consuming him; every day he can feel it crushing more of his soul.</p><p>Yet no one seems even the slightest bit interested in helping him free himself from its grip. As soon as he tries to express his feelings to anyone, they react as if he&#8217;s diseased, immediately losing interest in him. Men are supposed to be strong and uplift others, not complain and demand attention for themselves.</p><p>Maybe he <em>is </em>diseased. He&#8217;s pretty sure he&#8217;s suffering from depression at this point, and the stomach-churning anxiety and dread that frequently fill him don&#8217;t seem normal.</p><p>He brings it up with his doctor and gets referred to a therapist. He&#8217;s reluctant to go&#8212;it seems to be an admission of his weakness. But he&#8217;s desperate for someone to listen to him, so he decides to give it a try.</p><p>It turns out the therapist doesn&#8217;t have any interest in listening to him, either. She seems preoccupied with reminding him of his &#8220;luck&#8221; and &#8220;privilege&#8221; and insisting that he needs to use it to better his life.</p><p>He knows she has a valid point; he&#8217;s a straight, educated male. He has privileges in society that others would risk their life for. Logically, it would make sense to be happy and grateful, not sad and upset.</p><p>Yet the void has no respect for logic; rather than tempering his pain, the rationality merely adds a layer of self-disgust onto the despair. There are so many who suffer more than him, yet he can barely shoulder this burden.</p><p>He tries repeatedly to explain the pitiful truth to the therapist: he can&#8217;t help himself. He <em>can&#8217;t</em>. He&#8217;s tried over and over again, and it doesn&#8217;t work. He remains lost, and society continues to not care.</p><p>The therapist insists he&#8217;s not trying hard enough. Her advice is baffling. Exactly what is he supposed to be trying to do? What steps does he need to take to feel whole again? What actions are needed so he can know who he is, and what his purpose is, and convince people that he matters?</p><p>The therapist explains that only he can answer those questions.</p><p>The whole thing feels like a cruel joke. His performance continues to slip at work, until one day he&#8217;s let go. A couple coworkers send a farewell email, but most don&#8217;t seem to even notice his departure.</p><p>He knows he should start applying to other jobs, but he&#8217;s too tired. Tired of the loneliness, of the existential dread, of the rejection, of being reminded how &#8220;privileged&#8221; he is to exist as this broken shadow of a human being. The void has consumed him alive, and there seems to be no escape.</p><p>He lets himself go&#8211;doesn&#8217;t shower as much, stops going to the gym and running club and book club. Some small part of him hopes this will trigger sympathy and cause people to reach out. Instead, it has the opposite effect. He transforms from barely noticeable to completely invisible.</p><p>He is a ghost now, a haunted remnant of a human, yet the only person who cares is himself. And, increasingly, even that isn't true.</p><p>He doesn&#8217;t want to be invisible anymore. He doesn&#8217;t want to be ignored and rejected. He doesn&#8217;t want to be tired and scared and lonely and bitter and lost.</p><p>He doesn&#8217;t want to be. And the world doesn't give a single fuck.</p><h3>Dating a Man Who Is Not:</h3><p>It&#8217;s rare to actually go on a date with a man in this category. More often I find them glancing at me, only to abruptly look away when I try to meet their eyes. Attempts at conversing with them are usually met with hollow replies and an exhausted sense of suspicion.</p><p>On the rare instances I&#8217;ve ended up on dates with these men, it seems they&#8217;ve already used up all their hope and energy to schedule and arrive to the date. By the time we actually sit down for coffee, they&#8217;ve shriveled back into a ghost, providing half-hearted answers to questions about themselves.</p><p>When they do talk freely, it&#8217;s usually a rant. Most of them seem to realize ranting isn&#8217;t ideal behavior on a first date, but they&#8217;re clearly desperate for someone, <em>anyone,</em> to listen to their pain. Yeah, it&#8217;s going to scare away the woman, but she&#8217;s not going to stick around, anyway. No one ever does.</p><p>At least that&#8217;s what the void tells them, and there&#8217;s nothing I could say to sway this opinion. Hypothetically, there might be something I could <em>do</em>&#8211;I could enter into a relationship with him and provide the love and support he desperately craves, giving him the strength he needs to discover his purpose in life.</p><p>Yet realistically, this is a fantasy. A single person can rarely solve issues this severe; it requires the combined strength of an entire community to drag a soul back from such extreme depths. Any attempt at a romantic relationship would crumble under the weight of the void, and only leave the man feeling more hopeless.</p><p>The best I can do for these men is recommend they join communities where genuine emotional bonds <em>can</em> be forged. These still exist, although they&#8217;re frighteningly hard to find in modern society. I&#8217;ve been lucky enough to join several, and it&#8217;s startling how many people have the same story: feeling depressed and isolated and purposeless, and suddenly feeling like they&#8217;re alive for the first time in years once they&#8217;ve been embraced into the community.</p><p>Therapy and guided self-improvement are also helpful, of course. But it has to be the right therapist, and those seem surprisingly rare. I&#8217;ve heard some truly jaw-dropping stories about experiences with therapists, and I feel concern for the men who haven&#8217;t heard of &#8220;therapist shopping&#8221; and don&#8217;t realize it can take trial and error to find compatible and competent help.</p><p>Dates with these men leave me worried. Not for myself, but for these sullen ghosts who seem on the verge of giving up. There&#8217;s so much obvious potential within them, yet society offers them so few ladders to climb back from the pit of depression they&#8217;ve fallen into. When those ladders do exist, they're often missing rungs or spontaneously snap when men put their full weight on them.</p><p>We need more resources for these men, and even more importantly, we need better maps for them, so they don&#8217;t lose themselves to depression in the first place.</p><h2>THE MAN WITH A PLAN</h2><p>The Man With a Plan is the inverted twin of the Man Who Is Not. Rather than struggling to figure out what he wants, he knows<em> exactly </em>what his goals are: he&#8217;s going to get good grades, which get him into a good school, which earns him a good job, which finances a good house in a good neighborhood and attracts a good spouse who provides good kids. He knows this is what he wants, because it is the creed that has been repeated to him since he was in elementary school.</p><p>He does not know who he should <em>be</em>; his copy of the map is just as butchered as any other. But he knows what he needs to <em>do</em>, and that is what matters. After all, we&#8217;re merely the sum of our actions, right?</p><p>Life is smooth sailing for him. His mentors are right&#8211;hard work pays off, and once he graduates with that valuable degree, he lands an excellent job in exactly the field his parents always encouraged him to pursue. The money is great, and soon so is his apartment and his car.</p><p>Everything seems to be falling into place. He downloads a dating app and gets a fair amount of matches, one of whom turns into his girlfriend. She&#8217;s pretty, and successful, and shares his goals of settling down in a good neighborhood to have some kids.</p><p>His parents are <em>thrilled. </em>All their hard work has paid off, just as they expected.</p><p>He knows he should also be thrilled, too, but he&#8217;s not. There&#8217;s a vague sense of unease within him. It&#8217;s haunted him since he was young, sometimes dragging his thoughts to depressed and anxious places, although he always assumed it was because he just hadn&#8217;t completed all the steps in the plan. His work was unfinished, and thus so was he.</p><p>Yet as he checks off more and more boxes on the list of tasks to attain a good life, that feeling seems to be growing in strength, not decreasing.</p><p>He shrugs it off, reassuring himself that it&#8217;s just work stress that&#8217;s making him overthink things. Everything in his life is <em>good</em>. There&#8217;s no reasonable cause for despair, so he just needs to let those thoughts go.</p><p>Years pass, and he works hard to juggle work and his romantic relationship and his friends, although his friends seem to take less time these days. They&#8217;re getting married, having kids, and becoming too busy to hang out. When they do get together, it&#8217;s usually for an activity&#8211;an escape room, a movie night, karaoke. Once the event completes, people scurry off to other obligations, leaving little time for deep conversations.</p><p>But he has his girlfriend, at least. She&#8217;s just as pretty and smart and ambitious as ever. She&#8217;s also getting increasingly anxious for a ring, dropping hints that eventually start to sound more like demands.</p><p>This should excite him, but instead it just stirs the formless dread within him. He chastises himself for it&#8211;he needs to grow up and learn to commit. He&#8217;s too old to be yearning for the life of a bachelor. As they say, the grass is always greener on the other side.</p><p>One night, as they lay in bed, his girlfriend asks him how many kids he wants. He realizes that he doesn&#8217;t know. And actually, now that he thinks about it, he&#8217;s not even sure if he wants kids. They scream a lot, and they make all sorts of noxious odors and messes, and saddling himself to a dependent for eighteen years seems rather terrifying.</p><p>The thoughts come to him unbidden, and he doesn&#8217;t dare to voice them. Two kids. That&#8217;s what he tells his girlfriend, and she seems pleased enough with this answer.</p><p>Yet he can&#8217;t shake the dread from his mind. The part of his mind that those fears escaped from seems to have been a pandora&#8217;s box. Now that it&#8217;s open, he can&#8217;t close it, and the dread continues to grow.</p><p>He doesn't want to move to the suburbs; he knows there are better homes and schools there, but he enjoys the city. He&#8217;s not sure he wants his upcoming promotion to manager; yeah, his salary will increase, but he <em>hates</em> corporate politics. He doesn&#8217;t actually like doing escape rooms; he desperately misses the days of hanging out with his friends and getting tipsy and maybe a little high, and talking endlessly until the sun begins to rise.</p><p>And his girlfriend&#8230; when he really thinks about it, there&#8217;s little in common between them except the same checklist of goals. She&#8217;s a wonderful partner, but is she a wonderful partner for <em>him</em>?</p><p>He doesn&#8217;t know. For so long, he&#8217;s convinced himself that people are just a sum of their actions, and if he just has a solid plan, he&#8217;s going to be a good person with a good life. Now he realizes that&#8217;s a lie.</p><p>Yes, actions matter, but so do feelings. And he&#8217;s spent his entire adult life actively repressing his feelings, tamping them down in a desperate attempt to follow the plan and gain happiness. But it&#8217;s been a fool&#8217;s errand; he&#8217;s followed the plan, and it&#8217;s only led to existential dread.</p><p>He wants to discuss these things with his friends, but he realizes they hardly know him anymore, because he hardly knows himself. He lost himself somewhere in the endless march of the plan, and he begins to wonder if he&#8217;s ever fully existed at all. He&#8217;s followed his parent&#8217;s biddings ever since he was a young child, and chastised himself for any desire he&#8217;s ever had that doesn&#8217;t fit into the cookie-cutter ideal of capitalistic success.</p><p>His girlfriend says he&#8217;s been acting odd lately, cold and distant. He apologizes, and then he tells her that he likes painting. She probably doesn&#8217;t know that, because she&#8217;s never seen him do it, because the last time he painted was during art class in high school.</p><p>He was good at it, and he loved it. It made him feel <em>alive</em>. His teacher suggested he could become a professional someday, but he&#8217;d immediately rejected the idea, knowing the life of a starving artist wasn&#8217;t a good plan.</p><p>Maybe he was wrong. Maybe he should have embraced that life. Maybe he&#8217;d be happier, and wouldn&#8217;t wake up every morning with crushing dread at the thought of going to work.</p><p>His girlfriend says they should sign up for some wine-and-paint nights. He says they should break up.</p><p>He quits his job, too. He hates it; it consumes his time and sucks at his soul, leaving behind a robotic husk. He&#8217;s done with that bullshit. <em>Done.</em></p><p>His friends suggest he&#8217;s having a mental breakdown and needs help. It confirms his suspicions: they don&#8217;t know him at all. If they did, they would see that he <em>is</em> helping himself. He&#8217;s finally taking the time to find and understand himself, to discover his purpose.</p><p>For a few weeks, he&#8217;s elated and excited to be on this new journey. But then the existential dread begins to creep back in.</p><p>He&#8217;s never really done anything without a plan. And he&#8217;s still not entirely sure what he&#8217;s trying to accomplish; he knows he wants to &#8220;find himself,&#8221; but he&#8217;s unclear on what that requires, and the self-help books he consumes seem to have muddled and contradictory answers.</p><p>He starts painting again, taking up classes at a local studio, but his skill level is that of a fourteen-year-old with potential. He hasn&#8217;t practiced in two decades, and his work is weak compared to most other artists his age.</p><p>He&#8217;s not used to being the least skilled person in the room. His prior plan never allowed that as a possibility, and the sense of failure is disorientating. He also has no idea what he&#8217;s going to do with his art. He wants to make a plan, but also balks at the idea of trapping himself in yet another series of checkboxes.</p><p>He signs up to see a therapist, and she assures him that he just needs to find his happiness, but this feels like picking out a gift for someone he&#8217;s never met. How is he supposed to know what makes him happy, if he&#8217;s never been given the chance to figure out who he even is?</p><p>He doom scrolls on social media, wincing at the posts about people&#8217;s deep passion for their jobs and blazing love for their significant other. Part of him feels disgusted by what he perceives as disingenuity; after all, he was making similar posts just a year ago, and it was all a facade. But another part of him feels a cold wave of fear.</p><p>What if all those other people aren&#8217;t faking it? What if he&#8217;s just broken, and unable to feel the same happiness and fulfillment that others experience?</p><p>He feels empty. His unknown future starts to feel like a crushing concern, rather than an exciting adventure.</p><p>His few remaining friends suggest that maybe he should try to get back together with his girlfriend, maybe try to piece together his old life. It&#8217;s not too late, they assure him.</p><p>But he doesn&#8217;t want that. He misses sex and cuddling and having someone to tell about his day, but he doesn&#8217;t miss <em>her.</em> It&#8217;s probably because he&#8217;s fundamentally broken, and she deserves better than him. And as for his job, he can&#8217;t bring himself to possibly go back, despite his rapidly dwindling bank account.</p><p>He turns to the dating world, hoping maybe finding a solid partner will help him solve his brokenness. Yet he seems to keep attracting women with similar forms of emptiness within them, and a void that joins with a void is still just as empty.</p><p>But he&#8217;s not going to give up. He has to find someone, <em>something</em> to give him purpose. Otherwise, his whole life and all his work and all his pain has been pointless. And he&#8217;s not sure he could deal with that outcome.</p><h3>Dating a Man With a Plan:</h3><p>In my experience, Men with Plans are the most common form of lost men in the Bay Area. I feel like half the men I go on dates with fit into this category to some degree.</p><p>These men also tend to be intensely attracted to me, or rather, to my lack of a conventional plan. I&#8217;ve stumbled through a highly unusual path, somehow getting lucky enough to gain a solid understanding of myself, pursue my passions, earn a solid living, and enjoy a happy life along the way.</p><p>My story is like crack to them. They tell me they want to be more like me; they insist they want to see more of me. There seems to be a mistaken belief that they can absorb my personality through osmosis if they date me, absolving themselves of the requirement to figure out their own path and personality.</p><p>It&#8217;s a sad misunderstanding of how it all works. My unconventional life isn&#8217;t the result of zany choices and the advice contained in self-help books; it&#8217;s the result of an intensely rocky childhood I almost didn&#8217;t survive.</p><p>I don&#8217;t have a &#8220;cure&#8221; for these men and their lack of self-identity. I&#8217;ve figured out myself, found my community, and discovered my path, but I can&#8217;t do the same for them.</p><p>Once they figure this out, they almost immediately lose interest in me. Which is for the best, as I struggle to feel romantic attraction toward men in this category. It&#8217;s hard to love someone if they don&#8217;t even understand themselves well enough to know what&#8217;s lovable.</p><p>The good news is that this category seems to be the easiest for men to break free from. If they&#8217;re determined not to give up, and willing to realize that the right woman isn&#8217;t going to fix their issues, they can create a happy life of their own. They&#8217;ll often stumble around for a while&#8211;sometimes months, sometimes years&#8211;but they&#8217;ll eventually find a solid community and a purpose within it. Their brain is already programmed to follow plans and good habits, so as soon as they figure out a new map for themselves, the rest becomes easy.</p><p>The process of figuring out a new plan can be rocky, though. I won&#8217;t sugar-coat that bit. The reality is that a good community is hard to find, and purpose often comes from a certain amount of suffering. Some men never manage to climb out of this category and adopt the hopeless lostness of a Man Who Is Not.</p><p>But with the right support, most can escape to a bright future.</p><h2>THE MAN WHO PROVIDES</h2><p>Meet a Man Who Provides in person, and he&#8217;s often interesting and intellectually stimulating, an immediate &#8220;yes&#8221; when he asks for a date. His online profile features photos from international adventures, flashy job titles like &#8220;CEO&#8221; and &#8220;Senior Director,&#8221; and loving moments caught with his friends at Burning Man.</p><p>The Man who Provides kept hold of one tattered remnant of the old map to manhood: the part that states men must provide resources. This is a vital piece, one that has guided men for thousands of years, and it has survived the great purge of manhood. Sure, people are more likely to point out that it is flawed and unfair, but the reality is that men are still expected to be breadwinners. (If you doubt this, just ask any &#8220;stay at home dad&#8221; about the hostility they&#8217;ve received for their role.)</p><p>The Man who Provides takes this single piece of the map and makes it his entire identity. Much like the Man With a Plan, he takes his education and career seriously. But he doesn&#8217;t strive for a <em>good </em>education and career; he wants the <em>best</em>. In order to provide the most resources, he needs to earn as much success as possible, and he&#8217;s willing to put in the work to do it.</p><p>Tiger parents are excellent at creating Men Who Provide. From a young age, the message is clear: your worth is equivalent to your ability to provide, and providing requires consistent success.</p><p>Other Men Who Provide stumble into the obsession with success by themselves. Often these men are neurodivergent to some degree&#8211;ADHD, autistic, hyper-intelligent, or just otherwise &#8220;different.&#8221; They exasperate and confuse others, and are the subject of bullying by both peers and authority figures.</p><p>Success is an escape valve for these men; it earns them praise their personality never receives. Before long, it becomes a costume, a mask slipped over their personality to ward off apathy or disdain.</p><p>The Man Who Provides graduates at the top of his class and lands a job at a top company, which doesn&#8217;t come as a surprise to anyone who knows him. It&#8217;s also not a surprise when he leaves the job to found his own company, which is sure to be a success.</p><p>Despite his insane work hours, the Man Who Provides somehow manages to accomplish a vast amount of extra-curricular activities as well. He travels the world, speaking of it the same way most people speak of triathlons. The globe is not a tantalizing opportunity, but rather a challenge meant to be vanquished; he knows precisely how many countries he&#8217;s been to and how many he &#8220;has left.&#8221;</p><p>He&#8217;s fond of drugs and brags of the enlightenment he&#8217;s found in acid and mushrooms. The amount of ketamine he consumes makes some question exactly why he&#8217;s so hell bent on dissociating from his enlightened world, but most are simply impressed by the variety of substances he&#8217;s sampled.</p><p>Those &#8220;friends&#8221; in his Burning Man photos were from his startup incubator, and he hasn&#8217;t spoken to any of them in ten months. He misses speaking with them, if he&#8217;s honest with himself, but he worries they&#8217;d drag him down. Their startups haven&#8217;t been as successful as his, and he&#8217;s convinced it&#8217;s because of their attitudes and lack of work ethic.</p><p>As for dating? Well, a partner is yet another thing to be optimized, of course. They must match or exceed his quality level, and a woman&#8217;s quality revolves around their job title and academic degrees.</p><p>His dating life is tumultuous, to say the least. He goes through periods of casually dating many women, proving his desirability to those around him. Then he&#8217;ll enter a serious relationship, with emphasis on <em>serious</em>. His time is valuable, so this relationship had better not waste it.</p><p>The relationship will seem perfect at first&#8211;two successful, powerful, passionate people combining forces! What could possibly stand in their way?</p><p>The answer: themselves. Their relationship quickly implodes, as it turns out two individuals hyper-focused on their personal success tend to be terrible at a group activity such as dating.</p><p>Back to the carousel of casual dating he goes, carrying stories of his ex who just &#8220;couldn&#8217;t match his intensity&#8221; and &#8220;resented his success.&#8221; Then into another serious relationship, this time with someone with a bit less self-esteem and a determination to prove her worth to this intimidatingly accomplished man.</p><p>The relationship lasts longer this time around, a year, maybe two. Then it implodes just as violently, with the woman insisting he was a manipulative and neglectful partner. He&#8217;s baffled by the claims; <em>she&#8217;s</em> the one who was always offering to support his success! It&#8217;s not like he <em>made </em>her do anything. And besides, everything he did was for the both of them. He just wanted to provide.</p><p>Back to the carousel of casual dating he goes, still carrying the hope of finding The One, a woman to complete him, to prove to the world that he&#8217;s an attractive, successful man.</p><p>All the while, a void grows in his chest. Every day, he seems to wake up with less energy and more dread. A friend hints that he&#8217;s burning out, and this insinuation panics him, so he runs off to the Amazon to<strong> </strong>do some ayahuasca about it. But the travel and drugs no longer invigorates him in the same way, and it&#8217;s beginning to truly worry him.</p><p>He refuses to focus on these emotions, though. Emotions make him illogical and weak, and he needs to be strong and decisive. He&#8217;ll keep his focus on his company&#8217;s success, making sure that he can continue to provide and prove his worth. And in the meantime, he&#8217;ll keep searching for his perfect match to reap the rewards of his success and reassure him that he&#8217;s truly an excellent provider.</p><p>It&#8217;s a small pool of women who meet his quality bar, but he&#8217;ll eventually find The One. He knows it. After all, when he puts his mind to something, he always succeeds.</p><h3>Dating a Man Who Provides:</h3><p>Two words sum up dates with these men: pity and frustration. These dates generally begin with these men stating that their time is quite limited, hinting that they&#8217;ve made quite the sacrifice to offer some of it to you. Things only go downhill from there, with the entire affair feeling like an intense job interview.</p><p>I have zero interest in passing these interviews, which creates frustration in these men. I&#8217;ve wasted their precious time, and they&#8217;ve wasted mine. They generally end the date quite quickly, convinced that I have no hope of clearing their quality bar.</p><p>Yet they have no hope of clearing mine. A strong sense of self-identity is a requirement for anyone I date, and these men have never been given the chance to develop one outside of &#8220;founder&#8221; or &#8220;Ivy Leaguer&#8221; or &#8220;Forbes 30 Under 30.&#8221;</p><p>This leaves their identity hopelessly precarious and revolving around their immediate success. A bad day at work or a failed business deal can spell weeks of brooding and self-loathing. You never quite know what version of the man may appear; he could be euphoric from his latest product launch, or despondent and moody from a meeting that went wrong.</p><p>There&#8217;s little I can do to address the issues faced by Men Who Provide. Try to talk them out of focusing so much on standard capitalistic forms of achievement, and they&#8217;ll often accuse you of being jealous and sabotaging their success. Point out their clear misery, and they&#8217;ll insist &#8220;there&#8217;s no gain without pain,&#8221; and if they can just achieve a constantly moving goalpost, they&#8217;ll <em>finally</em> be happy.</p><p>These men generally only shake off this mentality after burning themselves out and facing a bout of depression so severe it kills their ability to succeed in a traditional capacity. This forces them to find other ways to derive satisfaction and finally grow a self-identity that doesn&#8217;t revolve around money and success.</p><p>It&#8217;s saddening that these men have to go through this burnout process to learn these lessons; I hope to see less of these men in the future, as more people come forward to describe this toxic form of living.</p><p>In the meantime, I try to catch young men <em>before</em> they fall into these self-destructive patterns. I lecture my young interns about the hazards of a success-obsessed lifestyle, and encourage them to find senses of worth that don&#8217;t revolve around gaining power and providing money.</p><p>I&#8217;ll be honest, they don&#8217;t seem to listen to me much. But I hope my words remain in the back of their mind, ready to help guide them away from misery when they&#8217;re ready to make that change.</p><h2>THE MAN WHO OPTS OUT</h2><p>The Man Who Opts Out is a growing contingent of the male population, but a rare sight in the dating world. These are men who have given up on dating, or never even attempted it in the first place.</p><p>Some of these men have serious, obvious flaws that keep them locked out of the dating world, such as personality disorders, issues with violence, or severe trauma that&#8217;s gone unaddressed.</p><p>The majority don&#8217;t fit this description, though. In fact, in the Bay Area, a large number of these men are very high-functioning members of society who are smart, respectful, and financially successful.</p><p>Often the Man Who Opts Out is the victim of bullying or neglect as a young adult. People accuse him of being awkward, or short, or shy, or overweight, or an &#8220;undesirable&#8221; ethnicity. Or maybe no one ever directly vocalizes it, but the messages in the media are enough to convince him of his low self-worth, and his interactions with girls seem to confirm it. Most treat him as if he&#8217;s invisible, and his few female friends are quick to emphasize that they&#8217;re <em>just friends.</em></p><p>Dating feels impossible. After all, the goal of dating is to make someone fall in love with you, and how could someone love him when he&#8217;s so terribly unattractive?</p><p>He decides to shove aside dating and focus on the other things society tells him are important: his schooling, his career, his social circle. He can actively work to improve and succeed in these areas, whereas being attractive feels miserably out of his control.</p><p>When he&#8217;s a teenager, this mentality doesn&#8217;t cause much alarm. In fact, some mentors even mistake his avoidance of dating as a sign of maturity. He &#8220;has his priorities straight,&#8221; they say.</p><p>Yeah, some of his peers might mock him for not having a girlfriend, but did<em> they </em>get into MIT? Nope. But <em>he</em> did. That helps to ease the pain of not having a date for senior prom.</p><p>When he&#8217;s in his early-twenties, his aversion to dating starts to feel like a problem. Friends and family comment on it, voicing concern.</p><p>He decides, reluctantly, to give dating a shot. Loneliness is beginning to eat at him, and he decides it&#8217;s worth facing his fears to have a girlfriend who infuses his life with warmth and affection. He&#8217;s still terribly self-conscious about his attractiveness, but his friends insist he&#8217;s &#8220;perfect boyfriend material,&#8221; so he gives it a chance.</p><p>His attempts don&#8217;t go well. In fact, you might say they&#8217;re a bit of a disaster. Women have come to expect a certain level of romantic competence from a twenty-two-year-old, and he just doesn&#8217;t meet the bar.</p><p>It&#8217;s a painful shock. He&#8217;d started to gain his confidence back, proving through his successful schooling and his burgeoning career that he&#8217;s really worth something, even if he doesn&#8217;t quite meet the traditional model of a hot young bachelor. At this point, he&#8217;s accustomed to succeeding at most things in life.</p><p>But every attempt to flirt and date paints an entirely different picture of himself: he&#8217;s practically trembling with nerves, unsure what to talk about, prone to rambling about his niche interests until their eyes glaze over, terrified of accidentally being a creep, yet overly eager for the romantic affection that he desperately craves.</p><p>He&#8217;s a bit of an anxious, awkward mess, and most women don&#8217;t enjoy the vibes. One even starts a rumor that he&#8217;s a creep. The accusation brings back an aching self-consciousness he hasn&#8217;t felt in years.</p><p>He vows to stop even trying. After all, what&#8217;s the point? It&#8217;s hopeless.</p><p>Years pass. He settles into his career, becomes more successful and more mature. He&#8217;s not exactly a social butterfly, but he has some good friends and enough love and connection in his life to keep him tumbling down the path of a Man Who Is Not.</p><p>Yet something is missing. He tries not to think about it, but there&#8217;s a growing emptiness inside him that makes life increasingly hollow. It&#8217;s not just a missing girlfriend; it&#8217;s a lack of someone, <em>anyone</em>, finding him attractive.</p><p>More and more friends are finding committed relationships. At the end of the day, they go home to cuddles and laughter and sex and long, deep conversations. He returns home to his silent apartment and plays video games.</p><p>That&#8217;s it, he decides. He&#8217;s done feeling miserable and lesser. He&#8217;s not some hapless twenty-two-year-old anymore. He&#8217;s a good, mature man with good friends who insist he can find someone, if he just tries.</p><p>He&#8217;s no longer in college, so meeting women isn&#8217;t as easy as it was when he was twenty-two and still living on a campus. He downloads a dating app, and almost immediately regrets it. He gets maybe one match a month, and it&#8217;s almost always a bot.</p><p>When he does match, he carries the conversation, and the woman usually ghosts at a certain point. He spends hours and hours swiping on profiles, growing more bitter with each swipe. When he goes on dates, he feels like he&#8217;s being interviewed, and usually the woman ghosts him afterward.</p><p>He takes another break from dating. More years pass, and his friends who are coupled feel increasingly alien. They&#8217;re having weddings, honeymoons, kids; buying houses and saving for college; attending recitals and soccer practices. He&#8217;s still playing Call of Duty and Dota with his dwindling group of single friends.</p><p>Occasionally, some of his coupled friends will join them on Discord, playing a couple hurried rounds before having to log off to cook dinner or tuck the kids into bed. <em>Damn, I miss being single, </em>they&#8217;ll say, laughing. <em>You have all the time, all the hobbies, all the peace you could ever want.</em></p><p>They don&#8217;t address the elephant in the room&#8211;that at any time, they could dump their partner and be single again.</p><p>Yet they don&#8217;t. Because being alone sucks.</p><p>As he nears his mid-thirties, an interesting development occurs: women start to actively become interested in <em>him</em>. Those superficial characteristics that kept them at bay when he was younger no longer seem so important.</p><p>So what if he&#8217;s only five-foot-six and a bit heavier than average? He has an amazing job, a stellar reputation, a gorgeous apartment, and a great sense of humor. He&#8217;s a <em>catch.</em></p><p>Yet once they discover he&#8217;s never been in a long-term relationship, they once more seem to recoil.</p><p>He enters into a series of short-term flings, trying to make up for the lost experience. At first it&#8217;s exhilarating to have women actually show interest in him. They <em>like</em> him. They <em>want</em> him.</p><p>Quickly, it becomes exhausting. Even when women initially approach him, <em>he&#8217;s</em> the one who must invest the most effort. The women know what they&#8217;re doing; he&#8217;s constantly trying to keep up. Some of them get tired of waiting for him to learn and walk away, opening up old wounds in his self-confidence.</p><p>He considers trying to make one of the connections more serious, but it becomes obvious that she&#8217;d expect him to change so much. His hobbies, his sleeping patterns, his work habits, his furniture, his friendships&#8230; all of it would require modification to keep a girl around.</p><p>And history has taught him that he&#8217;ll just end up getting rejected anyway, so what&#8217;s even the point?</p><p>It all feels so futile and so unfair. All around him, he sees women who settled with crappy men who don&#8217;t treat them properly. He wouldn&#8217;t do that; he&#8217;s a good person. Maybe a bit socially awkward, maybe not the handsomest, maybe a little clueless about some aspects of relationships, but he can learn to be a good partner, if he&#8217;s just given a chance.</p><p>Some of his single friends have officially given up on ever finding a woman, and they encourage him to do the same. It&#8217;s peaceful, they insist. No more pointless pining, no more painful daydreams that never come true.</p><p>They&#8217;re right, he decides. He&#8217;s done. It&#8217;s over.</p><p>Yet one evening, as he lays in bed, the loneliness chews at his soul as he stares at the empty spot beside him. He reaches for his phone and downloads a dating app.</p><p>He&#8217;ll go on just one more date, he tells himself. Just to remind himself of why he doesn&#8217;t date anymore. Just to remind himself of why it&#8217;s futile to even try.</p><h3>Dating a Man Who Opts Out:</h3><p>A date with a Man Who Opts Out is a losing battle. They arrive defeated and suspicious, certain they&#8217;re wasting their time, and it&#8217;s a self-fulfilling prophecy. Some awkwardly avoid any topic that could reveal their lack of dating experience, while others throw it in your face, wanting to get the reveal over with.</p><p>I&#8217;m often surprised by the men who fall into this category; society paints them all as grungy, awkward trolls who live in their mothers&#8217; basements, but many are not only high-functioning members of society, but also highly desirable individuals&#8211;attractive, wealthy, successful. Yet their self-confidence doesn&#8217;t reflect this success; they&#8217;re mentally trapped as the awkward, bullied teenager, convinced no one could ever truly love them.</p><p>For some, this causes bitterness or apathy to spoil interactions with women; dates with these men are uncomfortable events for everyone involved. Every question is met with suspicion, with the man assuming his responses will be used to negatively judge him.</p><p>For others, their lack of self-confidence causes a painful shyness and refusal to open up. They&#8217;re convinced that at any second, the woman will find something about them to reject, so they hide as much of themselves as possible.</p><p>These are some of the most painful dates I&#8217;ve experienced. The nurturing side of me wants to pull the man into a hug, to assure him he&#8217;s enough, to promise I won&#8217;t judge.</p><p>Yet the logical side of me knows I need to judge&#8211;ultimately, it&#8217;s a necessary part of dating. And a crippling lack of self-esteem is a death blow for the stability of any relationship. If I want a healthy relationship, I simply cannot date someone with that trait.</p><p>It&#8217;s a vicious cycle&#8211;a man&#8217;s confidence in his dating ability is crushed, he finally works up the nerve to show up to a date, gets rejected, and his self-esteem lowers even more. He limps off to nurse his wounds, vowing to avoid the &#8220;pointless&#8221; exercise of dating. It might be another year before he attempts to go on another date, or two years, or perhaps he just gives up altogether.</p><p>I absolutely hate being a participant in this cycle. It&#8217;s the dating equivalent of kicking a puppy and always leaves me feeling a dull ache of empathy for the men involved.</p><p>I also hate the standard advice given to these men: that it&#8217;s &#8220;just a numbers game&#8221; and they need to &#8220;just keep putting themselves out there.&#8221;</p><p>The truth isn&#8217;t nearly so easy. A man with severe self-esteem issues is not likely to find a healthy relationship, no matter how many times he flings himself at the dating world. The core issue of self-esteem must be addressed.</p><p>For some, this means structured therapy or psychiatric treatment, for others, it means growing their social life until it&#8217;s vibrant enough to soothe the part of their soul that insists they&#8217;re not enough. Or maybe it&#8217;s a combo of all three or something else entirely. But <em>action</em> needs to be taken to address the lack of self-esteem; the man can&#8217;t just half-heartedly daydream about a woman who might swoop in to &#8220;love him just the way he is&#8221; and solve all his confidence problems.</p><p>Also, relationships take practice. If a man is past the age of twenty-five and has never been in a committed relationship, most women will view this as a red flag. They&#8217;ve spent their teens and early-twenties doing the hard work of learning how to be in a relationship, and they don&#8217;t want to partner with someone who hasn&#8217;t even begun that journey yet.</p><p>The good news is that there are ways to compensate for this. I would happily date a thirty-year-old who has never been in a <em>romantic</em> relationship, if he has other <em>social </em>relationships to prove his viability as a partner. Close ties to his friends, family, and community can prove he&#8217;s well-versed in all the vital elements of a relationship: communication, trust, empathy, honesty, etc.</p><p>Yet the fact remains that the longer someone opts out of the dating world, the harder it becomes to opt back in.</p><p>So my advice to men who fall into this category is to rip off the bandaid. If they want a partner, they need to start working toward it <em>now</em>. Overcoming insecurities and past traumas takes time and effort.</p><p>The good news is that men who fall into this category seem to be pleasantly surprised at how quickly their social and romantic prospects improve, once they identify and address the root issues. Many of them happily &#8220;graduate&#8221; out of this category and go on to have wonderful relationships.</p><p>I have a feeling the man I end up partnered with will be someone who graduated out of this category. After all, both my previous serious partners fell into this category earlier in their life. I seem to have a soft-spot for people who overcome insecurities; they tend to be delightfully empathetic and dynamic individuals.</p><p>In the meantime, I&#8217;ll continue to try to encourage men who fall into this category not to give up. There&#8217;s a path to healthy, happy relationships. It may not be simple, but as the tired but true saying goes, nothing important ever is easy.</p><h2>THE MAN WHO BECOMES A BEAST</h2><p>The Man Who Becomes a Beast often begins as a Man Who Is Not. He is lost, and depressed, and anxious to find himself, yet unsure how to even begin.</p><p>He drudges through his job, hating every moment, yet sometimes he hates being away from work even more. At work, he&#8217;s at least acknowledged as a person. As soon as he leaves, the lonely silence of his existence threatens to suffocate him.</p><p>He doesn&#8217;t know what he wants from life, but he knows it&#8217;s not <em>this.</em></p><p>The city is filled with young, attractive women that inspire wistful daydreams. Maybe he&#8217;ll ask one out, and they&#8217;ll hit it off, and then his apartment will no longer be empty. Then maybe she can introduce him to her friends, and the empty abyss of his social calendar will suddenly be filled with dinners, and trips, and concerts, and&#8212;</p><p>No. He doesn&#8217;t dare. He&#8217;s far from an Adonis&#8211;his physique pales in comparison to most men. Chances are, any girl he asks out will say no, and she&#8217;ll think he&#8217;s a creep for approaching her. Then she might tell the other women that he&#8217;s a creep, and the whole thing would be a disaster.</p><p>It&#8217;s better not to directly approach women. He can find a girlfriend on the apps.</p><p>Except that certainly hasn&#8217;t been going well. He rarely gets matches, let alone dates. On the rare instances they occur, the women seem bored by the conversation and pepper him with questions about his intentions and future that he can&#8217;t answer.</p><p>His performance at work slips, and he&#8217;s placed on a performance improvement plan. He knows he&#8217;ll probably be fired next quarter, but he can&#8217;t bring himself to care.</p><p>His doctor tells him he&#8217;s depressed and tosses some pills at him, but it only serves to anger him.</p><p>The anger is a surprise. He&#8217;s not an angry person, or at least he&#8217;s never been in the past. Yet the emotion keeps flaring to life in his chest, poisoning his mind with spite. Spite toward his idiot manager who doesn&#8217;t give a shit about him. Spite toward the women who judge him without truly knowing him. Spite at the asshole doctor who mindlessly writes a prescription without bothering to understand the <em>real</em> problem.</p><p>There&#8217;s nothing wrong with his head; it&#8217;s the rest of the world that&#8217;s the problem. He doesn&#8217;t do anything wrong, yet the world treats him like he&#8217;s less than worthless. He doesn&#8217;t need pills, he just needs someone to give a shit.</p><p>He struggles to focus and turns to social media to distract his churning mind. YouTube, Instagram, and TikTok indulge him with a steady stream of entertainment, numbing his frustration and anger with an unceasing shower of fitness routines and video game hacks and soccer highlights.</p><p>Gradually, the algorithms drift toward new content. A buff dude sneers into the camera, pointing an accusing finger as he rants about &#8220;betas&#8221; and their pathetic video games and tiny dicks. It&#8217;s not the first time this influencer has crossed his feed, but it is the first time he actually watches a full video.</p><p>He&#8217;s not sure whether to be offended or amused. The video is so over-the-top that he wants to laugh it off, but it also hits some painful insecurities.</p><p>He <em>is </em>wasting his life at his shitty job. He<em> would </em>attract more women if he worked out more. He <em>hates</em> feeling awkward and uncertain and invisible.</p><p>He watches several more videos. The influencer sure isn&#8217;t a philosopher, but he at least has the balls to discuss the way society has neglected men. High school graduation rates are plummeting, college enrollment has taken a nosedive, addiction is spreading like wildfire, incarceration is creeping upwards, suicide rates are rocketing to the sky.</p><p>Where&#8217;s the public dismay? Where&#8217;s the outrage and the activism?</p><p>Nowhere, says the influencer. All those activists are too busy accusing men of being dangerous monsters to bother caring about them.</p><p>Fuck those people and all they stand for, says the influencer. If you want anyone to care about you, you have to <em>make </em>them care. And this influencer knows exactly how to accomplish that.</p><p>And then he gives it: a map for manhood. One that&#8217;s entirely different from the vague, confusing, dismissive directions that polite society has offered. One whose guidance loudly insists that being a man is a <em>good</em> thing, something to be proud of and use to his advantage.</p><p>The manosphere map promises power, success, sex, money, belonging, and confidence if it&#8217;s followed. In contrast, the map offered by polite society offers a vague promise to not be considered a failure or a danger.</p><p>The choice seems obvious.</p><p>If he looked hard at the manosphere map, its contradictions are obvious. It promises the respect and adoration of women, but insists this is to be gained through mistreating them. It promises power and money, yet discourages higher education, despite this being the most sure-fire way to climb the class ladder. It insists women are less intelligent and logical beings, yet also insists they have taken over control of the world.</p><p>Yet it&#8217;s hard to think critically about these contradictions; life has left him exhausted and angry, and the manosphere map insists that success and payback are just a few easy steps away. And those steps are <em>deliciously </em>concrete and specific. The manosphere offers millions of hours of video tutorials on the single subject of how to get a woman &#8220;out of your league&#8221; to like you. Meanwhile, polite society balks at the mere question, droning on about how romantic &#8220;leagues&#8221; are an inherently patriarchal and harmful concept.</p><p>Sure, some of the advice seems off. Insulting women goes against how he was raised, and some of the money advice seems like it's using people. Yet how he was raised led him to be anxious and invisible. And the rest of society seems to be using him, so why shouldn&#8217;t he turn the tables?</p><p>And besides, the map works. He knows it does. There are a hundred comments on each popular video balking at their morals, but a thousand more from men reporting the success of the techniques.</p><p>He decides to give it a try. He goes out and uses the techniques at a bar, and it works. He brings a woman home for the first time in years. Yeah, she seems kind of unstable and uncertain, but that&#8217;s to be expected. She&#8217;s a woman, after all. She just needs an alpha male to give her guidance and purpose; he&#8217;s actually doing her a favor.</p><p>He&#8217;s hooked. On the clear directions, on the sex, on the feeling of power. And although he doesn&#8217;t like to admit it, he&#8217;s hooked on the attention. His actions and opinions upset the people he&#8217;s determined to be his enemies; he likes their outrage, and the way he&#8217;s able to control their emotions with merely a few words.</p><p>They hate him, but that&#8217;s okay, because he hates them too.</p><p>The influencers were right: fuck society and their weak, pathetic norms. If you want something, you have to be a <em>real</em> man and take it.</p><h3>Dating a Man Who Becomes a Beast:</h3><p>There&#8217;s a unique aura that surrounds Men Who Become Beasts. Some are fit, and cocky, and smooth, exuding the hyper-masculine air that the Tate brothers exemplify. However, most remain awkward and abrasive, juggling self-consciousness with a sneering confidence that they&#8217;re more enlightened than the &#8220;sheep&#8221; who refuse to see the &#8220;truth.&#8221;</p><p>Both types share a noxious mixture of arrogance and frustration, and they&#8217;re all too eager to prove their disdain for the world.</p><p>I rarely end up on dates with these men; I&#8217;ve gotten good at detecting them over the years, both in-person and on dating apps. Still, occasionally they slip past my radar, and I find myself grabbing coffee with someone whose presence raises my hackles.</p><p>I will always end the date as soon as possible and update my detection heuristics. Yet it seems impossible to truly avoid these men.</p><p>I punched one a few months back. He tried to dance with my friend at a concert, refused to take her clear &#8220;no&#8221; for an answer, forcefully shoved himself against her, and did <em>not</em> appreciate me shoving him back.</p><p>He grabbed my arm and yanked me toward him; I landed a jab to his throat. (Apparently, the manosphere doesn&#8217;t teach men to tuck their chins during a fight. Quite the oversight.)</p><p>My jab shocked him enough to loosen his grip, and I yanked free. Three strangers from the crowd grabbed him, restraining him as he tried to lunge at me. His face twisted in a snarl as he hurled insults over the booming bass.</p><p><em>Cunt, crazy bitch, low value whore.</em></p><p>It was the latter insult that gave it away: he was yet another young man drugged by the toxic ideology of the manosphere.</p><p>There was something darkly poetic about the scene: three strangers, all men, throwing themselves in harm&#8217;s way to stop a two-hundred-pound brick of muscle from pulverizing me. Struggling against their grasp was the Hyde to their Jekyll, a rabid animal who used his natural strength to attack rather than to protect.</p><p>I pity that young man. He was well-dressed, handsome, and fit, clearly doing <em>something</em> right to have made it to an expensive concert in a popular city. Yet his mind has been tainted by a creed that turned him into a predator. The preachers of this creed promise success and respect, yet in reality, they doom their adherents to be unfit for society, forcibly outcast from any loving community.</p><p>That young man walks the world as a predator, destined to be deprived of the love and respect he yearns for. He&#8217;ll likely gain some twisted semblance of a relationship; there are plenty of women out there who won&#8217;t recognize the warning signs. But it will be a relationship rooted in fear and manipulation, devoid of the warmth of love.</p><p>He will feel that coldness. It will haunt him, and stoke his anger, and some poor woman will probably be the victim when his rage boils over.</p><p>I don&#8217;t know what to do about these men. I worry it&#8217;s too late for most of them; so many have been steeping in the manosphere ideology for years, and converting them away will be as hard as swaying a religious fanatic.</p><p>So I avoid them. I fear them. And I sure as hell don&#8217;t date them.</p><h1>V. The Man Who Is Whole</h1><p>Don&#8217;t let my categories of lostness convince you that all men are bumbling through life without purpose. Many men have beaten the odds and become Men Who Are Whole, and these men deserve an entire section devoted to them.</p><p>A Man Who Is Whole rarely begins whole. Occasionally they do, but these are rare and frankly baffling anomalies. Most begin within another category, and through a combination of sheer will, some luck, and the support of a community, they forge themselves into remarkably solid individuals.</p><p>A Man Who Is Whole has created his own map to manhood. Often, he&#8217;s been blessed with close mentors, and usually it&#8217;s coupled with an intense passion for something. Maybe he&#8217;s passionate about teaching, or building a business, or becoming a father, or creating music, or writing long-winded essays about the dangers of AI. Whatever it is, it&#8217;s a purpose he can use as his true north when piecing together his personal map.</p><p>His passions lend themselves to goals, but after some trial and error, it becomes clear that obsessing over his personal goals doesn&#8217;t feel quite right. He needs to find some way to benefit his community through his goals.</p><p>But what <em>is</em> his community exactly? He&#8217;s not sure, but he&#8217;s determined to find out. It&#8217;s not easy, and he screws up several times, burning and getting burned by various relationships. But eventually he manages to find a solid community, a real one with deep, emotional bonds and a mutual desire to provide love and support.</p><p>His passion gives him motivation; his goals give him intention; his community gives him purpose. Combined, they provide a scaffolding for him to build himself into the best version of himself.</p><p>He continues to flesh out his map, creating a unique path with the help of his community. Mentors guide him, peers critique him, friends and partners encourage him. The map is a messy thing, with lots of erased sections and some meandering parts, but after several years, it finally feels finished.</p><p>He knows how to be a man, because he knows how to be himself, and there is no doubt in his mind that he is a man. Some of the traits are exactly what he expected when he was a boy dreaming about manhood: his confidence, his strength, his protectiveness. But others were surprise discoveries: his empathy, his restraint, his soft spot for kids and desire to mentor them.</p><p>The map is his, and his alone, a hard-won victory personalized to his wants and needs. It should be celebrated and cherished, and whenever he gets the chance, shared with other young men who might benefit from its contents.</p><h3>Dating A Man Who Is Whole:</h3><p>Dating a Man Who Is Whole is a rare and precious experience. Their presence has a solidness that&#8217;s infinitely alluring and soothing, and it makes me want to nuzzle into their chest and listen to their heart, to marvel that such mundane biological pieces could somehow have produced such a magnetic presence.</p><p>There&#8217;s a stereotype that Men Who Are Whole are always overtly confident and highly masculine, but I haven&#8217;t found this to be true. In fact, many of them carry a subtle sort of masculinity that lends itself to gentleness and empathy. They have little to prove to the world, because they know who they are, and so does their community, and they are respected for it.</p><p>They have overcome a lot to achieve this frame of mind. They&#8217;ve bumbled through confusing directions and dead ends, but never given up, and the persistence has paid off. It makes them invaluable partners through difficult times; they know how to handle themselves in tough situations, and they&#8217;re eager to share their strength with others.</p><p>They&#8217;re not perfect. No human ever is. But they know that, and they have the humility to discuss issues in an open and empathetic way, while still standing their ground when necessary.</p><p>It&#8217;s an honor to be loved by a Man Who Is Whole, and it&#8217;s always a surprising delight when they choose you as the focus of their affection.</p><p>But there is also an inevitable sadness that clings to the edges of their presence. After all, it&#8217;s only when you interact with them that you realize how lost all those other men are. They usually are aware of how different their existence is to many other men, and they carry the weight of friends and loved ones who have been permanently lost to other categories.</p><p>I believe that most young men have the potential to become Men Who Are Whole, if they&#8217;re given the right support and guidance. I think the rarity of these men is one of the greatest indictments on our current culture and our methods of raising boys. Yet I&#8217;m hopeful that someday they&#8217;ll be the rule rather than the exception.</p><p>I&#8217;m deeply lucky to have several of these men in my life. If you do as well, don&#8217;t forget to remind them how grateful you are for them and how proud you are of who they&#8217;ve become. Oftentimes, they don&#8217;t understand just how impressive and important they are. So tell them, and treasure them, and maintain hope that someday there will be more of them.</p><h1>VI. Crafting a New Map</h1><p>The sheer number of lost men make it obvious that polite society has failed to deliver an effective map to manhood. Men are miserable, and their pain is reflected in the rising rate of suicide, depression, anxiety, joblessness, and crime. The numbers don&#8217;t lie: the current map doesn&#8217;t work.</p><p>Society owes it to young men to draft a new map for them, one with more positivity and concrete steps that can help them avoid getting lost.</p><p>I have many ideas about potential fixes and additions to the Modern Map to Manhood, but there are five that I feel are most important:</p><ol><li><p><strong>Encourage positive male role models to provide detailed directions on how to &#8220;become a man.&#8221;</strong></p></li></ol><p>Prior cultures have had granular stepping stones toward manhood for a reason: young minds thrive on concrete goals and specific examples. We need more high-profile, morally-sound men who openly discuss what it&#8217;s like to live with a testosterone-dominated body and how they learned to channel their natural instincts into positive and productive outcomes.</p><p>There is so obviously a desperate desire for this type of conversation; the wild success of &#8220;manosphere&#8221; influencers is proof that young men are desperate for authority figures to tell them exactly how to become a man. Yet right now the only people filling this niche seem to be creeps such as the Tate brothers, who are preaching a version of manhood that revolves around intimidation, trickery, and abuse.</p><p>We need to give good, moral men the license to openly discuss their personal path to manhood in a positive light, and not be accused of being sexists who are &#8220;reinforcing the patriarchy.&#8221; Millions of young men are desperate for these discussions; our options are either to give them the most positive versions possible, or leave them to feed on the dangerous slop produced by the likes of the Tates.</p><p>Importantly, when these discussions occur, there needs to be a focus on positivity. It can&#8217;t simply be a list of things you <em>shouldn&#8217;t</em> be. Don&#8217;t be lazy, don&#8217;t be violent, and don&#8217;t harass women are all vital lessons. But only hearing a list of &#8220;do nots&#8221; is a great way to make boys attach a feeling of shame to their gender and resentment toward those who preach those lessons.</p><p>Positivity needs to be woven into the core of the message; we need more &#8220;dos&#8221; than &#8220;do nots.&#8221; And those &#8220;dos&#8221; need to be specific and understandable.</p><p>There is no one &#8220;right way&#8221; to be a man, just as there is no one right way to be a woman. But we need to provide young men with varied, concrete examples of manhood, highlight the positivity that each form of manhood brings the world, and provide stepping-stones for becoming each type.</p><ol start=\"2\"><li><p><strong>Stigmatize sexist behavior toward men.</strong></p></li></ol><p>There is currently a double-standard when it comes to sexism. For many decades, there has been rightful backlash against sexist behavior toward women; after millenia of horrific treatment of women in Western society, this focus makes sense. Yet there is an increasingly vocal minority that has decided &#8220;protecting women&#8221; is a zero sum game, and demeaning men and ignoring their concerns will somehow improve the lives of women.</p><p>Comments such as &#8220;men are pigs&#8221; or &#8220;this is why women shouldn&#8217;t trust men&#8221; run rampant, and often escape pushback from polite society. Massively popular social media influencers insist that it&#8217;s horrible to judge groups of people as a monolith; so terrible, in fact, that it should be considered a crime in many cases. Yet those same people proudly crow about how they&#8217;d feel safer encountering a wild bear than an average man. The hypocrisy goes unquestioned in many cases, and those who do dare to point it out are often accused of being closet sexists.</p><p>An increasing amount of this sexism has real-life repercussions for men. For example, a growing body of studies suggests that some viruses affect men&#8217;s bodies in more severe ways; COVID and influenza kill a significantly higher number of men than women, even when controlling for other health factors. Yet millions of social media posts mock men for their &#8220;man flu,&#8221; insisting men who complain of severe illness are exaggerating their symptoms, or just aren&#8217;t as accustomed to bodily discomfort as women. This sort of discourse minimizes a very serious issue and discourages further research and targeted health outreach programs.</p><p>Similarly, the education gap between boys and girls is often discussed in disparaging and sexist terms. Male students are loudly accused of being &#8220;immature&#8221; and &#8220;disruptive&#8221; when compared to female students, and many influencers insist the education gap is the result of male entitlement and poor behavior caused by the patriarchy. Yet the biological reality is that critical portions of the male brain develop at slower rates than female brains, and our education system wasn&#8217;t built to accommodate this fact. Boys are at a serious, scientific disadvantage in the classroom, yet sexist discourse continues to minimize this issue or insist it's simply proof of weak character.</p><p>Over and over again, a loud segment of society labels casual cruelty toward men as &#8220;fighting the patriarchy.&#8221; In reality, this type of discourse is simply indulging in childish bullying and neglecting serious issues. Yes, there are some tough realities about the impacts of testosterone and other male hormones on behavior, but that&#8217;s no excuse to accept blatant sexism.</p><p>Being bigoted toward a group of people is destructive, immature, and harmful. Equality requires caring equally about all members of society. This is not a zero sum game, and that fact needs to be shouted to the heavens until all understand.</p><p>Sexism matters, in all forms. It&#8217;s horrible, and no one deserves it, so let&#8217;s make it unacceptable behavior for <em>anyone</em> to display, regardless of their gender.</p><ol start=\"3\"><li><p><strong>Remind men of their worth.</strong></p></li></ol><p>There&#8217;s a strange creed within much of polite society that insists men don&#8217;t need to be reminded of their worth, because they are privileged. In fact, some insist that reminding men of their worth might even make the privilege disparity <em>worse.</em></p><p>This mentality is madness. There&#8217;s a raging epidemic of men who question their worth, and it&#8217;s leading to them spiraling into lostness and taking their own lives. It&#8217;s also causing an alarming uptick in men who despise women and polite society, believing that these people don&#8217;t believe they&#8217;re worth anything at all.</p><p>Men need to know that we care. They need to know that they&#8217;re worthy of respect, love, and kindness. The only way this can happen is if we loudly discuss the benefits and beauty that men bring to society.</p><p>No one should ever feel ashamed or unworthy because of an inherent trait. Boys should be just as proud of their gender as girls are, and we can accomplish this by celebrating the beauties of both identities.</p><ol start=\"4\"><li><p><strong>Encourage men to discuss the issues they face, and listen to them.</strong></p></li></ol><p>There is currently a confusing contradiction when it comes to vocalizing the issues impacting men. On one hand, polite society insists the patriarchy has stifled men&#8217;s emotions, and they need to be better about discussing their thoughts, feelings, and concerns. Yet when men oblige and try to discuss the serious issues they face, they&#8217;re often berated for being sexist, told these problems are their own fault, or have their concerns dismissed as &#8220;lesser&#8221; than those faced by other demographics.</p><p>We need to listen to men and the issues they present. Rather than attacking the narratives they give, society needs to find ways to validate and address their concerns.</p><p>If we don&#8217;t, men will continue to turn to the manosphere and the alt-right for these conversations. And if the alt-right control those discussions, their bigoted and backwards ideas are the only &#8220;solutions&#8221; on the table.</p><p>Refusing to listen to men&#8217;s issues, or insisting those issues don&#8217;t actually exist, also gives the alt-right an incredibly powerful recruitment tool: they can claim they&#8217;re the only ones &#8220;willing to speak the truth,&#8221; and have that highly alluring message be partially true.</p><p>Many will protest that polite society <em>is</em> listening and men&#8217;s issues <em>are</em> being discussed. After all, polite society frequently discusses economic inequality, mental health resources, prison reform, and many other vital topics that have a massive impact on men&#8217;s issues. In fact, they discuss these things even more than the right!</p><p>This isn&#8217;t enough. At all other times, polite society jumps on the opportunity to call out the issues facing specific demographics, and loudly insists on listening to the stories of these people. Paying close attention to specific demographics is better at conveying empathy, validating the concerns of impacted populations, and having more efficient and effective conversations.</p><p>Yet when men&#8217;s issues are involved, polite society suddenly balks at their own logic and prefers broad, untargeted conversations.</p><p>This needs to stop. Polite society needs to get better at saying, &#8220;Men are hurting, and we care about their specific needs, and we want to hear from them and make things better for them.&#8221; Until that can be accomplished without triggering backlash and infighting, we are doomed to lose more and more young men to the alt-right.</p><ol start=\"5\"><li><p><strong>Openly acknowledge that men and women share some biological differences, and embrace the beauty of this diversity.</strong></p></li></ol><p>Within polite society, there&#8217;s a strange insistence for men to be their true selves, yet a rejection of the idea that the average man could, perhaps, <em>just maybe</em>, be biologically programmed to act differently than the average woman, like all species closely related to us.</p><p>Feminists encourage men to &#8220;reject social pressure&#8221; about manhood and &#8220;be their true selves.&#8221; Many seem to imagine that when social pressures vanish, traditionally masculine behaviors will melt away, leaving men with all the personality traits of the average woman.</p><p>Thus men face a bizarre push and pull: relentless demands to &#8220;be vulnerable&#8221; and &#8220;express your true self,&#8221; followed by self-righteous fury when that true self ends up being more dominant, more sex-driven, and less intuitively empathetic than the average woman.</p><p>This needs to stop. It&#8217;s wickedly confusing for young boys and frustrating for adult men who know with certainty they&#8217;re inherently different from the average women, yet are muzzled from repeating this truth that explains a lot of their experiences.</p><p>We need to openly acknowledge these differences and find beauty in them. One of the core messages of polite society is that diversity is a good thing, and this is just another chance to celebrate and embrace differences within people.</p><p>Of course, we still need to make sure people understand that many men and women will fall outside these &#8220;average&#8221; types; plenty of men will be more traditionally feminine than women, and vice-versa. But both of these truths can exist and be celebrated at once.</p><h1>VII. A New Beginning</h1><p>Although this review may make you think differently, I love dating in the Bay Area. There is nowhere else I&#8217;d rather live and date, partially because of how dynamic and rapidly-changing this city is.</p><p>The Bay Area has reinvented itself many times, and we can do it again. We can help create the next generation of men who are more grounded, more confident in their identity, less lost, and better romantic partners.</p><p>It will take effort from all of us and many difficult discussions, but many people in the Bay Area are already hard at work accomplishing these changes, and I hope this essay can help with their progress. With enough persistence, I&#8217;m confident that society can move onto a newer, more complete, and healthier Map to Manhood.</p><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/your-review-dating-men-in-the-bay",
            "publishedAt": "2025-08-15",
            "source": "SlateStarCodex",
            "summary": "<p><em>[This is one of the finalists in the 2025 review contest, written by an ACX reader who will remain anonymous until after voting is done. I&#8217;ll be posting about one of these a week for several months. When you&#8217;ve read them all, I&#8217;ll ask you to vote for a favorite, so remember which ones you liked]</em></p><h1>I. The Men Are Not Alright</h1><p>Sometimes I&#8217;m convinced there&#8217;s a note taped to my back that says, &#8220;PLEASE SPILL YOUR SOUL UPON THIS WOMAN.&#8221; I am not a therapist, nor in any way certified to deal with emotional distress, yet my presence seems to cause people to regurgitate their traumas.</p><p>This quirk of mine becomes especially obvious when dating. Many of my dates turn into pseudo-therapy sessions, with men sharing emotional traumas they&#8217;ve kept bottled up for years. One moment I&#8217;m learning about his cat named Daisy, and then half a latte later, I&#8217;m hearing a detailed account of his third suicide attempt, complete with a critique of the food in the psychiatric ward.</p><p>This repeated pattern in my dating life has taught me three things:</p><ol><li><p>I am <em>terrible</em> at small talk.</p></li><li><p>Most men are not accustomed to genuine questions about their well-being, and will often respond with a",
            "title": "Your Review: Dating Men In The Bay Area"
        },
        {
            "content": [
                "<p>In honor of Nate Silver’s analysis of when to leave for the airport, and because it’s been an intense week, I thought I’d offer my thoughts on various related questions.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!WEcv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F595254c8-9d2e-46ec-9387-42084b70d613_500x333.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Buying The Ticket</h4>\n\n\n<p>As far as I can tell, the major booking portals for tickets are all basically the same. I’ve been using Orbitz for a long time because I’m used to the interface, it is clean and I have confidence it works. The times I checked Kayak and so on they all seemed to be exactly the same.</p>\n<p>I still book tickets manually rather than using an AI agent. There isn’t much time to plausibly save and by the time I fully express preferences and enter my information anew I might as well have just done it myself. It also means I look at alternatives, which helps me keep tabs.</p>\n<div>\n\n\n<span id=\"more-24654\"></span>\n\n\n</div>\n<p>My heuristic is to book a little over two weeks in advance, but not to book much more in advance of that in case plans change or want to change, since in expectation price changes are pretty small and maybe you decide to stay an extra day for some reason even if you are confident you won’t cancel.</p>\n<p>I almost always book the minimum flight, basic economy, whether or not I am paying. There is so little to be gained from moving up compared to the price. What I will pay a substantial amount for are nonstop flights since connections create bad luck surface you don’t want, flights at the right time of day so I don’t lose a bunch of sleep or work for no reason, and avoiding terrible airlines, with only minor preference between the normal options.</p>\n<p>Terrible airlines mostly means avoiding Spirit and other ‘bargain’ options. I’ve given up on caring about frequent flier programs. I’ll still enter my information because who knows, but they’ve raised the barriers a lot and I don’t fly as often as I used to, and they frequently don’t even offer credit at all for basic economy. That last point seems like an obvious mistake by the airlines.</p>\n\n\n<h4 class=\"wp-block-heading\">Planning To Spend Time At The Airport</h4>\n\n\n<p><a href=\"https://x.com/acesounderglass/status/1946602168393650297\">You intentionally can spend a bunch of time at airports without spending too much time (per flight) at airports</a>, unless that extra time is expensive for you in some fashion.</p>\n<blockquote><p><a href=\"https://x.com/maiamindel/status/1946244263689199928\">Maia</a>: Something that the evil efficiency freaks on this place don&#8217;t understand is that spending time at the airport is fun.</p>\n<p>Elizabeth Van Nostrand: &#8220;Should I take 5% risk of missing an irreplaceable Christmas flight, or be on my laptop in a slightly worse place for 30m?&#8221; Easy choice.</p></blockquote>\n<p>Airport time beyond that first walkaround period is not as fun or productive as time at home. It is still for the most part totally fine?</p>\n<p>You have your laptop and your phone, if wise you have your headphones, you bring a book, you can go for a stroll, you have an excuse to relax and reset.</p>\n<p>The bigger your buffer the more relaxing it is. Unless you are extremely pressed for time, the number of flights you should miss is essentially zero.</p>\n<p>The food at the airport is not ideal, and it is more expensive than usual, but even if you do end up eating there so long as you have an option you don’t mind the cost in absolute terms is quite low. You should scout this ahead of time. I have notes for all the New York airports.</p>\n<p>The reason not to spend that much time at airports, even though that time is cheap and you want to mostly never miss a flight that is expensive to miss (not all of them are), is that you don’t have to spend a full two hours to get your risk near zero.</p>\n\n\n<h4 class=\"wp-block-heading\">When To Head To The Airport</h4>\n\n\n<p><a href=\"https://www.natesilver.net/p/how-soon-should-you-arrive-at-the-airport\">Nate Silver, taker of many flights and cruncher of many numbers</a>, tells us when we need to arrive at the airport. As he says, the standard advice of allowing 2 hours before a domestic flight makes absolutely no sense in today’s world.</p>\n<blockquote><p>Nate Silver: My <em>default</em> is to allocate 60 minutes — one hour, not two — from walking through the airport doors until departure time. There are several important assumptions behind this, however, which usually fit my circumstances but might not match yours:</p>\n<ul>\n<li>I’m flying within the United States.</li>\n<li>I have some form of expedited security: CLEAR, TSA PreCheck or the priority lane.</li>\n<li>I’m not checking bags.</li>\n<li>And there are some reasonable backups if I miss the flight, as is almost always the case since I mostly fly from New York to other major cities and have decent status on some of the big carriers.</li>\n</ul>\n<p>This won’t give you much time to hang out — but it’s enough of a buffer that you’re very unlikely to miss your flight. There are more things that can add time to the baseline than subtract from it, however — so let’s consider those complications.</p></blockquote>\n<p>I, also a taker of a reasonable number of flights and a cruncher of many numbers, agree with this. One hour from arrival at the terminal is very safe in 2025 in American airports. Maybe add on a few minutes each for lack of PreCheck (more if it’s a big travel day too) and the need to check bags, but realistically no, an hour is still fine even if you are trying to maintain full peace of mind.</p>\n<p>Maybe, as he notes, add another 15 minutes if you’re in an especially slow-to-navigate airport, or if you have kids with you or are otherwise going to move slow.</p>\n<p>If missing the flight is an epic disaster, as in there are no backups and you lose an entire day, then you do want to allocate some extra time, but that extra time is more about guarding against delays in the commute rather than at the airport. Kids similarly should make you leave early because they add variance getting to the airport.</p>\n<blockquote><p>As we all know, the estimated travel times that Uber or Lyft shows you are often optimistic. You’re rarely going to be put in too much of a pickle in, say, Pittsburgh. But New York or Los Angeles is a different story.</p>\n<p>So as a default, I’d round up that commute time by 30 percent if there’s a reasonable likelihood of encountering traffic.</p></blockquote>\n<p>This is the tricky part. You need to know the worst-case scenario for the trip to the airport. This is why I love taking trains to the airport, even when they are on average slower than a taxi. You have a safe upper bound of how long it takes. I agree that adding 30% is mostly safe enough for taxis, largely because the hour once you arrive also has a bunch of buffer in it.</p>\n<p>What about international flights?</p>\n<blockquote><p>To break it down more precisely [for international travel]:</p>\n<ul>\n<li>As a default, even if you think you’re fully checked in, I’d add 20 to 40 minutes to your domestic flight baseline for international travel, depending on your general experience level with flying abroad.</li>\n<li>If you do need to visit the check-in counter, I’d add a further 15 minutes for business class and 30 minutes for coach.</li>\n<li>And if you need to clear immigration before you take off — remember, this is <em>not</em> true for most destinations, but the most common exception is Canada — I’d add another 30 minutes.</li>\n</ul>\n<p>If missing the flight would cause a huge inconvenience — your best friend annoyingly decided to hold a destination wedding in Buenos Aires, you’re the best man and it’s last flight of the day — you might add more time still. But this sort of situation can also apply for domestic flights, so we’ll cover these cases later.</p></blockquote>\n<p>He also emphasizes the need to consider what happens if you miss the flight. Are you out a day? Do you miss an important event? Is there a next flight?</p>\n<p><a href=\"https://www.natesilver.net/p/how-soon-should-you-arrive-at-the-airport\">Nate offers a handy spreadsheet for doing approximate calculations.</a></p>\n<p>The two most underrated considerations are how much you like airports, which Nate Silver does take into account, and peace of mind. If you don’t mind the extra time, why not play it safe? And most of all, if you or someone you are traveling with is easily stressed about missing a flight, why not play it safer to avoid the stress? When I travel with anyone in the family, I’d much rather be a lot too early than have to cut it close even if I know I’m never actually going to miss the flight.</p>\n<p>If you are aiming for two hours or more at the airport, then either you have something specific you actively want to do there, or you had nothing better to do, there was very large uncertainty about your trip getting there, you took the only available shuttle or ride you had available, or you are almost certainly making a mistake.</p>\n\n\n<h4 class=\"wp-block-heading\">Packing Your Own Bags and Boarding the Plane</h4>\n\n\n<p>It saves you a bunch of money and time and also trouble and worry if you can move from checking bags to not checking bags, or from an overhead bags to only a backpack. Put more value on ‘moving down a tier’ on this than you might think.</p>\n<p>If you have an overhead bag, you have to worry about them forcing you to check it. That means you have to aggressively board the plane, and sometimes that will not be enough, and you have to worry and argue about this. Also they make you pay for it. If you check a bag, there is a substantial delay that can become a considerably longer one, and the probability of your luggage being lost is nontrivial.</p>\n<p>So consider this an excuse and opportunity to travel light.</p>\n\n\n<h4 class=\"wp-block-heading\">All Aboard</h4>\n\n\n<p>If you do not need to fight for overhead bin space and are not in first class, you should consider being one of the last to board the plane. Why do you want more time in that seat instead of staying at the gate?</p>\n\n\n<h4 class=\"wp-block-heading\">What Happens After The Airport</h4>\n\n\n<p><a href=\"https://www.maximum-progress.com/p/is-air-travel-getting-worse\">Maxwell Tabarrok asks whether air travel is getting worse</a>. The conclusion is that typical flights now take longer, but we pad the schedules so much that flights typically arrive ‘early.’ And then we have several times as many delays of three hours or more, although the chances are still recorded as on the order of 1% (I very much press X to doubt based on my track record).</p>\n<p>In exchange, travel has gotten cheaper in real dollars. These days I am consistently happy with the prices I get. Part of this is I am happy to fly basic economy with no checked bags and often not even an overhead bag, so I get beneficial price discrimination, and I’d want to make sure the graphs showing constant prices incorporate average actual net prices paid.</p>\n\n\n<h4 class=\"wp-block-heading\">What To Do In The Air</h4>\n\n\n<p>Unless you have something urgent, focus on comparative advantage.</p>\n<p>You have time away from it all, or when various activities are hard to do. I’ve long had a rule that I don’t seek out internet on the plane. The plane is an excuse to not have internet.</p>\n<p>The mistake is to try to use that time to do the things that are harder to do in the air, or less fun to do, and force them to happen anyway. The other mistake is to fiddle away the time aimlessly.</p>\n<p>The correct play is usually to take advantage of the isolation and lack of distractions. That makes some activities actively great to do. Reading books or listening to music or podcasts if you have good headphones are excellent picks.</p>\n<p>Watching movies is common. The screen is small, but the flight is an excuse to gain the focus that is even more important to watching movies than the big screen. You also have temporary access to movies you might not have otherwise considered, which can be exciting. So contra Tyler Cowen I think this is typically only a small mistake.</p>\n<p>Trying to sleep is of course great if you can pull it off, but be realistic and know thyself.</p>\n<p>What about working on the plane or preparing for when you arrive?</p>\n<p>To the extent that this is necessary to get you into the right mindset, to review information you will need, or it was impossible to do earlier? Sure, go ahead. But to the extent you can take care of it ahead of time, you want to do that.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/08/15/spending-too-much-time-at-airports/",
            "publishedAt": "2025-08-15",
            "source": "TheZvi",
            "summary": "In honor of Nate Silver’s analysis of when to leave for the airport, and because it’s been an intense week, I thought I’d offer my thoughts on various related questions. Buying The Ticket As far as I can tell, the &#8230; <a href=\"https://thezvi.wordpress.com/2025/08/15/spending-too-much-time-at-airports/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Spending Too Much Time At Airports"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3129/",
            "publishedAt": "2025-08-15",
            "source": "XKCD",
            "summary": "<img alt=\"The academic archaeology establishment is suppressing my breakthroughs because of the disruption it would bring to their prepared-core flake-based toolmaking industry.\" src=\"https://imgs.xkcd.com/comics/archaeology_research.png\" title=\"The academic archaeology establishment is suppressing my breakthroughs because of the disruption it would bring to their prepared-core flake-based toolmaking industry.\" />",
            "title": "Archaeology Research"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-08-15"
}