{
    "articles": [
        {
            "content": [
                "<p>The screen on my phone is about half the size of a credit card. I bought it to overcome my smartphone addiction, but discovered something far more interesting: People are utterly fascinated by it. So much so that there’s nothing about me or anything I’ve ever done that has gotten as much attention as my phone.</p> <figure>  <source class=\"responsive-img-srcset\" /> <img class=\"img-fluid rounded z-depth-1\" height=\"auto\" src=\"https://lukaspetersson.github.io/assets/img/jelly-star.png\" width=\"60%\" />  </figure> <p>I used to be addicted to my smartphone, and it made me a worse person. My work was less focused and productive. I lost creative ideas because my phone stole those precious moments of boredom. And I was a worse friend - every time I reached for my phone, I signaled to the people around me that they weren’t the most important thing at that moment.</p> <p>For many years, I tried to find a solution. First, I tried app blockers. That often worked for a few months, but eventually I always found a reason to turn them off (temporarily, I lied to myself). After realizing that app blockers would not do it, I bought a dumb phone. However, that did not last long either. Today’s society expects you to have a smartphone for basic tasks like transportation, meeting friends, banking and navigation. Once, I could not find a friend at the agreed location, and I could not contact them without WhatsApp. I also tried to wear a smart-watch without a phone for a while, but this was also too limiting.</p> <p>For a while, I gave up on my quest for a solution. Until I met Esben, who carried a small phone (Jelly Star). Still a smartphone (Android), but very, very small. I immediately bought one and it has had the desired effect. The screen is so small that you don’t really want to use it. I’m, of course, very happy about this, but there’s another effect that unexpectedly has been even bigger - it is the best conversation starter ever.</p> <p>It is impossible to convey how much interest I get from people around me when I pull out my phone. In my post-big-phone life, I have small conversations daily with strangers at all places where I have to show my phone. Whether I’m scanning my boarding pass at the airport, paying at the supermarket checkout, showing tickets at the movie theater, checking in at the doctor’s office, or mingling at networking events; every single time the phone comes out, a conversation begins. The funniest encounter was at the post office where the guy at the counter asked if he could hold the phone, then went to the back office with it to show all his colleagues. 10 minutes later he came back with it.</p> <p>It is safe to say that nothing about me has ever interested so many people as my phone does.</p> <p>I don’t think a single person has seen my phone without making a comment about it. The conversation always, always goes like this: Them: “What is that?” Me: “My phone. Yes, I know, it is small.” Them: “Why?” Me: “Because it is so bad that I don’t get addicted to it.” After this, they always stand frozen for a while with their jaw on the floor and a smile signaling reluctant admiration. I find that reaction very interesting. Let me tell you a fictional story to convey this reaction. Imagine two finance bros who compete to be the best during college, but lose contact after graduation. Twenty years later, they meet again. One is now a successful banker (who rarely sees his kids). He learns that the other, his previous rival, moved to Bali and worked in a surf shop. He stands frozen for a while with his jaw on the floor and a smile signaling reluctant admiration. Admiration because he realizes that’s the better path, but reluctant because he does not want to admit that to himself.</p> <p>Similarly, people who see my phone know that their smartphone is not good for them, but they don’t want to admit it because they don’t want to give up the drug they are addicted to.</p> <p>Most people stick to their drug, but some are seriously intrigued, so here is a short review of the phone for these people:</p> <ul> <li>Typing is ok. Short messages, quick notes and search queries are no problem, but I always go to my laptop to write longer messages.</li> <li>Two-finger zooming on maps is hard with such a small screen.</li> <li>I use a third-party minimalist homescreen launcher. This makes the phone very laggy at times (I never had this problem with my previous Android phones).</li> <li>Battery is ok. Worse than an iPhone, but you use the phone less so it is not an issue.</li> <li>The camera is bad. I still take pictures to capture memories, but never with the expectation to get a beautiful picture.</li> <li>It’s cheap (~$200).</li> <li>Precise localization in Google Maps is bad.</li> <li>Music listening is no problem. You can download Spotify and Bluetooth works. Even a headphone jack!</li> <li>There’s a fingerprint sensor, but it is very bad. But remember, it is still a smartphone, so all apps on the Play Store work. This is a double edged sword - some willpower is still needed. It was named one of the top 100 best inventions of 2025 by Times Magazine, but I don’t really know why.</li> </ul> <p>My life is much better without what today’s smartphones can offer. And since there is very little innovation here, with the yearly upgrades getting smaller and smaller, I don’t think I will ever use a normal smartphone again. Maybe some new type of device that replaces what we use the phone for today could do it, but until then, I’m happy with my Jelly Star.</p> <p>Follow me on <a href=\"https://x.com/lukaspet\">X</a> or subscribe via <a href=\"https://lukaspetersson.com/feed.xml\">RSS</a> or <a href=\"https://lukaspet.substack.com/\">Substack</a> to stay updated.</p> <p>Thanks to Sebbi Fodor, August Ereus and Esben Kran for feedback &lt;3</p>"
            ],
            "link": "https://lukaspetersson.github.io/blog/2025/jelly-star/",
            "publishedAt": "2025-11-19",
            "source": "Lukas Petersson",
            "summary": "The screen on my phone is about half the size of a credit card. I bought it to overcome my smartphone addiction, but discovered something far more interesting.",
            "title": "I wish I were as interesting as my phone"
        },
        {
            "content": [],
            "link": "https://interconnected.org/home/2025/11/19/inanimate",
            "publishedAt": "2025-11-19",
            "source": "Matt Webb",
            "summary": "<div> <p>I’m spinning up something new with a buddy and you can guess what it is by what I’ve been writing about recently.</p> <p>Big picture, there are two visions for the future of computing: <a href=\"https://interconnected.org/home/2025/10/13/dichotomy\">cyborgs and rooms</a>. I’m Team Augmented Environments. Mainly because so much of what I care about happens in small groups in physical space: family time, team collaboration, all the rest.</p> <p>Then what happens when we’re together with AI in these environments? <a href=\"https://interconnected.org/home/2025/08/29/dwim\">Interfaces will be intent-first</a> so what’s the room-scale OS for all of this? What are the products you find there?</p> <p>And where do you start?</p> <p>Anyway we’ve been designing and coding and planning.</p> <p>“We” is me and <a href=\"https://x.com/danielfogg\">Daniel Fogg</a>. We’ve known each other for ages, both done hardware, and he’s been scaling and running Big Things the last few years.</p> <p>We’re at the point where it’s more straightforward than not to give this thing a name and a landing page…</p> <p>Yes early days but we need a logo for renders, software protos and the raise deck haha</p> <p>(Drop me a note if you’d like to chat.)</p> <p>So say hello to <strong>Inanimate</strong> and <a href=\"https://inanimate.tech\">you can find us over here</a>.</p> <hr /> <p><small>Auto-detected",
            "title": "Spinning up a new thing: Inanimate"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/11/19/podcasts/money-relationship-conversations-tips.html",
            "publishedAt": "2025-11-19",
            "source": "Modern Love - NYT",
            "summary": "Ramit Sethi, a personal finance author and coach, offers four lessons to help you stop arguing about money in your relationship and start living a “rich life” together.",
            "title": "How to Talk About Money in Your Relationship, According to a Personal Finance Coach"
        },
        {
            "content": [
                "<p><strong>Dream a Bit.</strong> Nothing innovative was created by committee. You have to stumble on that odd idea at 3:15a and recognize that you&#8217;ve never seen it before. Maybe no one has seen it. Let it bump around your head a bit. Stare at it from a couple of different angles. Do whatever you do to let it stew, but pitch Jason at some point. Pitch him because he&#8217;s just as crazy as you, and he won&#8217;t shut it down because he knows what you know: innovation is a fight. He&#8217;ll raise an eyebrow when you make no sense, but he&#8217;ll still ask insightful questions. Keep talking with him. Soon, he&#8217;ll believe more than you.</p>\n<p><strong>Ask for Help.</strong> Nothing innovative was created by a committee, but it does require a team. You can see the blast radius of your idea, but you need Laura because scale requires not just a team, but an understandable process to drive that team. You need help. Maybe it isn&#8217;t Laura, but it is most certainly someone who is definitely not you. In fact, the more they aren&#8217;t you, the better. The more their vision and values differ from yours, the higher the chance of success.</p>\n<p><strong>Set Clear Expectations.</strong> Nothing innovative was created without the team understanding the vision. Explain the vision; it&#8217;s better if it starts as a smaller, palatable, tractable idea. Walk through the pitch and the draft of the strategy. Ask Terrance. His tolerance for ambiguity is zero, and he will explain why we can&#8217;t set reasonable expectations with this pitch. Someone once said, &#8220;Feedback is a gift,&#8221; and they were right. By clearly setting measurable and objective expectations, we can start. The act of starting is more important than the vision being perfect.</p>\n<p><strong>Do Your Best to Exceed Expectations.</strong> Nothing compelling was created by a team meeting expectations. Once you&#8217;ve begun, you&#8217;ll see progress, but key decision points will show up, and you&#8217;ll need to decide: Do more? Do less? Cut our losses? Admit defeat? Ask Stewart. He is unencumbered by the constraints of reality. Stewart understands that the art of creation involves:</p>\n<ol>\n<li><strong>Being an expert on the situation in front of us.</strong> Do you know what experts sound like? They sound like they fucking know what they are talking about. Experts make the fakers sound like they just read the latest summarization of ChatGPT: vapid, empty, obvious, and sloppy data.</li>\n<li><strong>Ignoring the constraints of time and resources.</strong> Do you want to know how to piss off just about everyone? Ignore objective reality. Ignore the structure that gives everyone purpose. The question is: are you trying to build something new or not?</li>\n<li><strong>Diving into the problem with expert opinions and a plan that most folks don&#8217;t believe</strong>. Your degree of discomfort with this plan tells me everything I need to know, not just about its viability, but its potential impact.</li>\n</ol>\n<p><strong>Do the Work.</strong> Nothing compelling was ever built without many days of drama-free productivity. Ask anyone on the team. We do our best work when we can focus. The Drama People<img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /> trade in drama, and sometimes we need them to highlight and address brokenness, but if the The Drama People<img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /> are running the show, we&#8217;re not working, we&#8217;re worrying. You&#8217;re going to need Sarah — she has zero tolerance for drama. She&#8217;ll stare drama straight in the eye until it realizes its pointlessness.</p>\n<p><strong>Shit Happens. Deal with It.</strong> Nothing compelling was built by a team of talented people who didn&#8217;t deal with the shit. Yeah, I wrote shit. It&#8217;s a swear word. If this word makes you uncomfortable, I have more bad news. So much more than bad shit is going to stand between you and building the next thing. Ask Maria, she&#8217;ll tell you. She&#8217;s seen the shit and she knows better than most that bullshit kills culture, it promises unachievable insanity, and it is incapable of delivering the impossible.</p>\n<p>Deal with it. No one believes you can do it; most everyone only believe what they have already seen, and if what you were trying to build was obvious, it would&#8217;ve already been done. The obstacles, the shit, are the clearest sign you are onto something. Repeat the loop. Ask for help, reset expectations, exceed those reset expectations, and prepare for more shit. It&#8217;s coming.</p>\n<p><strong>Admit You Are Wrong.</strong> Nothing compelling was created by people who didn&#8217;t fuck up. See, well, you actually screwed up. That was a bad decision, and it took us down an expensive and inefficient path to a dead end. You know how I know? Eliza told me, and, more importantly, I listened. Listen to the people you trust. You&#8217;ve been selling well-intentioned ego-based inspiration for a while now, and if you don&#8217;t listen to smart humans who tell you the truth, you will achieve an impressive nothing or, worse, a mediocre something.</p>\n<p><strong>Fearlessly Alter the Plan.</strong> Nothing compelling was created by people who didn&#8217;t change everything. It&#8217;s not just a bad idea and a dead end;  it&#8217;s a deeply flawed strategy that can not succeed. This will feel like failure until you talk to Erik. He has no skin in the game, he speaks the truth, and, most importantly, he knows how to speak to you. This combination of attributes dispels the sense of failure and allows you to move forward. He&#8217;s not going to fix it; that&#8217;s your job.</p>\n<p>So.</p>\n<p><strong>Dream a Bit.</strong>  Nothing innovative was created by not trying again. Ask Jason again. He has time.</p>"
            ],
            "link": "https://randsinrepose.com/archives/the-loop/",
            "publishedAt": "2025-11-19",
            "source": "Rands in Repose",
            "summary": "Dream a Bit. Nothing innovative was created by committee. You have to stumble on that odd idea at 3:15a and recognize that you&#8217;ve never seen it before. Maybe no one has seen it. Let it bump around your head a bit. Stare at it from a couple of different angles. Do whatever you do to&#8230; <a class=\"excerpt-more\" href=\"https://randsinrepose.com/archives/the-loop/\">more</a>",
            "title": "The Loop"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Nov/19/how-i-automate-my-substack-newsletter/#atom-entries",
            "publishedAt": "2025-11-19",
            "source": "Simon Willison",
            "summary": "<p>I sent out <a href=\"https://simonw.substack.com/p/trying-out-gemini-3-pro-with-audio\">my weekly-ish Substack newsletter</a> this morning and took the opportunity to record <a href=\"https://www.youtube.com/watch?v=BoPZltKDM-s\">a YouTube video</a> demonstrating my process and describing the different components that make it work. There's a <em>lot</em> of digital duct tape involved, taking the content from Django+Heroku+PostgreSQL to GitHub Actions to SQLite+Datasette+Fly.io to JavaScript+Observable and finally to Substack.</p> <p> </p> <p>The core process is the same as I described <a href=\"https://simonwillison.net/2023/Apr/4/substack-observable/\">back in 2023</a>. I have an Observable notebook called <a href=\"https://observablehq.com/@simonw/blog-to-newsletter\">blog-to-newsletter</a> which fetches content from my blog's database, filters out anything that has been in the newsletter before, formats what's left as HTML and offers a big \"Copy rich text newsletter to clipboard\" button.</p> <p><img alt=\"Screenshot of the interface. An item in a list says 9080: Trying out Gemini 3 Pro with audio transcription and a new pelican benchmark. A huge button reads Copy rich text newsletter to clipboard - below is a smaller button that says Copy just the links/quotes/TILs. A Last X days slider is set to 2. There are checkboxes for SKip content sent in prior newsletters and only include post content prior to the cutoff comment.\" src=\"https://static.simonwillison.net/static/2025/copy-to-newsletter.jpg\" /></p> <p>I click that button, paste the result into the Substack",
            "title": "How I automate my Substack newsletter with content from my blog"
        },
        {
            "content": [
                "<p>Happy Gemini Week to those who celebrate. Coverage of the new release will begin on Friday. Meanwhile, here’s this month’s things that don’t go anywhere else.</p>\n<h4>Good News, Everyone</h4>\n<p><a href=\"https://x.com/cremieuxrecueil/status/1986505517943169509\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Google has partnered with Polymarket</a> to include Polymarket odds into Google Search and Google Finance. This is fantastic and suggests we should expand the number of related markets on Polymarket.</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/10/prediction-markets-are-very-accurate.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=prediction-markets-are-very-accurate\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">In many ways Polymarket prediction markets are remarkably accurate</a>, but here what <a href=\"https://dune.com/alexmccullough/polymarket-brier-score\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">we have is a Brier Score</a> without a baseline of what we should expect as a baseline. You need to compare your Brier Score to scores on exactly the same events, or it doesn’t mean much. There’s a lot to be made on Polymarket if you pay attention.</p>\n<p><span id=\"more-24869\"></span></p>\n<p><a href=\"https://www.21civ.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A proposed ‘21st Century Civilization Curriculum’ for discussion groups</a>. There’s an interestingly high number of book reviews involved as opposed to the actual books. I get one post in at the end, which turns out to be <a href=\"https://thezvi.wordpress.com/2019/05/30/quotes-from-moral-mazes/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Quotes From Moral Mazes</a>, so I’m not sure it counts but the curation is hopefully doing important work there.</p>\n<p><a href=\"https://x.com/PolitlcsUK/status/1988871990304772588\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Wylfa in North Wales will host the UK’s first small modular nuclear reactors</a>, government to invest 2.5 billion.</p>\n<p><a href=\"https://x.com/JsonBasedman/status/1983324418005971401\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Fusion reactors might pay for themselves by turning Mercury into Gold</a>? Beware diminishing marginal returns. Manifold has this at 28% by 2035.</p>\n<p><a href=\"https://www.astralcodexten.com/p/model-city-monday-102725\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Scott Alexander’s latest roundup on charter cities</a>.</p>\n<h4>Good Advice</h4>\n<p><a href=\"https://x.com/hosseeb/status/1987988765202391155\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">This month’s version of standard solid advice</a> for men in their 20s.</p>\n<blockquote><p>Usopp: 12 advice that came up the most in the replies/qt so far:</p>\n<p>&#8211; Find your partner, get married and have kids</p>\n<p>&#8211; Take way more risks</p>\n<p>&#8211; Build a strong circle of quality friends, cut off toxic ppl</p>\n<p>&#8211; Read a lot a lot of books</p>\n<p>&#8211; Travel more, move elsewhere</p>\n<p>&#8211; Exercise daily, stay and keep fit</p>\n<p>&#8211; Stay away from junk food &#8211; always prioritise health</p>\n<p>&#8211; Quit porn, quit smoking, quit alcohol</p>\n<p>&#8211; Be humble, lose the ego but don’t lose the confidence.</p>\n<p>&#8211; Protect your mental health</p>\n<p>&#8211; Don’t neglect family, always call your parents</p></blockquote>\n<p>Nothing Earth shattering or surprising there, I hope, but yeah, that’s the go-tos.</p>\n<p>Risks here means taking ‘real’ risks in life, not taking financial risks or gambling.</p>\n<h4>Where’s The Party?</h4>\n<p><a href=\"https://x.com/wangzjeff/status/1983914310738047291\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Jeffrey Wang is the latest to offer advice on how to throw parties</a>, with an emphasis on sound, he says you need music and at least one both loud and quiet zone, and also he’s a fan of the drinking.</p>\n<p>I sense I don’t get invited to his sort of parties, and that’s probably for the best.</p>\n<h4>Antisocial Media</h4>\n<p><a href=\"https://www.theargumentmag.com/p/i-could-watch-tiktok-for-10-hours\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A report from Jerusalem Demas about what it is like</a> to know you could end up watching TikTok for 10 hours a day.</p>\n<p><a href=\"https://x.com/nikitabier/status/1978132382868988310\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Twitter will experiment with telling us</a> what nation accounts are posting from, what date they joined and when they last changed their username. They say there will be privacy toggles, but of course then everyone knows you have something to hide, and they’ll highlight that you did it. I’m mostly in support of this, as it should help control various bot and astroturfing problems. I think that’s worth the cost.</p>\n<p><a href=\"https://x.com/nikitabier/status/1979994223224209709\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">The plan to avoid penalizing Twitter links</a> is that when you click on a link in the iOS app it will keep the post itself accessible on the bottom of the screen so that you can easily like, repost or respond to the original post while you read. I guess this is a marginal improvement?</p>\n<p>Alternatively, you could do these things more often with tweets that have links or longer articles, especially the likes and retweets.</p>\n<p>The unfortunate natural pattern is that if you provide a witty comment, the barrier to liking it is low. Whereas if you provide actual value in the form of a link or Twitter article, or you read something on Substack, the threshold for liking it is ‘I actually read the damn thing and not only liked it but didn’t have any issues with anything in it, and also remembered to like it afterwards’ which makes it highly unlikely.</p>\n<p>Therefore, I’m going to make a request: If you think the world would be better off if more people read the link or article on Twitter, then like the post with the link or article. If not, not. Thank you for your attention to this matter.</p>\n<p><a href=\"https://www.slowboring.com/p/more-streaming-video-is-bad\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">The bulk of ‘social media’ is now actually short form television</a> that uses an algorithm. This, as Matthew Yglesias notes, is bad. Short form algorithmic video is bad news. Social media as originally intended, where you are social and consume various media from people you are social with, is a mixed bag, but the new thing is terrible. Regular television has big downsides, but also advantages. This seems obviously much worse, and I’ve said it before but it bears repeating.</p>\n<p><a href=\"https://x.com/tszzl/status/1981549585656066118\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Xi views TikTok as ‘spiritual opium’ rather than something important</a>, is totally fine with that, and is allowing the TikTok sale as a bargaining chip.</p>\n<p>What happens if you start a fresh Twitter account using a VPN and the For You page? <a href=\"https://x.com/BumrahBachi/status/1987565617483051126\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Soren Kierkegaard found (pre-election) a 4:1 ratio of right to left wing tweets</a>. Nicholas Decker made a new alt and so got a look at the new account algorithm, <a href=\"https://x.com/captgouda24/status/1987394312410218976\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">reports nothing but the most obnoxious conservative propaganda imaginable</a>.</p>\n<p>This is not good business on the part of Elon Musk. Even if your goal is only to advance conservative causes, you need to draw new users in. This doesn’t do that.</p>\n<p><a href=\"https://x.com/aaronp613/status/1986095185189605389\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Twitter’s new in-app link viewer has a few excluded domains, and well, whoops</a>.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"388\" src=\"https://substackcdn.com/image/fetch/$s_!GL3V!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F90f6d7bf-3432-4842-95fb-f170b206cc9f_648x388.png\" title=\"\" width=\"648\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>Substack being on the list is rather obnoxious, although it seems it was then taken out again and an explanation added?</p>\n<blockquote><p><a href=\"https://x.com/aaronp613/status/1986296494576562610\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Aaron</a>: X has released an update for iOS that clarifies why some domains are blacklisted from the new web view</p></blockquote>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"449\" src=\"https://substackcdn.com/image/fetch/$s_!41Ma!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2d261388-6e67-40b9-9415-bda95e412fb6_1199x449.jpeg\" title=\"\" width=\"1199\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<h4>Government Working</h4>\n<p><a href=\"https://x.com/svdate/status/1984447245945540866\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Our government keeps straight up murdering people</a> on the high seas, as in blowing up boats, in many cases without even knowing who is on the boats.</p>\n<p><a href=\"https://www.wsj.com/politics/policy/trump-irs-investigations-left-leaning-groups-democratic-donors-612a095e\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Wall Street Journal claims Trump administration is planning to overhaul the IRS</a> with the explicit goal of weaponizing it to investigate left wing groups. I thought that using the IRS in this way was illegal, but I guess it’s 2025, you can just do things.</p>\n<p><a href=\"https://x.com/unusual_whales/status/1979888007973925285\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">We are rolling back tariffs</a> on “products that cannot be grown, mined or naturally produced in the United States.” Good. I almost always have a policy of praising rather than criticizing people when they stop hitting themselves but man, we did not need to spend the better part of a year figuring that one out.</p>\n<p><a href=\"https://x.com/RandomSprint/status/1988722559278289217\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">While Trump argues that not having tariffs will bankrupt the country</a> Bessent announces a ‘$2,000 tariff stimulus check’ for those making less than $100k. Curious.</p>\n<p>Always be gracious when someone does something good, you don’t necessarily have to ask how we got there, especially since everybody knows:</p>\n<blockquote><p><a href=\"https://x.com/WhiteHouse/status/1990484929533419536\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">White House</a>: Thanks to President Trump’s deal-making, we’re making trade fair again, &amp; winning BIG.</p>\n<p>Coffee, tea, cocoa, spices, bananas, oranges, tomatoes, beef, fertilizers, &amp; more are now exempt from reciprocal tariffs.</p>\n<p>America First policies delivering for American workers &amp; families<img alt=\"🇺🇸\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f1fa-1f1f8.png\" style=\"height: 1em;\" /></p>\n<p><a href=\"https://x.com/ATabarrok/status/1990183452528763180\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Alex Tabarrok</a>: Frank Sinatra? Heck of a guy &#8211; real prince. Saved my life once. We were doing a show at the Sands, and between sets, I took a break in the parking lot. Next thing I know, three guys are working me over real good. Then I hear Frank say, ‘OK, boys, that’s enough.’”</p>\n<p>Shecky Greene</p></blockquote>\n<p>Home and auto insurance rates are rising, <a href=\"https://www.wsj.com/finance/regulation/runaway-insurance-costs-bring-back-talk-of-price-caps-fe4df279?st=pxSveP&amp;reflink=article_copyURL_share\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">so the state governments are governmenting and telling insurers to cap prices</a>. If you have lots of insurance providers and rates keep going up, there’s a reason. If you don’t have lots of insurance providers, there’s a reason for that, too. As California has learned, if you cap insurance prices where they’re unprofitable, insurers pick up and leave. No one seems to be asking about how to lower the real cost of insurance, as in the need for payouts.</p>\n<p><a href=\"https://x.com/ThomasHochman/status/1980098283487052287\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">There is about $1.5 trillion in capex going through federal permitting</a>. Chop chop.</p>\n<p><a href=\"https://x.com/Noahpinion/status/1988500003350819186\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Trump explicitly says on Fox News</a> we don’t have enough talent, we have to bring in talent, in reference to H1-Bs, and also reveals he had nothing to do with the raid on the South Korean battery factory and was wisely upset when it happened. It’s good that he understands the principle but we still observe what the White House is actually doing, which is not great.</p>\n<p><a href=\"https://x.com/acnewsitics/status/1982459521630146788\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Thanks to Argentina we now know that supporting US allies is America First.</a></p>\n<p><a href=\"https://x.com/MattGlassman312/status/1978620724349698355\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Trump’s mechanism to pay the troops during the shutdown</a> also seems rather blatantly illegal, as in spending money in a way not approved by Congress with no fig leaf on why it is allowed?</p>\n<blockquote><p>Bobby Kogan: The mechanism through which Trump is paying the troops is the most blatant large Antideficiency Act (ADA) violation in US history. It’s also clearly willful. No one has been charged under the ADA before, but violations carry a 2 year jail term. Statute of limitations is 5 years.</p>\n<p>Under the Constitution and under the ADA, it is illegal to spend money without funding for that purpose. The president may not spend money to do something unless there’s actually money to carry it out and that action is expressly allowed.</p>\n<p>… Military pay is appropriated one year at a time, with a one-year period of availability. The fiscal year ended on September 30th, and we did not pass new appropriations bills (the government is shut down), so there’s no money available to pay the troops (or to do lots of things).</p>\n<p>… [various technical reasons what they’re doing is very not legal] …</p>\n<p>… And the craziest part is this was needless. Congress would’ve passed a military pay bill with near unanimous support! Congressional Ds have been begging Rs to bring a bill to pay the military to the floor! But Johnson refuses to gavel in because he doesn’t want an Epstein vote.</p>\n<p>So just how bad is this? I got a text from an appropriator friend saying “The Republic has fallen. Pack it in.”</p>\n<p>I think there are five levels of potential badness here. Once you’ve decided to violate the ADA, you’re only bound by self-imposed limitations. But depending on what the White House is self-imposing, this can range from “BAD” to “The Republic has fallen, pack it in.”</p>\n<p>… Taken together w/ impoundments, this’d break everything. The president is claiming the power to not spend money he doesn’t want to and now also to spend money where it’s not allowed. And SCOTUS might say no one has standing to stop him. That would make him an appropriations king.</p></blockquote>\n<p>In this case everyone agrees you pay the troops and the money can be reconciled (if it hasn’t been already) so the de facto fig leaf is ‘it is common knowledge this would have been approved’ but that’s not a norm you can rely on in this spot, the violations of principles here are rather egregious, and once you do it once what stops it happening again? What stops them from spending any and all public funds on whatever the hell they feel like?</p>\n<p>In general, we follow a pattern of:</p>\n<ol>\n<li>A rule is broken that, if fully and properly exploited, would mean the Republic has fallen, and it’s time to pack it in.</li>\n<li>Things get a little bit worse but the thing is not exploited maximally.</li>\n<li>The Republic does not fall and we do not pack it in.</li>\n</ol>\n<p>So we can do things like have unidentified masked people kidnapping citizens off the street and acting like this is fine, we can sink boats in international waters without trial or a declaration of war, have relatives of the president make a billion in crypto, have the Department of Justice selectively prosecute personal enemies on direct presidential orders,<a href=\"https://x.com/JHWeissmann/status/1982203712287265191\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> impose punitive tarriffs on one of our most reliable, friendly and important trading partners</a> because of dislike of an advertisement, pardon or <a href=\"https://x.com/jamiedupree/status/1979310672916943220\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">give clemency to ten Republican congressmen convicted of corruption style crimes including actual George Santos</a>, weaponize the IRS to go after opposition groups, actively work to destroy vaccinations and PEPFAR and for some reason tylenol, <a href=\"https://x.com/CGasparino/status/1981496719863955913\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">warn major media companies to sell to the correct bidder</a> or else they won’t approve the deal, outright demand $230 million from the treasury for his personal account right in the open, and so on and so on, and yet things are mostly normal.</p>\n<p>For now. It doesn’t seem great that we keep playing that game.</p>\n<p><a href=\"https://x.com/ericadyork/status/1978614147106406872\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Trump administration will be setting price floors</a> across a range of industries to combat market manipulation by China. Price floors have a long history of causing markets to not clear and reducing supply, see minimum wages, and certainly they do not help you lower prices, but in this case I actually think this is a reasonable response? You have a rival strategically flooding your market as part of a strategy to drive you out of business. The worry is it is highly prone to abuse, or to becoming permanent, but if implemented wisely, it does seem like the right tool.</p>\n<p><a href=\"https://x.com/SpeakSamuel/status/1982845674614866048\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Not to harp on the H1-B visa thing but here’s another</a> ‘the wage levels principle is completely absurd’ illustrative post. We’re prioritizing the most experienced people working in the lowest paid professions. If that sounds crazy, it’s probably because it is, especially since the correct answer (‘those who make the most money’) is right there. We’re also keeping it a weighted lottery instead of a sorting algorithm. What you actually want is certainty, so people know if they’re getting in or not.</p>\n<p><a href=\"https://x.com/patio11/status/1982255444782358807\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Patrick McKenzie explains that Germany’s shutting down of its nuclear plants</a> in favor of coal plants, under pressure from the so-called ‘greens,’ is an illustration of a fatal flaw in coalitional parliamentary politics.</p>\n<blockquote><p>Patrick McKenzie: I think it’s important, in the cases where people do things for wildly irrational reasons, to carefully listen to their explanation, both for understanding their worldview and for recording mistakes for future versions of the game.</p>\n<p>One of the takeaways here is “A bad news cycle and a system which allows coalition management primacy over decision making will allow a generally effective technocratic government to, with eyes wide open, pick policies which are obviously foreseeable catastrophes.”</p>\n<p>And when you ask, years later, “What possessed you to do that?”, the people who did it will say they were boxed in, that their coalition partners invested all their points in X, and when then happens during a bad news cycle well you just have to roll with it.</p></blockquote>\n<p><a href=\"https://x.com/arpitrage/status/1984046022839218586\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Germany continues to attempt</a> to stop Uber from existing because they don’t direct rides through the central offices of a car rental company, which means they would be unfair competition. Expectation is that this won’t actually work, but still, wow.</p>\n<p><a href=\"https://x.com/ATabarrok/status/1987226651298566587\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">There are calls to privatize air traffic control</a>, because air traffic controllers are impacted by government shutdowns. I suppose if you’re locked into shutdowns and into the shutdowns impacting air traffic controllers this could end up working out. But rather obviously this is completely crazy? That you need something to reliably happen and not shut down so you need to privatize it?</p>\n<p>The obviously correct thing is to exempt air traffic controllers from shutdowns. This seems super doable? You can pass a bill that automatically funds the FAA indefinitely from a trust fund. It’s what we do for USPS. It’s not like anyone want the FAA to shut down.</p>\n<p>Instead, we have widespread flight cancellations and people <a href=\"https://x.com/mattparlmer/status/1985817482536550719\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">considering planning road trips.</a></p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/creative-stagnation.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">We are going to require cars and trucks,</a> including electric vehicles, to include AM radios? What? In 2025, when we didn’t do this before? Some in the comments argue that AM radio is indeed important because the 0.1% of the time you need it you really need it, and I can buy that there might even be a market failure here, but the very obvious response is that this bill would have made ten times more sense in 1995 or 1975, and we didn’t have it then, so why now? Also, if this is important it’s like $25 to buy an AM radio and stick it in the glove compartment for when you need one.</p>\n<p>In case it wasn’t obvious, <a href=\"https://x.com/patio11/status/1988754058018959457\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">the United States government pays below market for everything policy related</a>, the jobs have super long hours and aren’t especially stable, and require you to go to Washington, DC, so only those who are already rich or heavily ideologically motivated tend to take them.</p>\n<h4>Jones Act Watch</h4>\n<p><a href=\"https://x.com/CatoInstitute/status/1980301303268933916\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Rep. Ed Case (D-HI) points out that we have the Jones Act</a> and ‘despite this’ our shipbuilding, repair capacity and such are all withering away to nothing, so arguing that the Jones Act protects national security makes no sense. I agree with him, except that instead of ‘despite’ he should be saying ‘because of,’ the Jones Act actively makes these problems worse.</p>\n<p><a href=\"https://www.cato.org/events/assessing-jones-act-perspectives-noncontiguous-states-territories\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">This is from a full event</a>, Assessing the Jones Act: Perspectives from the Noncontiguous States and Territories. Everyone is harmed except the rent seekers, but the noncontiguous areas are hurt quite a lot more than the rest of us.</p>\n<h4>Variously Effective Altruism</h4>\n<p><a href=\"https://x.com/albrgr/status/1990799001416012237\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Open Philanthropy is now Coefficient Giving</a>, <a href=\"https://coefficientgiving.org/research/open-philanthropy-is-now-coefficient-giving/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">you will now be able to fund one of</a> several cause area divisions.</p>\n<blockquote><p><a href=\"https://t.co/K3OFFwaVI7\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Alexander Berger:</a> Our ambition has always been to work with more donors once we had enough bandwidth to support Good Ventures.</p>\n<p>We started in earnest in 2024, directing over $100m from other donors. We more than doubled that so far in 2025. We’re aiming for a lot more in years to come.</p>\n<p>Our new name reflects various aspects of this new chapter:</p>\n<p>“Co” -&gt; collaborating with other donors</p>\n<p>“Efficient” -&gt; a nod to cost-effectiveness</p>\n<p>“Coefficient” -&gt; multiplying others’ impact, ROI</p>\n<p>(And “giving” is much less of a mouthful than “philanthropy”)</p></blockquote>\n<p>Big success, a long time coming:</p>\n<blockquote><p><a href=\"https://x.com/DrSamuelBHume/status/1988910456182821308\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Samuel Hume:</a> Novartis’ new malaria treatment <a href=\"https://www.novartis.com/news/media-releases/novartis-phase-iii-trial-next-generation-malaria-treatment-klu156-ganlum-meets-primary-endpoint-potential-combat-antimalarial-resistance\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">cured 97.4% of patients – more than the current best treatment</a>.</p>\n<p>It kills resistant parasites, too, and probably blocks transmission better than current drugs</p>\n<p>Approval is expected next year!</p>\n<p>Roon: malaria of course has killed billions of people through human history and just like that another foe is ~vanquished</p>\n<p>Scottt Alexander: &gt; Go to the drug’s Wikipedia article<br />\n&gt; “This drug [was] developed with support from the Bill and Melinda Gates foundation via their Medicine for Malaria Venture.”</p>\n<p>If you mean Effective Altruists (TM), the compound was discovered in 2007, before effective altruism was founded, so we can hardly be blamed for not contributing to it! EA leader Open Philanthropy (founded 2017) has since funded research into other pioneering antimalarials.</p></blockquote>\n<p>From what I have seen, the ‘spreadsheet altruism’ absolutely includes strategies like ‘research new malaria drug’ and otherwise funding science and making similar bets.</p>\n<p>Somehow this got 3 million views…</p>\n<blockquote><p>Gina: You can only pick one option!!!</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"686.3622047244095\" src=\"https://substackcdn.com/image/fetch/$s_!Onv0!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fba60d204-2022-4306-962d-61e96866a09d_889x1344.jpeg\" title=\"\" width=\"454\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>The funny answer is the ‘life extension’ or ‘defense against existential risk’ move if you interpret the $700k as definitely living to 65.</p>\n<p>But if you take it as intended, that you if you die early you still die in real life, then I really hope one would take $1.1 million here? Putting the amount this high is bizarre.</p>\n<p>A remarkably large number of people went for the $900k, without even stopping to think that there was no assurance you would even get away with it. Well, that’s engagement farming, I guess.</p>\n<h4>Great Taste, Less Filling</h4>\n<p>This seems like a good note. I think the actual limiting factor here is mostly time.</p>\n<blockquote><p>Will Manidis: with the exception of museum quality/rareness, antique prices have fallen off a cliff over the past 10 years. you can decorate your home like a 18th century royal with pieces unthinkable 99% of humans across history, but instead you live amongst minimalist ikea slop</p>\n<p><a href=\"https://x.com/david_perell/status/1982851789150933024\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">David Perell:</a> I’ve been interviewing people who have beautiful homes about how they decorated them, and the biggest surprise is how they almost all insist that good design is more about taste than money.</p>\n<p>Yes, it costs more to buy a great sofa than a bad one. But there are plenty of millionaires living in homes that feel like an airport lounge.</p>\n<p>The actual limiting factor is taste and time. The taste to know what looks good and the time it takes to find what you’re looking for. What’s key is that the second-hand furniture market is quite inefficient.</p>\n<p>To be sure, there is a spectrum: at one end, you have thrift stores (cheap, chaotic, and unvetted). At the other, you have Sotheby’s (curated, clean, and highly vetted). The sweet spot is somewhere in the middle.</p>\n<p>So how do you find pockets of glorious inefficiency?</p>\n<p>One way is to make friends with people who own antique shops. I have a friend in San Francisco who knows a few collectors in town. They know her taste, and when something comes in that matches her style, they call her. And because of this, she never has to wait 17 weeks for a backordered couch from CB2.</p>\n<p>Here’s the key point: If you have a strong sense of taste and understand the game, you’ll consistently spend less to design a house that feels alive and uniquely yours.</p>\n<p>Good design, it turns out, is a byproduct of taste and attention, not money.</p>\n<p><a href=\"https://x.com/Spyzguyz/status/1982870723061297208\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Matthew Speiser</a>: In NYC and the Hudson Valley there are numerous vintage and antique furniture stores selling great stuff at reasonable prices. Far from chaotic and unvetted.</p>\n<p>And “taste” isn’t about “efficiency.” It takes a lot of time browsing pieces and observing decor you enjoy to develop your taste.</p>\n<p>In NYC: Dobbins Street Vintage, Dream Fishing Tackle, Lichen, tihngs, Humble House, Shop 86, Sterling Place</p>\n<p>In HV: Newburgh Vintage Emporium (2 locations), The Antique Warehouse, Magic Hill Mercantile, Hyde Park Antiques Center + lots of small shops in Hudson, Kingston, Saugerties, etc.</p></blockquote>\n<p>If you try to buy antiques or otherwise develop taste you need to worry about matching and you need to get buy-in from others, and it all takes time, alas. Getting consensus is tough. Also once you decorate the first time, it takes a lot of activation energy to start changing, and to shift to a new equilibrium. So I get it. But when I look over at our IKEA-style drawers in this room do I wish they were old school? Oh yeah.</p>\n<p>There’s also the functionality of the room, which you have to pay attention to and understand. Know your Christopher Alexander.</p>\n<h4>How You Do Anything</h4>\n<p>(EDIT: This section originally identified this as being by someone else, for reasons that are lost to time.)</p>\n<p><a href=\"https://www.henrikkarlsson.xyz/p/art-gallery\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Henrick Karlsson’s whole OP is full of gold</a>, I want to emphasize <a href=\"https://www.henrikkarlsson.xyz/i/151598106/the-worst-exhibitions-take-the-most-work\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">his third point</a> here:</p>\n<blockquote><p>Henrick Karlsson: I got to run something like an experiment on my capacity to predict which exhibitions would end up great, and which would be a waste of time. It was easy. As soon as someone was slow at answering their email, or complained, or wanted us to be their therapist as they worked through the creative worries, I would tell my boss, “I think we should cancel this.” And my boss—whose strength and weakness is that she thinks the best of people and makes everyone feel held—would say, “Ah, but they are just a bit sloppy with email” “if we just fix this thing it will be fine. . .”</p>\n<p>I was right every time; it ended in pain.</p>\n<p>And this is quite nice actually: it means it doesn’t take some Tyler Cowen-level taste in talent to figure out who will do good work.</p></blockquote>\n<h4>Bad News</h4>\n<p><a href=\"https://www.thecrimson.com/article/2025/10/21/fas-phd-admissions-cuts/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Harvard cuts the majority of its PhD seats across the next two years</a>, citing financial uncertainty about funding and potential endowment taxes. Of what use is Harvard’s giant endowment, if not to keep the lights on in a situation like this? There is nonzero worry about this ‘rewarding’ the cuts in funding, but in this case the people cutting the funding are happy you’re cutting the PhD slots, so I don’t think that argument plays. Some cost cutting makes sense, but this seems crazy.</p>\n<p><a href=\"https://x.com/allTheYud/status/1980100382643958119\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">We’d rather replace a microwave than try to get it repaired</a>. Is that a failure in the handyman market? We actually just relaced our microwave, and in our case clearly it wasn’t, yes you could have tried to repair it but the time cost of even getting it to a repair shop or arranging a visit would already have exceeded the replacement cost. To get the handyman market to clear here, you would need to be able to summon someone as easily as with an Uber, and the total cost per successful repair would need to be kept at roughly $100, so yeah, not going to happen in New York City.</p>\n<p><a href=\"https://x.com/DegenRolf/status/1979195756012785941\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">In a forecasting competition</a>, evaluators failed to find better predictors more persuasive. They did notice the better predictors showed signs of intelligence, rationality and motivation, but this was counteracted by others presenting with higher confidence. This suggests an easy fix if people care to get it right.</p>\n<p>Listed under bad news because I wouldn’t want this playbook to be the right book, Andreesen and Collision discuss Elon Musk’s management style.</p>\n<blockquote><p><a href=\"https://x.com/pnegahdar/status/1981830714279833760\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Bearly AI and Parham</a>:</p>\n<ol>\n<li>Engineer-first organizations and find truth by speaking with those working on the floor (avoid management layers).</li>\n<li>Every week, find the most important bottleneck at a company and parachute in to fix it.</li>\n<li>Keep model of all engineering and business moving parts in his head (obviously, not many can do this).</li>\n<li>Create cult of personality in and outside of the company (continually drive attention, without marketing or PR).</li>\n<li>Pick single most import target metric for business at a time (eg. SpaceX = $ per kilo to orbit)</li>\n<li>Constantly create urgency (which often shortens time horizons for projects).</li>\n<li>Focus on capital efficiency</li>\n</ol>\n</blockquote>\n<p>My theory is this is all very much a package deal if you try do more than about two of them. If you try to do half these things, it won’t work. You have to do most or all of them, or try a different approach, and as noted few people can do #3 and I would also add #4, or #2 in any useful sense. You need to be able to keep all the pieces in place, do the engineering work and also create a widespread cult of personality to justify that you keep f***ing with everyone and everything and making everyone’s lives miserable all the time.</p>\n<p>Looking back on MetaMed in this light, I think we often fell into the ‘do many but not enough of these things and not hardcore and consistently enough’ bucket (not intentionally, I wasn’t modeling on Musk at all), and that’s one high level explanation of why it didn’t work. If I’d been able to go harder in the key missing places, then it plausibly would have worked to the extent the plan was workable at all (or pivoted).</p>\n<h4>The Rage of the Plastic Straw Ban</h4>\n<p>Why do people care so much about bans on plastic straws? Let us count the ways.</p>\n<blockquote><p>Gearoid Reidy: McDonald’s Japan is finally abandoning its unpopular paper straws, replacing them with lids that diners can drink from directly.</p>\n<p><a href=\"https://x.com/no_on_15/status/1982768464793403655\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Sam D’Amico</a>: A nine year old wrote a “study” for a school project and we all ended up drinking glue for over a decade.</p>\n<p><a href=\"https://x.com/no_on_15/status/1982768464793403655\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">no_on_15:</a> I will never understand how people became so distressed over paper straws.</p>\n<p><a href=\"https://x.com/caesararum/status/1982776582453235929\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">caesararum</a>: as “people” lemme count the ways</p>\n<p>&#8211; paper straws are inferior at their main job</p>\n<p>&#8211; they fall apart within minutes of use &#8211; they impart taste to what you’re drinking</p>\n<p>&#8211; there’s evidence they leach more and worse chemicals than plastic</p>\n<p>&#8211; they have a weird texture when you put your mouth on them</p>\n<p>&#8211; the seam and softness and weird pliability _feel_ off</p>\n<p>&#8211; ocean plastics have never been about single use plastics in the west</p>\n<p>&#8211; legislators burned up time, political capital, and credibility advancing these laws</p>\n<p>&#8211; we’re probably going to find out plastic straws use less total GHG anyway</p>\n<p><a href=\"https://x.com/KelseyTuoc/status/1982875758906523723\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Kelsey Piper:</a> One more for your list: My toddler absolutely cannot use a paper straw at all. She bites it a bit, which plastic can handle and which destroys paper immediately.</p>\n<p>Shea Levy (quoting Marcel Dumas): One more: The only answer to “It’s no big deal” is “fine, then let me win.”</p>\n<p>Kelsey Piper: I think part of why the straws are such a flashpoint is because they’re such a pure example of making things worse and then going ‘why do you care so much? get a life’ when people observe that now their lives are worse.</p></blockquote>\n<p>Kelsey is spot on. It’s not that it’s such a huge deal, it’s that every time it happens it is so obvious that your life has been made worse essentially out of spite and stupidity and innumeracy, and every time it rubs this in your face. And then they lie to you, and say the paper straws are fine. They’re not fine, they are worse than nothing. That’s why it fills me with rage, even though I cannot remember the last time I used a straw.</p>\n<h4>Affordability Politics</h4>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/i-worry-about-affordability-politics.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Tyler Cowen worries about ‘affordability politics</a>.’ He’s not against the abstract concept, but the ways people respond to lack of affordability don’t correspond to the good ways to create real affordability. We respond in such spots by restricting supply and subsidizing demand instead of expanding supply, so we find a problem and then go make it worse.</p>\n<p>So yes, I worry about this too. In general, any time people say ‘the market has failed to provide what we want’ you are not going to like the proposed intervention.</p>\n<h4>Monks In The Casino</h4>\n<p>Recommended: <a href=\"https://www.derekthompson.org/p/the-monks-in-the-casino\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Derek Thompson writes about The Monks In The Casino</a>, as in the young men in America who don’t live nominally healthy and ascetic lives in many senses but stay home, isolated, in front of computer monitors, without even feeling lonely, often addicted to things like porn and gambling as the economy looks increasingly like a casino. They take financial risks online, but no risks in physical space. Betting is getting easier while living gets harder.</p>\n<p>I may say more later, for now read the whole thing.</p>\n<h4>Procrastination Is Bad Actually</h4>\n<p><a href=\"https://x.com/zencephalon/status/1981446740780654746\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">People will attempt to justify anything</a>.</p>\n<blockquote><p>Zen: “I procrastinated for days and then it only took 20m when I sat down to do it <img alt=\"😭\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f62d.png\" style=\"height: 1em;\" />”</p>\n<p>Give your system more credit. A few days of subconscious processing to prepare for 20 minutes of execution. Subtract all the self-guilt and reprobation and U’ve got efficient functioning.</p>\n<p>Loopy: I instead let the avoidance process run its course, and then I am resourced to do the task.</p></blockquote>\n<p>Yeah, look, no, that’s usually hogwash and it’s important to know it’s hogwash. Are there times when you actually need more subconscious processing? I mean I guess but mostly that’s the flimsiest of excuses. Do the thing already.</p>\n<h4>Many Successful People Adjust Behaviors More</h4>\n<p><a href=\"https://x.com/robinhanson/status/1982810283195191373\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Do top people vary behaviors more? Where is causation here?</a></p>\n<blockquote><p>Robin Hanson: Top people have more conflicting stories about them as both nice and jerks. Because, I think, their behavior is in fact more context dependent. As that is in fact a more winning social strategy.</p>\n<p>Triangulation: Also: high status attracts both detractors and sycophants.</p></blockquote>\n<p>In most situations for most people, even top people, I believe nice is correct regardless, jerk is a mistake, this pays dividends over time.</p>\n<p>As you get to the top the jerk stories get amplified a lot more. You do have to be willing to be hard nosed in some situations, and there are those who are more willing to consider you a jerk because you’re successful. That doesn’t mean be a jerk, even to someone with no power.</p>\n<p>However, there is a particular strategy based around maximal incentive gradients, and its final form only works at the top. Trump is the avatar of this.</p>\n<p>One minute you’re the best, the next you’re the worst, and then you’re back to the best. So you have maximum reason to be sure you’re the best and not the worst.</p>\n<p>If you’re high enough in relative status and power or usefulness that people still want to deal with you at all, this can be very powerful. If you’re not, it doesn’t work, because no one will want to associate with you at all. So you can only deploy this strategy to the extent, and in the contexts, where people have no choice but to engage.</p>\n<p>In some places there’s an equilibrium that drives such strategies out, and I prefer such spaces. But the top of business and politics reward it.</p>\n<h4>Take The Money And Run</h4>\n<p><a href=\"https://x.com/oscredwin/status/1986977146586177920\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Venezuelan President Maduro did not actually say</a> (to our knowledge) that if the US gives him amnesty, removes his bounty and gives a comfortable exile he’ll leave office. But let’s suppose that he made this offer. Should we take it?</p>\n<blockquote><p>Andrew Rettek: It’s like the trolley problem but instead of one person it’s a bag of money and instead of 5 people it’s an entire country.</p></blockquote>\n<p>In terms of causal decision theory, of the direct consequences, obviously yes. You greatly improve an entire nation in exchange for a tiny bag of money. Great deal.</p>\n<p>Alas, that is not the full deal. The deal also is that future dictators will know they likely have a similar option, even if they are pretty terrible. This goes both ways.</p>\n<p>First the good news:</p>\n<ol>\n<li>If others take similar deals, you can rescue other countries similarly.</li>\n<li>If others know they have this option, they can invest fewer resources in regime stability and buying off loyalty of their chain of command, since failure to maintain power is now often much less bad.</li>\n</ol>\n<p>Then the bad news:</p>\n<ol start=\"3\">\n<li>This makes being a dictator a much, much better deal.</li>\n<li>This encourages them to maintain strong bargaining positions.</li>\n<li>This also gives them more incentive to steal money and squirrel it away.</li>\n</ol>\n<p>We face similar hostage situations all the time at smaller scale. We strike a balance. We do often pay ransoms, negotiate for hostages and so forth. We also have limits. I think in general we are too willing to negotiate, and should more often tell such folks to go to hell and accept that this particular situation will often end poorly as a result.</p>\n<p>On the dictator level it is less clear. In this case I would take the deal, if it came not only with him leaving but with a transition to democracy. Indeed, one could make a conditional deal, where his immunity depends on the transition.</p>\n<h4>Work Harder</h4>\n<p><a href=\"https://x.com/ATabarrok/status/1983591259605221477\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">If the job interview was too easy, perhaps you don’t want the job</a>. Worthwhile interviews are two ways, you want to be sure you will have good colleagues who work hard and the job will challenge you, and that is a fit for your interests. I the interview is too easy, you probably could have aimed higher. The paper here finds that the perceptions from a job interview are indeed informative about the job.</p>\n<p>When I left my interview at Jane Street Capital, I was very excited to work there. When I did my other finance interview? Not so much.</p>\n<h4>Work Smarter</h4>\n<p><a href=\"https://x.com/tszzl/status/1982929076609528177\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">I strongly agree with Roon here</a>, for most (but not all) classes of intellectual tasks. For physical tasks it will probably suck to be you doing it but in terms of productivity you can 996 (work 12 hours a day 6 days a week) all you want.</p>\n<blockquote><p>Roon: most likely you will not get the most out of yourself by 996ing. generally that’s a way to destroy the self. I subscribe to the Ferris bueller’s day off theology that says you’ll probably get the most out of yourself by being maximally uninhibited so the universe sings with you.</p>\n<p>it’s more important to Go To War when dharma is calling, and you will know when it happens, than to 996 as a permanent way of life. for people like elon [musk] and sam [altman] that may be every day but it’s probably not yours.</p></blockquote>\n<h4>Anti-Suicide Chairs</h4>\n<p>They are pitching us… <a href=\"https://chairdeskexpert.com/guide/anti-suicide-chairs/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">anti-suicide chairs?</a> It seems a lot of the argument here is literally ‘the chair doesn’t help you physically kill yourself’ and a bunch of weird claims about things like ‘creating a supportive and inclusive environment and reducing stigma and encouraging dialogue’ and I’m calling full BS on all that.</p>\n<p>Indeed, my guess is the best thing you can do for people in trouble via chairs is to get them actually comfy chairs, so they feel better.</p>\n<h4>The Great American Songbook</h4>\n<blockquote><p><a href=\"https://x.com/wdavidmarx/status/1977162349107900770?s=46\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">David Marx</a>: Rolling Stone <a href=\"https://t.co/EHiNBMD1Y2\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">compiled a “The 250 Greatest Songs of the 21st Century” list</a>, and while the specific inclusions are debatable, it gives a sense of the 21st century canon as it’s forming.</p>\n<p>I noticed a bias towards the early 2000s so I ran the numbers.</p>\n<p>I tallied the number of entries per year, and there’s a steady and linear decline, with a very clear dip in the last half of the Aughts. Then I weighted the entries (so that a #1 was worth much more than a #250), and it tells a similar story, although 2013 shows a resurgence before things collapse again.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"740\" src=\"https://substackcdn.com/image/fetch/$s_!BJI7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa182052f-898c-44f0-b685-8a648e7dd7a6_1198x740.png\" title=\"\" width=\"1198\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>There will always be some anti-recency bias in canon-building, because new things have yet to prove their long-term value, but there’s also a clear bias here towards “long ‘90s” songs like “B.O.B.” and “Get Ur Freak On” and lingering respect for the post-9/11 rock revival.</p>\n<p>The resurgent 2013 winners list doesn’t have a clear narrative (although interested in your ideas): Lorde, Drake, Kacey Musgraves, Haim, DJ Snake feat. Lil Jon, Paramore, Arctic Monkeys, Justin Timberlake, Miley Cyrus, Sky Ferreira, Jason Isbell, Alvvays.</p>\n<p>Also: it’s a real Neptunes / PW shutout. Sure, no “Blurred Lines” but no “Drop It Like It’s Hot” or “Grindin’”?</p>\n<p>Steve Sailer: Rolling Stone subscribers are really, really old.</p></blockquote>\n<p>I don’t know how much of this is anti-recency bias, and how much of this is those involved being super old, but also the idea of having a canon of music songs, that are listened to over decades, seems itself pretty old now, something only old people would care about?</p>\n<p>I also checked some of the list, and it’s remarkable how much there simply isn’t a canon from this century, or at least how easy it is to ignore. If you’d made a similar list from the 20th century, I expect I’d have known most of the songs. When I browsed this list, I was running at maybe 15%, and that’s simply to know them, not like them. To be fair to the list, the ones I did recognize seemed like mostly good picks.</p>\n<p>Tanmay Khale emailed Tyler Cowen to suggest that modern songs <a href=\"https://marginalrevolution.com/marginalrevolution/2025/10/tanmay-khale-on-the-decline-in-iconic-songs-over-time-from-my-email.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=tanmay-khale-on-the-decline-in-iconic-songs-over-time-from-my-email\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">are suffering from unfair regularization of scores</a>, where they are compared to other modern songs or to how much better they are than prior efforts, so they don’t look great. I agree there is some of this going on, our standards to break through are higher, but I think that’s more about the low hanging fruit being picked, you don’t need to be ‘better’ so much as you need to be original, which is increasingly hard. There’s some amount of better necessary to break through into a canon to overcome familiarity barriers, but also people can get really familiar with big hits quickly.</p>\n<p>Music is different from sports here because you don’t only play against simultaneous competition. A song from 2025 and one from 1975 are both on Spotify, you can choose which one to play or prefer.</p>\n<h4>For Your Entertainment</h4>\n<p><a href=\"https://www.nytimes.com/2025/10/14/business/media/netflix-spotify-podcast-deal.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Netflix makes a deal with Spotify </a>to <a href=\"https://stratechery.com/2025/walmart-on-chatgpt-walmart-and-amazon-motivations-spotify-podcasts-on-netflix/?access_token=eyJhbGciOiJSUzI1NiIsImtpZCI6InN0cmF0ZWNoZXJ5LnBhc3Nwb3J0Lm9ubGluZSIsInR5cCI6IkpXVCJ9.eyJhdWQiOiJzdHJhdGVjaGVyeS5wYXNzcG9ydC5vbmxpbmUiLCJhenAiOiJIS0xjUzREd1Nod1AyWURLYmZQV00xIiwiZW50Ijp7InVyaSI6WyJodHRwczovL3N0cmF0ZWNoZXJ5LmNvbS8yMDI1L3dhbG1hcnQtb24tY2hhdGdwdC13YWxtYXJ0LWFuZC1hbWF6b24tbW90aXZhdGlvbnMtc3BvdGlmeS1wb2RjYXN0cy1vbi1uZXRmbGl4LyJdfSwiZXhwIjoxNzYzMjAxMTM4LCJpYXQiOjE3NjA2MDkxMzgsImlzcyI6Imh0dHBzOi8vYXBwLnBhc3Nwb3J0Lm9ubGluZS9vYXV0aCIsInNjb3BlIjoiZmVlZDpyZWFkIGFydGljbGU6cmVhZCBhc3NldDpyZWFkIGNhdGVnb3J5OnJlYWQgZW50aXRsZW1lbnRzIiwic3ViIjoiMDE5NjQwYTctM2NjNS03NzUzLTgzNjgtZmIyODkxMjRjZjEzIiwidXNlIjoiYWNjZXNzIn0.lZomwywGak9j6iTIg0cPpUhJGruoovuyDdJkmnWKPldhCo52biOe30am83F05llYtk5DyJTU-QGRonYeJreQTSI9YtkYLe7TsLv_GefLT8J-PzIpx4oORkofrE91BJeGXBfjJoDuilald1DmBFq3_FaZowuCyga1LhJSIkJ6HyMGahy7vld7Y6aEUwVICoZGixB8_ZiBOpyCkpyNQrRxjXRM0PZUNkp8cAwvGPXUI-WvV09-4P4XOARLN2obSMafpZ6gng2XYFZhH4a3w3OpnmJcEH6Qtz5DXLwBBLeyiim414HUTV-qBrsel4O14N3XOyqQ8CpcwVLzhOczV6Ba6Q\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">get The Ringer’s podcasts and exclude those podcasts</a> from YouTube. I get why they’re doing it, but I don’t love it. Dividing up podcasts the way we’ve divided up television streaming is super annoying.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1980362723956518972\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Free clicks are seldom cheap, but often slop</a>.</p>\n<blockquote><p>Nathan Lazerus: From @mattyglesias today (quotes the classic newsroom finding from the early internet era that what people click on is very different from what they say they want to read):</p>\n<p>I feel like the ad vs. subscription model matters a lot here. People will sign up for a subscription to a news source that fits their high-minded aspirations, while they don’t want to pay for some guilty pleasure/clickbait.</p>\n<p>So journalists of old were maybe not wrong to keep putting out the high-quality reporting they did—it drove subscriptions. But when pay/reach was determined by views, the profit-maximizing type of content changed.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1980362723956518972\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Matthew Yglesias</a>: Yes this is a very important point.</p>\n<p>People tend to subscribe to things based on what kind of content they are *proud* to consume, while they’ll watch any garbage for free.</p>\n<p>So subscription-based models, especially without much bundling, support more high-minded content.</p></blockquote>\n<p>Have a policy for where your inputs come from. Stick to that policy. Your subscription self it better than your free click self.</p>\n<p><a href=\"https://flowingdata.com/2025/10/08/mortality-in-the-news-vs-what-we-usually-die-from/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">What we die of in real life versus media</a>:</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"1058\" src=\"https://substackcdn.com/image/fetch/$s_!ZTb5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe88abcc-68e1-4378-b92f-575b3aa201a4_1536x1116.png\" title=\"\" width=\"1456\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>I mean, yes, ‘person has heart attack and dies’ is not news. I do wish they’d stop being so damn lazy with all the car accidents in fictional media.</p>\n<p><a href=\"https://time.com/7328396/vince-gilligan-interview-pluribus/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Vince Gilligan is still proud of Breaking Bad and Better Call Saul</a> but thinks we have too many antiheroes and it is harmful, which his new show Pluribus seeks to address, by all reports it is cool but I’m waiting for the full season drop. Article is a fun extended profile.</p>\n<h4>The Subscription Package Dance</h4>\n<p><a href=\"https://www.thestar.com.my/tech/tech-news/2025/10/17/apple-tv-peacock-streaming-bundle-to-launch-next-week-at-1499-a-month\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">And so the new cable package era continues to slowly create itself</a>, as AppleTV+ and Peacock offer a combined package for $20/month (or $15 if you’re willing to accept Peacock ads). On their own AppleTV+ is $13/month and Peacock is $10/$15 depending on if you accept ads, so that’s a deep discount. That’s in addition to the $30 HBO/Hulu/Disney+ package, which is also strong. You should have Amazon Prime anyway, so throw in Netflix and YouTube Premium, Paramount+ is optional, and you’re all set unless you watch sports.</p>\n<p>The problem is you’re then very tempted to rotate between packages. The long term equilibrium is presumably one package with all of it, so you aren’t constantly either toggling between services or feeling bad about not doing so. Alternatively, they should up their yearly subscription discount game, which I would also find acceptable.</p>\n<p>Meanwhile there’s a war. Disney owns ESPN and ABC, as well as Hulu and Fubo. Google wants Disney to agree to incorporate their Hulu offerings into the YouTubeTV experience, and Disney is having none of it, and as a result of that (and some amount of pricing argument) we’ve now gone weeks with Disney not available on YouTubeTV.</p>\n<p>This is wreaking havoc on my ability to experience college football in particular, because the only alternative services, ESPN and Hulu, have remarkably awful experiences for anyone trying to view sports that aren’t live, in a ‘seriously considering not to bother’ way.</p>\n<h4>Was Television Better Before?</h4>\n<p><a href=\"https://x.com/karpathy/status/1978653908663726585\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Andrej Karpathy makes the case that the TV watching experience</a> was better in the 1990s.</p>\n<blockquote><p>Andrej Karpathy: TV in the 90s: you turn it on, you watch.</p>\n<p>TV 2025:</p>\n<p>&#8211; turn on, wait for it to load</p>\n<p>&#8211; popup: TV wants to update, 1.5GB. No.</p>\n<p>&#8211; scroll sideways, find prime video app or etc</p>\n<p>&#8211; popup: now app wants to update, 500MB. No!!</p>\n<p>&#8211; App launching&#8230; App loading…</p>\n<p>&#8211; select account screen</p>\n<p>&#8211; <img alt=\"🫠\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1fae0.png\" style=\"height: 1em;\" /></p>\n<p>There is a movement I found on Instagram where people deliberately choose to live in 90s, refusing all technology after 2000. Like an intermediate form of the Amish.</p></blockquote>\n<p>That sometimes (rarely) happens, and yes it’s annoying. There’s substantial startup costs. But have you tried watching TV that is 30% advertisements that you cannot skip, and that cannot be paused? Have you tried managing a VCR? Have you tried having to call <a href=\"https://www.youtube.com/watch?v=rhhI_qYOacw&amp;pp=ygUJY2FibGUgZ3V5\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">the cable guy</a>?</p>\n<p>Yeah, no thanks.</p>\n<p><a href=\"https://x.com/NateRothstein/status/1958611904924196941\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Nate argues television peaked in 2014</a>. I agree there were some good times, 2014 is definitely a better television case than the 1990s (although movies peaking in 1999 is a highly reasonable argument!), but a lot of this is again forgetting all the old annoyances, and forgetting that we used to have actual scarcity. Yes, now you have to figure out where to watch something, but usually there is an answer. Before you turned on the television and watched, because if it wasn’t on some channel you were out of luck.</p>\n<p>Overall I am firmly on the side that the television experience has never been better, or at least that this will be true once Disney and YouTubeTV resolve their dispute.</p>\n<h4>The Joys Of Partial Task Automation</h4>\n<p>As in, it’s not only AI that has jagged capabilities.</p>\n<blockquote><p>Sarah Constantin: It feels like every time I’m “bad at” something, it’s actually that I’m good at some subskills and not doing other subskills AT ALL.</p>\n<p>Like, underneath every 50% there’s a bunch of 100% and 0% pieces.</p>\n<p>eg:</p>\n<p>“I’m not so good at sales” is actually “I have a good pipeline and offer a good service but I’m essentially not even trying to be persuasive on sales calls”</p>\n<p>“I’m not so good at the videogame Hades” is actually “there are some moves i never learned to do at all, so i don’t use em”</p></blockquote>\n<h4>Gamers Gonna Game Game Game Game Game</h4>\n<p><a href=\"https://x.com/fireshoes/status/1980681380112789723\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Magic: The Gathering announces a Magic Limited Championship in 2027</a>. I thought I was out, but given I can use my Hall of Fame invite and only learn one set and one limited format, this could pull me back in.</p>\n<p>I also am considering doing some power cube drafting on Arena. Sounds like fun.</p>\n<p><a href=\"https://x.com/lsv/status/1982491575549886732\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Magic Spotlight Series SCG Baltimore has a second day metagame over 50% Cauldron</a>.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"773\" src=\"https://substackcdn.com/image/fetch/$s_!MalE!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F964a3aff-90ca-4053-88e8-8a80a13e3f8f_1164x773.jpeg\" title=\"\" width=\"1164\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>Occasionally we see Standard formats that end up in this failure mode. The price of printing fun and cool cards, and of the current theory of design, is that this will sometimes happen. When it happens by accident, that’s unfortunate, and I think they could do a better job putting stabilizers into sets to guard against this, but the correct risk of this to take is not zero.</p>\n<p><a href=\"https://thezvi.substack.com/p/monthly-roundup-34-september-2025\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Except that back in September</a> things had already reached this nightmare state in a way that seemed obviously like it was going to be sustainable, and <a href=\"https://x.com/ChannelFireball/status/1957524660838416713\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">LSV predicted essentially the full outcome back on August 18</a>. This was an active decision.</p>\n<p>The official response is that this would have required an emergency ban, and formats need stability, so they’re not doing it.</p>\n<p>I’m sorry, but that’s ridiculous. As of SCG Con, it had been two full months. If you’re unwilling to ‘emergency’ ban then you need more B&amp;R days than this.</p>\n<p>I’m also sympathetic to ‘balancing Standard is not the top priority of Wizards R&amp;D anymore,’ and I realize this will increase the rate of mistakes made, except that this consideration cannot apply to Standard itself or to its banned list. Standard participation needs to be continuous to keep up with card access, breaking it is deadly. As someone excited to try and find the time to do a fully Limited PT, I cannot overstate how much this failure makes me uninterested in returning to Standard.</p>\n<p><a href=\"https://moxfield.com/decks/YAiSIuIUOE66pq0DI3m4CA\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Sam Black assembles a list of every card</a> in Magic’s Premodern format that one could possibly want to play. It’s a fun list and includes some deep cuts, while letting you skip the cuts that are too deep.</p>\n<p>Sam Black warns us that <a href=\"https://x.com/SamuelHBlack/status/1986924740573811066\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">in Magic draft, 17lands data on win rates is often misleading</a> because cards that only go in the better decks will end up showing artificially high win rates when drawn. Cards that only go in one particular strong deck type look great because they don’t make the cut at all otherwise, whereas Sol Ring goes in almost every deck. Also you need to worry about your skill level versus average skill level.</p>\n<p>The caveat back is that while in theory full flexibility is good, and for experts like Sam Black it’s very good, it can also be a trap (in terms of short term win rates) to be tempted into decks that aren’t good or that you don’t know how to draft, whereas you actually should be forcing the good stuff far more if you care only about winning now.</p>\n<h4>Sports Go Sports</h4>\n<p><a href=\"https://www.wsj.com/business/media/apple-f1-us-streaming-deal-1dfb7724\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Formula 1 (F1) racing signs an exclusive five-year deal with AppleTV+,</a> likely for ~$150 million a year, up from the $90 million ESPN paid in the previous deal. <a href=\"https://stratechery.com/2025/f1-on-apple-tv-distribution-as-differentiation-a-worthwhile-gamble/?access_token=eyJhbGciOiJSUzI1NiIsImtpZCI6InN0cmF0ZWNoZXJ5LnBhc3Nwb3J0Lm9ubGluZSIsInR5cCI6IkpXVCJ9.eyJhdWQiOiJzdHJhdGVjaGVyeS5wYXNzcG9ydC5vbmxpbmUiLCJhenAiOiJIS0xjUzREd1Nod1AyWURLYmZQV00xIiwiZW50Ijp7InVyaSI6WyJodHRwczovL3N0cmF0ZWNoZXJ5LmNvbS8yMDI1L2YxLW9uLWFwcGxlLXR2LWRpc3RyaWJ1dGlvbi1hcy1kaWZmZXJlbnRpYXRpb24tYS13b3J0aHdoaWxlLWdhbWJsZS8iXX0sImV4cCI6MTc2MzYzMzEyMCwiaWF0IjoxNzYxMDQxMTIwLCJpc3MiOiJodHRwczovL2FwcC5wYXNzcG9ydC5vbmxpbmUvb2F1dGgiLCJzY29wZSI6ImZlZWQ6cmVhZCBhcnRpY2xlOnJlYWQgYXNzZXQ6cmVhZCBjYXRlZ29yeTpyZWFkIGVudGl0bGVtZW50cyIsInN1YiI6IjAxOTY0MGE3LTNjYzUtNzc1My04MzY4LWZiMjg5MTI0Y2YxMyIsInVzZSI6ImFjY2VzcyJ9.elKQqZY4WjDbeTCx5ddgsyLTNYTZQGrmuQSOK3Ow7_Bna1BrHnktKV6xuSmuijq6sZm9h_3WQhKywSTLjT86bawMy-9Utj2maxISbbtQ5VQCxRW6l-ErOCim7uoU5j8MlY_vp1KQvqFe-Ikuoxvu-ZjTBJiWyzRJSXAdb5Z7iCbGgCyBGQd20yWVxmcuhB9-HSku1oJa34zMa53Z7c_43dsBiasVkcXi3p8monQqBHPm4uj_6st8N0QEt_S1fOR6lX-1o_d6cXdBjhzUbckp78DK5RaAdLQV1ZOjPK8abAEJMlDgk6jUdH2chVYILEEDlsw0zjlhCyh-8cjay3Y9zw\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Ben Thompson notes that ESPN had been putting in minimal effort</a>, and AppleTV+ will be incorporating the full F1 TV be part of the base AppleTV+ package.</p>\n<p>I see the risk in going to a niche service like AppleTV+ over ESPN, given that every serious sports fan presumably will still need ESPN access, but in exchange they hopefully get to present a better product, in a unified way. The obvious deal would have been Netflix, why not unify the core broadcast with Drive to Survive, but I don’t mind what they ended up doing. Apple is also a powerful ally.</p>\n<p>I think AppleTV+ is exactly on point in saying it wants to own entire entire sports. It is maddening to have to hunt for different games or events and feel forced to buy multiple services. I think this played a substantial part in driving me away from baseball this year.</p>\n<p>I do warn AppleTV+ to fix their spoiler problem. Their current interface actively spoils everything, constantly, it’s a disgrace. Someone reading this must know someone who knows someone. Fix it.</p>\n<p>Don’t click the link, but yeah, <a href=\"https://x.com/nearcyan/status/1981457095934501270\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">the perfect a16z is ‘[evil thing X] meets [awful thing Y]</a> in ways of questionable legality that will ruin our customers lives.’ Don’t like you, but I’m impressed.</p>\n<p><a href=\"https://www.usatoday.com/story/sports/ncaaf/2025/10/31/college-football-coach-buyout-tracker-counter-how-much-schools-spending-fired-coaches-millions/86671970007/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">College football coaches have been paid a combined $185 million</a> this season to go away. I get how we got here, the coaches are in high demand and shop for the best deal, want to lock in profits, are definitely not looking to get fired so there isn’t actual moral hazard, and the patience teams show has worn paper thin, and the buyout serves are protection against being poached by another school. Also the transition to the NIL era has invalidated many past strategies, making previously excellent coaches no longer good, see Dabo Swinney (probably).</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"354\" src=\"https://substackcdn.com/image/fetch/$s_!iPMg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9a3b0461-de7c-4b02-923d-7fd3b22de46c_436x354.png\" title=\"\" width=\"436\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>It still does not make sense to me. You might not love the coach but at an 80%+ discount you think you can do better? You need to be firing them in the middle of the season like this? It’s madness, I tell you.</p>\n<p>I think with Franklin and Kelly in particular the problem is that they did great jobs in recruiting, so expectations got very high, then the teams didn’t deliver and they thought let’s axe the coach. Big mistake.</p>\n<p>The other note is that if the coaches get rehired then the cost will be a lot less, and one expects the top names on this list to get new jobs. LSU and Penn State might not want them, but plenty of schools would love Kelly or Franklin. I’d love to get Franklin for Wisconsin, it seems like a perfect fit.</p>\n<p>Whereas one I definitely agree with here is Mike Gundy. Gundy is a prime example of a previously excellent coach who is adrift in the new era, you have to cut your losses.</p>\n<p>One obvious suggestion is to tie the buyouts directly to the record. You say, okay, if we fire you without cause you are owed 85% of the contract, but if you have X losses or fail to hit some milestone, then that’s cause. Seems simple enough, and the coaches at this level have big egos and don’t expect to fail.</p>\n<p><a href=\"https://x.com/SethBurn/status/1981018286302085305\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">The NFL might be getting ready to move to the 4th and 15 alternative to onside kicks</a>.</p>\n<blockquote><p>Jonathan Jones: NFL EVP Troy Vincent told team owners today that it may be time to look at the fourth-and-15 proposal that has been offered as an alternate to the onside kick. The lack of recoveries on onside has disappointed the league.</p>\n<p>Seth Burn: This will be a disaster if teams can bait the refs into giving cheap defensive holding or DPI flags.</p></blockquote>\n<p>You want to calibrate about how often the team can convert. Right now the onside kick recovery rate is too low. The yards to go can be adjusted to taste, and with many yards to go you don’t have to give the refs an excuse.</p>\n<p>If the refs are actively looking to throw a flag in order to extend the game, and are basically cheating in this particular spot, that’s a different problem. I presume they wouldn’t do it because this is bad for the game.</p>\n<p>Also the cheap automatic first downs from such penalties should be clamped down on in any case. There are any number of rules changes to fix this, the most obvious being that there can be two types of such flags, the way there’s both running into and roughing the kicker, and you don’t get an automatic first down unless it’s flagrant.</p>\n<p><a href=\"https://www.natesilver.net/p/the-nba-gambling-scandal-explained\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Nate Silver offers his thoughts on the NBA betting scandal.</a> Our perspectives on this are broadly similar. Sports betting can be good fun and good business, and the context of odds can enhance sports, but the current regime of legalized sports gambling on your phone is terrible and current books do not deserve your sympathy.</p>\n<p>They especially don’t deserve sympathy for when their whales (big customers getting taken for huge amounts that are allowed to do basically anything for huge limits without questions) end up becoming beards (as in placing bets on behalf of actual professional gamblers) and bet $100k or more on an obscure player prop. They’re choosing to do game theoretically unsound things and taking calculated risks. If you’re gonna play with fire then sometimes you’re gonna get burned.</p>\n<p>My view of player props is that people who seek them out should be allowed to have their fun, sure why not, it’s cool info and a cool mini-game and in some cases it’s even a loss leader (since the wise person betting can pick off your mistakes and passes otherwise), but that the sportsbooks pushing them (and also pushing parlays) on recreational players is predatory behavior. And if they raise the limits on the props, especially on obscure players, that’s at their own risk.</p>\n<p>I also don’t have much sympathy for the recreational gamblers who take the other side of insider NBA bets. The NBA lines are, as Nate says, full of information about injuries and player usage and intent to tank, often not publicly known, to the point where this is the main thing driving lines away from where they naively ‘should’ be, and where most NBA fans at a sports bar could tell you what the line ‘should’ be if everyone potentially available was healthy and playing. Evaluating and tracking injuries is the main skill. That’s the game you’re playing. Either play it, or don’t.</p>\n<p>One place I disagree is where Nate mentions in his point #7 that if we banned FanDuel and DraftKings that 70% of that volume might move offshore rather than vanishing. I agree some percentage would move if there were no alternatives, but I would be utterly shocked if it was on the order of 70%. All the advertising would be gone. All the integration with media and teams and stadiums would be gone. Funding would be non-trivial again, as Nate notes you’d largely need to use crypto. You wouldn’t have an app with an optimized UI and wouldn’t be getting all the hyper aggressive customized push notifications on your phone. The entire context would change. No, it wouldn’t go fully back to the old level of activity, but it would drop a lot.</p>\n<p><a href=\"https://www.natesilver.net/p/the-nfl-has-entered-the-scorigami\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">The broader NFL shift is that not only are kickers getting better</a> (as per this very fun article from Nate Silver), offenses are getting better across the board and also making better decisions, and the reason we don’t notice the extent of this is that drives are taking up more time so the scores don’t fully reflect the shift.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"856\" src=\"https://substackcdn.com/image/fetch/$s_!h3Pc!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc7088ad-9074-4e88-b67c-bc019538442e_1119x856.png\" width=\"1119\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/SethBurn/status/1985802686449766694\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">When NFL teams depart</a> from draft consensus on player value they consistently do worse. So teams should use the consensus board for player value, except for when they have particular private information (such as on injuries), especially teams like the Jets with poor track records.</p>\n<p>You do still have to account for positional value, and what you in particular need because the trading market is illiquid. It’s fine to make small departures based on what you do and don’t need, but that should be it.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1990222205574381748\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">I actually do understand the calls for capping concession prices at stadiums</a>.</p>\n<p>Lindsay Owens here claims that teams are outright making mistakes, that in Atlanta raising ticket prices while lowering concession prices increased sales volume and revenue and fan satisfaction. I buy it.</p>\n<p>My read is that the higher concession prices raise marginally more revenue, but that you don’t want to be at the top of the revenue curve on this because the bad feeling of overpaying too much not only drives fans away from purchases, it makes the overall experience worse, as the stadium experience is Out To Get You. What you want is to be able to basically order whatever you want and not feel bad about it, and the team should want this for you too.</p>\n<p>It makes the overall experience much better, keeps people coming back, and turns them into long term fans. In general, teams should be doing less short term profit maximizing at their stadiums. I bet that on most current margins this outweighs the value of the price discrimination.</p>\n<p>This is not the same as requiring ‘all-in pricing’ on tickets, which I think is just good, and yes you lose the ability to do price discrimination which in theory leaves something on the table. However, I think there are enough differences that I do not want to ‘force them into a good move’ via law.</p>\n<p>&nbsp;</p>\n<h4>Sometimes People Cheat At Poker</h4>\n<p>Nate also discusses the poker cheating scandal, where I’m happy to defer to him and his notes match my understanding. Poker is fun, either with your buddies or at a casino, but if you’re not at a casino avoid raked games where the host turns a profit, there’s too much cheating risk and risk of involvement with people who are bad news. If you get invited to a home game, don’t go unless you understand why you’re invited.</p>\n<p>I’d highlight the note that cheaters are usually extremely greedy and unable to keep their cheating subtle, as per Nate’s #39. If they were capable of only ‘cheating small’ then they wouldn’t be cheating, so if you pay attention you can usually sense things aren’t right even if you can’t prove it.</p>\n<p>Hence the <a href=\"https://www.reddit.com/r/ripcity/comments/13lbu55/chauncey_allegedly_scammed_people_out_of/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">ability of Matt Berkey to call out the Billups game as rigged</a> two years ago. If you listen to the podcast clip, everything was the opposite of subtle, with players constantly making plays that make absolutely no sense unless cheating is involved.</p>\n<p>Also, as per #40, it doesn’t matter if you think the game is good enough you can win anyway, don’t play in a game where you’re being cheated, period.</p>\n<p>A similar phenomenon exists in Magic: The Gathering. If someone is cheating, they’re almost always highly suspicious. The problem is that unlike poker you often don’t choose who you play your Magic matches against, so you can be stuck against a likely cheater who hasn’t formally been caught yet.</p>\n<h4>Opportunity Knocks</h4>\n<p><a href=\"https://x.com/moreisdifferent/status/1988650405258297385\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">New York City will</a> have its <a href=\"https://t.co/VDxHZgpF9T\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Secular Solstice and Mega-Meetup</a> on the weekend of December 20th. The main event is on the 20th.</p>\n<p>I strongly recommend going to the Secular Solstice itself if you have the opportunity, either in NYC, SF or other places it is offered. If you are local, and the rationalist megameetup is self-recommending to you, then you should definitely go. If not, consider going anyway. I’m usually there for one of the days.</p>\n<p>If you’re looking for an idea of what the music is like, <a href=\"https://www.youtube.com/watch?v=0eNHtm6r7TI&amp;list=PLm7VTe8bokHFtY5PNUbynUBS3ktsk16U_\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">this playlist</a> gives you an idea.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"1200\" src=\"https://substackcdn.com/image/fetch/$s_!3l_R!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff5ca7a54-0e46-4367-9f37-b59ac907c14f_1159x1200.jpeg\" title=\"\" width=\"1159\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/AlecStapp/status/1986158992154865963\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">IFP is hiring</a> a <a href=\"https://t.co/J8HFNaEhwT\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Director of Operations.</a></p>\n<h4>The Lighter Side</h4>\n<p><a href=\"https://x.com/memeslich/status/1978906045838717141/quotes\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Name the four core character classes, wrong answers only</a>. Remarkably strong quality and diversity most of the way.</p>\n<p><a href=\"https://x.com/nearcyan/status/1965012261917053409\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">I know about the gender pay gap but this is ridiculous</a>, also Near is a man:</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"509.42003853564546\" src=\"https://substackcdn.com/image/fetch/$s_!RIWG!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4d7a2c0a-62ca-4cd7-a857-c9a0beaf5228_1038x1262.png\" title=\"\" width=\"419\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/robinhanson/status/1964294769376444897\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Robin Hanson, never stop Robin Hansoning</a>, I will not explain further:</p>\n<blockquote><p>Rob Henderson (Quoting from The Social Paradox by William von Hippel): “If two people anywhere on earth look into each other’s eyes for more than five seconds, then either they’re going to have sex or one of them is going to kill the other.”</p>\n<p>Robin Hanson: I’d bet a lot of money that this is simply not true. In fact the % of random pairs for which either of those happens must be well below 5%.</p></blockquote>\n<p><a href=\"https://x.com/mattyglesias/status/1966584450780627221\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Oh well</a>.</p>\n<blockquote><p>Matthew Yglesias: Hmmmm so they are considering trading away enduring spiritual values in exchange for short-term material gain, wonder if anything has ever been written that would be relevant to this.</p></blockquote>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"473\" src=\"https://substackcdn.com/image/fetch/$s_!oz4z!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe644564-ae71-4b10-9742-60dbe4ebe67a_1031x473.png\" title=\"\" width=\"1031\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/CoreyWriting/status/1972490679201960058\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Andrew Callaghan considers not releasing his interview with Pete Buttigieg</a> because despite being a good discussion it went too well for Pete and his audience is mad about it.</p>\n<p>If you didn’t watch Sabrina Carpenter on SNL, <a href=\"https://www.youtube.com/watch?v=f83L0Wd_mKI\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">watch this video from that show</a>.</p>\n<p><a href=\"https://x.com/daniel_271828/status/1973246802431537516\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">A claim by Matt Bruenig that capitalism does not reward risk-taking</a>, because when you take a risk sometimes it doesn’t work out. It’s too risky.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"791.2816091954023\" src=\"https://substackcdn.com/image/fetch/$s_!_yOA!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F794e3d06-a200-4af8-8f9f-967aedc567cf_1044x1513.png\" title=\"\" width=\"546\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>You do not get reliably rewarded for risk taking. It’s true!</p>\n<p>It’s actually not as true as you might think. In many cases you can repeatedly take uncorrelated risks at good odds, and over time you will reliably get rewarded for this.</p>\n<p>And then it gets better, in response:</p>\n<blockquote><p><a href=\"https://x.com/JamesSurowiecki/status/1973226724604387488\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">James Surowiecki</a> (Author, The Wisdom of Crowds): Does capitalism systematically reward risk-taking? In other words, is there a tight correlation, empirically, between the amount of risk one takes on and the returns one earns?</p></blockquote>\n<p>And better than that, even!</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"680\" src=\"https://substackcdn.com/image/fetch/$s_!23Fr!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F587d08aa-e5fd-4a9e-bc92-594ae9fc0ff4_623x680.jpeg\" title=\"\" width=\"623\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>No, I’m not going to explain this one.</p>\n<p>Perhaps the crowds are not so wise, after all. Or perhaps they weren’t consulted.</p>\n<blockquote><p><a href=\"https://x.com/fragrancewife/status/1975342993562648688\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">courtney</a>: ordering from the indian restaurant and I just burst out laughing</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"544.0746268656717\" src=\"https://substackcdn.com/image/fetch/$s_!yeMS!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb413e58c-f2ff-4576-b072-86ebba378d1b_1206x1566.jpeg\" title=\"\" width=\"419\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>A response suggests another way:</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"1941\" src=\"https://substackcdn.com/image/fetch/$s_!AXIo!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb3e7da60-2155-4a58-95bd-5db222d33d80_1536x2048.jpeg\" title=\"\" width=\"1456\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>Bookem Code Monkey: I go to one with an Indian friend. Ordered something spicy. It was bland, bland. My Indian friends snaps his fingers and the guy comes over. falkfjlkjakljagaffadfa or whatever he said to the guy. Guy responds, Oh no, we don’t give that to white people. WTH.</p>\n<p>Sven-Hajo Sieber: Had that experience in Tasmania, ordered very spicy and it was quite mild. When they asked if it was okay at the end I commented on it and they said: oh, order Indian spicy next time, we brought you Australian spicy.</p>\n<p>Nina: My friend has the same experience with his Malaysian boyfriend when ordering food in London. They bring the boyfriend REAL spicy food, but not his British partner!</p></blockquote>\n<p>Victory is hers!</p>\n<blockquote><p>Aella: omg I did it.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset\">\n<p><img alt=\"\" class=\"sizing-normal\" height=\"525\" src=\"https://substackcdn.com/image/fetch/$s_!p_DJ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Faa7806d9-5f38-4f90-84f4-1b0f699ddbf5_926x525.jpeg\" width=\"926\" /></p>\n<div></div>\n</div>\n</figure>\n</div>\n<p>Eliezer Yudkowsky: Exactly half of your followers are insane.</p></blockquote>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/11/19/monthly-roundup-36-november-2025/",
            "publishedAt": "2025-11-19",
            "source": "TheZvi",
            "summary": "Happy Gemini Week to those who celebrate. Coverage of the new release will begin on Friday. Meanwhile, here’s this month’s things that don’t go anywhere else. Good News, Everyone Google has partnered with Polymarket to include Polymarket odds into Google &#8230; <a href=\"https://thezvi.wordpress.com/2025/11/19/monthly-roundup-36-november-2025/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Monthly Roundup #36: November 2025"
        },
        {
            "content": [],
            "link": "https://lethain.com/coding-at-work/",
            "publishedAt": "2025-11-19",
            "source": "Will Larson",
            "summary": "<p>Since joining Imprint a bit over six months ago as the CTO of a ~50 engineer team, I&rsquo;ve merged 104 pull requests, which is slightly over four per week. Many of them are very minimal configuration and documentation tweaks, and none were <em>the hardest</em> or even <em>most time-sensitive</em> task available at any given time; I&rsquo;m much more of a pull request scavenger finding opportunities that don&rsquo;t disrupt the operating teams&rsquo; rhythms.</p> <p>That said, a decent chunk represent meaningful software development tasks, and these 104 pull requests are more pull requests than I&rsquo;ve completed <em>combined</em> in my prior decade of work, where Uber was the last time I was substantially submitting pull requests (well, whatever Phabricator called its pull request equvialent). Since then, I&rsquo;ve been predominantly managing managers, and <em>not</em> writing software with my own hands at work.</p> <p>This has been a fascinating shift, and I wanted to write dome some thoughts on whether this is good for software, good for me, whether it&rsquo;s fun, and how I&rsquo;ve personally worked to adapt to <a href=\"https://lethain.com/good-eng-mgmt-is-a-fad/\">the current era</a>.</p> <hr /> <p><em>Unrelatedly, I did enjoy Peter Seibel&rsquo;s <a href=\"https://codersatwork.com/\">Coders at Work</a> (2009).</em></p> <h2 id=\"dubious-return-on-effort-of-manager-coding\">Dubious return-on-effort of manager coding</h2> <p>I was a computer science",
            "title": "Coding at work (after a decade away)."
        },
        {
            "content": [],
            "link": "https://xkcd.com/3170/",
            "publishedAt": "2025-11-19",
            "source": "XKCD",
            "summary": "<img alt=\"Now, if it were the *Canon* wiki, it's possible to imagine someone with a productivity-related reason for consulting it, but no one's job requires them to read that much about Admiral Daala.\" src=\"https://imgs.xkcd.com/comics/service_outage.png\" title=\"Now, if it were the *Canon* wiki, it's possible to imagine someone with a productivity-related reason for consulting it, but no one's job requires them to read that much about Admiral Daala.\" />",
            "title": "Service Outage"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-11-19"
}