{
    "articles": [
        {
            "content": [
                "<p>I’ve been building a <a href=\"https://alexwlchan.net/2025/social-media-scrapbook/\">scrapbook of social media</a>, a place where I can save posts and conversations that I want to remember.\nIt has a nice web-based interface for browsing, and a carefully-designed data model that should scale as I add more platforms and more years of my life.\nAs I see new things I want to remember, it’s easy to save them in my scrapbook.</p>\n\n<p>But what about everything I’d saved before?</p>\n\n<p>Across various disks, I’d accumulated over 150,000 posts from Twitter, Tumblr, and other platforms.\nThese sites were important to me and I didn’t want to lose those memories, so I kept trying to back them up – but those snapshots had more enthusiasm than organisation.\nThey were chaotic, devoid of context, and difficult to search – but the data was there.</p>\n\n<p>After so many failed attempts, my scrapbook finally feels sustainable.\nIt has a robust data model and a simple tech stack that I hope will last a long time.\nI wanted to bring in my older backups, but importing everything wholesale would just reproduce the problems of the past.\nI’d be polluting a clean space with a decade of disordered history.\nIt was finally time to do some curation.</p>\n\n<p>I went through each post, one-by-one, and asked: <em>Is this worth keeping? Do I want this in the story of my life? Is this best left in the past?</em></p>\n\n<p>That’s why I started looking back over fifteen years of a life lived online, which became an unexpectedly emotional meeting with my younger self.</p>\n\n<h2 id=\"the-internet-as-a-teacher\">The Internet as a teacher</h2>\n\n<p>One thing I’d forgotten is how much I learnt from being online, especially in fannish spaces.\nMy timeline taught me about feminism and consent; about disability and the barriers of the built world; about racism in a way that went far deeper than anything I’d encountered before.\nI could learn about issues directly from the people who faced them, not filtered through a journalist’s lens.\nToday I take that social awareness for granted, but the Internet is where it started.</p>\n\n<p>Social media was a crash course in humanity – broader, richer, and more diverse than anything I got from formal education.</p>\n\n<p>Once I learned to shut up and just listen, Twitter let me follow conversations between people whose lives were nothing like mine.\nI got the answers to so many questions I’d never even known to ask, and I miss that.\nI stopped using Twitter after it was bought by Elon Musk, and I have yet to find another platform that replicates that passive, ambient learning.</p>\n\n<h2 id=\"questioning-and-queer\">Questioning and queer</h2>\n\n<p>More than anything else I saw online, queer culture has shaped my life.\nI’m queer, my partner is queer, and so are most of my friends.\nThere are so many people I’d never have met if social media hadn’t introduced me to this world.</p>\n\n<p>When I was realising I was queer, it all felt very difficult and angsty.\nLooking back, I can see myself following a classic path – talking to queer people, being a loud and enthusiastic ally, then starting to realise there might be a reason I cared so much.\nI went through it once when I realised I wasn’t straight, and again a few years later when I realised I wasn’t cis.</p>\n\n<p>My younger self was oblivious, but it’s all so obvious in hindsight.\nI cringe at some of those older posts, but they helped me become who I am today, and I want to keep them.</p>\n\n<h2 id=\"i-was-annoying-and-rude-but-i-grew-up\">I was annoying and rude, but I grew up</h2>\n\n<p>There are other posts I look back on with less fondness.\nI’m embarrassed by how annoying I was when I was younger.\nI spent too much time on self-indulgent moralising and pointless arguments, often with people I probably agreed with on almost everything else.\nI wanted to be right more than I wanted to listen, and that got in the way of useful conversations.</p>\n\n<p>Those arguments were worthless then and they’re worthless now.\nDeleting them was a relief.</p>\n\n<p>Among my less admirable behaviour was the performative outrage toward the <a href=\"https://twitter.com/maplecocaine/status/1080665226410889217\">“main character”</a> of the day – the unlucky person whose viral tweet had summoned thousands of replies explaining why they were a terrible person.\nLooking back, it was a symptom of misplaced familiarity.\nI was reading a stranger’s posts as if I knew them, projecting motives from scraps of context, and joining dogpiles to fit in with the crowd.</p>\n\n<p>Despite ruffling a lot of feathers, I was only the main character once, and in a small corner of the tech community.\nIt was still an unpleasant weekend, and I got off lightly compared to some of my friends – but I’ve never forgotten how quickly online attention can turn to anger and hostility.</p>\n\n<p>Learning about <a href=\"https://en.wikipedia.org/wiki/Parasocial_relationships\">parasocial relationships</a> helped me behave better.\nI realised how often my reactions were shaped by a false sense of intimacy, and how easy it was to be cruel when I forgot there was a person behind the avatar.\nI shifted my attention towards friends rather than strangers, and when I did talk to people I didn’t know, I tried to be constructive instead of showing off.</p>\n\n<p>When I joined Twitter, I admired by people who were smart.\nToday, I look up to people who are kind.\nI’ve come to value generosity and empathy far more than cleverness and nitpicking.</p>\n\n<h2 id=\"the-ghosts-in-the-posts\">The ghosts in the posts</h2>\n\n<p>Looking through old conversations, I see the ghosts of friendships and relationships I’ve since lost.\nSome of those could be recovered if either of us reached out; others are gone for good.\nA few people have even passed away.\nI don’t know where most of those friends ended up, but I hope life has been kind to them.</p>\n\n<p>I’ve passed through so many spaces: the PyCon UK community; fandoms like the Marmfish and the Creampuffs; the trans elders who supported me during my transition; the small, loyal group of blog readers who always left thoughtful comments.\nSome I lost touch with while I was still on Twitter; others I left behind when I left Twitter altogether.</p>\n\n<p>As my interests changed and I moved from one space to another, I often did a poor job of keeping up the friendships I already had.\nI’d pour my energy into chasing new connections in the spaces I’d just discovered, <a href=\"https://www.lewissociety.org/innerring/\">neglecting the people who had been there all along</a>.\nThat neglect is stark when I look at it over a decade-long span.\nIt was sobering to realise how many more friends I might have today if I hadn’t taken so many past connections for granted.</p>\n\n<p>I’ve tried to keep lingering traces of those friendships by saving my mentions as well as my own tweets.\nHere’s one I found that made me cry: <em>“One of the things I miss the most from my pre-pandemic Twitter timeline is seeing @alexwlchan traveling on trains and taking train selfies”</em>.\nI miss that culture too – selfies were such a source of joy and affirmation, especially in queer and trans spaces.\nI miss seeing pretty pictures of my friends, and sharing mine in return.</p>\n\n<p>When Elon Musk bought Twitter, a lot of my remaining connections there were broken.\nSome friends went to other platforms; others left social media entirely.\nI was one of them!\nI still write here, but it’s a more professional, broadcast space – it’s not a back-and-forth conversation.</p>\n\n<p>I miss the friendships I had, and the ones that might have been.</p>\n\n<h2 id=\"what-i-choose-to-remember\">What I choose to remember</h2>\n\n<p>I started with 150,000 fragments, which I reduced to 4,000 conversations.\nA lot of it I was glad to forget, but there are gems I want to remember.\nI’m glad I’ve done this, and it reinforces my belief that social media is an important part of my life that I should preserve properly.</p>\n\n<p>Curating these memories has made them feel smaller and more manageable.\nThe mess of JSON files scattered across disks has been replaced by a meaningful, well-organised collection I can look back on with a smile.</p>\n\n<h2 id=\"what-comes-next\">What comes next?</h2>\n\n<p>My use of Tumblr fell away gradually, and I stopped tweeting when Elon Musk bought Twitter.\nI didn’t jump to another platform immediately, because I wanted to pause and reflect on what I wanted from social media.\nCurrently, my social media usage is limited to linking to blog posts.</p>\n\n<p>Looking back over my old posts has helped with those reflections.\nI’d like to think I’ve grown up a bit in the interim, and that I’d use it better if I made it a bigger part of my life again.\nA lot of good things started as conversations on social media, and I often wonder if I’m missing out.\nBut I don’t miss the time sunk in pointless arguments, the performative anger, or the abuse from strangers.</p>\n\n<p>I still don’t know what my future with social media will look like, but this project has me wondering.\nUntil I decide, my scrapbook lets me see the best of what’s already been – the friendships, the joy, and the moments that mattered.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2025/meeting-my-younger-self/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2025/meeting-my-younger-self/?ref=rss",
            "publishedAt": "2025-12-12",
            "source": "Alex Chan",
            "summary": "I reviewed 150,000 fragments of my online life, and I was reminded of the friends I found, the mistakes I made, and the growth I gained.",
            "title": "Meeting my younger self"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/12/12/style/modern-love-why-its-best-to-imagine-the-worst.html",
            "publishedAt": "2025-12-12",
            "source": "Modern Love - NYT",
            "summary": "After learning devastating news about our young son, we needed to feel connected to friends and family, not just exist beyond their imagination.",
            "title": "Why It’s Best to Imagine the Worst"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Dec/12/openai-skills/#atom-entries",
            "publishedAt": "2025-12-12",
            "source": "Simon Willison",
            "summary": "<p>One of the things that most excited me about <a href=\"https://simonwillison.net/2025/Oct/16/claude-skills/\">Anthropic's new Skills mechanism</a> back in October is how easy it looked for other platforms to implement. A skill is just a folder with a Markdown file and some optional extra resources and scripts, so any LLM tool with the ability to navigate and read from a filesystem should be capable of using them. It turns out OpenAI are doing exactly that, with skills support quietly showing up in both their Codex CLI tool and now also in ChatGPT itself.</p> <h4 id=\"skills-in-chatgpt\">Skills in ChatGPT</h4> <p>I learned about this <a href=\"https://x.com/elias_judin/status/1999491647563006171\">from Elias Judin</a> this morning. It turns out the Code Interpreter feature of ChatGPT now has a new <code>/home/oai/skills</code> folder which you can access simply by prompting:</p> <blockquote> <p><code>Create a zip file of /home/oai/skills</code></p> </blockquote> <p>I <a href=\"https://chatgpt.com/share/693c9645-caa4-8006-9302-0a9226ea7599\">tried that myself</a> and got back <a href=\"https://static.simonwillison.net/static/cors-allow/2025/skills.zip\">this zip file</a>. Here's <a href=\"https://tools.simonwillison.net/zip-wheel-explorer?url=https%3A%2F%2Fstatic.simonwillison.net%2Fstatic%2Fcors-allow%2F2025%2Fskills.zip\">a UI for exploring its content</a> (<a href=\"https://tools.simonwillison.net/colophon#zip-wheel-explorer.html\">more about that tool</a>).</p> <p><img alt=\"Screenshot of file explorer. Files skills/docs/render_docsx.py and skills/docs/skill.md and skills/pdfs/ and skills/pdfs/skill.md - that last one is expanded and reads: # PDF reading, creation, and review guidance ## Reading PDFs - Use pdftoppm -png $OUTDIR/$BASENAME.pdf $OUTDIR/$BASENAME to convert PDFs to",
            "title": "OpenAI are quietly adopting skills, now available in ChatGPT and Codex CLI"
        },
        {
            "content": [
                "<p>I’m doing the Monthly Roundup early this month so that next week can be GPT-5.2 and affordability of life week, assuming we are not overtaken by other events.</p>\n\n\n<h4 class=\"wp-block-heading\">Ban Gain of Function Research</h4>\n\n\n<p>The risk-reward profile of creating highly dangerous new viruses, supposedly in order to study them, is abysmal even when things are handled properly.</p>\n<p>Also, the actual practice of it is completely utterly insane.</p>\n<p>This below is the kind of thing that could very easily cause a global pandemic vastly worse than Covid, or even end civilization, and it was done in a BSL-2 laboratory, and no one has been arrested for it.</p>\n<div>\n\n\n<span id=\"more-24950\"></span>\n\n\n</div>\n<p>People need to be arrested for this. Ideally heads need to end up on pikes until it stops.</p>\n<blockquote><p><a href=\"https://x.com/mdc_martinus/status/1993257964195790931\">Maarten De Cock:</a> A new <img alt=\"🇨🇳\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f1e8-1f1f3.png\" style=\"height: 1em;\" /> gain of function study created chimeric coronaviruses that can infect human cells and kill mice (up to 100% mortality).</p>\n<p><img alt=\"🚩\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f6a9.png\" style=\"height: 1em;\" />”The viral infection [and all animal experiments] were performed in a BSL-2 laboratory”(!)<img alt=\"🤦‍♂️\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f926-200d-2642-fe0f.png\" style=\"height: 1em;\" /></p>\n<p>*The authors thank a.o. Ben Hu &amp; Zheng-Li Shi.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!JwJu!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb9f55472-de5e-4fdf-9c60-9a8f61a90ab4_1185x1792.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">In The Zone</h4>\n\n\n<p>At current margins, <a href=\"https://x.com/senatorshoshana/status/1991872736566886628\">zoning restrictions on home-based businesses are terrible</a> <a href=\"https://thedailyeconomy.org/article/home-business-control/\">and make everything worse</a>. There of course have to be some rules and limits, and occasionally one might even need to enforce them, but we can and should be dramatically more chill.</p>\n<p><a href=\"https://x.com/david_perell/status/1990996476315496598\">All the modern buildings and living spaces have no character</a>, even expensive ones, as everything converges on a single largely white aesthetic. A lot of people realize that the old look of ‘having character’ was better, but no one ends up doing it, even when there is the ability to pay more.</p>\n\n\n<h4 class=\"wp-block-heading\">A Price Is A Signal Wrapped In An Incentive</h4>\n\n\n<p>This level of having no idea what prices do seems to be very common. Also very common is that someone finds out and then refuses to understand:</p>\n<blockquote><p><a href=\"https://x.com/gtmom/status/1994889968179974458\">Pamela Hobart</a>: I graduated with high honors from an affluent, acclaimed high school and then again with high honors with a BA in philosophy &amp; pre-law before EVER once hearing the idea that prices convey information and coordinate actors.</p>\n<p>I’ll never forget rolling up to a philosophy conference in Pasadena in 2008 and wandering into a session on “price gouging” and the pro-”price gougers” introduced this concept.</p>\n<p>Possibly the single most transformative moment of my entire education.</p>\n<p>like I didn’t even grow up in a particularly liberal enclave or anything either, most parents were garden variety Republicans as were the teachers I imagine.</p></blockquote>\n<p>CEOs are <a href=\"https://x.com/_rotimia/status/1995856296135065904\">using the assassination of the CEO of United Healthcare to argue for higher pay in light of job risks</a> and need for security, and many of them are getting it. As well they should, I know my happy price to be CEO of a major corporation went up that day.</p>\n\n\n<h4 class=\"wp-block-heading\">While I Cannot Condone This</h4>\n\n\n<p><a href=\"https://x.com/KelseyTuoc/status/1884702831451754548\">Kelsey Piper recalls the story of James Damore</a>, and the attempts to have him blacklisted after he was fired from Google. The events are also described <a href=\"https://pod.link/1677066062/episode/M2E2NWViYjQtYTQwMS00ODAyLTkxYTgtYzMyNTJmMjM4OTFi\">in this podcast</a> by her boss at the time, Harj Taggar, who resisted the calls to blacklist him. Yeah, things were like that back then.</p>\n<p><a href=\"https://x.com/davidmanheim/status/1990012449094090876\">I fully agree with David Manheim here, in general</a>, that condemnations are almost always at most supererogatory.</p>\n<blockquote><p>David Manheim: I will again state my view that condemning bad things is great, but condemning others for failing to condemn bad things, (much less boycotting them and similar glorious loyalty oath crusades,) is building toxic community incentives and attempting to force conformity.</p></blockquote>\n<p>Partly this is because life beckons and we have better things to do with our time than constantly condemn everything bad. But it’s more than that.</p>\n<p>Often condemning a bad thing only gives it oxygen, and also gives oxygen to additional demands to condemn things that are decreasingly bad until you finally draw the line, and you are now seen as endorsing, condoning or even ‘platforming’ anything you didn’t sufficiently condemn and punish. At which point you become blameworthy, no matter what you did. Don’t accept the jurisdiction of that court.</p>\n<p><a href=\"https://x.com/rootsofprogress/status/1993375753170542794\">Videos from the Roots of Progress Conference</a>.</p>\n<p>Polymarket participant AlphaRaccoon once again exploits insider information (presumably), as is legal and allowed on Polymarket, <a href=\"https://x.com/tszzl/status/1996702058544877608\">and makes over a million dollars betting on the Google search markets</a>, after profiting on the release date of Gemini 3.</p>\n\n\n<h4 class=\"wp-block-heading\">The Gift Of Having A Gift To Give Away</h4>\n\n\n<p>This post has <a href=\"https://www.lesswrong.com/posts/dmLnWjyqAi5N2pqqz/ruby-s-ultimate-guide-to-thoughtful-gifts\">good advice on gift giving</a>.</p>\n<p>The central point on such guides is that you need to know why they haven’t gotten the gift for themselves despite it providing value when you give it to them, and the more good reasons for that the better.</p>\n<p>Activation energy, trivial inconveniences, <a href=\"https://thezvi.substack.com/p/choices-are-bad\">choices are bad</a>, lack of in-context knowledge or taste, lack of access, guilt over spending, too much audacity or cringe if they bought it for themselves, shared experiences, symbolic meaning and yes liquidity and solvency constraints are all good reasons. Stack them on top of each other.</p>\n\n\n<h4 class=\"wp-block-heading\">Good News, Everyone</h4>\n\n\n<p><a href=\"https://x.com/fidjissimo/status/1992136485131506128\">I strongly agree with the</a> statement below, and it a statement that positively updates me on the person making it, <a href=\"https://ifp.org/indoor-air-quality/\">also see this proposal from IFP</a>.</p>\n<blockquote><p>Fidji Simo (OpenAI CEO of Products): We need the equivalent of the 20th-century clean water revolution, except for clean indoor air.</p>\n<p>People with post-infectious chronic illnesses have known for a while how insane it is that, as a society, we continue to find it perfectly acceptable to breathe air full of viruses that can completely destroy our lives years later and that our schools are virus factories.</p>\n<p>With more horrible conditions being attributed to viruses earlier in life, I hope that perceptions will finally change, and that contaminated air will soon feel as unacceptable as contaminated water.</p></blockquote>\n<p><a href=\"https://www.avitalbalwit.com/post/the-advice-i-would-give-on-a-mentorship-call\">Avital Balwit writes the advice he would give on a mentorship call to college students</a>.</p>\n<p>Zohran Mamdani, New York City’s next major, <a href=\"https://x.com/binarybits/status/1995486278218080484\">plans to make it so you don’t have to fill out 24 forms and go through 7 agencies to start a barber shop</a>? As I’ve thought for a while, we have no idea what Mamdani will actually do as mayor. Things like this can make up for a lot of stupid symbolic stuff.</p>\n<p><a href=\"https://asteriskmag.com/issues/12-books/can-you-just-do-things\">Cate Hall once again reminds us that You Can Just Do Things</a>, this time in an interview with Clara Collier.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1993647572209357098\">The public is reasonably good at estimating which traits are how heritable</a>, r^2 is something like 0.35-0.4 even if you exclude eye color and blood group, and if you assume the literature is always right and the laypeople are wrong, which I would not be so quick to assume, especially for the big gaps: sexual orientation and obesity.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!BIl3!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F61d42187-2529-43b2-9903-7a601f434a54_1206x1782.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Paranoia, Paranoia</h4>\n\n\n<p><a href=\"https://www.lesswrong.com/posts/yXSKGm4txgbC3gvNs/paranoia-a-beginner-s-guide\">Oliver Habryka offers a beginner’s guide</a>, as in basic explanations for why exiting in paranoia-inducing epistemic situations drives people crazy and towards making seemingly crazy decisions. Oliver’s thesis is that the world has gotten more paranoia-requiring and epistemically hostile, and that this often overwhelms the value of us having better information and other resources, often leading to worse decisions.</p>\n<p>He starts by <a href=\"https://www.lesswrong.com/posts/yXSKGm4txgbC3gvNs/paranoia-a-beginner-s-guide#A_market_for_lemons\">going over how lemon markets work</a>, and points out that in the real world we always have not only a potential lemon problem but also a potential lemon problem among the identifiers of the lemons, and so on. Whatever system you are relying upon there are those looking to exploit it.</p>\n<p>Well, maybe. That’s true for a sufficiently collective value of ‘you,’ or if you alone are a sufficiently important target. In many cases, this doesn’t apply, and it isn’t true.</p>\n<p>In other cases you can do a pretty good job identifying non-suspicious counterparties, or you can engage in enough iterated games, such that you can solve such worries.</p>\n<p>The reason used cars in particular are such an issue is that not only is it traditionally hard to detect lemons, there is also little recourse or consequence to selling a lemon, and also there is a baseline cultural expectation that a ‘used car salesman’ will be slimy, so them being suspicious or having somewhat of a sketchy reputation doesn’t mean you can obviously bail on them.</p>\n<p>(We now actually have made substantial progress in the used car lemon problem, with inspections that come with warranties, longer test drive periods, online marketplaces, certifications that have long term reputations to maintain and the rise of history trackers like Carfax and AutoCheck.)</p>\n<p>The next point Oliver makes, about OODA loops, is key, although I’d frame it differently. Oliver presents it as, if the enemy can ‘get inside your OODA loop,’ meaning act on you before you can observe, orient, decide and act, then you’re screwed, because you never actually get to act in an appropriate way. This is a good illustration but feels too general.</p>\n<p>It’s more a question of, can you handle the epistemic environment in which you have been placed without taking generally paranoid or drastic measures?</p>\n<p>Consider a poker game. If you’re up against an inferior player, or one of similar caliber, then there is a lot of room to make interesting moves, and try to use the information they are giving off, and to give off intentionally misleading information, both with game actions and otherwise. You can always make what you think is the ‘best’ play based on the situation, and ideally only randomize in true edge cases.</p>\n<p>If you’re up against a sufficiently superior player, that won’t work. They anticipate what you are thinking, they adopt faster than you do, they are giving off actively misleading signals and figuring out yours.</p>\n<p>You need to retreat to your best approximation of game theory optimal play and randomize your moves while ignoring your reads, combining Oliver’s strategies.</p>\n<p>Which are:</p>\n<blockquote><p>Oliver Habryka: There are lots of different ways people react to adversarial information environments like this, but at a high level, my sense is there are roughly three big strategies:</p>\n<ul>\n<li>You blind yourself to information</li>\n<li>You try to eliminate the sources of the deception</li>\n<li>You try to become unpredictable</li>\n</ul>\n<p>All three of those produce pretty insane-looking behavior from the outside, yet I think are by-and-large an appropriate response to adversarial environments (if far from optimal).</p></blockquote>\n<p>Blinding yourself to information is an extreme response that only makes sense when you are sufficiently outgunned. One good reason to be outgunned is that others might be putting way more effort in than you can or would want to put in.</p>\n<p>When sources around you are willing to lie or otherwise untrustworthy, that does not mean you should ignore them, even if they are clearly lying to you to try and trick you.</p>\n<p>Oliver gives the example of the CDC during Covid, where they were saying things like ‘masks don’t work.’ This is indeed valuable information about the CDC and also the current world state, if you understand how to process it and not fall into the trap of interpreting it as ‘oh, masks don’t work.’</p>\n<p>This goes back to <a href=\"https://thezvi.substack.com/p/simulacra-levels-summary\">Simulacra Levels</a>.</p>\n<p>The CDC and Fauci were operating at <a href=\"https://thezvi.substack.com/p/simulacra-levels-summary\">Simulacra Level</a> 2. As in, they would tell you [X] so that you would believe [X] and then act accordingly and do [Y]. They didn’t care if [X] was true or false, they cared that they thought [Y] was good for public health.</p>\n<p>Once you identify that this is what the CDC and Fauci are doing, you can properly interpret their statements. They say ‘[X] is true’ and you hear ‘we think it would be good for public health if you did [Y].’</p>\n<p>You can do similar things when you figure out people are on Level 3 or Level 4.</p>\n<p>I also think the stories on professional advice, official numbers and admissible evidence, Oliver’s examples of rules limiting information flow, are more complicated, but I won’t get into that here.</p>\n<p>Strategy two is to purge the untrustworthy. This seems purely good. Even if you are in a mostly non-paranoid mode, and can mostly trust everyone, how do you keep it that way? By punishing and if needed exiling anyone who is not trustworthy, which includes you being insufficiently able to trust that they are trustworthy. That’s how trustworthiness works.</p>\n<p>A variation of purging, or asking which sources are unreliable, is to determine which sources are adversarial. A source can be unreliable without being adversarial, or it can be adversarial without being unreliable. Ideally you’d avoid me if I was either of these.</p>\n<p>Strategy three is to become unpredictable and vindictive.</p>\n<p>You can combine these strategies, and you can also use either one on their own.</p>\n<p>To a large extent ‘be unpredictable and vindictive’ is about creating maximally strong incentives. If you’re going down this strategy, you want maximum distinction between reward and punishment, and to always make people uncertain where they stand and worried or hopeful you might flip from one to the other, ideally with fear of massive overreactions. It can definitely work.</p>\n<p>Paranoia is one good reason to do this, as it makes people scared to cross you, but it also is a valid strategy for anyone with enough power even without paranoia.</p>\n<p>And again, you can split the two halves and do either without the other.</p>\n<p>Richard Ngo suggests an additional strategy, that the wise trader uses, which is to have wide bid-ask spreads, and being conservative in taking actions that might reward or get punished by deception.</p>\n<p>Thus we have six strategies.</p>\n<p>We have Oliver’s three, the last of which is split in two, we have Richard’s, and then we have Git Gud, be able to parse the information properly and get good use out of it, and you can do any combination of the six.</p>\n\n\n<h4 class=\"wp-block-heading\">A Good Book</h4>\n\n\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/best-non-fiction-books-of-2025.html\">Tyler Cowen list of best nonfiction books of the year</a>.</p>\n<p>The only one I have read is <a href=\"https://www.amazon.com/Open-Socrates-Case-Philosophical-Life/dp/1631498460/ref=sr_1_1?crid=1BVEW9BYLFE9I&amp;dib=eyJ2IjoiMSJ9.b5s6eyScm0q-MRCqffnBGkCPjg50FRzDXxKHRoIyBxO-FGGg9AJB1BcIiRF0-JT1STfE4jPgXqRcsp38r7kLAzm9JSfu6l8nX3Ws9itlpXw.G1MnWISzaRRZUvXYaKxEq3OAXLX1K1BXWt2S62iBFyM&amp;dib_tag=se&amp;keywords=agnes+callard+open+socrates&amp;qid=1763481897&amp;sprefix=agnes+callard%2Caps%2C280&amp;sr=8-1\">Open Socrates</a> by Agnes Callard, which I affirm was excellent and I’m sad I did not finish my book review. I might attempt it again at a later time, it is even now on top of my ‘when I have time’ stack, although it will suffer from my loss of memory. I’ll be largely relying on what I chose to highlight. Still seems worth it? So much to enjoy disagreeing with in that book.</p>\n<p>I am on the fence on whether I should be reading and reviewing more nonfiction books, versus other uses of time.</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/best-fiction-of-2025.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=best-fiction-of-2025\">Tyler Cowen picks his best fiction of 2025</a>, as a person whose best-of book lists are much bigger than how many books I read at all. I hadn’t even heard of any of these. Balle is included and appears to be a time travel story, which I’m usually down for, but I can wait and see if people like where it goes.</p>\n<p>How many fiction books did I read in 2025 other than when reading to my kids? One, <a href=\"https://amzn.to/4oM5UmH\"><em>This Is How You Lose The Time War</em></a><em>, </em>which I read on a plane and can recommend as ‘a good book.’ I owe Seth Burn that I will read Dungeon Crawler next. Fiction is one of the things my revealed preferences don’t find the time for. I wonder if that is a mistake, as the upside of a really good book can be very high.</p>\n<p>I’d also love to learn how to write fiction, although I’m most attracted to the idea of a screenplay? Every time I try to actually write fiction I feel like an imposter, nothing seems right or good enough, I end up not writing anything. Yet I often have very particular opinions about creative works.</p>\n\n\n<h4 class=\"wp-block-heading\">For Your Entertainment</h4>\n\n\n<p>I will be doing a Movies of 2025 post, either later this year or early in 2026, once I’ve had opportunity to watch the end-of-year movies. This was the year of pain, and the year of anticorrelation with critics.</p>\n<p><a href=\"https://deadline.com/2025/11/pope-leo-xiv-cinema-speech-a-list-crowd-read-his-speech-1236618389/\">The Pope waxes poetic about the magic of movies</a>. No disagreements but also we need to see him get more feisty.</p>\n<p><a href=\"https://substack.com/home/post/p-179505702?selection=5d541aa6-2b46-4bf8-b6b5-5cb717c66511\">Charlie XCX on what it is like to be a pop star</a>.</p>\n<p><a href=\"https://www.slowboring.com/p/the-hidden-cause-of-cultural-stagnation\">Another article, this time from Slow Boring and Chris Dalla Riva</a>, points out that copyright terms are too long and terms too restrictive. In particular, Chris blames this for a lot of our cultural stagnation, as there are constant pushes to reintroduce us to existing music and other IP via things like biopics.</p>\n<p>Except, isn’t that good? What’s wrong with getting owners of song catalogues to bankroll biopics for artists like Elvis and Springsteen, which you don’t have to watch and are often pretty good and also make our music experiences better? Or to encourage sampling?</p>\n<p>The intervention Chris pushes is expanded compulsory licensing. I agree that compulsory licensing has been great for music. I unfortunately don’t think that works the same way for television and movies, but also the copyright term is obviously way too long and due to treaties it would be difficult to shorten it.</p>\n<p>Thus, an obvious compromise suggests itself. We can move to mandatory licensing after a reasonable period of time, something like 30 years, plus a required prominent disclaimer on all licensed visual media.</p>\n\n\n<h4 class=\"wp-block-heading\">And The Warner Sister Dot</h4>\n\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2025-12-05/netflix-to-buy-warner-bros-in-72-billion-cash-stock-deal?srnd=homepage-americas\">Netflix is attempting to buy Warner Brothers for $72 billion</a>, although Paramount has now bid higher and the prediction markets think Paramount is the favorite. The market hates the deal for Netflix. It is unclear how much of that is ‘this is too high a price or a poor fit’ and <a href=\"https://www.bloomberg.com/news/articles/2025-12-07/netflix-co-ceo-ted-sarandos-wooed-trump-personally-ahead-of-warner-bid\">how much is ‘Netflix choosing to do this reveals something is wrong</a>.’</p>\n<blockquote><p>Lucas Shaw and Michelle Davis: California Republican Darrell Issa <a href=\"https://variety.com/2025/tv/news/netflix-acquisition-warner-bros-antitrust-concerns-republican-issa-1236582022/\">wrote a note</a> to US regulators objecting to any potential Netflix deal, saying it could result in harm to consumers. Netflix has argued that one of its biggest competitors, however, is <a href=\"https://www.bloomberg.com/quote/GOOGL:US\">Alphabet Inc.</a>’s YouTube, and that <a href=\"https://www.reuters.com/business/media-telecom/netflix-warner-bros-discovery-combo-seen-lowering-costs-consumers-sources-say-2025-12-03/\">bundling</a> offerings could lower prices for subscribers.</p></blockquote>\n<p>I think Netflix is right, and also this merger could be fantastic for customers, combining HBO and Netflix. Netflix has promised to allow Warner Brothers films to continue to have full theatrical releases, and for their business to continue unchanged, and I see little reason for them not to do that.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1996962225563558303\">I agree with Matthew Yglesias that a lot of what Netflix is buying is the prestige television</a> and the best way to use that is to let it do its thing on that front. On the movie front there is some reason to worry about less motivation for prestige films especially.</p>\n<p>I have also heard the theory that if Paramount buys Warner Bros. then Paramount would pull all of both companies content from Netflix and form a competitor, so the Netflix bid is largely defensive. That’s all the more reason not to fear it.</p>\n<p>My instinct is we want Netflix to win this fight, but if Paramount is willing to integrate Paramount+ and HBO Max into an actually functional streaming service that can surface high quality content (Paramount+ is, shall we say, not the most functional service on either surfacing high quality content or serving its basic functions) then that would also be a win.</p>\n\n\n<h4 class=\"wp-block-heading\">Gamers Gonna Game Game Game Game Game</h4>\n\n\n<p>If a Magic: The Gathering deck would be too good with perfect play, but approximately zero people can play the deck well enough to dominate with it, <a href=\"https://x.com/SamuelHBlack/status/1993893292849942867\">do we have a problem</a>? Amulet decks in Modern are the latest to suggest this question.</p>\n<p>In the linked discussion I think both Seth Burn and Sam Black make good points. Centrally I agree that bans are about harm reduction, which is often best served by harm prevention, with the goal of creating the best game in practice. I view harm as primarily mattering on the level of typical player experiences and health of a format in practice. I do think there’s a level at which Pro Tour level results can force your hand here anyway, but it’s on the level of ‘this deck is &gt;50% to win if we ran the tournament back next week.’</p>\n<p><a href=\"https://x.com/Liv_Boeree/status/1994874026817159282\">Werewolf is a highly illustrative game</a> (basic rules: there are [X] players in the village, [Y] of which are werewolves, each day everyone in the village including the werewolves votes to kill a player, each night the werewolves kill a player, whichever side is left at the end wins, various players get various other special powers), in that in most groups the werewolves win way more often than they ‘should’ for given values of [X] and [Y].</p>\n<p>This happens largely because so many players effectively focus largely on their own survival rather than the survival of their team, so they become afraid to speak out or otherwise try to help the village win, and that the villager side is in various ways the harder one to play well. Whereas if the villagers are good enough at working together, getting people talking and analyzing Bayesian evidence, they can win remarkably often, including a high chance of identifying a werewolf at game start without any hard evidence. These are important lessons about the world and the ease with which a focused group can win, which was the point of the OP she is QTing here.</p>\n<p>Liv Boeree is correct that by balancing the special roles (and also the number of werewolves) you can get the win rate for the werewolves to be whatever you want it to be for a given group of people, but people fail to understand the dynamics pointing towards the werewolves, and thus the werewolves tend to win most games in practice unless a given group is self-balancing.</p>\n\n\n<h4 class=\"wp-block-heading\">Think Of The Children</h4>\n\n\n<p><a href=\"https://www.nytimes.com/2025/11/21/podcasts/hardfork-roblox-child-safety.html?unlocked_article_code=1.208.Cg2f.wWs4lD6t2rvj&amp;smid=url-share\">Roblox is a confusingly popular platform</a> for children’s computer games. There are more than 150 million daily active users spending 11 billion hours a month, 3 percent of the gaming space, with at one point more than 25 million users simultaneously playing the game ‘Steal a Brainrot.’ I haven’t checked that ‘game’ out but presumably based only on the title this is an indictment of our entire civilization. A quick investigation indicates it is basically a base raiding game.</p>\n<p>Roblox is described as ‘one of the primary gathering places for preteens.’</p>\n<p>Alas, any time something attracts kids that will mean not only hosts of abominations like ‘Steal a Brainrot.’ It also means predators, and there are 20+ associated lawsuits. <a href=\"https://x.com/kevinroose/status/1991921097546269006\">Roblox pitched Kevin Roose and Hard Fork on interviewing Roblox’s CEO</a> David Baszucki about child safety, which seems like a fine idea for all concerned, except then it got weird.</p>\n<p>They start out talking about new safety measures, including using a facial scan and AI age estimator (that is also using various behavioral indicators) before allowing communications. The idea is yes you might fool the image filter but when you stack the evidence it gets harder and harder to hide that you’re a kid. They also use such strategies as not sharing images, aggressive text filtering and so on.</p>\n<p>And he says essentially: Hey, better to have the kids in Roblox with these restrictions, than a place like Snapchat or Instagram or Discord where things are worse. Fair point.</p>\n<p>That all helps, but as always if you twiddle enough you can always get through filters. As Baszucki points out at some point you’re using the fifth letter of every third word and nothing short of full generative AI analysis is going to ever cut it. Give me a text channel, give me sufficient incentive and time, and you’re cooked.</p>\n<p>Many games respond to this by not allowing open-ended chat, period, or heavily restricting what it takes to open such a channel. When I made the Emergents TCG, I was essentially informed by our legal department that no, you are not going to let your users chat with each other, you are not allowed to do that.</p>\n<p>Which really, really sucks. I’m totally with Baszucki that allowing communication adds a ton of value, that being social is important to the experience. I mean, look, it sure isn’t the quality of the games.</p>\n<p>Then Roose asks about responsibility coming with scale and then the Hindenburg report on Roblox where they said they were compromising child safety to report growth to investors (which of course they were, compromises are inevitable and not obviously bad, we’re talking price here) and things keep focusing on the safety issues at the expense of everything else, at which point Baszucki gets increasingly upset and things go off the rails and complains that he’d love to also talk about things other than content filtering at some point.</p>\n<p>Fundamentally, underneath him going on tilt, it seems like Baszucki’s core argument is that AI safety filtering is better than human filtering given how much human attention could reasonably be available. And I actually agree with that, so long as it escalates to a human when necessary.</p>\n<p>Oh, and then Baszucki brings up Polymarket unprompted, he’s rightfully a big fan but also then he gives a flat out yes to a intended-to-be-a-joke question about putting prediction markets inside Roblox via a Dress To Impress Predictor. So that was a lot of fun. Isaac King is right that <a href=\"https://x.com/ohabryka/status/1995732415218598106\">prediction markets for kids are a great idea</a> if you can find a way to avoid them devolving into gambling, that does not make it not funny.</p>\n\n\n<h4 class=\"wp-block-heading\">Sports Go Sports</h4>\n\n\n<p><a href=\"https://sethburn.wordpress.com/2025/11/29/schrodingers-two-point-conversion/\">Seth Burn breaks down the latest game in which an NFL team</a> would have benefited by going for 2 in order to adjust their behavior (in this case, the Eagles score a TD to go down 9 with 3:09 to go against the Bears). To maximize the probability of winning, the Eagles need to go for 2 right away, so they can onside kick if they fail, which overrides all the ways the Bears might use the information.</p>\n<p>That is true, but the gain in win probability is very low, whereas the amount of exciting football that is lost to the fans, in expectation, is rather high. From the perspective of the NFL or of the fans, I would want a convention that you kick the extra point here. I agree that <a href=\"https://thezvi.substack.com/p/you-play-to-win-the-game\">you play to win the game</a>, but it’s not to the exclusion of all other considerations, and the win probability difference here is very small, well under 1%. It’s fine to give some consideration to what is cool, to the fan experience, to various records, to health of players, to ‘the good of the game’ writ large and maintaining good norms.</p>\n<p>An easy way to see this is that near the end of basketball games, there is a point at which there is a non-zero chance that the team trailing could win if they started fouling, yet there is a convention that past some point they do not try, and that this convention is obviously a good thing. Whereas in the NCAA tournament that rule goes out the window and <a href=\"https://thezvi.substack.com/p/you-play-to-win-the-game\">you play to win the game</a>, and that too is good.</p>\n<p><a href=\"https://x.com/johnarnold/status/1989162570343936038\">University of Michigan athletics generated $266 million in revenue last year and still lost $15 million</a>, and that’s before they were on the hook for $20 million or more in payments to student-athletes, and also before the football coach got fired and arrested.</p>\n<p>What’s the actual business model? Sports drive alumni donations.</p>\n<blockquote><p>Geoff White: Donors gave nearly $900 million dollars to UofM in 2025. As an alum, I can state with 100% confidence those numbers would be substantially lower without athletics. The impact is far, far, far greater than $15mm, it is probably closer to $250mm. That is the real story.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Antisocial Media</h4>\n\n\n<p><a href=\"https://x.com/johnbourscheid/status/1992246055887650841\">Twitter made user</a> locations public, revealing that many supposedly accounts stoking the flames of toxic discourse were not American at all. At least many of them were foreigners in it for the engagement payments.</p>\n<p>Mostly all the ‘real’ accounts are who and where they said they were, many reported that <a href=\"https://x.com/yishan/status/1992893381949980940\">a bunch of accounts that got exposed vanished</a>, and mostly this was a big win. I didn’t notice a change, but I cultivate lists and block as needed so I’m not exposed to troll farms. Seems like a very good change overall.</p>\n<p>The one problem was that <a href=\"https://x.com/mpopv/status/1992652936351273456\">the location algorithm can be a little funky</a> in some cases.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!86Y4!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F10eddee2-8644-48d1-9ce5-ef8da76cb4f7_1200x771.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This led to some obviously real accounts joking about being put in the wrong place (such as Liv Boeree being put in the UK or Will Eden in Japan) and also some bad faith attacks in places where the origin was obviously glitched. As always, I noted who joined in such attacks and who did not.</p>\n<p><a href=\"https://x.com/politicalmath/status/1990994420435419435\">The rollout of the new Twitter ‘chat’ feature </a>has been a rather unmitigated disaster and it is rather dismaying that it was allowed to go forward. It frequently didn’t work, and even when it does work the whole thing is worse than what we had before, and I don’t see any benefits.</p>\n\n\n<h4 class=\"wp-block-heading\">Government Working</h4>\n\n\n<p><a href=\"https://www.gov.uk/government/news/taskforce-calls-for-radical-reset-of-nuclear-regulation-in-uk\">UK Taskforce calls for radical reset of nuclear regulation in UK</a>. I saw widespread praise for the whole of the recommendations here, and this was an opportunity to push for doing all of it, <a href=\"https://x.com/freddie_poser/status/1995831199252533609\">and it worked</a>, the PM has pledged to do exactly that.</p>\n<blockquote><p><a href=\"https://x.com/visegrad24/status/1993686110447247507\">Visegrad 24</a>: The European Parliament just voted in favor of banning social media for people under the age of 16.</p>\n<p>483 MEPs voted in favor while 92 voted against. If it becomes law, people will likely have to use IDs to log into their profiles, making anonymous accounts impossible.</p></blockquote>\n<p>The primary effect of this is to force tracking and verification of everyone’s identify online to the maximum extent possible. Which of course they know, and is why they voted for it.</p>\n<p>Over half the cost of hardware construction at Revoy and Charm Industrial <a href=\"https://rein.pk/over-regulation-is-doubling-the-cost\">is claimed to come from regulatory bottlenecks</a>. The post makes good points but I note the accounting seems creative, as in ‘you delayed my project a year so you imposed a societal burden equal to the per-year benefits of the project.’ That’s a real thing you can measure, but you have to keep it in its proper context.</p>\n<p><a href=\"https://www.thefp.com/p/tyler-cowen-why-humane-immigration-policy-ends-in-cruelty?utm_campaign=260347&amp;utm_source=cross-post&amp;r=18f0&amp;utm_medium=email\">Tyler Cowen says an important point out loud</a>, which is that every workable immigration policy offends liberal instincts, public opinion or both. I would argue that ultimately, no matter the path, it is both. All the options require doing something that profoundly sucks in both ways, in some combination of who is not allowed in, how we enforce who is not allowed in and how we treat those we let in.</p>\n<p>That still leaves many free wins available to us. We are miles away from the production possibilities frontier. High skilled and high value immigration is a win for everyone across the board, or can be with compensation as needed, no matter what else we ultimately choose to do, and a lot of the things we do right now are purely destructive and cruel, and we can stop. But yes, ultimately there are contradictions.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1994056898144850128\">Elon Musk used to talk about free speech</a>.</p>\n<blockquote><p>Elon Musk: Falsely labeling non-violent people as “fascist” or “Nazi” should be treated as incitement to murder.</p>\n<p>CNN (October 29, 2024): Trump calls Harris a fascist, says he is ‘the opposite of a Nazi.’</p></blockquote>\n<p>To guarantee objectivity I turned to Grok to ask if Elon Musk has ever done this. The answer is yes.</p>\n<blockquote><p>Zvi: has Elon Musk called any non-violent people ‘fascist’ or ‘nazis’?</p>\n<p>Grok: Yes, Elon Musk has referred to non-violent individuals and entities as “fascists” or drawn comparisons implying “Nazi” associations on multiple occasions. Here are some key examples based on documented instances:</p>\n<ul>\n<li>In September 2024, Musk labeled the Australian government “fascists” in response to proposed legislation that would fine social media platforms for failing to address misinformation. This was directed at the center-left government led by Prime Minister Anthony Albanese, who is not associated with violence.\n<p>He doubled down on the remark after Albanese criticized it, emphasizing his opposition to the bill’s potential impact on free speech.</li>\n<li>In February 2022, amid the Canadian trucker protests against COVID-19 restrictions, Musk posted (and later deleted) a meme likening Prime Minister Justin Trudeau to Adolf Hitler, implying a Nazi comparison. The meme read: “Stop comparing me to Justin Trudeau. I had a budget,” overlaid on a photo of Hitler.\n<p>In a related post, he stated: “If Canadian government is suppressing peaceful protests, that’s where fascism lies,” indirectly calling Trudeau’s administration fascist.</p>\n<p>Trudeau, a non-violent political leader, was the target of these remarks.</li>\n</ul>\n<p>These instances involve Musk criticizing government actions he views as authoritarian, but the individuals and groups referenced (e.g., elected officials and administrations) are not engaged in personal violence.</p>\n<p>Zvi: would you describe these instances as ‘falsely labeling’ those people?</p>\n<p>Grok: Yes, I would describe these instances as falsely labeling those people, as the terms “fascist” and “Nazi” (or direct comparisons to Hitler) carry specific historical and ideological connotations that do not accurately apply to the democratic governments and leaders in question. <noscript><div><i>Please view this post in your web browser to complete the quiz.</i></div></noscript>.</p></blockquote>\n<p>Curious.</p>\n\n\n<h4 class=\"wp-block-heading\">Variously Effective Altruism</h4>\n\n\n<p><a href=\"https://www.wsj.com/us-news/michael-dell-donates-6-25-billion-to-trump-accounts-for-children-5bbddf33?mod=trending_now_news_4\">Michael and Susan Dell donate $6.25 billion for ‘Trump accounts</a>’ for children (out of a net worth of about $148.5 billion), giving them $250 each.</p>\n<p>Look, no, good that he’s donating the money to kids at all, but this implementation is dumb, it doesn’t buy that much political goodwill and it isn’t a good use of the funds. This seems well behind the ‘make tuition free’ donations if you have to go this route.</p>\n\n\n<h4 class=\"wp-block-heading\">Party Time, Excellent</h4>\n\n\n<blockquote><p><a href=\"https://x.com/4HLsartorialist/status/1997432201768587739\">Postmanbloke</a>: House parties need to make a comeback.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!_ub5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0dff5a92-e297-4113-9c8e-c51a1d0c23e4_735x562.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/peterwildeford/status/1997735434039001230\">Peter Wildeford</a>: House parties exist! I met my girlfriend at a house party 2 years and 10 months ago <img alt=\"❤\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/2764.png\" style=\"height: 1em;\" /></p>\n<p><a href=\"https://x.com/allie__voss/status/1997474234676003132\">Allie</a>: Guys just have house parties. No one is stopping you.</p>\n<p>The fun thing is you do not need a house! I did this in my apartment.</p>\n<p>I think they often also mean they don’t have a social circle to begin with.</p>\n<p><a href=\"https://x.com/CartoonsHateHer/status/1997482170936676667\">Cartoons Hate Her!</a>: ACTUALLY something is stopping me: nobody fucking comes!!</p>\n<p>One problem here is irl I have zero “status” related to my career. Not that it explains nobody liking me, but people generally don’t know/care what CHH is, so I say im a writer and theyre thinking “oh, a loser”</p>\n<p>There are a lot of people from the Internet who would come to my house party if I invited them, but I specifically do not want them there.</p>\n<p><a href=\"https://x.com/tweetsbenedict/status/1997709533284852206\">Ben Hsieh</a>: ok i can finally post about my trauma trying to host events in LA where consistently 0-1 people showed and in one case the invitees did the same event just without me</p>\n<p>honestly felt like something was wrong with me until i moved back to NYC and started getting 20+ attendees again</p>\n<p>the actual nadir (well besides the rehosting thing) was somehow hosting a comped company happy hour where all 6 rsvpd coworkers ghosted including a designer i work with every day. honestly fuck LA never going back</p>\n<p>shoutout to the solo attendees tho, those guys were total bros about it every time <img alt=\"🫡\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1fae1.png\" style=\"height: 1em;\" /></p>\n<p>Jake Eaton: first holiday party in LA we invited (and cooked) for 20 people; 2 showed up. once we proposed doing formalwear at mel’s diner with friends. while we tried to find a date, we saw on instagram they did it without us. i still miss it all the time though</p>\n<p>Ben Hsieh: wow this is so validating to hear that it wasn’t just me. honestly i never felt like it was anything personal but just the unpredictable traffic and people being overly surface nice makes the flake rate insane. solidarity for hosts w/ flakey friends tho</p>\n<p><a href=\"https://x.com/drethelin/status/1997761929235108194\">Misha</a>: Party Expert here: most house parties are not in fact networking events based on your prestige or legible status. They’re outgrowths of friend groups, chance meetings, and public/semi-public events.</p>\n<p>There IS an unfortunate sort of catch-22 here which is if you’re locally socially disconnected your avenue for getting people to come to your parties / getting invited to parties is pretty constrained</p>\n<p>but there’s also a clear if effortful path to connection</p>\n<p>Another unfortunate thing about the process of making friends (or lovers or whatever) is that it’s necessarily kind of stochastic because it’s hard to know if you’ll get along with someone before you interact. Even correct purposeful behavior will only be intermittently rewarded.</p></blockquote>\n<p>I would attend a house party by Cartoons Hate Her! if it was local, but then I am probably one of those internet people she doesn’t want to come.</p>\n\n\n<h4 class=\"wp-block-heading\">Waste, Fraud, Abuse But Mostly No One Looked</h4>\n\n\n<p>Lots of businesses actually have no idea how they make or lose money, and have huge room for improvement. There’s a reason Private Equity exists.</p>\n<blockquote><p><a href=\"https://x.com/AlecStapp/status/1927531599689601232\">Alec Stapp</a> (describing Rob Henderson):</p>\n<p>&gt; <a href=\"https://www.henrikkarlsson.xyz/i/151598106/most-people-are-not-serious\">hired to work in art gallery café</a></p>\n<p>&gt; get bored making coffee</p>\n<p>&gt; decide to look at the books</p>\n<p>&gt; discover 2 of 3 “income sources” are actually cost centers</p>\n<p>&gt; convince board to pivot business model</p>\n<p>&gt; revenue up 311%</p>\n<p>Zac Hill: This is exactly what led my wife to opening her own nail salon: she literally spent one day looking at the accounting of a well-regarded high end DC franchise while bored working at the front desk, and was just like “…wait, what? no.”</p>\n<p>Leah Libresco Sargeant: Experiences like this help drive the “surely the problem is waste fraud and abuse” attitude @rSanti97’s been talking about elsewhere on Here</p>\n<p>See also: the movie Dave where they fix the federal budget this way.</p></blockquote>\n<p>I had one job where I didn’t realize I wasn’t supposed to be doing this so I went ahead and did it. I believe the impact was similar, but after a while rather than let me transition into running the place those that did run it told me to stop, at one point even saying ‘the time of heroes is over.’ I didn’t stay that much longer after that.</p>\n\n\n<h4 class=\"wp-block-heading\">How You Do Anything</h4>\n\n\n<p><a href=\"https://x.com/robinhanson/status/1977740479656493364\">Entering into</a> <a href=\"https://www.nber.org/papers/w34346\">a romantic relationship with a manager is associated with raising your earnings by 6%</a>, but breaking up predicts an abrupt 18% earnings decline, and retention of other workers declines by 6%.</p>\n<p>I am being more careful about wording than the paper abstract, because while obviously some of this is causal, I don’t believe we can assume most or all of this is causal. There are also other mechanisms in play, such as higher performers that are already on good terms with the boss (and thus more likely to get raises) more often entering such relationships, and breakups happening for reasons.</p>\n<p>What this does conclude is that as the subordinate, if you are not prepared to seek alternative employment then you should tread lightly and only do this if you see a real future together, since if you break up you face a net loss of 13% of earnings and probably a much bigger loss in terms of other aspects of the work experience.</p>\n<p><a href=\"https://x.com/robinhanson/status/1977739919524044968\">Similarly, as a manager</a>, <a href=\"https://www.nber.org/papers/w34362\">beware small slights</a> and set those birthday reminders.</p>\n<blockquote><p>We study what appears to be a very minor workplace mistreatment—failing to deliver an expected birthday gift and greeting card on time—and examine its effect on subsequent employee performance. Using a dynamic difference-in-differences approach with detailed data from a national retail chain, we find that this small slight leads to over a 50% increase in employee absenteeism and a reduction of more than two working hours per month.</p></blockquote>\n<p>Again I would be cautious with potential common cause concerns, but yeah people take such things personally, as anyone who has seen shows like The Office or worked in an actual typical office will know.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/12/monthly-roundup-37-december-2026/",
            "publishedAt": "2025-12-12",
            "source": "TheZvi",
            "summary": "I’m doing the Monthly Roundup early this month so that next week can be GPT-5.2 and affordability of life week, assuming we are not overtaken by other events. Ban Gain of Function Research The risk-reward profile of creating highly dangerous &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/12/monthly-roundup-37-december-2026/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Monthly Roundup #37: December 2026"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3180/",
            "publishedAt": "2025-12-12",
            "source": "XKCD",
            "summary": "<img alt=\"The experimental math department's budget is under scrutiny for how much they've been spending on trains leaving Chicago at 9:00pm traveling at 45 mph.\" src=\"https://imgs.xkcd.com/comics/apples.png\" title=\"The experimental math department's budget is under scrutiny for how much they've been spending on trains leaving Chicago at 9:00pm traveling at 45 mph.\" />",
            "title": "Apples"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/settings-ui",
            "publishedAt": "2025-12-12",
            "source": "Zed Blog",
            "summary": "Behind-the-scenes peek at all the required work to expose a myriad of Zed's settings in a UI.",
            "title": "How We Rebuilt Settings in Zed"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-12"
}