{
    "articles": [
        {
            "content": [],
            "link": "http://journal.stuffwithstuff.com/2025/05/30/consider-knitting/",
            "publishedAt": "2025-05-30",
            "source": "Robert Nystrom",
            "summary": "<p>Let&rsquo;s say that, like me, you are a person who stares at a computer and writes code for a living. As a straight male who grew up in a time where knitting was very strongly female coded, it for the most part never occurred to me that knitting was a thing I could do and might enjoy. Regardless of your demographic categories and background, it&rsquo;s possible that you have also not really considered knitting.</p> <p>This article exists to get you to do so. Specifically, I&rsquo;ll try to convince you, one software person to another, why it might be a good fit for your life and brain. This is a pitch for knitting, but&mdash;for better or worse&mdash;an extremely nerdily argued one.</p> <p>Before I start, note that when I say &ldquo;knitting&rdquo;, you can read that as any of the various <a href=\"https://en.wikipedia.org/wiki/Fiber_art\">fiber arts</a>, including crochet, weaving, macramé, cross-stitch, etc. I talk about knitting here because that&rsquo;s the one closest to my heart and I strive to speak from the heart. You can make stuff out of string however you want. We are all fiber friends.</p> <h2>The sense of touch</h2> <p>I love the aesthetics of programming. Sitting in a cool quiet room, techno",
            "title": "Consider Knitting"
        },
        {
            "content": [
                "<p>By living in our world, we collect intuitions on how the physical stuff around us behaves, and on the most practical ways to do particular things. Like fry an egg, bounce a basketball, carry a couch, stay level on bouncing platform, or get a door unstuck. These intuitions come with a sense of their generality, and many of them you feel pretty confident that your intuitions are pretty general. They feel like the best way to do a thing in 99%+ of relevant situations in which humans today find themselves.</p><p>But of course our universe is vast, and the physical context in most of that universe is quite different from our usual human contexts in terms of temperature, pressure, acidity, vibrations, radiation, etc. Thus many of these 99%+ reliable general ways to do physical things among humans today likely also fail in 99%+ of the physical environments out there in the universe. Which is to say that our physical intuitions are context dependent; they were developed in a context, and may be reliable there, but not necessarily far outside of it.</p><p>Living in our world also gives us moral intuitions, about the best ways to treat other people. And through most of human history, these intuitions were also plausibly mostly about practicality: what ways to treat each other work well, and are adaptive, for individuals and their communities.</p><p>We are also often confident that our moral intuitions are pretty general, and indicate the best ways to treat people in 99%+ of related situations that we have seen. And while we do have incentives to exaggerate that confidence, to signal loyalty to our associates, we are also plausibly often right about such judgments.</p><p>However, few of us have seen more than a tiny fraction of all the social situations that humanity has ever seen. And relative to all the social situations that our descendants may yet see, the fraction is likely far smaller. Thus few of our moral intuitions can be anything like fully general, working consistently well across the vast space of possible social worlds. Yet many mistakenly talk and act as if their intuitions were that general.</p><p>For example, many say it could never be moral to enslave human-like minds. (Prison and the draft don&#8217;t count as &#8220;slavery&#8221; to many.) But war was endemic to the ancient world, and war winners there faced a hard choice: if freed, those who they conquered might well seek revenge. The safer options were to kill or enslave the vanquished, and of those slavery seems the most humane option. Thus slavery seems a sensible way to treat those you defeated in war in the ancient world. (In polls, folks say 5-1 <a href=\"https://x.com/robinhanson/status/1927182811116544179\">that</a> ancients didn&#8217;t know &#8220;in their hearts&#8221; that slavery is immoral, and 5-2 <a href=\"https://x.com/robinhanson/status/1927192246861840816\">that</a> we don&#8217;t know arguments that would have persuaded smart ancients of this.) </p><p>As another example, many say that murder is generally immoral (even if they allow exceptions for war and justice). But my book <em><a href=\"http://ageofem.com\">Age of Em</a></em> describes in great detail a possible future world wherein the dominant minds usually suffer little when a single copy of them is &#8220;killed&#8221;. They don&#8217;t feel physical pain unless they choose to, and archive copies are made of their minds every subjective five minutes. Most mind copies are only a few hours old, and will be erased within a few hours. Unexpectedly erasing such a copy is only a minor inconvenience, analogous to stepping on someone&#8217;s toes, or farting nearby for us, minor harms that don&#8217;t rise to the level of moral violations.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/intuitions-have-context",
            "publishedAt": "2025-05-30",
            "source": "Robin Hanson",
            "summary": "By living in our world, we collect intuitions on how the physical stuff around us behaves, and on the most practical ways to do particular things.",
            "title": "Intuitions Have Context"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/May/30/ai-and-jobs-with-natasha-zouves/#atom-entries",
            "publishedAt": "2025-05-30",
            "source": "Simon Willison",
            "summary": "<p>I was interviewed by News Nation's Natasha Zouves about the very complicated topic of how we should think about AI in terms of threatening our jobs and careers. I previously talked with Natasha two years ago <a href=\"https://simonwillison.net/2023/Feb/19/live-tv/\">about Microsoft Bing</a>.</p> <p>I'll be honest: I was nervous about this one. I'm not an economist and I didn't feel confident talking about this topic!</p> <p>I do find the challenge of making recent advances in AI and LLMs accessible to a general audience absolutely fascinating though, so I took the risk and agreed to the interview.</p> <p>I think it came out very well. The full hour long video is now available <a href=\"https://www.youtube.com/watch?v=RIvIpILrNXE\">on the News Nation YouTube channel</a>, or as an audio podcast <a href=\"https://podcasts.apple.com/us/podcast/the-truth-of-the-matter-with-natasha-zouves/id1804707066?i=1000709421307\">on iTunes</a> or <a href=\"https://open.spotify.com/episode/5M4DGPfmPqD8mgK3o2K0uj?si=PR4h9EL6TDCrRHZ9NKXFfQ\">on Spotify</a>.</p> <p> </p> <p>I made my own transcript of the video (using <a href=\"https://goodsnooze.gumroad.com/l/macwhisper\">MacWhisper</a>) and fed it into the new Claude Opus 4 model to see if it could do a good job of turning that into an outline of the episode, with links to segments, short summaries and illustrative quotes. It did such a good job that I'm including it here on my blog - I <em>very rarely</em> publish AI-produced text of this",
            "title": "Talking AI and jobs with Natasha Zouves for News Nation"
        },
        {
            "content": [
                "<p><em>[<strong>Editor&#8217;s note:</strong> I accept guest posts from certain people, especially past Book Review Contest winners. Brandon Hendrickson, whose<a href=\"https://www.astralcodexten.com/p/your-book-review-the-educated-mind\"> review of The Educated Mind</a> won the 2023 contest, has taken me up on this and submitted this essay. He writes at<a href=\"https://losttools.substack.com\"> The Lost Tools of Learning</a> and will be at <a href=\"https://less.online/\">LessOnline</a> this weekend, where he and Jack Despain Zhou aka TracingWoodgrains will be doing a live conversation about education.]</em></p><p>I began my<a href=\"https://www.astralcodexten.com/p/your-book-review-the-educated-mind\"> book review</a> of a couple years back with a rather simple question:</p><blockquote><p>Could a new kind of school make the world rational?</p></blockquote><p>What followed, however, was a sprawling distillation of one scholar&#8217;s answer that I believe <em>still </em>qualifies as &#8220;the longest thing anyone has submitted for an ACX contest&#8221;. Since then I&#8217;ve been diving into particulars, exploring how we use the insights I learned while writing it to start re-enchanting all the academic subjects from kindergarten to high school. But in the fun of all that, I fear I&#8217;ve lost touch with that original question. How, even in theory, could a method of education help all students become rational?</p><p>It probably won&#8217;t surprise you that I think part of the answer is Bayes&#8217; theorem. But the equation is famously prickly and off-putting:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb5394ddc-62f2-40f2-a206-7534c8516951_1356x295.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"295\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb5394ddc-62f2-40f2-a206-7534c8516951_1356x295.jpeg\" width=\"1356\" /><div></div></div></a></figure></div><p>Over the years quite a few folks have attempted to explain it clearly. Eliezer wrote<a href=\"https://www.lesswrong.com/posts/XTXWPQSEgoMkAupKt/an-intuitive-explanation-of-bayes-s-theorem\"> his famous essay back in 2003</a> (which Khalid Azad<a href=\"https://betterexplained.com/articles/an-intuitive-and-short-explanation-of-bayes-theorem/\"> helpfully summarized in 2007</a>), Scott&#8217;s written about it a number of times, Steven Pinker takes a whack at it in<a href=\"http://www.amazon.com/Rationality-What-Seems-Scarce-Matters/dp/0525561994\"> </a><em><a href=\"http://www.amazon.com/Rationality-What-Seems-Scarce-Matters/dp/0525561994\">Rationality</a></em>, Julia Galef<a href=\"https://youtu.be/NEqHML98RgU\"> speaks about it on BigThink</a>, and so on and so forth. Recently, there&#8217;s even been<a href=\"http://amazon.com/Bayesian-Probability-Babies-Chris-Ferrie/dp/1492680796\"> a book explaining Bayes to babies</a>. Bayesianism has become quite a racket!</p><p>I&#8217;ll be honest: I&#8217;ve learned something from each of these, but I think we can do even better. Specifically, I think that by using the paradigm I introduced in that book review &#8212; that of the recently-deceased philosopher Kieran Egan &#8212; we can make understanding <em>and enjoying </em>Bayes&#8217; theorem a perfectly normal thing not just for quantitative geeks, but for more-or-less everyone. I&#8217;ve recently begun to test this out, and thought others might benefit from seeing what I&#8217;ve learned.</p><h2>1: Ed philosophy on one foot</h2><p>Your mind isn&#8217;t a general-purpose learning engine. Perhaps that sounds obvious to you, but among educators, I promise it&#8217;s not: I still hear teachers say that we know<em> </em>everyone can learn math on their own &#8220;because didn&#8217;t they learn <em>language itself </em>when they were <em>babies</em>?!&#8221;; I still hear people treat all learning as if it&#8217;s just facts on a forgetting curve.</p><p>Your mind, rather, is a Swiss Army knife &#8212; an assortment of oddball capacities kludged together over our long evolutionary history. In my book review, I showed how Kieran Egan found it useful to think of those tools being in five boxes:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8c32b877-a176-4822-9a4f-90ffc1461e01_1456x795.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"795\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8c32b877-a176-4822-9a4f-90ffc1461e01_1456x795.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>And <em>wow</em>, that&#8217;s still <em>way</em> too complicated to easily grok. Two years later, can I do better? I think so.</p><p>Nowadays, I had to explain Egan while standing on one foot, I&#8217;d say something like this:</p><p>&#8220;We have old tools, and new tools. Join them together to help students fall in love with the world.&#8221;</p><p>There&#8217;s a lot <em>wrong</em> about that summary<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a>, but it&#8217;s at least a place to begin. The &#8220;new tools&#8221; are the ones created in the last couple thousand years, like <em>careful concepts</em>, <em>finicky definitions</em>, <em>the scientific method</em>, <em>analysis</em> &amp; <em>synthesis</em>, and <em>the quantification of everything</em>. We here in the rationalist community <em>love </em>these things. Inculcating students in them is what much of the academic curriculum was built to do.</p><p>The &#8220;old tools&#8221;, meanwhile, are a motley bunch. Some have emerged through the tens of millennia of cultural evolution &#8212; <em>stories</em>, <em>metaphors</em>, <em>rhyme &amp; rhythm</em>, <em>jokes</em>, and <em>simple counting</em>. Others are much, much older, coming out of our biological evolution &#8212; like our <em>bodily senses</em>, our capacity for <em>mental imagery</em>, <em>gestures</em>, <em>mimicry</em>, and <em>personification</em>.</p><p>These two toolsets create a chasm between how people today understand and live in the world. This is something that I suspect we all recognize: the old tools give us a way of understanding that&#8217;s embodied, narrative, and qualitative; the new ones give us one that&#8217;s abstracted, logical, and quantitative.</p><p>If this sounds like some sort of esoteric, speculative division, I&#8217;m doing a bad job explaining it. I mean to gesture at an idea that smart people have been pointing at for centuries. It&#8217;s at least <em>similar </em>to Nietzsche&#8217;s &#8220;Dionysian&#8221; vs. &#8220;Apollonian&#8221; modes, and to Claude L&#233;vi-Strauss&#8217;s &#8220;the bricoleur&#8221; vs. &#8220;the engineer&#8221;, and to Alasdair MacIntyre&#8217;s critique of modernity. It&#8217;s near the heart of what Iain McGilchrist is describing in <em>The Master and His Emissary</em>. I <em>think </em>it&#8217;s the same thing as Erik Hoel&#8217;s &#8220;intrinsic&#8221; vs. &#8220;extrinsic&#8221; perspectives? It overlaps a lot with Kahneman&#8217;s &#8220;System 1&#8221; and &#8220;System 2&#8221; and with Jonathan Haidt&#8217;s &#8220;the elephant&#8221; and &#8220;the rider&#8221;. Heck, the lack of clarity on this divide is what makes Jordan Peterson&#8217;s dialogues with atheists so frustrating.</p><p>Anyhow, if we want to Eganize Bayes&#8217; theorem, what we need to remember is that while the new tools have precision, the old tools have power. If we see Bayes&#8217; theorem as one of the peaks of the new way of understanding, the question becomes, how can we use the old tools to secure Bayes in kids&#8217; minds?</p><p>Anyhow, I&#8217;ve been working at this problem for a while. So far, I&#8217;ve come up with four ways to do it: make Bayes <em>visual</em> and <em>intuitive</em>, then make it <em>vital</em>, then make it <em>obsolete</em>.</p><h2>2: Make it <em>visual</em> by turning equations into images</h2><p>The boring ol&#8217; way to explain Bayes, of course, is through an equation like the one above&#8230; and doing a Google image search for &#8220;Bayes&#8217; theorem&#8221; overwhelmingly pulls up more examples of that than anything else.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F32ddffe0-49c5-41d4-890d-c6143af20148_1456x1014.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1014\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F32ddffe0-49c5-41d4-890d-c6143af20148_1456x1014.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>It should go without saying that this <em>isn&#8217;t </em>the best way to teach this to the median middle schooler. Equations in general don&#8217;t come easily to most of us: recall that for the majority of our species&#8217; existence, most people probably haven&#8217;t been able to count to ten. Worse, this equation doesn&#8217;t feature anything so simple as &#8220;a number&#8221; &#8212; instead it&#8217;s filled with wonky-looking variables with their own names and definitions that themselves need to be explained. For example:</p><blockquote><p>P(B|A) is called the &#8220;likelihood&#8221;, and is the probability that the evidence is true, given that your hypothesis is true.</p></blockquote><p><em>Blech</em>. I&#8217;m not quite &#8220;innumerate&#8221; &#8212; once upon a time I scored an 800 on the quantitative section of my GRE &#8212; but when I typed in that definition a moment ago I literally felt my stomach lurch. If we want to pull normies in, we&#8217;ve gotta find some old tool that&#8217;s able to do some heavy lifting.</p><p>Images can do this. We shouldn&#8217;t be surprised: our pre-vertebrate ancestors evolved to see stuff, and to this day a substantial portion of our cortices is devoted to processing what our eyes take in. If we can find a way to represent this visually, we can sidestep this problem. And indeed on LessWrong, there&#8217;s<a href=\"https://www.lesswrong.com/posts/CMt3ijXYuCynhPWXa/bayes-theorem-illustrated-my-way\"> an explanation that uses blobs, triangles, and pentagons</a>; another person has built one<a href=\"https://oscarbonilla.com/2009/05/visualizing-bayes-theorem/\"> out of Venn diagrams</a>. My tastes, though, skew toward the simple, and I prefer the visualization created by the YouTuber 3Blue1Brown<a href=\"https://youtu.be/HZGCoVF3YvM\"> in a video that sets a new standard for elegance in explanation</a>:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5bb78d10-01dd-46e6-abbe-d2e37d304b94_1456x1092.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1092\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5bb78d10-01dd-46e6-abbe-d2e37d304b94_1456x1092.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Let&#8217;s use a toy example to explain how this pretty picture works.</p><p>You&#8217;re lounging at the park, when you see a football being thrown out from a bush. The throw, you startle to see, is an utterly <em>perfect</em> spiral. Is the thrower a professional? Your dad&#8217;s a big football fan, and you suspect he&#8217;d be <em>very </em>impressed if you got an NFL player to autograph your face with the Sharpie marker you happen to have in your pocket. Alas, you&#8217;re too introverted to ask them, so you ask me to do it for you. I do, and I tell you that the person in the bush is <em>either </em>an NFL player <em>or </em>a math teacher. So what&#8217;s more likely &#8212; that an NFL player is hiding there, or a math teacher?</p><p>If you&#8217;re thinking carefully, you might note that some math teachers moonlight as football coaches: you guess that just 1% could throw a perfect spiral. If you&#8217;re thinking <em>very </em>carefully (or you&#8217;re just a trained Bayesian), you try to guess what the base rate is. How many NFL players are there in your area, and how many math teachers? A minute&#8217;s Googling tells you there your country has about 1,500 NFL players and 1,500,000 math teachers.</p><p>What are the odds it&#8217;s an NFL player? Draw a square. Sketch in the base (or prior) at the bottom &#8212; 1.5 thousand NFL players and 1.5 million math teachers.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4b0187b8-e3bd-4059-8b8e-5f0e5ca8aadb_1456x892.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"892\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4b0187b8-e3bd-4059-8b8e-5f0e5ca8aadb_1456x892.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Then sketch in the likelihoods: 100% and 1%.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff7baa3a3-2b3f-4bda-90b3-ac320359adf9_1456x892.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"892\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff7baa3a3-2b3f-4bda-90b3-ac320359adf9_1456x892.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Then do the multiplication, and find that while there are indeed 1,500 NFL players in the country that could have thrown that ball, there are still far more math teachers &#8212; 15,000 &#8212; who could have thrown it!</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F558b806a-1c85-4901-84b4-35f6b4b7be06_1456x892.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"892\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F558b806a-1c85-4901-84b4-35f6b4b7be06_1456x892.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>If you&#8217;d like to find the new probability there&#8217;s an NFL player in that bush, just divide the shaded NFL players by <em>all</em> the shaded folks.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1bbab9d0-5490-4da2-9bf0-c032abd60f4c_1456x892.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"892\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1bbab9d0-5490-4da2-9bf0-c032abd60f4c_1456x892.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h5>Imaginary Interlocutor: You&#8217;re suggesting we dumb Bayes&#8217; theorem down, then?</h5><p>Not at all &#8212; mathematically, they&#8217;re equivalent! In working through the problem visually, you do every single step that the equation does. There may be practical or aesthetic reasons someone might prefer working with the equation, but don&#8217;t forget<a href=\"https://www.lesswrong.com/w/twelfth-virtue-the\"> what the purpose of the sword is</a>.</p><h2>3: Make it <em>intuitive</em> by tying abstractions to an emotional binary</h2><p>Happily, this method seems to be taking off in our community. (See, for example, the second half of<a href=\"https://youtu.be/4hHA-oqpNig\"> this Rational Animations video</a>.<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-2\" id=\"footnote-anchor-2\" target=\"_self\">2</a>) But we can make it even more intuitive by drawing deeper from our evolutionary inheritance: before our ancestors could see, before they had cortices on which to represent the world around them, they had to answer an even simpler question: &#8220;is this place <em>good</em> or <em>bad</em>?&#8221; (Squint, and you&#8217;ll see the last three billion years of evolution as a series of attempts to answer that question with ever-greater precision.) This is the fundamental emotional binary. Value judgments, by necessity, seem to go all the way back to those crazy days when we were all archaebacteria.</p><p>This seems like one of those facts about the world that should be very important to philosophers, but how can we exploit this educationally? Simple: connect it to the abstractions of the Bayes box. Let&#8217;s be lazy, and call green &#8220;good&#8221; and red &#8220;bad&#8221;:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe78051b8-595a-4ee5-b2fd-a60366665db9_1456x892.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"892\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe78051b8-595a-4ee5-b2fd-a60366665db9_1456x892.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h5>I.I.: What about people who are red-green colorblind?</h5><p>Use whatever you&#8217;d like! Obviously, there&#8217;s nothing &#8220;good&#8221; about green, or &#8220;bad&#8221; about red. They&#8217;re cultural symbols &#8212; if you have a color pair that screams &#8220;good&#8221; and &#8220;bad&#8221; to you, use that instead. That said, if you&#8217;re using this to teach a class, you might want to lean into another emotional binary: empty/substantial. The first prior that we scribble down is usually going to be the one we&#8217;re hoping for (in this case, that it&#8217;s an NFL player). Make that more substantial by shading it as bolder. The second prior, make lighter:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7718a2e8-b97e-4520-8c71-c2fd8f2d2192_1456x892.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"892\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7718a2e8-b97e-4520-8c71-c2fd8f2d2192_1456x892.jpeg\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>So far, so good, but we haven&#8217;t left the realm of &#8220;teaching hacks&#8221;. I&#8217;ve found that this is one of the fail states when I introduce folks to Egan education &#8212; they mistake it for just another entry in the growing world of cog-sci-infused educational traditionalism.<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-3\" id=\"footnote-anchor-3\" target=\"_self\">3</a></p><p>We care, of course, that Bayes is taught clearly to students &#8212; but we don&#8217;t want it to become for our students just another one of those &#8220;things I got an &#8216;A&#8217; on and then never thought about again&#8221;. We want to infect students with the zeal of Bayesian thinking. We want it to upend the way they live in the world, and think about life, the universe, and everything. We want to make it <em>matter </em>to them.</p><p>This, I only recognized after writing that book review, is the unspoken assumption of Egan education. The matter with schooling is that too often, schooling doesn&#8217;t matter. The academic curriculum is filled with fossils &#8212; bizarre forms that once seem to have been alive and kicking but which now are just odd rocks. We want to make them come alive again. The promise of doing so is that when things emotionally matter to students, they will (by definition?) pay attention, work hard, and remember more.</p><p>So: how can we make Bayes matter to kids?</p><h2>4: Make it <em>vital</em> by asking why people cared about it in the first place</h2><p>Let&#8217;s look at the examples that the explanations use. The classic example (which is used by Eliezer, and which has a long history in conversations about Bayesianism) is mammograms &#8212; obviously, pretty far away from the concerns of most middle schoolers. The Bayes baby book does better, asking whether a random candy-less bite of a cookie is more likely to have been taken out of a cookie that has no candy pieces at all, or from one which has a few. Everyone loves candy, so this is <em>sort </em>of relevant [footnote: My two-year-old particularly loves this book, by the way, though she screams &#8220;BALL!&#8221; when she sees the colored candy pieces.], but it doesn&#8217;t exactly grab the emotions.</p><h5>I.I.: Should we make the examples fun, then?</h5><p><em>Eh.</em> You&#8217;d think that as someone whose teaching style could be described as &#8220;wacky&#8221; and &#8220;manic&#8221; and &#8220;unhinged&#8221;, I&#8217;d be in favor of more silliness in schools. I suppose I am, but it&#8217;s important to note that &#8220;fun&#8221; by itself is unsubstantial. Education is a serious pursuit; souls are on the line.</p><h5>I.I.: Then is it &#8220;relevancy&#8221; we need? (How <em>could </em>we make Bayesian reasoning relevant to middle schoolers&#8217; everyday lives?)</h5><p>Making what we teach relevant is essential &#8212; but be very careful about the assumptions packed into words like &#8220;relevant&#8221;, &#8220;useful&#8221;, and &#8220;practical&#8221;. When most of us hear those, we start thinking about the externals of our students&#8217; lives. (How will this help them get a job? How will this help them become socially savvy?) Pause to consider how some of the most boring topics you learned in school were precisely those that were supposed to be &#8220;useful&#8221;. Here be dragons!</p><p>Consider, instead, just how irrelevant, useless, and impractical many of the things were that you threw yourself into when you were that age. Running a D&amp;D campaign? Modding <em>Half-Life</em>? Learning Photoshop? Designing a fictional language? The real concerns of people run much deeper than what we&#8217;re likely to think of when we try to make something &#8220;relevant&#8221;.</p><p>Egan suggests a more helpful tact: <em>look at where the skill came from</em>. Who first created it?</p><h5>I.I.: I&#8217;ve looked deeply into the life and times of the Reverend and Learned Thomas Bayes, Master of Arts, Fellow of the Royal Society, and I&#8217;ve come up with nothing.</h5><p>Then look at who developed Bayesianism further. What community championed it? What sorts of things were driving them? Dear reader, we are that community! And why did we throw ourselves into Bayesian reasoning so fully? Certainly different people can give different answers, but my understanding is that many of us got interested in order to win online arguments against morons. My own start wasn&#8217;t particularly &#8220;relevant&#8221; to anything else I was doing: I got into Bayes to debate the historicity of Jesus. The people I see using it the most these days are mostly partisans (on both sides) of the God wars.</p><p>Presumably &#8220;does God exist?&#8221; is too spicy a vehicle for carrying Bayes into most schools, but that&#8217;s fine. We don&#8217;t need to emulate the specifics; we want to identify what more general psychological itches those fights were scratching. My read on this is that it&#8217;s about worldviews. In middle school, a lot of kids begin to wake up from the simplistic understandings of the universe they were told as a child: what&#8217;s really going on, and how can I show the world that those fools who disagree with me are wrong?</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F94f244ee-ec26-4217-945e-534d30a884ac_601x659.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"659\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F94f244ee-ec26-4217-945e-534d30a884ac_601x659.png\" width=\"601\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Randall Munroe,<a href=\"https://xkcd.com/386/\"> https://xkcd.com/386/</a></p><p>A lot of the kids who I work with (not a representative sample: they skew toward the gifted and hyperactive sides of the spectrums) are fascinated by cryptids, UFOs, and psychic phenomena. So for them, I&#8217;ve been crafting courses that teach Bayes as a way to get clear on that stuff.</p><h5>I.I.: That&#8217;s pseudoscientific schlock &#8212; you can&#8217;t teach that in school!</h5><p>You can&#8217;t teach it, but you can explore it. (And it&#8217;ll elicit far fewer emails to the principal than evaluating the existence of God.)</p><h5>I.I.: What I meant to say was please <em>don&#8217;t </em>teach pseudoscientific schlock in schools. Instead, use Bayes to teach what&#8217;s <em>actually </em>important.</h5><p>Please don&#8217;t refuse to take children seriously. My probability for Bigfoot is way under 1%, but when we assume an answer to (for example) whether Bigfoot is real and simply repeat it to kids, we deny them an opportunity ripe for sharpening their intellects.</p><h5>I.I.: But cryptids are so low-brow&#8230;</h5><p>A sign of how deeply appealing they are for multitudes of people! Things like this are a road to intellectualism for the masses; we ignore it to the detriment of some of the kids who need it most. Even the cretin who bullied me in sixth grade was, in his spare time, trying to understand the world. Heck, we&#8217;re all naturally drawn to understanding the edges of things. Where does fact end and fiction begin? There&#8217;s a reason the History Channel inevitably morphed into the &#8220;ancient aliens&#8221; channel.</p><p>Taking this seriously is how I came up with<a href=\"https://www.scienceisweird.com/believe-it-or-not\"> a set of online summer camps</a>. The weeklong course last year used Bigfoot to get kids to experience using Bayes theorem. The one from this summer will deepen that by looking at claims of sea monsters. Year 3&#8217;s will extend this, asking when we should trust the media on <s>UFOs</s> UAPs. Year 4&#8217;s will hold a bright light up to academic, peer-reviewed sources by looking closely into the evidence for psychic powers, and year 5&#8217;s will try to suss out the edges of science itself by looking into the evidence for ghosts. Whatever else these summer camps accomplish, I hope they&#8217;ll prepare my students for whatever dubious assertions they run across on YouTube.</p><h2>5: Repeat it until it&#8217;s obsolete</h2><p>I&#8217;ve spread my classes across multiple summers not (merely) because I&#8217;m lazy, but because it&#8217;s useful to keep working on the theorem across multiple years. Because we can&#8217;t ignore the fact that &#8220;computing the Bayesian probabilities&#8221; isn&#8217;t actually a silver bullet to rationality. Most of us know people who&#8217;ve earnestly used Bayes to &#8220;prove&#8221; things that are <em>straight-up insane</em>. As<a href=\"https://www.scienceisweird.com/team#page-section-618b3c4218954a209b40f042\"> my science advisor</a> warned me when I was deciding whether to make these courses:</p><blockquote><p>Bayesian reasoning can become confirmation bias on steroids. You have to be humble in your analysis, because there are SO MANY DIFFERENT WAYS IT CAN GO WRONG.</p></blockquote><p>There really are so, so many ways it can go wrong. And the kids need to make each and every one of them.</p><h5>I.I.: Because repetition builds mastery, right?</h5><p>Yes, but then we want to build <em>past </em>mastery. &#8220;Mastery&#8221; has become something of a buzzword lately, but something that&#8217;s been forgotten in our love of deliberate practice is that the journey to becoming educated is harder and longer than just mastering a set of skills. It requires being able to stick your head out of the Matrix and ask, &#8220;wait, how useful is this stuff, actually?&#8221; We want to help kids get so good with drawing Bayes boxes that they realize they&#8217;ll <em>never </em>be perfect at it&#8230; and that their best hope for becoming rational is to reason together with people they disagree with.</p><h5><em>I.I.</em>: Is it even useful to teach middle schoolers to literally crunch these numbers? Shouldn&#8217;t we teach &#8220;<a href=\"http://amazon.com/Scout-Mindset-Perils-Defensive-Thinking/dp/0735217556\">scout mindset</a>&#8221; first?</h5><p>Indeed, this is the question &#8212; scouting first, or Bayes Boxes?</p><p>I used to think that formally learning Bayes&#8217; theorem was difficult and better saved to the end of learning rationality. Now I see things differently &#8212; though not because I think we should expect kids to sit down and do the math on their own, in their everyday lives. (Do any of us actually do that?<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-4\" id=\"footnote-anchor-4\" target=\"_self\">4</a>) I think once we make it <em>easy </em>&#8212; and the math really is easy, once you explain it visually and do it a couple times &#8212; then we should teach Bayes first, because&#8230;</p><p>Bayes is a great excuse to think with other people.</p><p>Drawing little rectangles is a great way to see where you disagree with somebody. You think aliens have infiltrated the world&#8217;s governments? Cool! Let&#8217;s talk priors, and see where we draw our vertical lines. You think you saw a ghost, and now it&#8217;s rocked your worldview? Let&#8217;s talk about how strongly we should update from personal experience. Get a napkin &#8212; let&#8217;s draw some cute boxes.</p><p>This, I think, is actually the deepest value of teaching kids Bayes: it&#8217;s a way to get them to converse with people whose views they think are stupid. And it&#8217;s only through <em>actually doing that </em>that we have any chance of helping people become rational. Such conversations (done with checking each other&#8217;s math) are the way to inculcate an openness to being wrong, a detached self-worth, comfort with uncertainty, and all the other aspects of what Julia Galef has so winsomely dubbed scout mindset. Approached this way, Bayes isn&#8217;t the weirdo, quant-y capstone to scout mindset &#8212; it&#8217;s the publicly-accessible front door.</p><h2>6: Where are we, now?</h2><h5><em>I.I.</em>: You claim to be promoting something new, but it seems to me like you&#8217;re just describing the rationalist community.</h5><p>Indeed I am! My claim wasn&#8217;t that this method of explaining Bayes goes beyond what&#8217;s practiced in the community &#8212; just that it&#8217;s likely to do a better job pulling kids into the sorts of intense, curiosity-fueled relationships that our community excels at.</p><p>And I think this is something worth working hard to achieve.<a href=\"http://amazon.com/Why-Ancient-Greeks-Matter-Problematic/dp/1009505599\"> According to the historian Reviel Netz</a>, creating a stable culture like this was the One Weird Trick behind the &#8220;Greek Miracle&#8221; around 500 BCE. When this culture finally fizzled out, society reverted to valuing authority and uniformity. In<a href=\"http://amazon.com/Knowledge-Machine-Irrationality-Created-Science/dp/1631491377\"> the account of the historian and philosopher Michael Strevens</a>, the Scientific Revolution was launched when thinkers found a new social practice that could gin up these cultural norms again. My hope is that by helping kids do Bayes&#8217; theorem together &#8212; and starting with questions they&#8217;re actually excited about &#8212; can spark something similar in schools now.</p><p>At the end of my book review, I floated my thought that the best way to express Egan&#8217;s paradigm is to say it &#8220;re-humanizes academics&#8221;. That&#8217;s what I&#8217;ve tried to do here: to take an important component of modern thinking, make it easy to learn by using tools from our evolutionary past, and make it vital to kids. And all of this is toward the goal of helping lift them out of the Matrix, so they can see what they&#8217;re studying as imperfect, historically-contingent tools that they can, as autonomous agents, choose to use as they see fit.</p><p>If that much human richness and potential can be pulled out of just one piece of the curriculum (albeit an important bit!), what could be achieved if we re-humanize the rest? What hidden vitality lies in poetry, or geography, or punctuation? With ancient history, or economics, or biology? Maybe education isn&#8217;t<a href=\"https://www.astralcodexten.com/p/a-theoretical-case-against-education\"> a lost cause after all</a>.</p><p>In any case, if you have a notion about how to further unveil the glories of Bayes&#8217; theorem to kids, I&#8217;m eager for your take.</p><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-1\" id=\"footnote-1\" target=\"_self\">1</a><div class=\"footnote-content\"><p>Where&#8217;s the sense that story undergirds everything? Where&#8217;s the recognition that these types of tools create qualitatively different ways of understanding that war against one another? Where&#8217;s the beauty, the existential wrangling, the bewilderment&#8230;?</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-2\" id=\"footnote-2\" target=\"_self\">2</a><div class=\"footnote-content\"><p>And I think I heard Aella mention it on a podcast?</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-3\" id=\"footnote-3\" target=\"_self\">3</a><div class=\"footnote-content\"><p>Not that I&#8217;m opposed to cog-sci-infused educational traditionalism! For anyone looking for such, I recommend Zach Groshell&#8217;s<a href=\"http://amazon.com/Just-Tell-Them-Explanations-Explicit/dp/103600368X\"> </a><em><a href=\"http://amazon.com/Just-Tell-Them-Explanations-Explicit/dp/103600368X\">Just Tell Them: The Power of Explanations and Explicit Teaching</a></em>.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-4\" id=\"footnote-4\" target=\"_self\">4</a><div class=\"footnote-content\"><p>I meant that rhetorically, but now I&#8217;m actually really interested.</p></div></div>"
            ],
            "link": "https://www.astralcodexten.com/p/bayes-for-everyone",
            "publishedAt": "2025-05-30",
            "source": "SlateStarCodex",
            "summary": "<p><em>[<strong>Editor&#8217;s note:</strong> I accept guest posts from certain people, especially past Book Review Contest winners. Brandon Hendrickson, whose<a href=\"https://www.astralcodexten.com/p/your-book-review-the-educated-mind\"> review of The Educated Mind</a> won the 2023 contest, has taken me up on this and submitted this essay. He writes at<a href=\"https://losttools.substack.com\"> The Lost Tools of Learning</a> and will be at <a href=\"https://less.online/\">LessOnline</a> this weekend, where he and Jack Despain Zhou aka TracingWoodgrains will be doing a live conversation about education.]</em></p><p>I began my<a href=\"https://www.astralcodexten.com/p/your-book-review-the-educated-mind\"> book review</a> of a couple years back with a rather simple question:</p><blockquote><p>Could a new kind of school make the world rational?</p></blockquote><p>What followed, however, was a sprawling distillation of one scholar&#8217;s answer that I believe <em>still </em>qualifies as &#8220;the longest thing anyone has submitted for an ACX contest&#8221;. Since then I&#8217;ve been diving into particulars, exploring how we use the insights I learned while writing it to start re-enchanting all the academic subjects from kindergarten to high school. But in the fun of all that, I fear I&#8217;ve lost touch with that original question. How, even in theory, could a method of education help all students become rational?</p><p>It probably won&#8217;t surprise you that I think part of the answer is Bayes&#8217; theorem. But the equation is famously",
            "title": "Bayes For Everyone"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3096/",
            "publishedAt": "2025-05-30",
            "source": "XKCD",
            "summary": "<img alt=\"They say it's probably safe to keep orbiting for a while, but if it stays on or starts flashing we might have to call someone.\" src=\"https://imgs.xkcd.com/comics/check_engine.png\" title=\"They say it's probably safe to keep orbiting for a while, but if it stays on or starts flashing we might have to call someone.\" />",
            "title": "Check Engine"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-30"
}