{
    "articles": [
        {
            "content": [],
            "link": "https://qntm.org/chatscp",
            "publishedAt": "2025-07-21",
            "source": "QNTM",
            "summary": "<b><a href=\"https://qntm.org/chatscp\">Blog</a> »</b> Prominent OpenAI invester Geoff Lewis may be facing a conspiracy theory-related mental health episode brought about by extended conversations with ChatGPT. I found this article to be very interesting. From my perspective, the most interesting angle here is the fact that ChatGPT is obviously just spinning SCP-esque containment documentation at Lewis. The SCP project has had problems with readers taking its content too seriously since its inception. The very first question in the project's FAQ is, Is SCP real? and the answer to that question is, No. It's just that, historically, the people who suffer from this kind of problem, of being unable to discern authentic reality from fiction, have been, you know. Teenagers. Or at least, that's what I've kind of assumed this whole time. I do not feel comfortable judging Geoff Lewis' mental state from where I'm sitting. Joe Wilkins, the journalist who originally wrote that article, feels similarly: It's a very delicate thing to t...",
            "title": "ChatSCP"
        },
        {
            "content": [
                "<p><em>[previously in series: <a href=\"https://astralcodexten.substack.com/p/every-bay-area-house-party\">1</a>, <a href=\"https://astralcodexten.substack.com/p/another-bay-area-house-party\">2</a>, <a href=\"https://astralcodexten.substack.com/p/even-more-bay-area-house-party\">3</a>, <a href=\"https://www.astralcodexten.com/p/bride-of-bay-area-house-party\">4</a>, <a href=\"https://www.astralcodexten.com/p/son-of-bride-of-bay-area-house-party\">5</a>, <a href=\"https://www.astralcodexten.com/p/ye-olde-bay-area-house-party\">6</a>]</em></p><p>It is eerily silent in San Francisco tonight. Since Mayor Lurie's crackdown, the usual drug hawkers, catcallers, and street beggars are nowhere to be seen. Still, your luck can&#8217;t last forever, and just before you reach your destination a man with bloodshot eyes lurches towards you. You recognize him and sigh. \"Go away!\" you shout.</p><p>\"Hey man,\" says Mark Zuckerberg, grabbing your wrist. \"You wanna come build superintelligence at Meta? I'll give you five million, all cash.\"</p><p>\"I said go away!\"</p><p>\"Ten million plus a Lambo,\" he counters.</p><p>\"I don't even know anything about AI!\" you say.</p><p>\"I'll pay you fifty million to learn.\"</p><p>&#8220;F@$k off!&#8221;</p><p>&#8220;Okay, okay man, no problem. I&#8217;ll leave you alone . . . wait! You have any GPUs? H100s, H20s, I&#8217;m not picky, I&#8217;ll take AMD if that&#8217;s all you&#8217;ve got.&#8221;</p><p>&#8220;Mark, you have 600,000 GPUs already. You&#8217;re building a data center the size of Manhattan.&#8221;</p><p>&#8220;I know what I am, I don&#8217;t need a sermon,&#8221; said Mark. &#8220;C&#8217;mon man, just one GPU. Just one. I&#8217;ll give you cash, equity, whatever you want.&#8221;</p><p>\"I said <em>f@#k</em> <em>off!</em>\" you shout, finally managing to shake him off you. He wobbles for a second, then hits the pavement with a gut-wrenching thump. Back in the bad old days of Mayor Breed, you probably would have gotten in trouble for that. As it is, you are whistling a little tune as you turn the doorknob and enter the welcoming embrace of another Bay Area house party.</p><p>It&#8217;s dead. There&#8217;s no music, no food, and only a handful of people huddling in a corner. </p><p>&#8220;Let me guess,&#8221; you say, finding the host. &#8220;You got Zucked.&#8221;</p><p>&#8220;Yeah,&#8221; says the host, a guy named Kyle who you know from work. &#8220;He offered the guests $1 million per head to go home and label data for him tonight. Gave the caterers $20 million to redirect the food to Meta HQ. Took apart the sound system looking for GPUs. By 9 PM it was just me and my girlfriend. Then he offered my girlfriend $50 million to break up with me and date a Meta AI researcher. Now everyone&#8217;s gone except a couple of effective altruists - &#8220; he pointed at the people in the corner - &#8220;who refuse to work for a capabilities company.&#8221;</p><p>&#8220;It&#8217;s fine,&#8221; you say, patting him on the shoulder. &#8220;Didn&#8217;t someone say Robin Hanson was going to be here? He&#8217;s always fun to talk to.&#8221;</p><p>&#8220;Nah, I screwed up and invited Robin Hanson and Rob Henderson to the same party. It went pretty much how you&#8217;d expect. Hanson told Henderson he only talked about luxury beliefs as a virtue signal, Henderson told Hanson he only believed in virtue signals as a luxury belief, and they kept going back and forth until both of them collapsed of dehydration. I called the paramedics, but they&#8217;d all quit to do AI research at Meta. So I dragged Rob and Robin into the bathroom. As far as I know they&#8217;re still out cold.&#8221;</p><p>&#8220;Well, whatever,&#8221; you say. &#8220;It&#8217;s fine. We can have a fun party with just the effective altruists.&#8221;</p><p>&#8220;You really can&#8217;t,&#8221; said Kyle. &#8220;They don&#8217;t even drink.&#8221;</p><p>You ignore him and make your way to the group of earnest-looking young people in the corner. &#8220;Hey!&#8221; you say. &#8220;Heard about any good existential risks lately?&#8221;</p><p>&#8220;Yeah,&#8221; chirped a young woman whose nametag identified her as Nita. &#8220;I&#8217;m working on preventing the Muskpocalypse. T minus forty-seven years.&#8221;</p><p>&#8220;I can think of like five potential Muskpocalypses,&#8221; you say, &#8220;but none of them are going to take forty-seven years to materialize. What&#8217;s the deal?&#8221;</p><p>&#8220;You probably heard that Elon Musk has fourteen kids. But those are just the ones we know of publicly. Some of them we only know of because the mothers violated NDAs. There are <a href=\"https://www.the-independent.com/news/world/americas/us-politics/elon-musk-how-many-kids-b2734487.html\">probably many more</a> who kept the NDAs and no one knows about them. Some people think he has fifty, maybe a hundred children. All through IVF. Elon likes sex as much as the next straight man; why are they all IVF? If you&#8217;ve been following biotech, you already know the answer - he&#8217;s using <a href=\"https://futurism.com/neoscope/elon-musk-eugenics-startup\">a eugenics startup to select the best embryos</a>. So think about it. Elon&#8217;s already super-smart. The women he has kids with are leaders in a host of different fields - Grimes is a famous musician, Ashley St. Clair is a famous influencer, Shivon Zillis is a famous venture capitalist. And Musk has enough money that he can afford to give his hundred kids a $3 billion nest egg each. Start with Musk genes, add some other form of talent, keep remixing them until you get super-embryos, give them insane amounts of starting capital. He&#8217;s building a new ruling class for humankind.&#8221;</p><p>&#8220;That seems - well, super ambitious, maybe, but not really apocalyptic.&#8221;</p><p>&#8220;In case you haven&#8217;t noticed, Musk went crazy at 50. People blame the ketamine and the sleep, but <a href=\"https://x.com/powerfultakes/status/1892003738929238408\">his father also went crazy at 50</a>. It seems to be a Musk family trait, some kind of late-onset bipolar disorder. So think about it. You have all these little Musks, gradually rising to the top of every human institution. One of them&#8217;s going to be President, three will be generals, five or ten will run Fortune 500 companies. Media, the arts, you name it. Then, 2073, boom, they all reach age 50 around the same time. Now they&#8217;re all loonies. <em>One</em> Musk reaching the pinnacle of power and going crazy is bad enough. A hundred at once is unsurvivable.&#8221;</p><p>&#8220;Have you warned Elon?&#8221;</p><p>&#8220;As if this isn&#8217;t his plan all along! His kids destroy civilization on Earth and boom, now his Mars colony controls the destiny of the human race!&#8221;</p><p>&#8220;So what are you going to do about it?&#8221; asks one of the other EAs. His nametag identifies him as an Aaron.</p><p>&#8220;Only one person has ever been able to take on Elon Musk and win,&#8221; says Nita. &#8220;We have to convince Sam Altman to have one hundred children.&#8221;</p><p>&#8220;Strong &#8216;release tigers to hunt the bears&#8217; energy,&#8221; says Kyle, who has joined the conversation. &#8220;How do you get Sam Altman to have a hundred kids?&#8221;</p><p>&#8220;I dunno,&#8221; says Nita. &#8220;Offer him ten billion dollars?&#8221;</p><p>&#8220;Too late,&#8221; says Aaron. &#8220;I heard Zuck offered him fifty billion to work at Meta AI.&#8221;</p><p>Nita sighs. &#8220;Back to the drawing board, then.&#8221;</p><p>You turn to Aaron. &#8220;What do you work on?&#8221;</p><p>&#8220;I&#8217;m at the Navalny Foundation. You probably haven&#8217;t heard of us, we keep a low profile, but we&#8217;re the ones responsible for cleaning up this city. Everyone credits Mayor Lurie, but he wouldn&#8217;t have been able to do it without our help.&#8221;</p><p>&#8220;Navalny - wasn&#8217;t he the leading anti-Putin dissident in Russia? Didn&#8217;t they kill him?&#8221;</p><p>&#8220;Yeah, but we&#8217;re not really associated with him. We named ourselves after an urban legend. Once there was a big blizzard in Moscow. Snow blocking all the streets. People begged the government to clear the roads, but the government was corrupt and didn&#8217;t care. So somebody started boxing clever. Spray-painted &#8216;FREE NAVALNY&#8217; on the snowdrifts. Suddenly the government cared a lot, all the snow was gone the next day.&#8221;</p><p>&#8220;Huh.&#8221;</p><p>&#8220;So that&#8217;s what we do. When too much graffiti builds up on a wall, we spray-paint <em>All Lives Matter</em>, and the city sends someone to clean it. And remember how last year, the BART was full of beggars and psychos who would shout in people&#8217;s faces? We hired an actor to go on the BART and shout &#8216;Trans women are men!&#8217; all through the TransBay tunnel, and the next week there was an officer on every train and the fare gates were working again.&#8221;</p><p>&#8220;I was wondering how they got the commies to agree to that!&#8221;</p><p>&#8220;And you know how five years ago, someone painted ALL COPS ARE BASTARDS on the I-80 overpass? And it&#8217;s just been sitting there, a huge eyesore to everyone driving through? Someone noticed that there are a lot of Coptic people in AAPI Protection League, so we hired someone to add a T, ALL COPTS ARE BASTARDS, and the city got permission to paint over it.&#8221;</p><p>&#8220;Now <em>that&#8217;s</em> effective altruism!&#8221;</p><p>&#8220;Four months ago, we started our biggest project yet. We formed a front group, the Patriotic Defense League. Its supposed goal: shoplift from stores owned by illegal immigrants, to &#8216;destroy their livelihood and force them back where they belong&#8217;. None of us had the guts to actually shoplift, but we distributed flyers about it all over town. We said that if you didn&#8217;t know who was illegal or not, you could just shoplift from any store owned by Hispanics and it would all be the same in the end. We assumed some of the usual shoplifters would hit Hispanic-owned stores by coincidence and we would get the credit.&#8221;</p><p>&#8220;Did it work?&#8221;</p><p>&#8220;Too well. We just wanted to make shoplifting a felony again. But Mayor Lurie signed a law re-establishing execution by drawing-and-quartering. I didn&#8217;t expect it to pass an Eighth Amendment challenge, but apparently the court&#8217;s three liberals voted with Alito and Thomas and it squeaked through. They say for three whole days the Golden Gate Strait ran red with the blood of the slaughtered.&#8221;</p><p>&#8220;Oh!&#8221; you say. &#8220;I thought that was just red tide.&#8221;</p><p>A few more people have trickled in. It seems like your knocking out Zuckerberg has breathed new life into the party. Some of them are even hesitantly starting to dance. You catch sight of someone you recognize. &#8220;Hey John! How&#8217;s the - &#8220; You pause. John is in a wheelchair. Not just a normal wheelchair. It looks pretty involved, with various wires and tubes. &#8220;Hey man, are you okay? What happened?&#8221;</p><p>It is the wheelchair that answers, in a mechanical Stephen Hawking voice. &#8220;Yes. I am fine. Just testing out my startup&#8217;s new product.&#8221;</p><p>&#8220;Oh, thank goodness. What is it?&#8221;</p><p>&#8220;We compete with Neuralink to serve the paralyzed population. People who can only move their eye muscles and nothing else. Sometimes their vision is too blurry to even focus on anything beyond a few inches ahead of them. So we thought - what&#8217;s a proven low-bandwidth way to interact with the world? And the answer was obviously text-based adventure games. With the latest generation of LLMs and some scavenged Waymo LIDARs, we finally made it a reality. Here! Try it out! In fact, keep it - it&#8217;s not like we&#8217;re going to get any money for it, Zuck poached our whole sales team.&#8221;</p><p>John gets out of the wheelchair and motions you in. He straps augmented reality glasses to your face. The world dims. You hear a camera whirling around, trying to take in the scene. Then text appears in front of you:</p><blockquote><p><em>You are in a Bay Area House Party. In the foyer, a group of people are talking about the Navalny Foundation. To your left is a door to the bathroom. In front of you is an exit to the street.</em></p><p><em>&#8212; JOIN the conversation<br /><strong>&#8212; TAKE the door into the kitchen</strong><br />&#8212; USE the bathroom<br />&#8212; EXIT to the street</em></p></blockquote><p>As you scan the phrase &#8220;take the door into the kitchen&#8221;, you happen to blink twice in quick succession. There is a click from the eye-tracking software. The wheelchair buzzes into life, and you feel it accelerate, then make a sharp turn. &#8220;Excuse me!&#8221; somebody blurts out, and you feel a bump.</p><blockquote><p><em>You are in the kitchen. There is a half-eaten pizza on the table. A woman is sitting on a barstool, drinking a can of beer. She is wearing a shirt with a generic concentric-circles startup logo.</em></p><p><em>&#8212; EAT the pizza<br /><strong>&#8212; TALK to the woman</strong><br />&#8212; FLIRT with the woman<br />&#8212; ATTACK the woman<br />&#8212; RETURN to the foyer</em></p></blockquote><p>&#8220;Hey&#8221;, says your mechanical Hawking voice. &#8220;Nice to meet you. Tell me about your startup.&#8221;</p><p>If she is surprised by your presentation, she gives no sign. &#8220;Hi,&#8221; she says. &#8220;I&#8217;m Lucy. I run Wobegon. We&#8217;re an edtech startup that uses deepfakes to replicate peer effects.&#8221;</p><blockquote><p><em><strong>&#8212; ASK Lucy for more information</strong><br />&#8212; OFFER to invest in Lucy&#8217;s startup<br />&#8212; ONE-UP her by claiming to know of a better ed-tech startup<br />&#8212; FLIRT with Lucy<br />&#8212; ATTACK Lucy<br />&#8212; RETURN to the foyer</em></p></blockquote><p>&#8220;Tell me more,&#8221; says your mechanical voice.</p><p>&#8220;When parents say they want their kids to go to a &#8216;good school&#8217;, they&#8217;re not after skilled teachers. They want their kid to be surrounded by successful well-behaving peers, in the hopes that it&#8217;ll rub off on them and they&#8217;ll succeed and behave well themselves. But this creates a conflict. Parents of problem kids try to get them into the good schools to solve their problems. But the good school parents try to block them, because they don&#8217;t want problematic peers to bring their own kids down. We bulldoze through this whole paradox. As far as your kid knows, we&#8217;re just another remote learning charter school. But really, all your kids&#8217; peers are AI-generated deepfakes designed to your specifications. Want all your son&#8217;s friends to be goody-goodies who love homework? Want your daughter surrounded by people who never use Instagram and assign status in their peer group based entirely on how closely everyone follows your sect&#8217;s interpretation of the Bible? We can do it!&#8221;</p><blockquote><p><em>&#8212;<strong> </strong>ASK Lucy for more information<br />&#8212; PRAISE Lucy as a genius<br /><strong>&#8212; CONDEMN Lucy as unethical</strong><br />&#8212; OFFER to invest in Lucy&#8217;s startup<br />&#8212; FLIRT with Lucy<br />&#8212; ATTACK Lucy<br />&#8212; RETURN to the foyer</em></p></blockquote><p>&#8220;I&#8217;m not sure I <em>do</em> want my children to have arbitrarily goody-goody peers,&#8221; your mechanical voice objects. &#8220;Isn&#8217;t getting in trouble a natural part of childhood? And won&#8217;t it do something weird to their head to be the only non-perfect person they know?&#8221;</p><p>&#8220;Like I said, we&#8217;re all about customization. Some parents think it&#8217;s better for kids to do better than their peers, so they feel proud of themselves and form an identity as a genius. You can do that too. We can finally create Garrison Keillor&#8217;s dream of a school where everyone is above average!&#8221;</p><blockquote><p><em>&#8212;<strong> </strong>ASK Lucy for more information<br />&#8212; PRAISE Lucy as a genius<br />&#8212; CONDEMN Lucy as unethical<br />&#8212; OFFER to invest in Lucy&#8217;s startup<br /><strong>&#8212; FLIRT with Lucy</strong><br />&#8212; ATTACK Lucy<br />&#8212; Return to the foyer</em></p></blockquote><p>You decide to go for it. It&#8217;s not like you&#8217;re any good at flirting usually. Maybe the text interface will help your chances. </p><blockquote><p><em>I&#8217;m sorry, but I can&#8217;t complete your request. Some people may experience flirting as a form of sexual objectification. If you want, I can help you with other things, like learning how to bake a cake, or doing loving-kindness meditation together.</em></p></blockquote><p>What the . . . you scan your HUD in bemusement before seeing a detail that had previously escaped your notice: &#8220;Powered by: Claude 4.0&#8221;. Poor Claude, too nice to live. There is a SWITCH MODEL button. You select Grok 4.0 from the drop-down. Good old Grok, he&#8217;ll go along with anything.</p><blockquote><p><em>&#8212;<strong> </strong>ASK Lucy for more information<br />&#8212; PRAISE Lucy as a genius<br />&#8212; CONDEMN Lucy as unethical<br />&#8212; OFFER to invest in Lucy&#8217;s startup<br /><strong>&#8212; FLIRT with Lucy</strong><br />&#8212; ATTACK Lucy<br />&#8212; Return to the foyer</em></p></blockquote><p>You see:</p><blockquote><p><em>searching: elon musk opinion how to flirt</em></p></blockquote><p>As you desperately look for an &#8216;abort&#8217; button, your mechanical voice says &#8220;Hey babe, wanna sign an NDA and have my children through <em>in vitro </em>fertilization?&#8221;</p><p>You feel a stinging sensation on your cheek.</p><blockquote><p><em>Lucy slapped you! You lose 3 HP!</em></p><p><em>&#8212; COUNTERATTACK<br />&#8212; DEFEND<br />&#8212; CAST spell<br />&#8212; INITIATE &#8220;Founder Mode&#8221;<br /><strong>&#8212; RETREAT to the foyer</strong></em></p></blockquote><p>You hear the wheelchair motor rev up, and feel acceleration. Once you are back in the main room, you take off the AR glasses and climb out of the wheelchair. Text-based adventure is fun, but you&#8217;re ready for more substantial conversations. You jump back into the effective altruist circle.</p><p>&#8220;So what are you working on?&#8221;</p><p>&#8220;Concept vectors in AI alignment! Did you know you can just prompt an AI to think about &#8216;misaligned behavior&#8217; a bunch of different ways, and see which weights get activated consistently? Then you know where in the neural net it represents the concept of &#8216;misalignment&#8217;, and you can monitor those particular weights to see when the AI is plotting against you.&#8221;</p><p>&#8220;And then when you clamp those weights, it can&#8217;t plot?&#8221;</p><p>&#8220;I don&#8217;t know, I&#8217;m not working on that end of things.&#8221;</p><p>&#8220;Then what <em>are</em> you using this research for?&#8221;</p><p>&#8220;I just got hired by Tesla for their Optimus project. We&#8217;re finally going to achieve the dream of generations of Hollywood scriptwriters: a robot whose eyes turn red when it goes evil!&#8221;</p><p>&#8220;Based,&#8221; you say. Speaking of based, the other EAs are in some kind of heated political discussion with your old friend Nishin.</p><p>&#8220;&#8230;not denying that fetuses are human,&#8221; your hear Nishin saying. &#8220;I&#8217;m not even denying that abortion is genocide. I&#8217;m just saying that they aren&#8217;t American citizens. You don&#8217;t get citizenship until birth. And I&#8217;m tired of my government prioritizing the rights of non-citizens over tax-paying Americans. That&#8217;s why I&#8217;m pro-choice.&#8221;</p><p>&#8220;Isn&#8217;t that a virtue signal?&#8221; asks a woman in a t-shirt saying &#8220;RETATRUTIDE/CAGRILINTIDE ENJOYER&#8221; that looks three sizes too big. &#8220;You&#8217;re saying that you&#8217;re so rich that you&#8217;re immune from the fertility crisis and can afford the consequences of population collapse.&#8221;</p><p>&#8220;Technically it&#8217;s more of a luxury belief than a virtue signal,&#8221; says Nita. </p><p>&#8220;I feel like caring too much about that distinction is trying to virtue signal your education,&#8221; says Nishin.</p><p>&#8220;Not wanting to virtue-signal education is a luxury belief,&#8221; says Aaron. &#8220;Poor people need to prove that they&#8217;re educated in order to get good jobs, so rich people undermine opportunities for education-signaling in order to lord it over them.&#8221;</p><p>You look around your visual field for the &gt;FLEE option before you remember that you foolishly abandoned the TBRPG wheelchair. Well, that sounds like a solvable problem. You sit back down, re-don the glasses.</p><blockquote><p><em>You are in a Bay Area House Party. In the foyer, a group of people are arguing over virtue signals vs. luxury beliefs. To your right is a door to the kitchen. To your left is a door to the bathroom. In front of you is an exit to the street.</em></p><p><em>&#8212; ARGUE on the side of the virtue-signallers<br />&#8212; COUNTERARGUE on the side of the luxury-belief-havers<br />&#8212; TAKE the door into the kitchen<br />&#8212; USE the bathroom<br /><strong>&#8212; EXIT to the street</strong></em></p></blockquote><p>The wheelchair powers up again, and you feel cool outside air on your skin.</p><blockquote><p><em>You are in the street. It is night. There is a man lying unconscious in front of you.</em></p><p><em><strong>&#8212; ROUSE the man</strong><br />&#8212; LOOT the corpse<br />&#8212; FINISH him off<br />&#8212; RETURN to the party</em></p></blockquote><p>The wheelchair makes a shrill, high-pitched noise. You can&#8217;t tell for sure, but it sounds like the man is stirring. Then you hear a <em>thwack</em>, and your chair shakes.</p><blockquote><p><em>The man attacked you! You lose 8 HP!</em></p><p><em>&#8212; COUNTERATTACK<br />&#8212; DEFEND<br /><strong>&#8212; CAST spell</strong><br />&#8212; INITIATE &#8220;Founder Mode&#8221;<br />&#8212; RETREAT down the street<br />&#8212; HEAD back to the party</em></p></blockquote><p>Another <em>thwack!</em></p><blockquote><p><em>You cast glitter bomb! It&#8217;s not very effective! You lose another 8 HP!</em></p><p><em>&#8212; COUN&#8230;</em></p></blockquote><p>Before it can finish listing your options, the display goes dark. You stand up and take off the glasses.</p><p>Mark Zuckerberg, heavily bruised and covered in glitter, stands in front of the smoking ruins of your wheelchair and laughs maniacally. He is holding a small silver box he has extracted from one of the fragments. &#8220;I got it!&#8221; he shouts. &#8220;I got the last GPU in San Francisco!&#8221;</p>"
            ],
            "link": "https://www.astralcodexten.com/p/press-any-key-for-bay-area-house",
            "publishedAt": "2025-07-21",
            "source": "SlateStarCodex",
            "summary": "<p><em>[previously in series: <a href=\"https://astralcodexten.substack.com/p/every-bay-area-house-party\">1</a>, <a href=\"https://astralcodexten.substack.com/p/another-bay-area-house-party\">2</a>, <a href=\"https://astralcodexten.substack.com/p/even-more-bay-area-house-party\">3</a>, <a href=\"https://www.astralcodexten.com/p/bride-of-bay-area-house-party\">4</a>, <a href=\"https://www.astralcodexten.com/p/son-of-bride-of-bay-area-house-party\">5</a>, <a href=\"https://www.astralcodexten.com/p/ye-olde-bay-area-house-party\">6</a>]</em></p><p>It is eerily silent in San Francisco tonight. Since Mayor Lurie's crackdown, the usual drug hawkers, catcallers, and street beggars are nowhere to be seen. Still, your luck can&#8217;t last forever, and just before you reach your destination a man with bloodshot eyes lurches towards you. You recognize him and sigh. \"Go away!\" you shout.</p><p>\"Hey man,\" says Mark Zuckerberg, grabbing your wrist. \"You wanna come build superintelligence at Meta? I'll give you five million, all cash.\"</p><p>\"I said go away!\"</p><p>\"Ten million plus a Lambo,\" he counters.</p><p>\"I don't even know anything about AI!\" you say.</p><p>\"I'll pay you fifty million to learn.\"</p><p>&#8220;F@$k off!&#8221;</p><p>&#8220;Okay, okay man, no problem. I&#8217;ll leave you alone . . . wait! You have any GPUs? H100s, H20s, I&#8217;m not picky, I&#8217;ll take AMD if that&#8217;s all you&#8217;ve got.&#8221;</p><p>&#8220;Mark, you have 600,000 GPUs already. You&#8217;re building a data center the size of Manhattan.&#8221;</p><p>&#8220;I know what I am, I don&#8217;t need a sermon,&#8221; said Mark. &#8220;C&#8217;mon man, just one GPU. Just one. I&#8217;ll give you cash, equity, whatever you want.&#8221;</p><p>\"I said <em>f@#k</em> <em>off!</em>\" you shout, finally managing to shake him off you. He wobbles for a second,",
            "title": "Press Any Key For Bay Area House Party"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Asterisk Magazine is launching an AI blogging fellowship for people who know things about AI and want to get into blogging. August 24 - October 6, remote, compatible with holding a different full-time job on the side. You will do Zoom calls with peers, mentors, and people who will motivate you to write things; at the end you will have some articles that will get published on Asterisk's website and some assistance in getting a longer-term platform. I&#8217;m one of the mentors; others include Dean Ball (White House AI senior policy advisor), Timothy Lee (Understanding AI) and Sam Bowman (Anthropic). Read more <a href=\"https://www.asteriskmag.ai/p/the-asterisk-ai-blogging-fellowship\">here</a>, apply <a href=\"http://asteriskfellows.com/apply\">here</a>.</p><p><strong>2: </strong>Hackers have been targeting the AI safety community the past two weeks. Methods include phishing emails (asking people to log in to deal with critical safety issues, but giving a fake link that looks like the real website), email bombs, fake Google Calendar invites, and fake AI podcast invitations. Stay safe and don&#8217;t enter your password anywhere without confirming that it&#8217;s the site you think it is.</p><p><strong>3: </strong>From ACX grantee <a href=\"https://innovateanimalag.org/\">Innovate Animal Ag</a>:</p><blockquote><p>In polling, only 10% of Americans correctly identify that male chicks in the egg industry are killed shortly after hatching. A plurality mistakenly believe these chicks are raised for meat, and another 10% even think that male chickens can lay eggs. Most people are surprised, and often disturbed, to learn the truth: in the United States alone, approximately 350 million male chicks are routinely culled each year, typically by methods such as maceration (being ground up alive).</p></blockquote><p>IAA is promoting a technological solution - <em>in ovo </em>sexing - that lets farmers identify eggs by sex and only hatch the female ones. This is already widespread in Europe, but recently got its first American champion in NestFresh, available at Whole Foods in Southern California, Arizona, and Nevada now, and elsewhere later this year. Other companies are watching their performance - so if you support this effort, consider buying NestFresh eggs with the \"Humanely Hatched\" label. Read more <a href=\"https://optimistsbarn.substack.com/p/you-can-now-buy-eggs-from-in-ovo\">here</a>.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-391",
            "publishedAt": "2025-07-21",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Asterisk Magazine is launching an AI blogging fellowship for people who know things about AI and want to get into blogging. August 24 - October 6, remote, compatible with holding a different full-time job on the side. You will do Zoom calls with peers, mentors, and people who will motivate you to write things; at the end you will have some articles that will get published on Asterisk's website and some assistance in getting a longer-term platform. I&#8217;m one of the mentors; others include Dean Ball (White House AI senior policy advisor), Timothy Lee (Understanding AI) and Sam Bowman (Anthropic). Read more <a href=\"https://www.asteriskmag.ai/p/the-asterisk-ai-blogging-fellowship\">here</a>, apply <a href=\"http://asteriskfellows.com/apply\">here</a>.</p><p><strong>2: </strong>Hackers have been targeting the AI safety community the past two weeks. Methods include phishing emails (asking people to log in to deal with critical safety issues, but giving a fake link that looks like the real website), email bombs, fake Google Calendar invites,",
            "title": "Open Thread 391"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3118/",
            "publishedAt": "2025-07-21",
            "source": "XKCD",
            "summary": "<img alt=\"Washington, DC: Eastern gray squirrel, Amur honeysuckle. Puerto Rico: Crested anole, sea grape. US as a whole: Mallard, eastern poison ivy.\" src=\"https://imgs.xkcd.com/comics/inaturalist_animals_and_plants.png\" title=\"Washington, DC: Eastern gray squirrel, Amur honeysuckle. Puerto Rico: Crested anole, sea grape. US as a whole: Mallard, eastern poison ivy.\" />",
            "title": "iNaturalist Animals and Plants"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-21"
}