{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>There's no country on earth that does hype better than America. It's one of the most appealing aspects about being here. People are genuinely excited about the future and never stop searching for better ways to work, live, entertain, and profit. There's a unique critical mass in the US accelerating and celebrating tomorrow.<br /><br /></div><div>The contrast to Europe couldn't be greater. Most Europeans are allergic to anything that even smells like a commercial promise of a better tomorrow. \"Hype\" is universally used as a term to ridicule anyone who dares to be excited about something new, something different. Only a fool would believe that real progress is possible!</div><div><br />This is cultural bedrock. The fault lines have been settling for generations. It'll take an earthquake to move them.<br /><br /></div><div>You see this in AI, you saw it in the Internet. Europeans are just as smart, just as inventive as their American brethren, but they don't do hype, so they're rarely the ones able to sell the sizzle that public opinion requires to shift its vision for tomorrow.&nbsp;</div><div><br />To say I have a complicated relationship with venture capital is putting it mildly. I've spent a career <a href=\"https://signalvnoise.com/posts/3972-reconsider\">proving the counter narrative</a>. Proving that you can build and bootstrap <a href=\"https://37signals.com/\">an incredible business</a> without investor money, still <a href=\"https://rubyonrails.org/\">leave a dent in the universe</a>, while enjoying <a href=\"https://www.instagram.com/dhhdrives/\">the spoils of capitalism</a>. And yet...<br /><br /></div><div>I must admit that the excesses of venture capital are integral to this uniquely American advantage on hype. The lavish overspending during the dot-com boom led directly to a spectacular bust, but it also built the foundation of the internet we all enjoy today. Pets.com and Webvan flamed out such that Amazon and Shopify could transform ecommerce out of the ashes.<br /><br /></div><div>We're in the thick of peak hype on AI right now. Fantastical sums are chasing AGI along with every dumb derivative mirage along the way. The most outrageous claims are being put forth on the daily. It's easy to look at that spectacle with European eyes and roll them. Some of it is pretty cringe!<br /><br /></div><div>But I think that would be a mistake. You don't have to throw away your critical reasoning to accept that in the face of unknown potential, optimism beats pessimism. We all have to believe in something, and you're much better off believing that things can get better than not.&nbsp;<br /><br /></div><div>Americans fundamentally believe this. They believe the hype, so they make it come to fruition. Not every time, not all of them, but more of them, more of the time than any other country in the world.</div><div><br />That really is exceptional.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/american-hype-6f7afd1b",
            "publishedAt": "2025-07-17",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>There's no country on earth that does hype better than America. It's one of the most appealing aspects about being here. People are genuinely excited about the future and never stop searching for better ways to work, live, entertain, and profit. There's a unique critical mass in the US accelerating and celebrating tomorrow.<br /><br /></div><div>The contrast to Europe couldn't be greater. Most Europeans are allergic to anything that even smells like a commercial promise of a better tomorrow. \"Hype\" is universally used as a term to ridicule anyone who dares to be excited about something new, something different. Only a fool would believe that real progress is possible!</div><div><br />This is cultural bedrock. The fault lines have been settling for generations. It'll take an earthquake to move them.<br /><br /></div><div>You see this in AI, you saw it in the Internet. Europeans are just as smart, just as inventive as their American brethren, but they don't do hype, so they're rarely the ones able to sell the sizzle that public opinion requires to shift its vision for tomorrow.&nbsp;</div><div><br />To say I have a complicated relationship with venture capital is putting it mildly. I've spent a career <a href=\"https://signalvnoise.com/posts/3972-reconsider\">proving the counter",
            "title": "American hype"
        },
        {
            "content": [
                "<h2 id=\"1\">1.</h2>\n\n<p>Your eyes sense color. They do this because you have three different kinds of cone cells on your retinas, which are sensitive to different <a href=\"https://en.wikipedia.org/wiki/Cone_cell#/media/File:Cone-fundamentals-with-srgb-spectrum.svg\">wavelengths of light</a>.</p>\n\n<p><img alt=\"cones\" src=\"https://dynomight.net/img/colors/cones.svg\" /></p>\n\n<p>For whatever reason, evolution decided those wavelengths should be <em>overlapping</em>. For example, M cones are most sensitive to 535 nm light, while L cones are most sensitive to 560 nm light. But M cones are still stimulated quite a lot by 560 nm light—around 80% of maximum. This means you never (normally) get to experience having just one type of cone firing.</p>\n\n<p>So what do you do?</p>\n\n<p>If you’re a quitter, I guess you accept the limits of biology. But if you like <em>fun</em>, then what you do is image people’s retinas, classify individual cones, and then selectively stimulate them using laser pulses, so you aren’t limited by stupid cone cells and their stupid blurry responsivity spectra.</p>\n\n<p><a href=\"https://doi.org/10.1126/sciadv.adu1052\">Fong et al. (2025)</a> choose fun.</p>\n\n<p><a href=\"https://dynomight.net/img/colors/lasers.pdf\"><img alt=\"\" src=\"https://dynomight.net/img/colors/lasers.png\" /></a></p>\n\n<p>When they stimulated only M cells…</p>\n\n<blockquote>\n  <p>Subjects report that [pure M-cell activation] appears blue-green of unprecedented saturation.</p>\n</blockquote>\n\n<p>If you make people see brand-new colors, you will have my full attention. It doesn’t hurt to use lasers. I will read every report from every subject. Do our brains even know how to interpret these signals, given that they can never occur?</p>\n\n<p>But tragically, the paper doesn’t give any subject reports. Even though most of the subjects were, umm, authors on the paper. If you want to know what this new color is like, the above quote is all you get for now.</p>\n\n<h2 id=\"2\">2.</h2>\n\n<p>Or… possibly you can see that color right now?</p>\n\n<p><a href=\"https://dynomight.net/img/colors/eclipse-(255,0,0)-(0,170,85)-700px-15s-70s-shrink.svg\">\n  <img src=\"https://dynomight.net/img/colors/eclipse-(255,0,0)-(0,170,85)-700px-no-animation.svg\" />\n</a></p>\n\n<p>If you click on the above image, a little animation will open. Please do that now and stare at the tiny white dot. Weird stuff will happen, but stay focused on the dot. Blink if you must. It takes one minute and it’s probably best to experience it without extra information i.e. without reading past this sentence.</p>\n\n<p>The idea for that animation is not new. It’s <del>plagiarized</del> based on Skytopia’s <a href=\"https://www.skytopia.com/project/illusion/ipage-et.html\">Eclipse of Titan</a> optical illusion (h/t <a href=\"https://blog.ikiz.tech/\">Steve Alexander</a>), which dates back to at least 2010. Later I’ll show you some variants with other colors and give you a tool to make your own.</p>\n\n<p>If you refused to look at the animation, it’s just a bluish-green background with a red circle on top that slowly shrinks down to nothing. That’s all. But as it shrinks, you should hallucinate a very intense blue-green color around the rim.</p>\n\n<p>Why do you hallucinate that crazy color? I think the red circle saturates the hell out of your red-sensitive L cones. Ordinarily, the green frequencies in the background would stimulate both your green-sensitive M cones and your red-sensitive L cones, due to their <a href=\"https://dynomight.net/colors/#:~:text=overlapping\">overlapping spectra</a>. But the red circle has desensitized your red cones, so you get to experience your M cones firing without your L cones firing as much, and voilà—insane color.</p>\n\n<h2 id=\"3\">3.</h2>\n\n<p>So here’s my question: Can that type of optical illusion show you all the same colors you could see by shooting lasers into your eyes?</p>\n\n<p>That turns out to be a tricky question. See, here’s a triangle:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/colors/gamut-blank.svg\" /></p>\n\n<p>Think of this <a href=\"https://en.wikipedia.org/wiki/Simplex\">triangle</a> as representing all the “colors” you could conceivably experience. The lower-left corner represents only having your S cones firing, the top corner represents only your M cones firing, and so on.</p>\n\n<p>So what happens if you look different wavelengths of light?</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/colors/gamut-colors.svg\" /></p>\n\n<p>Short wavelengths near 400 nm <em>mostly</em> just stimulate the S cones, but also stimulate the others a little. Longer wavelengths stimulate the M cones more, but also stimulate the L cones, because the M and L cones have <a href=\"https://dynomight.net/colors/#:~:text=overlapping\">overlapping spectra</a>. (That figure, and the following, are modified from <a href=\"https://doi.org/10.1126/sciadv.adu1052\">Fong et al.</a>)</p>\n\n<p>When you mix different wavelengths of light, you mix the cell activations. So all the colors you can <em>normally</em> experience fall inside this shape:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/colors/gamut-gamut.svg\" /></p>\n\n<p>That’s the standard <a href=\"https://en.wikipedia.org/wiki/Gamut\">human color gamut</a>, in <a href=\"https://en.wikipedia.org/wiki/LMS_color_space\">LMS colorspace</a>. Note that the exact shape of this gamut is subject to debate. For one thing, the exact sensitivity of cells is hard to measure and still a subject of research. Also, it’s not clear how far that gamut should reach into the lower-left and lower-right corners, since wavelengths outside 400-700 nm still stimulate cells a tiny bit.</p>\n\n<p>And it gets worse. Most of the technology we use to represent and display images electronically is based on <a href=\"https://en.wikipedia.org/wiki/SRGB\">standard RGB (sRGB) colorspace</a>. This colorspace, <em>by definition</em>, cannot represent the full human color gamut.</p>\n\n<p>The precise definition of sRGB colorspace is quite involved. But very roughly speaking, when an sRGB image is “pure blue”, your screen is supposed to show you a color that looks like 450-470 nm light, while “pure green” should look like 520-530 nm light, and “pure red” should look like 610-630 nm light. So when your screen mixes these together, you can only see colors inside this triangle.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/colors/gamut-srgb02.svg\" /></p>\n\n<p>(The corners of this triangle don’t quite touch the boundaries of the human color gamut. That’s because it’s very difficult to produce single wavelengths of light without using lasers. In reality, the sRGB specification say that pure red/blue/green should produce a mixture of colors centered around the wavelengths I listed above.)</p>\n\n<p>What’s the point of all this theorizing? Simple: When you look at the optical illusions on a modern screen, you aren’t <em>just</em> fighting the overlapping spectra of your cones. You’re also fighting the fact that the screen you’re looking at can’t produce single wavelengths of light.</p>\n\n<p>So do the illusions actually take you outside the natural human color gamut? Unfortunately, I’m not sure. I can’t find much quantitative information about how much your cones are saturated when you stare at red circles. My best guess is no, or perhaps just a little.</p>\n\n<h2 id=\"4\">4.</h2>\n\n<p>If you’d like to explore these types of illusions further, I made a page in which you can pick <em>any</em> colors. You can also change the size of the circle, the countdown time, if the circle should shrink or grow, and how fast it does that.</p>\n\n<p>You can try it <a href=\"https://dynomight.net/img/colors/generate.html\">here</a>. You can export the animation to an animated SVG, which will be less than 1 kb. Or you can just save the URL.</p>\n\n<p>Some favorites:</p>\n\n<ul>\n  <li>\n    <p><a href=\"https://dynomight.net/img/colors/generate.html?inside=ff0000&amp;outside=b06400\">Red inside, reddish-orange outside</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://dynomight.net/img/colors/generate.html?inside=ff0000&amp;outside=00ff00\">Red inside, green outside</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://dynomight.net/img/colors/generate.html?inside=00ff00&amp;outside=ff00ff\">Green inside, purple outside</a></p>\n  </li>\n</ul>\n\n<p>If you’re colorblind, I don’t <em>think</em> these will work, though I’m not sure. Folks with deuteranomaly, have M cones, but they’re shifted to respond more like L cones. In principle, these types of illusions might help selectively activate them, but I have no idea if that will lead to stronger color perception. I’d love to hear from you if you try it.</p>"
            ],
            "link": "https://dynomight.net/colors/",
            "publishedAt": "2025-07-17",
            "source": "Dynomight",
            "summary": "<h2 id=\"1\">1.</h2> <p>Your eyes sense color. They do this because you have three different kinds of cone cells on your retinas, which are sensitive to different <a href=\"https://en.wikipedia.org/wiki/Cone_cell#/media/File:Cone-fundamentals-with-srgb-spectrum.svg\">wavelengths of light</a>.</p> <p><img alt=\"cones\" src=\"https://dynomight.net/img/colors/cones.svg\" /></p> <p>For whatever reason, evolution decided those wavelengths should be <em>overlapping</em>. For example, M cones are most sensitive to 535 nm light, while L cones are most sensitive to 560 nm light. But M cones are still stimulated quite a lot by 560 nm light—around 80% of maximum. This means you never (normally) get to experience having just one type of cone firing.</p> <p>So what do you do?</p> <p>If you’re a quitter, I guess you accept the limits of biology. But if you like <em>fun</em>, then what you do is image people’s retinas, classify individual cones, and then selectively stimulate them using laser pulses, so you aren’t limited by stupid cone cells and their stupid blurry responsivity spectra.</p> <p><a href=\"https://doi.org/10.1126/sciadv.adu1052\">Fong et al. (2025)</a> choose fun.</p> <p><a href=\"https://dynomight.net/img/colors/lasers.pdf\"><img alt=\"\" src=\"https://dynomight.net/img/colors/lasers.png\" /></a></p> <p>When they stimulated only M cells…</p> <blockquote> <p>Subjects report that [pure M-cell activation] appears blue-green of unprecedented saturation.</p> </blockquote> <p>If you make people see brand-new colors, you will have my full attention. It doesn’t hurt to use",
            "title": "New colors without shooting lasers into your eyes"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/maybe-writing-speed-actually-is-a-bottleneck-for/",
            "publishedAt": "2025-07-17",
            "source": "Hillel Wayne",
            "summary": "<p>I'm a big (neo)vim buff. My config is over 1500 lines and I regularly write new scripts. I recently ported my neovim config to a new laptop. Before then, I was using VSCode to write, and when I switched back I immediately saw a big gain in productivity.</p> <p>People often pooh-pooh vim (and other assistive writing technologies) by saying that writing code isn't the bottleneck in software development. Reading, understanding, and thinking through code is!</p> <p>Now I don't know how true this actually is in practice, because empirical studies of time spent coding are all over the place. Most of them, like <a href=\"https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/meyer-fse-2014.pdf\" target=\"_blank\">this study</a>, track time spent in the editor but don't distinguish between time spent reading code and time spent writing code. The only one I found that separates them was <a href=\"https://scispace.com/pdf/i-know-what-you-did-last-summer-an-investigation-of-how-3zxclzzocc.pdf\" target=\"_blank\">this study</a>. It finds that developers spend only 5% of their time editing. It also finds they spend 14% of their time moving or resizing editor windows, so I don't know how clean their data is.</p> <p>But I have a bigger problem with \"writing is not the bottleneck\": when I think of a bottleneck, I imagine that <em>no</em> amount of improvement will lead to",
            "title": "Maybe writing speed actually is a bottleneck for programming"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Jul/17/vibe-scraping/#atom-entries",
            "publishedAt": "2025-07-17",
            "source": "Simon Willison",
            "summary": "<p>This morning, working entirely on my phone, I scraped a conference website and vibe coded up an alternative UI for interacting with the schedule using a combination of OpenAI Codex and Claude Artifacts.</p> <p>This weekend is <a href=\"https://opensauce.com/\">Open Sauce 2025</a>, the third edition of the Bay Area conference for YouTube creators in the science and engineering space. I have a couple of friends going and they were complaining that the official schedule was difficult to navigate on a phone - it's not even linked from the homepage on mobile, and once you do find <a href=\"https://opensauce.com/agenda/\">the agenda</a> it isn't particularly mobile-friendly.</p> <p>We were out for coffee this morning so I only had my phone, but I decided to see if I could fix it anyway.</p> <p>TLDR: Working entirely on my iPhone, using a combination of <a href=\"https://chatgpt.com/codex\">OpenAI Codex</a> in the ChatGPT mobile app and Claude Artifacts via the Claude app, I was able to scrape the full schedule and then build and deploy this: <a href=\"https://tools.simonwillison.net/open-sauce-2025\">tools.simonwillison.net/open-sauce-2025</a></p> <p><img alt=\"Screenshot of a blue page, Open Sauce 2025, July 18-20 2025, Download Calendar ICS button, then Friday 18th and Saturday 18th and Sunday 20th pill buttons, Friday is selected, the Welcome to Open",
            "title": "Vibe scraping and vibe coding a schedule app for Open Sauce 2025 entirely on my phone"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3905\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3905",
            "publishedAt": "2025-07-17",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3905\"> Read more </a> </p>",
            "title": "Hidden Open Thread 390.5"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-17"
}