{
    "articles": [
        {
            "content": [
                "<p><em>&#8220;The greatest punishment, if one isn&#8217;t willing to rule, is to be ruled by someone worse than oneself. And I think that it&#8217;s fear of this that makes decent people rule when they do. &#8230; In a city of good men, if it came into being, the citizens would fight in order not to rule, just as they do now in order to rule.&#8221;</em> Plato, <em>The Republic</em> 347a-d</p><p>Governance systems can be distinguished by the goals they pursue, and by their competence at achieving those goals. And a key meta-competence question about any such system is: when a more competent system that achieve similar goals becomes available, how reliably does the original system replace itself with the better system? A similar question applies to any one person who rules: will they voluntarily step down to be replaced by someone who will more competently fill their role?</p><p>The US was one of the first modern democracies, and it still uses roughly its original form of democracy, even though proportional representation has long been <a href=\"https://www.overcomingbias.com/p/yay-parliamentshtml\">shown</a> to be a more competent form of democracy. Thus US democracy is not very meta-competent.</p><p>We have good reasons to think competence and meta-competence are correlated. For example, when a for-profit firm does not put up big obstacles to hostile takeovers, those takeovers happen more often, improving both competence and meta-competence.</p><p>Also, futarchy seems promising as a more competent form of governance, and if so it would also be much more meta-competent. After all, the process by which it would evaluate a change in governance form would be mostly the same as the process it uses to evaluate other changes. As long as the new governance system would preserve the key futarchy outcome measurements, assets, and payoff mechanisms, futarchy could reliably estimate the consequences of changing to it.</p><p>Meta-competent governance systems offer the promise of a virtuous governance cycle. Systems would replace themselves with systems that are better not only at governing, but also at replacing themselves with improvements. While at first the gains from replacing must be very big, clear, and obvious, and even then take a long time to implement, later smaller and subtler gains will be found and implemented more quickly. Causing an acceleration of governance gains.</p><p>Competent governance of nations would tend to induce more competent governance of states, cities, firms, and non-profits. The competence of any one of these areas would tend to push for more competence in the other areas. Once such a virtuous cycle has played out to a substantial degree, we&#8217;d have a much more competent world, which should be more effective finding and avoiding risks, and at identifying and solving civ scale problems like cultural drift.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/a-virtuous-governance-cycle",
            "publishedAt": "2025-06-10",
            "source": "Robin Hanson",
            "summary": "<p><em>&#8220;The greatest punishment, if one isn&#8217;t willing to rule, is to be ruled by someone worse than oneself. And I think that it&#8217;s fear of this that makes decent people rule when they do. &#8230; In a city of good men, if it came into being, the citizens would fight in order not to rule, just as they do now in order to rule.&#8221;</em> Plato, <em>The Republic</em> 347a-d</p><p>Governance systems can be distinguished by the goals they pursue, and by their competence at achieving those goals. And a key meta-competence question about any such system is: when a more competent system that achieve similar goals becomes available, how reliably does the original system replace itself with the better system? A similar question applies to any one person who rules: will they voluntarily step down to be replaced by someone who will more competently fill their role?</p><p>The US was one of the first modern democracies, and it still uses roughly its original form of democracy, even though proportional representation has long been <a href=\"https://www.overcomingbias.com/p/yay-parliamentshtml\">shown</a> to be a more competent form of democracy. Thus US democracy is not very meta-competent.</p><p>We have good reasons to think competence and meta-competence are correlated. For example, when",
            "title": "A Virtuous Governance Cycle"
        },
        {
            "content": [
                "<p>There&#8217;s a long-running philosophical argument about the conceivability of otherwise-normal people who are not conscious, aka <a href=\"https://en.wikipedia.org/wiki/Philosophical_zombie\">&#8220;philosophical zombies&#8221;</a>. This has spawned a shorter-running (only fifteen years!) rationalist sub-argument on the topic. The last time I checked its status was <a href=\"https://www.lesswrong.com/posts/6TBhBjiYivtLCKGoy/repairing-yudkowsky-s-anti-zombie-argument\">this post</a>, which says:</p><blockquote><p>1. Both Yudkowsky and Chalmers agree that humans possess &#8220;qualia&#8221;.</p><p>2. Chalmers argues that a superintelligent being which somewhow knew the positions of all particles in a large region of the Universe would need to be told as an additional fact that any humans (or other minds possessing qualia) in this region of space possess qualia &#8211; it could not deduce this from mere perfect physical knowledge of their constituent particles. Therefore, qualia are in some sense extra-physical.</p><p>3. Yudkowsky argues that such a being would notice that humans discuss at length the fact that they possess qualia, and their internal narratives also represent this fact. <strong>It is extraordinarily improbable that beings would behave in this manner if they did not actually possess qualia.</strong> Therefore an omniscient being would conclude that it is extremely likely that humans possess qualia. Therefore, qualia are not extra-physical.</p></blockquote><p>I want to re-open this (sorry!) by disagreeing with the bolded sentence. I think beings would talk about qualia - the &#8220;mysterious redness of red&#8221; and all that - even if we start by assuming they don&#8217;t have it. I realize this is a surprising claim, but that&#8217;s why it&#8217;s interesting enough to re-open the argument over<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a>.</p><p>Start by imagining a race of p-zombies who are exactly like humans, except for two things. First, they don&#8217;t have conscious experience. Second, they don&#8217;t <em>necessarily</em> report having conscious experience; if we want to claim that they do, we&#8217;ll have to derive this fact from first principles. </p><p>These p-zombies talk to each other (like humans do), and an outside observer might notice that they report on some levels of mental processing, but not others (like humans do). For example, they might fail the infamous <em><a href=\"https://en.wikipedia.org/wiki/Paris_in_the_the_Spring\">PARIS IN THE THE SPRINGTIME</a></em> test, reporting only one <em>THE </em>rather than two. The observer would conjecture that the p-zombies&#8217; speech is produced by a part with access to high-level processing (after the Paris sentence has been rounded off to its more plausible alternative), but not low-level processing (the base-level sense-data including both &#8220;the&#8221;s). Thus, the observer would reinvent the idea of the &#8220;conscious&#8221; vs. &#8220;unconscious&#8221; mind. This isn&#8217;t surprising or a contradiction of our premise - this is a different sort of &#8220;conscious&#8221; (easy problem) than the one we agreed the p-zombies lack (<a href=\"https://en.wikipedia.org/wiki/Hard_problem_of_consciousness\">hard problem</a>). But it will be linguistically awkward, so let&#8217;s call this distinction the &#8220;reportable&#8221; vs. &#8220;unreportable&#8221; mind.</p><p>Suppose the observer shows the p-zombie a picture of a rose, and the p-zombie describes it as red. If the observer asks the p-zombie to recount how their reportable mind came to know that it was red, what might they answer?</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdeb2163c-e86b-4b45-b51f-4ded56b3e95a_943x630.webp\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"311.9936373276776\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdeb2163c-e86b-4b45-b51f-4ded56b3e95a_943x630.webp\" width=\"467\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>They wouldn&#8217;t answer &#8220;The light triggered the rhodopsin-based photoreceptors in my eye, the signal was transmitted to my brain, and it eventually reached the speech centers and made them say the word &#8216;red&#8217;&#8221;. After all, we hypothesized that the p-zombies don&#8217;t know anything humans don&#8217;t know, and most humans don&#8217;t know what &#8220;rhodopsin&#8221; is. In fact, we can imagine a primitive tribe of p-zombies who don&#8217;t know any biology - they don&#8217;t even know what the brain is - but who still have to be able to answer this question. Although these words are a correct description of what&#8217;s happening to the p-zombies neurologically (just as they would be a correct description of regular humans), there has to be some other answer about what they would <em>tell us</em> when we asked.</p><p>And they wouldn&#8217;t answer &#8220;IDK, my mouth just moved and formed the syllables &#8216;this is red&#8217;&#8221;. Normal humans can easily tell the difference between a voluntary action and an involuntary spasm (eg if your limb jerks because of an electric current or a seizure). In fact, this faculty is so profound that its failures <a href=\"https://www.sciencedirect.com/science/article/pii/S0042698912003616\">contribute to conditions like schizophrenia</a>; when someone loses the ability to interpret their speech as self-produced, they start formulating hypotheses like &#8220;the CIA put a chip in my brain that controls my actions&#8221;. Since the p-zombies can do anything humans can (including distinguishing voluntary vs. involuntary actions, and getting schizophrenia) they must be able to report something other than &#8220;my mouth moved but I can&#8217;t say why&#8221;.</p><p>I think they would have to say something similar to what we say: &#8220;My reporting mind received a packet of visual data, and after examining/analyzing this packet, I was able to tell that the rose was red.&#8221; </p><p>Could they describe this packet of visual data further? </p><p>The packet can&#8217;t just be a verbal description of the rose, like &#8220;There is a rose in the scene. It is red.&#8221; After all, if the p-zombie can do anything that humans can do, it can use the packet to draw a somewhat faithful reproduction of the rose, including details like how many petals it has, their orientation relative to one another, and the exact way that the stem bends. It would take a novella worth of words to describe a rose in such detail (consider how many words it would take to describe a complex image so that someone who read the words could draw it as faithfully as someone who really saw the image). So the packet must be a rich spatial representation of the rose&#8217;s edges, colors, size, et cetera. Given the speed with which the p-zombie could calculate distance (eg &#8220;the center of the rose is further from the first leaf than the first leaf is from the bottom of the stem&#8221;) and turn it into a 2D sketch, I have trouble thinking of this packet as anything other than already organized in a 2D grid.</p><p>How is color information communicated in this 2D grid? Since this is a p-zombie who doesn&#8217;t have &#8220;real experience&#8221;, one might naively expect it to be something like a bitmap, with each pixel containing the coordinates of the color in an RGB color space.</p><p>But imagine presenting the p-zombie with this image:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa7a30475-78b6-44c1-9255-b797d59bcb28_401x121.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"121\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa7a30475-78b6-44c1-9255-b797d59bcb28_401x121.png\" width=\"401\" /><div></div></div></a></figure></div><p>&#8230;and asking them to tell you what it shows, with a time limit of 100 milliseconds. Since the p-zombie has only the skills a regular human could have, it would fail: interpreting a bitmap like this must be done laboriously by hand.</p><p>But the visual field is a bitmap thousands of times bigger than this, and the p-zombie <em>can</em> interpret it within 100 ms. So the pixels must be presented not as RGB color coordinates, but in some kind of rich color language that produces an immediate experience of color without requiring any further thought or processing.</p><p>If the p-zombie says this - &#8220;My reportable mind receives the color information as a 2D grid in which each pixel conveys a irreducible sudden intuitive sense of being the correct color&#8221; - then what&#8217;s the difference between that claim versus &#8220;I experience the mysterious redness of red&#8221;? </p><p>This argument confuses me. It still seems like, even if the p-zombie is using an inner encoding scheme in which red is represented by a conceptual primitive, they still aren&#8217;t &#8220;experiencing&#8221; the mysterious redness of red, just . . . I don&#8217;t even know how to end this sentence. Just using an encoding scheme that matches it perfectly and causes them to describe it the exact same way that we do?</p><p>I&#8217;m not even sure which direction to update on this. If you don&#8217;t need consciousness to claim to have qualia, this is good news for epiphenomenalism and other positions where consciousness doesn&#8217;t interact with the physical world (and therefore cannot cause our claims that we have qualia). But it doesn&#8217;t fully defuse the intuitive inelegance of these positions, where it&#8217;s a baffling coincidence that we both claim to have qualia, and actually have them. So maybe it&#8217;s the best news for illusionism and deflationist physicalisms, which have to explain why we talk about qualia even though there &#8220;is&#8221; &#8220;no&#8221; &#8220;consciousness&#8221;. </p><p>But these still fail to explain how and why we so obviously experience consciousness, not just in the sense of there being a mysterious redness of red, but in the sense where there&#8217;s &#8220;someone&#8221; &#8220;there&#8221; to appreciate it.</p><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-1\" id=\"footnote-1\" target=\"_self\">1</a><div class=\"footnote-content\"><p>To fend off the inevitable accusations - I&#8217;m not claiming to be the first person to ever think of this, I&#8217;m not claiming I&#8217;m an autodidact genius who is better than real academic philosophers, I agree I am scum and not worthy of kissing the boots of anyone with formal credentials, please don&#8217;t kill me. I&#8217;m just saying I personally don&#8217;t know of anyone making this exact argument before, and I think it&#8217;s interesting and worth talking about even without clearing the bar of spending weeks reviewing every philosophy paper ever written until I figure out that it&#8217;s similar to an idea in Schmoe &amp; Schmendrick 1972. Also, if I <em>did</em> do that, you would obsess over some way it&#8217;s subtly different from Schmoe &amp; Schmendrick 1972, accuse me of misinterpreting them, and get mad anyway. Still, if you know of prior work on this topic, let me know and I&#8217;ll edit it in.</p></div></div>"
            ],
            "link": "https://www.astralcodexten.com/p/p-zombies-would-report-qualia",
            "publishedAt": "2025-06-10",
            "source": "SlateStarCodex",
            "summary": "<p>There&#8217;s a long-running philosophical argument about the conceivability of otherwise-normal people who are not conscious, aka <a href=\"https://en.wikipedia.org/wiki/Philosophical_zombie\">&#8220;philosophical zombies&#8221;</a>. This has spawned a shorter-running (only fifteen years!) rationalist sub-argument on the topic. The last time I checked its status was <a href=\"https://www.lesswrong.com/posts/6TBhBjiYivtLCKGoy/repairing-yudkowsky-s-anti-zombie-argument\">this post</a>, which says:</p><blockquote><p>1. Both Yudkowsky and Chalmers agree that humans possess &#8220;qualia&#8221;.</p><p>2. Chalmers argues that a superintelligent being which somewhow knew the positions of all particles in a large region of the Universe would need to be told as an additional fact that any humans (or other minds possessing qualia) in this region of space possess qualia &#8211; it could not deduce this from mere perfect physical knowledge of their constituent particles. Therefore, qualia are in some sense extra-physical.</p><p>3. Yudkowsky argues that such a being would notice that humans discuss at length the fact that they possess qualia, and their internal narratives also represent this fact. <strong>It is extraordinarily improbable that beings would behave in this manner if they did not actually possess qualia.</strong> Therefore an omniscient being would conclude that it is extremely likely that humans possess qualia. Therefore, qualia are not extra-physical.</p></blockquote><p>I want to re-open this (sorry!) by disagreeing with the bolded sentence. I think beings",
            "title": "P-Zombies Would Report Qualia"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-10"
}