{
    "articles": [
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/logical-duals-in-software-engineering/",
            "publishedAt": "2025-08-27",
            "source": "Hillel Wayne",
            "summary": "<p>(<a href=\"https://buttondown.com/hillelwayne/archive/sapir-whorf-does-not-apply-to-programming/\" target=\"_blank\">Last week's newsletter</a> took too long and I'm way behind on <a href=\"https://leanpub.com/logic/\" target=\"_blank\">Logic for Programmers</a> revisions so short one this time.<sup id=\"fnref:retread\"><a class=\"footnote-ref\" href=\"https://buttondown.com/hillelwayne/rss#fn:retread\">1</a></sup>)</p> <p>In classical logic, two operators <code>F/G</code> are <strong>duals</strong> if <code>F(x) = !G(!x)</code>. Three examples:</p> <ol> <li><code>x || y</code> is the same as <code>!(!x &amp;&amp; !y)</code>.</li> <li><code>&lt;&gt;P</code> (\"P is possibly true\") is the same as <code>![]!P</code> (\"not P isn't definitely true\").</li> <li><code>some x in set: P(x)</code> is the same as <code>!(all x in set: !P(x))</code>.</li> </ol> <p>(1) is just a version of De Morgan's Law, which we regularly use to simplify boolean expressions. (2) is important in modal logic but has niche applications in software engineering, mostly in how it powers various formal methods.<sup id=\"fnref:fm\"><a class=\"footnote-ref\" href=\"https://buttondown.com/hillelwayne/rss#fn:fm\">2</a></sup> The real interesting one is (3), the \"quantifier duals\". We use lots of software tools to either <em>find</em> a value satisfying <code>P</code> or <em>check</em> that all values satisfy <code>P</code>. And by duality, any tool that does one can do the other, by seeing if it <em>fails</em> to find/check <code>!P</code>. Some examples in the wild:</p> <ul> <li>Z3 is used to solve mathematical constraints, like \"find x, where <code>f(x) &gt;= 0</code>. If I want to prove a property like",
            "title": "Logical Duals in Software Engineering"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Aug/27/london-culture/#atom-entries",
            "publishedAt": "2025-08-27",
            "source": "Simon Willison",
            "summary": "<p>We were back in London for a few days and yesterday had a day of culture.</p> <p>First up: the brand new <a href=\"https://www.vam.ac.uk/east/storehouse/visit\">V&amp;A East Storehouse</a> museum in the Queen Elizabeth Olympic Park near Stratford, which opened on May 31st this year.</p> <p>This is a delightful new format for a museum. The building is primarily an off-site storage area for London's Victoria and Albert museum, storing 250,000 items that aren't on display in their main building.</p> <p>The twist is that it's also open to the public. Entrance is free, and you can climb stairs and walk through an airlock-style corridor into the climate controlled interior, then explore three floors of walkways between industrial shelving units holding thousands of items from the collection.</p> <p>There is almost no signage aside from an occasional number that can help you look up items in the online catalog.</p> <p>I found the lack of signs to be unexpectedly delightful: it compels you to really pay attention to the items on display.</p> <p>There's so much great stuff in here. I particularly appreciated the two storey street-facing façades of <a href=\"https://en.wikipedia.org/wiki/Robin_Hood_Gardens\">Robin Hood Gardens</a>, a brutalist London residential estate completed in 1972 and demolished in 2017 through 2025. I also",
            "title": "V&A East Storehouse and Operation Mincemeat in London"
        },
        {
            "content": [
                "<a href=\"https://x.com/ednewtonrex/status/1960301927561941360\">Is generative AI making</a> <a href=\"https://t.co/sS7gx18qzw\">it harder for young people to find jobs</a>?\n\nMy answer is:\n<ol>\n \t<li>Yes, definitely, in terms of for any given job that exists finding the job and getting hired. That’s getting harder. AI is most definitely screwing up that process.</li>\n \t<li>Yes, probably, in terms of employment in automation-impacted sectors. It always seemed odd to think otherwise, and this week’s new study has strong evidence here.</li>\n \t<li>Maybe, overall, in terms of the jobs available (excluding search and matching effects from #1), because AI should be increasing employment in areas not being automated yet, and that effect can be small and still dominate.\n<div> <span id=\"more-24678\"></span> </div></li>\n</ol>\n<a href=\"https://www.derekthompson.org/p/the-evidence-that-ai-is-destroying\">The claims go back and forth on the employment effects of AI</a>. As Derek Thompson points out, if you go by articles in the popular press, we’ve gone from ‘possibly’ to ‘definitely yes’ to ‘almost certainly no’ until what Derek describes as this week’s ‘plausibly yes’ and which others are treating as stronger than that.\n<blockquote>Derek Thompson: To be honest with you, I considered this debate well and truly settled. <em>No</em>, I’d come to think, <em>AI is probably not wrecking employment for young people</em>. But now, I’m thinking about changing my mind again.</blockquote>\nIt’s weird to pull an ‘I told you all so’ when what you said was ‘I am confused and you all are overconfident’ but yeah, basically. The idea that this was ‘well and truly settled’ always seemed absurd to me even considering present effects, none of these arguments should have filled anyone with confidence and neither should the new one, and this is AI so even if it definitively wasn’t happening now who knows where we would be six months later.\n\nPeople changing their minds a lot reflects, as Derek notes, <a href=\"https://x.com/DKThomp/status/1960717151884730626\">the way discovery, evaluation, discourse and science are supposed to work</a>, except for the overconfidence.\n\nMost recently before this week we had claims that what looks like effects of AI automation are delayed impacts from Covid, various interest rate changes, existing overhiring or other non-AI market trends.\n\n<a href=\"https://www.wsj.com/economy/jobs/ai-entry-level-job-impact-5c687c84?mod=hp_lead_pos9\">The new hotness</a> is <a href=\"https://t.co/sS7gx18qzw\">this new Stanford study from Brynjolfsson, Chandar and Chen</a>:\n<blockquote>This paper examines changes in the labor market for occupations exposed to generative artificial intelligence using high-frequency administrative data from the largest payroll software provider in the United States.\n\nWe present six facts that characterize these shifts. We find that since the widespread adoption of generative AI, early-career workers (ages 22-25) in the most AI-exposed occupations have experienced a 13 percent relative decline in employment even after controlling for firm-level shocks.\n\nIn contrast, employment for workers in less exposed fields and more experienced workers in the same occupations has remained stable or continued to grow.\n\nWe also find that adjustments occur primarily through employment rather than compensation. Furthermore, employment declines are concentrated in occupations where AI is more likely to automate, rather than augment, human labor. Our results are robust to alternative explanations, such as excluding technology-related firms and excluding occupations amenable to remote work.</blockquote>\nEffects acting through employment rather than compensation makes sense since the different fields are competing against each other for labor and wages are sticky downwards even across workers.\n<blockquote><a href=\"https://x.com/econ_b/status/1960242091159667116\">Bharat Chanar</a> (author): We observe millions of workers each month. Use this cut the data finely by age and occ.\n\nWhat do we find?\n\nStories about young SW developers struggling to find work borne out in data\n\nEmployment for 22-25 y/o developers <img alt=\"⬇\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/2b07.png\" style=\"height: 1em;\" /> ~20% from peak in 2022. Older ages show steady rise.\n<div>\n<figure>\n<div>\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!62uj!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6c5d11bb-5983-49f6-8317-27e7c3ff6a73_908x604.jpeg\" /></figure>\n\n<div></div>\n</div></figure>\n</div>\nThis isn&#8217;t just about software. See a similar pattern for customer service reps, another job highly exposed to AI. For both roles, the decline is sharpest for the 22-25 age group, with older, more experienced workers less affected.\n<div>\n<figure>\n<div>\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!HcMV!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4d3fa1b2-7cd8-46b6-8c9d-8ccd2f485c74_936x624.jpeg\" /></figure>\n\n<div></div>\n</div></figure>\n</div>\nIn contrast, jobs less exposed to AI, like health aides, show the opposite trend. These jobs, which require in-person physical tasks, have seen the fastest employment growth among youngest workers.\n\n…\n\nOverall, job market for entry-level workers has been stagnant since late 2022, while market for experienced workers remains robust. Stagnation for young workers driven by declines in AI-exposed jobs. Of course, lots of changes in the economy, so this is not all caused by AI.</blockquote>\nNote the y-axis scale on the graphs, but that does seem like a definitive result. It seems far too fast and targeted to be the result of non-AI factors.\n<blockquote><a href=\"https://x.com/jburnmurdoch/status/1960324626254327882\">John Burn-Murdoch</a>: Very important paper, for two reasons:\n<ol>\n \t<li>Key finding: employment *is* falling in early-career roles exposed to LLM automation</li>\n \t<li>Shows that administrative data (millions of payroll records) is much better than survey data for questions requiring precision (occupation x age)</li>\n</ol>\n</blockquote>\nThere’s always that battle between ‘our findings are robust to various things’ and ‘your findings go away when you account for this particular thing in this way,’ and different findings appear to contradict.\n\nI don’t know for sure who is right, but <a href=\"https://x.com/ben_j_todd/status/1960355095461216626\">I was convinced by their explanation of why they have better data sources and thus they’re right and the FT study was wrong</a>, in terms of there being relative entry-level employment effects that vary based on the amount of automation in each sector.\n\nAreas with automation from AI saw job losses at entry level, whereas areas with AI amplification saw job gains, but we should expect more full automation over time.\n\nThere’s the additional twist that a 13 percent decline in employment for the AI-exposed early-career jobs does not mean work is harder to find. Everyone agrees AI will automate away some jobs. The bull case for employment is not that those jobs don’t go away. It is that those jobs are replaced by other jobs. So the 13% could be an 11% decline in some areas and a 2% increase in other larger areas, where they cancel out. AI is driving substantial economic growth already which should create jobs. We can’t tell.\n\nThere is one place I am very confident AI is making things harder. That is the many ways it is making it harder to find and get hired for what jobs do exist. Automated job applications are flooding and breaking the job application market, most of all in software but across the board. Matching is by all reports getting harder rather than easier, although if you are ahead of the curve on AI use here you presumably have an edge.\n\nPredictions are hard, especially about the future, but I would as strongly as always disagree with this advice from Derek Thompson:\n<blockquote><a href=\"https://www.derekthompson.org/p/the-evidence-that-ai-is-destroying\">Derek Thompson</a>: Someone once asked me recently if I had any advice on how to predict the future when I wrote about social and technological trends. <em>Sure</em>, I said. <em>My advice is that predicting the future is impossible, so the best thing you can do is try to describe the present accurately</em>.\n\nSince most people live in the past, hanging onto stale narratives and outdated models, people who pay attention to what’s happening as it happens will appear to others like they’re predicting the future when all they’re doing is describing the present.</blockquote>\nPredicting the future is hard in some ways, but that is no reason to throw up one’s hands and pretend to know nothing. We can especially know big things based on broad trends, destinations are often clearer than the road towards them. And in the age of AI, while predicting the present puts you ahead of many, we can know for certain many ways the future will not look like the present.\n\nThe most important and in some ways easiest things we can say involve what would happen with powerful or transformational AI, and that is really important, the only truly important thing, but in this particular context that’s not important right now.\n\nIf by the future we do mean the effect on jobs, and we presume that the world is not otherwise transformed so much we have far bigger problems, we can indeed still say many things. At minimum, we know many jobs will be amplified or augmented, and many more jobs will be fully automated or rendered irrelevant, even if we have high uncertainty about which ones in what order how fast.\n\nWe know that there will be some number of new jobs created by this process, especially if we have time to adjust, but that as AI ‘automates the new jobs as well’ this will get harder and eventually break. And we know that there is a lot of slack for an increasingly wealthy civilization to hire people for quite a lot of what I call ‘shadow jobs,’ which are jobs that would already exist except labor and capital currently choose better opportunities, again if those jobs too are not yet automated. Eventually we should expect unemployment.\n\nGetting more speculative and less confident, earlier than that, it makes sense to expect unemployment for those lacking a necessary threshold of skill as technology advances, even if AI wasn’t a direct substitute for your intelligence. Notice that the employment charts above start at age 22. They used to start at age 18, and before that even younger, or they would have if we had charts back then."
            ],
            "link": "https://thezvi.wordpress.com/2025/08/27/are-they-starting-to-take-our-jobs/",
            "publishedAt": "2025-08-27",
            "source": "TheZvi",
            "summary": "Is generative AI making it harder for young people to find jobs? My answer is: Yes, definitely, in terms of for any given job that exists finding the job and getting hired. That’s getting harder. AI is most definitely screwing &#8230; <a href=\"https://thezvi.wordpress.com/2025/08/27/are-they-starting-to-take-our-jobs/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Are They Starting To Take Our Jobs?"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3134/",
            "publishedAt": "2025-08-27",
            "source": "XKCD",
            "summary": "<img alt=\"Wavefunction collapse is only one interpretation. Under some interpretations, graduate students also have souls.\" src=\"https://imgs.xkcd.com/comics/wavefunction_collapse.png\" title=\"Wavefunction collapse is only one interpretation. Under some interpretations, graduate students also have souls.\" />",
            "title": "Wavefunction Collapse"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-08-27"
}