{
    "articles": [
        {
            "content": [
                "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9613c771-7c5f-4a29-a206-ccd301d18ece_750x560.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"560\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9613c771-7c5f-4a29-a206-ccd301d18ece_750x560.jpeg\" width=\"750\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Reality (1983), Dorothea Tanning</h6><p></p><p><strong>Dear Polly,</strong></p><p><strong>Lately I've noticed I'm always trying to get out of anything that's on my calendar, even if it's something I want to do, or totally don't mind doing. I'm going to the gym after work today, great, wonderful, happy to tick that off my list, but all day whenever anything happens I'm finding myself thinking \"Maybe this will be why I can't go tonight.&#8221; I have a tummy grumble, maybe I'll be too sick. Work is a bit busy, maybe I'll have to work late and miss my class. Maybe I should cancel it now so I can take it off my mental plate. But I'm not sick, and I won't need to work late, I'm just constantly thinking of excuses and reasons not to go. There's nothing else I'd rather do instead at 6 pm tonight, but I just can't seem to get my mind on board with that.</strong></p><p><strong>It's getting exhausting and I can see I've canceled things in the past because of this kind of thinking. Now that I'm noticing it, it's just plain annoying. Do you know what this is? Do you know what I could do to stop it/ fix it/ get around it?</strong></p><p><strong>Can't Stop (Thinking About) Canceling</strong></p><p>Dear CSTAC,</p><p>I used to be like you. I wanted to cancel every plan I made, but not for any particular reason. I just didn&#8217;t want to spend the whole day with a plan looming over my head.</p><p>You might think I wanted to live more spontaneously, but that wasn&#8217;t it. If a group of friends insisted on playing everything by ear, it drove me out of my mind. I wanted a time and a place <em>set in stone</em>. </p><p>Even so, every obligation felt like homework or an onerous medical procedure. I would get tripped up by the logistics: <em>Oof, remember to take a shower in time. Remember to leave early. That&#8217;s a lot of driving. You&#8217;ll be home late. Too bad you can&#8217;t just sit right here in your soft pants eating ramen instead. </em></p><p>Last night I watched the documentary &#8220;Don&#8217;t Die,&#8221; about Bryan Johnson, that wealthy tech dude who&#8217;s trying to live forever. Beyond the perversity of such an obvious and excessive feat of self-branding, what struck me is that Johnson seems to be on a shame-and-trauma-induced quest for total control. He wakes up before dawn, works out, takes hundreds of vitamins, bathes in red lights, receives plasma transfusions from his teenage son, and applies therapeutic shocks to his penis to increase erections. By casting his lifestyle as a courageous experiment designed to help humankind, he spins his rigidity into something honorable, enviable, bold. His heroism also means he&#8217;s finally emancipated from his chubby-kid past &#8212; to continue to be a hero, he can&#8217;t eat fast food, he can&#8217;t date anyone who goes to bed late, he can&#8217;t stray from his plan for a single second. Even though Johnson identifies his Mormon upbringing as oppressive, his lifestyle is a redemptive but also nostalgic quest, a return to the past and a way of making sure the future never arrives. </p><p>Last week, the New York Times ran a feature about Johnson&#8217;s fondness for non-disclosure agreements. On social media, Johnson asserted that the NDAs &#8220;try to create clear boundaries and expectations, so that trust isn&#8217;t left to chance.&#8221; This statement lies at the white hot center of Johnson&#8217;s pursuit, which isn&#8217;t about living forever so much as eliminating all unknowns, obliterating all uncertainty, and legally guaranteeing complete and total control over your physical and also emotional experiences. In other words, his experiment is <em>also</em> about surrender: surrendering to the (sometimes dubious) &#8220;science&#8221; of extending your life span, surrendering to plans and structures that are valiantly justified as helpful to humankind, but also surrendering a sensitive, intelligent mind&#8217;s anxious need for control and perfection to a perfect plan for a perfect body and eternal (safe, sterile, isolated) life. Johnson often asserts that &#8220;the mind is dead.&#8221; He then explains that he&#8217;s been much happier ever since he prioritized his body and now rejects his mind&#8217;s neurotic circling.</p><p>In other words, all of these efforts at control &#8212; planning and scheduling and documenting and legally protecting every minute of your life and putting your body through a daily obstacle course &#8212; are aimed at a way for your <em>mind and heart</em> to finally find rest and peace. </p><p>The irony, of course, is that this quest for ETERNAL LIFE is actually a quest for DEATH: No more tormenting, neurotic thoughts, no uncertainty, no unknowns, no awkwardness, no misunderstandings, no sickness, no fear, no distrust, no sadness, no decline, no messiness, no conflicts, no bewilderment. You will remain exactly this smart and fit and beautiful forever. Cue The Beatles: <em>Nothing&#8217;s gonna change my world.</em> </p><p>Being alive &#8212; fully, truly, thrillingly, <em>dangerously</em> alive &#8212; is the opposite of this. Engaging and connecting with yourself, with your thoughts and feelings and body and heart, with this day and the unpredictable humans in it: these are <em>necessarily</em> risky and unnerving actions. Every day, we age a little. The weather shifts. People we know grow into shapes we don&#8217;t recognize. Our desires bend and move and transform into other desires. We are taken by surprise, over and over again.</p><p>So here&#8217;s what I want you to realize about your own struggles right now: Just as Johnson&#8217;s lifestyle doesn&#8217;t constitute a valiant quest for longevity so much as a drive to escape the anxiety-inducing unknowns of being fully alive, your distaste for plans isn&#8217;t a bold pursuit of <em>more improvisation and spontaneity</em> or even <em>more alone time</em> so much as an urge for LESS:  less engagement, less hassles, less unknowns, less discomfort. </p><p>There&#8217;s a lot of anxiety in your picture, in other words. Some anxiety is generated by your mind, which has the bad habit of latching onto any plan and recasting it as something you don&#8217;t want. Some anxiety is in your storytelling, which imagines that the only real relief from uncertainty, stress, awkwardness, and other calamities lies in eliminating all unnecessary plans from your schedule and also becoming better, better, best. </p><p>But what do you do with the time you&#8217;ve created for yourself? Do you luxuriate at home, relishing your evenings, feeling absolutely certain that you are truly a human being who wants to be alone as much as possible? Do you return from a dinner with friends feeling depleted and angry, while you crawl into bed after a night alone feeling deeply satisfied? Do you come home from the gym feeling annoyed that you worked out?</p><p>In my life, every quest for LESS has been a disguised plea for MORE: More satisfaction, more engagement, more joy. I used to say &#8220;I hate being too busy,&#8221; and as true as this felt, what I meant was &#8220;I hate blaming myself for every single decision I make&#8221; and &#8220;I hate the stories I tell about my obligations in advance&#8221; and &#8220;I hate taking on projects I don&#8217;t believe in&#8221; and &#8220;I hate feeling locked into friendships where I don&#8217;t feel like I can tell the truth&#8221; and &#8220;I hate pretending to like things that I don&#8217;t like&#8221; and &#8220;I hate having to act cheerful when I&#8217;m in a bad mood.&#8221; </p><p>&#8220;I hate being too busy&#8221; also meant &#8220;I&#8217;m anxious&#8221; and &#8220;I don&#8217;t know how to be less anxious because whenever I leave the house, I feel inauthentic, on edge, and overwhelmed.&#8221; These are the sounds that shame and trauma make, and they can keep you from making plans with old friends (even though you feel at ease with them), stop you from going to the gym (even though you feel better when you leave), prevent you from taking classes in something you&#8217;re bad at (even though, eventually, you don&#8217;t mind being bad at things; it actually feels good to just <em>do stuff</em> without expectations), and keep you at home every night (even though there&#8217;s a kind of dread that sets in after several days in a row of binge-watching whatever). </p><p>When you&#8217;re anxious, you want peace. You want your mind to be dead. You want total control over the future. You overvalue your thoughts about events <em>before</em> they happen and undervalue your feelings about events <em>after</em> they happen.</p><p>In other words, you undervalue yourself. You cast blame every day. You preemptively blame yourself for the way your mind works and the stories you tell. But this blame isn&#8217;t new; it&#8217;s an outcropping of your shame, which is a constant in your life. You&#8217;re ashamed of how little you want to DO THINGS but you&#8217;re also ashamed of not doing enough.</p><p>I want you to try this radical notion on for size: You&#8217;re ashamed of yourself and everything you do. </p><p>Check in and see if it&#8217;s true: You get on the bus and you imagine that people don&#8217;t like the sight of you. At work, you say something that&#8217;s designed to be helpful but you correct yourself afterwards because it wasn&#8217;t quite right. You walk into social situations coaching yourself on what not to do, and you leave second-guessing your words and behaviors. This is how debilitating shame plays out in day-to-day life: You live inside your head and your head is your enemy.</p><p>So even though it may be that you find plans and scheduling and being busy oppressive, the heart of the matter is that you find EVERYTHING oppressive, because you&#8217;re oppressed by the steady notion that you&#8217;re DOING EVERYTHING WRONG, ALL THE TIME.</p><p>So instead of MORE WRONG CHOICES, you want LESS. You want peace and rest from the shame you feel over all of your bad choices every day, big and small. But even when you get peace and rest? You don&#8217;t feel better. You feel worse. </p><p>The answer to this state of affairs is not to power down your mind entirely while locking in a rigid schedule that you never question (Bryan Johnson&#8217;s strategy). While that&#8217;s a decent short-term solution, over the long haul, you&#8217;ll (rightly) start to wonder why the fuck you&#8217;re doing the things you do, and because you&#8217;re not allowed to think or feel, just adhere to a bulletproof, perfectionist plan, you won&#8217;t know and you&#8217;ll feel ashamed of any (necessarily slow, difficult) effort to try to find out. To remain the valiant hero, you can never change course. </p><p>Instead, the answer is to attune yourself to what you enjoy, and give yourself the absolute right to pursue enjoyment, free of the constant measuring and guilting and shaming and corrections and noises of your mind.</p><p>This is far less simple than it sounds. Because for someone who&#8217;s ashamed of her own body and mind, what&#8217;s enjoyable? When shame has rendered you inauthentic and neurotic about most of what you do, soft pants and soft serve are the only enjoyable-sounding options. And lord knows, I am NOT taking a stand against soft pants and soft serve here! Never! I just want to make you aware that you might crave THE EXACT OPPOSITE OF WHAT YOU BELIEVE YOU CRAVE. </p><p>That&#8217;s why every reflective, thoughtful, accepting, calm journey into your own preferences and desires, pushing away shame left and right, yields such surprising results. For example: I moved away from LA because I wanted a calmer, simpler, smaller life, and now I&#8217;m busier and more scheduled and more social than ever. But I know why I do everything I do. I&#8217;m allowed to speak my mind. I&#8217;m allowed to change course as needed. I&#8217;m allowed to be very bad at things as I learn &#8212; <em>forever</em> bad at things, if necessary. LESS led to MORE, because as I eliminated empty ambitions and pointless obligations, I suddenly had all of this free time and space for activities and pursuits that felt GOOD, that I didn&#8217;t dread, that I didn&#8217;t worry about, that I refused to overthink or evaluate. </p><p>Less evaluating and berating and shaming leads to more enjoyment, more pleasure. And also? Sometimes just doing some random activity, on a regular schedule, that makes you feel stupid and outmatched and unskilled and awkward, actually leads you to feel more relaxed and accepting and alive inside your skin. Because by taking on something hard and mostly pointless, you&#8217;re surrendering control. You&#8217;re giving up on perfection. You can&#8217;t overthink such a thing or correct yourself constantly because the entire pursuit is one big fuck-up after another. You become tolerant of surrender, of lack of control, of simply existing.</p><p>That&#8217;s peace &#8212; the fully, truly, thrillingly, <em>dangerously</em> alive kind of peace that makes you keep your inconvenient and pesky plans in spite of your love of soft pants and naps and binge-watching whatever. It&#8217;s the kind of peace that makes it okay to say no sometimes, and to bail on a plan occasionally. It&#8217;s the kind of peace that lowers your anxiety and erodes your shame. </p><p>So I want to congratulate you for noticing that you dread ALL PLANS. This is the start of your path away from neuroticism and shame, toward pleasure and desire and joy. This path begins with jittery nerves and annoying scheduling and committing to things you&#8217;re not even sure you like. This path includes awkwardness and firmer boundaries and irritations and more honesty and unpredictable strangers and yes, some oppressive obligations. There are no heroic stories to tell. In fact, your dread may increase at first!</p><p>Remind yourself that it&#8217;s all an experiment. You might try one thing and discover that you like the opposite thing. You&#8217;re the one who decides. Resist the urge to imagine trouble in advance,  or second-guess your choices after the fact. Disinvite shame and welcome curiosity. Show up and notice how you feel. </p><p>Keep showing up without evaluating anything or measuring the validity of your choices. This isn&#8217;t about mastery, it&#8217;s about pleasure. Pleasure erodes shame. Perfectionism heightens shame. Eventually, you will learn to embrace reality, good and bad, irritating and thrilling. You will learn to tolerate flaws and fumbles and uncertainty and unknowns. You will learn to enjoy the mysteries <em>and</em> the hassles of being fully alive.</p><p>When you are fully, <em>dangerously</em> alive, every day is bracing, unnerving, bewildering. There are calamities waiting around every corner. People are terrible and delightful in unexpected ways every day. The temperature rises and falls, the winds shift, the sun disappears behind a cloud, your mood lifts and then darkens.</p><p>But this life doesn&#8217;t last that long. Taste every disappointment, feel every shock, relish every tear, savor each new discovery.</p><p>You don&#8217;t know a thing about the person you&#8217;ll turn out to be in a few years. That&#8217;s what&#8217;s so incredible: When you&#8217;re fully alive, you&#8217;re constantly surprised. Joy springs from surprise, from uncertainty, from surrender. Romance and trust and deep communion are <em>always</em> left to chance. Dare to cultivate curiosity instead of fear and control. Dare to celebrate whatever comes next. </p><p>Polly</p><div><hr /></div><p><em>Thanks for reading Ask Polly! Send your letters to askpolly@protonmail.com. Today, try to relish the endless hassles of being exactly who you are, where you are. Your life is wildly romantic &#8212; not in the past, not in the future, but right now. Open your heart and feel it.</em></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.ask-polly.com/subscribe\"><span>Subscribe now</span></a></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.ask-polly.com/p/why-do-i-always-try-to-get-out-of?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share\"><span>Share</span></a></p>"
            ],
            "link": "https://www.ask-polly.com/p/why-do-i-always-try-to-get-out-of",
            "publishedAt": "2025-04-01",
            "source": "Ask Polly",
            "summary": "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9613c771-7c5f-4a29-a206-ccd301d18ece_750x560.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"560\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9613c771-7c5f-4a29-a206-ccd301d18ece_750x560.jpeg\" width=\"750\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Reality (1983), Dorothea Tanning</h6><p></p><p><strong>Dear Polly,</strong></p><p><strong>Lately I've noticed I'm always trying to get out of anything that's on my calendar, even if it's something I want to do, or totally don't mind doing. I'm going to the gym after work today, great, wonderful, happy to tick that off my list, but all day whenever anything happens I'm finding myself thinking \"Maybe this will be why I can't go tonight.&#8221; I have a tummy grumble, maybe I'll be too sick. Work is a bit busy, maybe I'll have to work late and miss my",
            "title": "'Why Do I Try to Get Out of Every Plan?'"
        },
        {
            "content": [
                "<p><small>This post was adapted from an internal doc I wrote at <a href=\"https://www.wave.com/en/\">Wave</a>.</small></p>\n<p>Welcome to being a manager! Your time-management problem just got a lot harder.</p>\n<p>As an IC, you can often get away with a very simple time-management strategy:</p>\n<ol>\n<li>Decide what your one most important thing is.</li>\n<li>Work on it until it’s done.</li>\n<li>GOTO 1</li>\n</ol>\n<p>As a team lead, this isn’t going to work, because much more of your work is interrupt-driven or gets blocked for long periods of time. One-on-ones! Code reviews! Design reviews! Prioritization meetings! Project check-ins! All of these are subject to an external schedule rather than being the type of thing that you can push on in a single focused block until it’s done.</p>\n<p>Being a team lead means three big changes for your time management:</p>\n<ol>\n<li>\n<p>You no longer have a single most important thing. You’ll have to learn how to juggle competing priorities.</p>\n</li>\n<li>\n<p>Your most important responsibility is for your team’s output, not your personal output. That means that individual engineering work goes last in your list of potential most important things.</p>\n</li>\n<li>\n<p>You’ll need to start spending some of your time on a <a href=\"http://www.paulgraham.com/makersschedule.html\">manager’s schedule</a>:</p>\n<blockquote>\n<p>There are two types of schedule, which I&rsquo;ll call the manager&rsquo;s schedule and the maker&rsquo;s schedule. The manager&rsquo;s schedule is for bosses. It&rsquo;s embodied in the traditional appointment book, with each day cut into one hour intervals. You can block off several hours for a single task if you need to, but by default you change what you&rsquo;re doing every hour.</p>\n<p>Most powerful people are on the manager&rsquo;s schedule. It&rsquo;s the schedule of command. But there&rsquo;s another way of using time that&rsquo;s common among people who make things, like programmers and writers. They generally prefer to use time in units of half a day at least. You can&rsquo;t write or program well in units of an hour. That&rsquo;s barely enough time to get started.</p>\n</blockquote>\n</li>\n</ol>\n<p>Here’s some advice on how to cope with those changes.</p>\n<h2 id=\"have-accurate-expectations-of-yourself\">Have accurate expectations of yourself</h2>\n<p>Your responsibilities to your team will take time, and even more importantly, <a href=\"https://www.benkuhn.net/attention/\">attention</a>. That means you’ll be a lot less productive on IC work than you have been in the past—especially at first while you’re finding your legs. Additionally, your time will be less predictable week-to-week as you might have to spend an unknown amount of time responding to “inbound” work.</p>\n<p>For the first few months, you should treat any individual engineering work that you get done as a bonus. Even after that, you should expect to have something like 10-20% less individual output per engineer you manage, depending on how experienced you are, they are, etc., and with substantial week-to-week variance.</p>\n<p>To mitigate this, my rule for myself has been to make sure that my IC work is <a href=\"https://en.wikipedia.org/wiki/Time_management%23The_Eisenhower_Method\">important but not urgent</a>—i.e. that nobody will be sad and no plans will be derailed if I end up having to spend the next week firefighting instead of pushing it forward.</p>\n<p>For honing my intuitions about how much I can actually expect to accomplish, I’ve found time tracking very useful (see <a href=\"https://www.wave.com/en/blog/time-tracking/\">How time tracking helped me be a better manager</a> and <a href=\"https://www.benkuhn.net/50pct/\">I apparently got 50% better at my job last month</a>).</p>\n<h2 id=\"prioritize-ruthlessly\">Prioritize ruthlessly</h2>\n<p>A corollary of the above is that it becomes very important for you to prioritize what to work on, both on an hour-to-hour cadence and on a larger timescale.</p>\n<p>It’s not possible to write down a full algorithm for prioritizing in a blog post—that’s why they pay us the big bucks—but here are some heuristics for which things are most worth prioritizing:</p>\n<ul>\n<li><strong>Deadlines where something bad happens if you miss them.</strong> (e.g. performance improvements in advance of a holiday rush.) Note that the badness of missing deadlines varies wildly. Make a habit of asking “what is the reason for this deadline?” for any deadline-driven project.</li>\n<li><strong>Work that increases your or your team’s future bandwidth.</strong> This can include hiring, addressing tech / process debt, automating toil, mentoring people, reducing pager burden, etc. A useful way of thinking about it is to rank this kind of work based on the “payback period,” or how long it takes before the time saved by the improvement exceeds the time invested in making it.</li>\n<li><strong>One-on-ones.</strong> Try very hard not to cancel these, unless you’re on vacation—the other 39.5 hours a week they’re focused on what you need from them, so please don’t disdain the 0.5 hours you spend focused on what they need from you. If you cancel too many, expect your reports to feel less safe bringing up tricky things, and to have more issues “blow up” because they didn’t get addressed early.</li>\n</ul>\n<h2 id=\"unemploy-your-future-self\">Unemploy your future self</h2>\n<p>One of the most important types of “work that increases your or your team’s future bandwidth” is delegating things. This is something entire books have been written about, but here’s how to avoid a few common delegation pitfalls for new team leads:</p>\n<ul>\n<li>\n<p><strong>Negotiate how hands-on to be.</strong> Effective delegation means finding the right balance between micromanaging, and throwing your report to the wolves. The stereotype is that new managers often micromanage, but at Wave, I’ve noticed that new managers often err on the side of <em>under</em>managing, or being too hands-off, perhaps out of a desire to signal that they trust their reports.</p>\n<p>If you’re unsure, it’s good to have an explicit conversation with the person you’re delegating to about how much support they want. E.g. “do you want to do the design for this feature yourself, have me do the high-level and fill in the details, or have me write the entire design doc?”</p>\n</li>\n<li>\n<p><strong>Calibrate to your team members’ <a href=\"https://getlighthouse.com/blog/management-concept/\">task-relevant maturity</a></strong>, or how capable they are of independently doing a particular type of task. A senior engineer should be able to design most features independently (with review), but give the same design task to a junior engineer and they’ll probably flail around and make no progress. You should be maintaining a mental map of each of your team members’ strengths and weaknesses—and updating it over time as you help them improve.</p>\n</li>\n<li>\n<p><strong>Delegate ahead of future growth.</strong> Your team’s workload is going to increase over time, so even if you don’t feel like you have too much work to do right now, you probably will in the future, unless you currently feel <em>under</em>utilized. You should aim for a workload where in the steady state, you feel like you have some slack capacity.</p>\n</li>\n<li>\n<p><strong>Delegate “stretch projects” to help your team level up.</strong> Getting enough slack might require you to delegate work that no one else on your team can currently do. Take your mental strengths-and-weaknesses map, ask yourself what the most important growth directions for each of those team members are, and figure out how to give them work that stretches them in that direction. Note that these delegations will probably require more frequent monitoring, since your reports will have less task-relevant maturity on their stretch projects!</p>\n</li>\n</ul>\n<h2 id=\"a-five-step-help-im-overwhelmed-checklist\">A five-step “help, I’m overwhelmed” checklist</h2>\n<p>Despite your best efforts to follow the above advice, there will probably come a time when you feel very stressed about the amount of work on your plate. When that time comes, here’s what to do:</p>\n<ol>\n<li>Schedule time with your manager, for the soonest slot you can, to triage your todo list. (If the primary stakeholder for your scariest todos is your PM, schedule with them instead.)</li>\n<li>Make a list of everything that’s on your plate currently. Yes, everything, even that code review that’s been sitting in your backlog for the last 3 months.</li>\n<li>At the meeting you scheduled in step 1, figure out how to delegate everything in that list you can delegate, then stack-rank the remainder.</li>\n<li>Realistically (see <a href=\"https://www.benkuhn.net/\">Have accurate expectations of yourself</a>) decide how far down the list you’re going to get. Remember to leave yourself some slack for whatever comes up!</li>\n<li>For things below the cutoff, decide that you’re not going to do them, and notify everyone who cares that you probably won’t get to it.</li>\n</ol>\n<h2 id=\"carve-out-focused-time\">Carve out focused time</h2>\n<p>If you’re not careful, it’s easy to fill your entire calendar with meetings, Slack, etc. and have no time for <a href=\"https://www.calnewport.com/books/deep-work/\">deep work</a>. With careful planning, you can avoid this by “batching” all your distractions to particular times of day.</p>\n<p>There are lots of tactical tips for doing this; I catalogued some that work for me in <a href=\"https://www.benkuhn.net/focustools/\">Tools for keeping focused</a>.</p>\n<p>One tech-lead-specific one that I’ll add is <em>batching meetings</em>: I schedule all my meetings back-to-back on Tuesdays and Thursdays to leave the rest of the week as free as possible for deep work.</p>\n<h2 id=\"appendix-further-reading\">Appendix: further reading</h2>\n<ul>\n<li><a href=\"https://mindingourway.com/rest-in-motion/\">Rest in Motion</a></li>\n<li><a href=\"https://www.wave.com/en/blog/time-tracking/\">How time tracking helped me be a better manager</a></li>\n<li><a href=\"https://lethain.com/time-management/\">Time management: the leadership meta-problem.</a></li>\n<li><a href=\"https://www.benkuhn.net/focustools/\">Tools for keeping focused</a></li>\n<li><a href=\"https://www.benkuhn.net/attention/\">Attention is your scarcest resource</a></li>\n<li><a href=\"https://www.benkuhn.net/50pct/\">I apparently got 50% better at my job last month</a></li>\n<li><a href=\"http://www.paulgraham.com/top.html\">The Top Idea in Your Mind</a></li>\n<li><a href=\"http://www.paulgraham.com/makersschedule.html\">Maker&rsquo;s Schedule, Manager&rsquo;s Schedule</a></li>\n<li><a href=\"https://www.benkuhn.net/weekly/\">My weekly review habit</a></li>\n</ul>"
            ],
            "link": "https://www.benkuhn.net/tmgr/",
            "publishedAt": "2025-04-01",
            "source": "Ben Kuhn",
            "summary": "have accurate expectations of yourself • prioritize ruthlessly • unemploy your future self • a five-step “help, I’m overwhelmed” checklist • carve out focused time",
            "title": "Advice for time management as a manager"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Picasso got it right: Great artists steal. Even if he didn’t actually say it, and we all just repeat the quote because Steve Jobs used it. Because it strikes at the heart of creativity: None of it happens in a vacuum. Everything is inspired by something. The best ideas, angles, techniques, and tones are stolen to build everything that comes after the original.<br /><br /></div><div>Furthermore, the way to learn originality is to set it aside while you learn to perfect a copy. You learn to draw by imitating the masters. I learned photography by attempting to recreate great compositions. I learned to program by aping the Ruby standard library.<br /><br /></div><div>Stealing good ideas isn’t a detour on the way to becoming a master — it’s the straight route. And it’s nothing to be ashamed of.<br /><br /></div><div>This, by the way, doesn’t just apply to art but to the economy as well. Japan became an economic superpower in the 80s by first poorly copying Western electronics in the decades prior. China is now following exactly the same playbook to even greater effect. You start with a cheap copy, then you learn how to make a good copy, and then you don’t need to copy at all.<br /><br /></div><div>AI has sped through the phase of cheap copies. It’s now firmly established in the realm of good copies. You’re a fool if you don’t believe originality is a likely next step. In all likelihood, it’s a matter of <em>when</em>, not <em>if</em>. (And we already have plenty of early indications that it’s actually already here, on the edges.)<br /><br /></div><div>Now, whether that’s <em>good</em> is a different question. Whether we want AI to become truly creative is a fair question — albeit a theoretical or, at best, moral one. Because it’s going to happen if it can happen, and it almost certainly can (or even has).<br /><br /></div><div>Ironically, I think the peanut gallery disparaging recent advances — like the Ghibli fever — over minor details in the copying effort will only accelerate the quest toward true creativity. AI builders, like the Japanese and Chinese economies before them, eager to demonstrate an ability to exceed.<br /><br /></div><div>All that is to say that AI is in the \"Good Copy\" phase of its creative evolution. Expect \"The Great Artist\" to emerge at any moment.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/great-ai-steals-280615be",
            "publishedAt": "2025-03-31",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Picasso got it right: Great artists steal. Even if he didn’t actually say it, and we all just repeat the quote because Steve Jobs used it. Because it strikes at the heart of creativity: None of it happens in a vacuum. Everything is inspired by something. The best ideas, angles, techniques, and tones are stolen to build everything that comes after the original.<br /><br /></div><div>Furthermore, the way to learn originality is to set it aside while you learn to perfect a copy. You learn to draw by imitating the masters. I learned photography by attempting to recreate great compositions. I learned to program by aping the Ruby standard library.<br /><br /></div><div>Stealing good ideas isn’t a detour on the way to becoming a master — it’s the straight route. And it’s nothing to be ashamed of.<br /><br /></div><div>This, by the way, doesn’t just apply to art but to the economy as well. Japan became an economic superpower in the 80s by first poorly copying Western electronics in the decades prior. China is now following exactly the same playbook to even greater effect. You start with a cheap copy, then you learn how to make a good copy, and then",
            "title": "Great AI Steals"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>I've been running <a href=\"https://omakub.org\">Linux</a>, <a href=\"https://www.lazyvim.org/\">Neovim</a>, and <a href=\"https://frame.work/\">Framework</a> for a year now, but it easily feels like a decade or more. That's the funny thing about habits: They can be so hard to break, but once you do, they're also easily forgotten.</div><div><br />That's how it feels having left the Apple realm after two decades inside the walled garden. It was hard for the first couple of weeks, but since then, it’s rarely crossed my mind.</div><div><br />Humans are rigid in the short term, but flexible in the long term. Blessed are the few who can retain the grit to push through that early mental resistance and reach new maxima.<br /><br /></div><div>That is something that gets harder with age. I can feel it. It takes more of me now to wipe a mental slate clean and start over. To go back to being a beginner. But the reward for learning something new is as satisfying as ever.</div><div><br />But it's also why I've tried to be modest with the advocacy. I don't know if most developers are better off on Linux. I mean, I believe they are, at some utopian level, especially if they work for the web, using open source tooling. But I don't know if they are as humans with limited will or capacity for change.</div><div><br />Of course, it's fair to say that one doesn't want to. Either because one remain a fan of Apple, in dire need of the remaining edge MacBooks retain on efficiency/battery, or simply content inside the ecosystem. There are plenty of reasons why someone might not want to change. It's not just about rigidity.</div><div><br />Besides, it's a dead end trying to convince anyone of an alternative with the sharp end of a religious argument. That kind of <a href=\"https://world.hey.com/dhh/why-i-retired-from-the-tech-crusades-107a51ea\">crusading just seeds resentment and stubbornness</a>. I know that all too well.<br /><br /></div><div>What I've found to work much better is planting seeds and showing off your plowshare. Let whatever curiosity that blooms find its own way towards your blue sky. The mimetic engine of persuasion runs much cleaner anyway.</div><div><br />And for me, it's primarily about <a href=\"https://omakub.org\">my personal computing workbench</a> regardless of what the world does or doesn't. It was the same with finding Ruby. It's great when others come along for the ride, but I'd also be happy taking the trip solo too.<br /><br /></div><div>So consider this a postcard from a year into the Linux, Neovim, and Framework journey. The sun is still shining, the wind is in my hair, and the smile on my lips hasn't been this big since the earliest days of OS X.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/the-year-on-linux-7f30279e",
            "publishedAt": "2025-03-29",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>I've been running <a href=\"https://omakub.org\">Linux</a>, <a href=\"https://www.lazyvim.org/\">Neovim</a>, and <a href=\"https://frame.work/\">Framework</a> for a year now, but it easily feels like a decade or more. That's the funny thing about habits: They can be so hard to break, but once you do, they're also easily forgotten.</div><div><br />That's how it feels having left the Apple realm after two decades inside the walled garden. It was hard for the first couple of weeks, but since then, it’s rarely crossed my mind.</div><div><br />Humans are rigid in the short term, but flexible in the long term. Blessed are the few who can retain the grit to push through that early mental resistance and reach new maxima.<br /><br /></div><div>That is something that gets harder with age. I can feel it. It takes more of me now to wipe a mental slate clean and start over. To go back to being a beginner. But the reward for learning something new is as satisfying as ever.</div><div><br />But it's also why I've tried to be modest with the advocacy. I don't know if most developers are better off on Linux. I mean, I believe they are, at some utopian level, especially if they work for the web, using",
            "title": "The Year on Linux"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>The singularity is the point where artificial intelligence goes parabolic, surpassing humans writ large, and leads to rapid, unpredictable change. The intellectual seed of this concept was planted back in the '50s by early computer pioneer John von Neumann. So it’s been here since the dawn of the modern computer, but I’ve only just come around to giving the idea consideration as something other than science fiction.<br /><br /></div><div>Now, this quickly becomes quasi-religious, with all the terms being as fluid as redemption, absolution, and eternity. What and when exactly is AGI (Artificial General Intelligence) or SAI (Super Artificial Intelligence)? You’ll find a million definitions.<br /><br /></div><div>But it really does feel like we’re on the cusp of <em>something</em>. Even the most ardent AI skeptics are probably finding it hard not to be impressed with recent advances. <a href=\"https://x.com/search?q=%23Ghibli\">Everything Is Ghibli</a> might seem like a silly gimmick, but to me, it flipped a key bit here: the style persistence, solving text in image generation, and then turning those images into <a href=\"https://x.com/PJaccetturo/status/1905151190872309907\">incredible moving pictures</a>.<br /><br /></div><div>What makes all this progress so fascinating is that it’s clear <a href=\"https://world.hey.com/dhh/nobody-knows-anything-9c773a5a\">nobody knows anything</a> about what the world will look like four years from now. It’s barely been half that time since ChatGPT and Midjourney hit us in 2022, and the leaps since then have been staggering.<br /><br /></div><div>I’ve been playing with computers since the Commodore 64 entertained my childhood street with <a href=\"https://www.youtube.com/watch?v=kx-ZROVQGw0\"><em>Yie Ar Kung-Fu</em></a> on its glorious 1 MHz processor. I was there when the web made the internet come alive in the mid-'90s. I lined up for hours for the first iPhone to participate in the grand move to mobile. But I’ve never felt less able to predict what the next token of reality will look like.<br /><br /></div><div>When you factor in <a href=\"https://www.youtube.com/watch?v=I44_zbEwz_w\">recent advances in robotics</a> and pair those with the AI brains we’re building, it’s easy to imagine all sorts of futuristic scenarios happening very quickly: from humanoid robots finishing household chores à la <em>The Jetsons</em> (have you seen how good it’s getting <a href=\"https://www.youtube.com/shorts/8vsTNFUFJEU\">at folding</a>?) to every movie we watch being created from a novel prompt on the spot, to, yes, even armies of droids and drones fighting our wars.</div><div>This is one of those paradigm shifts with the potential for Total Change. Like the agricultural revolution, the industrial revolution, the information revolution. The kind that rewrites society, where it was impossible to tell in advance where we’d land.<br /><br /></div><div>I understand why people find that uncertainty scary. But I choose to receive it as exhilarating instead. What good is it to fret about a future you don’t control anyway? That’s the marvel and the danger of progress: nobody is actually in charge! This is all being driven by a million independent agents chasing irresistible incentives. There’s no pause button, let alone an off-ramp. We’re going to be all-in whether we like it or not.</div><div>So we might as well come to terms with that reality. Choose to marvel at the accelerating milestones we've been hitting rather than tremble over the next.<br /><br /></div><div>This is something most religions and grand philosophies have long since figured out. The world didn’t just start changing; we’ve had these lurches of forward progress before. And humans have struggled to cope with the transition since the beginning of time. So, the best intellectual frameworks have worked on ways to deal.</div><div>Christianity has the Serenity Prayer, which I’ve always been fond of:<br /><br /></div><blockquote><em>God, grant me the serenity<br />to accept the things I cannot change,<br />the courage to change the things I can,<br />and the wisdom to know the difference.</em></blockquote><div><br /></div><div>That’s the part most people know. But it actually continues:<br /><br /></div><blockquote><em>Living one day at a time,<br />enjoying one moment at a time;<br />accepting hardship as a pathway to peace;<br />taking, as Jesus did,<br />this sinful world as it is,<br />not as I would have it;<br />trusting that You will make all things right<br />if I surrender to Your will;<br />so that I may be reasonably happy in this life<br />and supremely happy with You forever in the next.<br />Amen.</em></blockquote><div><br /></div><div>What a great frame for the mind!<br /><br />The Stoics were big on the same concept. Here’s Epictetus:<br /><br /></div><blockquote><em>Some things are in our control and others not. Things in our control are opinion, pursuit, desire, aversion, and, in a word, whatever are our own actions. Things not in our control are body, property, reputation, command, and, in one word, whatever are not our own actions.</em></blockquote><div><br /></div><div>Buddhism does this well too. Here’s the Buddha being his wonderfully brief self:<br /><br /></div><blockquote><em>Suffering does not follow one who is free from clinging.</em></blockquote><div><br /></div><div>I don’t think it’s a coincidence that all these traditions converged on the idea of letting go of what you can’t control, not clinging to any specific preferred outcome. Because you’re bound to be disappointed that way. You don’t get to know the script to life in advance, but what an incredible show, if you just let it unfold.</div><div>This is the broader view of amor fati. You should learn to love not just your own fate, but the fate of the world — its turns, its twists, its progress, and even the inevitable regressions.<br /><br /></div><div>The singularity may be here soon, or it may not. You’d be a fool to be convinced either way. But you’ll find serenity in accepting whatever happens.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/singularity-serenity-0198b8b5",
            "publishedAt": "2025-03-28",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>The singularity is the point where artificial intelligence goes parabolic, surpassing humans writ large, and leads to rapid, unpredictable change. The intellectual seed of this concept was planted back in the '50s by early computer pioneer John von Neumann. So it’s been here since the dawn of the modern computer, but I’ve only just come around to giving the idea consideration as something other than science fiction.<br /><br /></div><div>Now, this quickly becomes quasi-religious, with all the terms being as fluid as redemption, absolution, and eternity. What and when exactly is AGI (Artificial General Intelligence) or SAI (Super Artificial Intelligence)? You’ll find a million definitions.<br /><br /></div><div>But it really does feel like we’re on the cusp of <em>something</em>. Even the most ardent AI skeptics are probably finding it hard not to be impressed with recent advances. <a href=\"https://x.com/search?q=%23Ghibli\">Everything Is Ghibli</a> might seem like a silly gimmick, but to me, it flipped a key bit here: the style persistence, solving text in image generation, and then turning those images into <a href=\"https://x.com/PJaccetturo/status/1905151190872309907\">incredible moving pictures</a>.<br /><br /></div><div>What makes all this progress so fascinating is that it’s clear <a href=\"https://world.hey.com/dhh/nobody-knows-anything-9c773a5a\">nobody knows anything</a> about what the world will look like four years from",
            "title": "Singularity & Serenity"
        },
        {
            "content": [
                "<p>Take me. Now take someone with the combined talents of Von Neumann, Archimedes, Ramanujan, and Mozart. Now take someone smarter again by the same margin and repeat that a few times.</p>\n\n<p><img alt=\"archanujart\" src=\"https://dynomight.net/img/smart/archanujart.svg\" /></p>\n\n<p>Say this Being is created and has an IQ of 300. Let’s also say it can think at 10,000× normal speed. But it only has access to the same resources you do.</p>\n\n<p>Now what?</p>\n\n<p>Let’s assume it would quickly solve all our problems in math and programming and philosophy. (To the extent they’re solvable.) That’s plausible since progress in these fields only requires thinking. What about other fields?</p>\n\n<h2 id=\"other-fields\">Other fields</h2>\n\n<p><strong>How good would it be at predicting the weather?</strong></p>\n\n<p>We’re constantly <a href=\"https://ourworldindata.org/weather-forecasts\">getting better</a> at predicting weather, because:</p>\n\n<ol>\n  <li>\n    <p>We have faster supercomputers to run simulations.</p>\n  </li>\n  <li>\n    <p>We have better data from new satellites, weather stations, and radar.</p>\n  </li>\n  <li>\n    <p>We use machine learning and statistics to exploit patterns in all that data.</p>\n  </li>\n</ol>\n\n<p>The Being could surely design better algorithms for simulations or machine learning. But still: There’s only so much you can do with a given supercomputer or a given amount of data. Weather is a chaotic system. If you want to predict further in the future, you’ll eventually need more FLOPs and better knowledge of starting conditions. Those require bigger supercomputers and better satellites. Just being smart doesn’t (immediately) cause those things to exist.</p>\n\n<p>Best guess: A bit better.</p>\n\n<p><strong>Would it have known that Donald Trump would win the 2024 election?</strong></p>\n\n<p>I don’t think this was knowable. Take all the available polling, economic data, and lessons from history. If you looked at these on Nov 2, 2024, I doubt they provide enough signal to predict the winner with confidence. The truth was out there in people’s voting intentions, but they were buried in the brains of millions of people.</p>\n\n<p>I’m sure the Being would give <em>better</em> predictions. If you let it bet in prediction markets, it would probably make tons of money. But it wouldn’t be able to give geopolitical events 0% or 100% probabilities. It wouldn’t be psychic.</p>\n\n<p>Best guess: No.</p>\n\n<p><strong>Would it beat current chess engines?</strong></p>\n\n<p>The top current chess engine has an Elo of <a href=\"https://en.wikipedia.org/wiki/Stockfish_(chess)\">3625</a>. This is insane. It’s 750 Elo higher than ever achieved by a human. Anyway, the old hated Levitt Equation says that after years of study, a person can achieve an Elo of around (10×IQ)+1000. This suggests the 300 IQ Being would manage an Elo of 4000. If you trust that calculation, and the Being played our current best engine, it would win 81.09% of games, draw 18.88%, and lose 0.03%.</p>\n\n<p>But we shouldn’t trust that calculation. Obviously, the Levitt Equation isn’t accurate even for normal IQs. And I suspect the Being would lose to modern chess engines in complex endgames. Because it turns out that complex endgames in chess aren’t really solved with “intelligence”. Chess engines do incredibly deep searches of trees of possible moves and countermoves. The best move is the thing that comes out of that tree search. There is no other explanation.</p>\n\n<p>We assumed the Being could think 10,000x faster than a normal human, and that would allow it to do some searching of its own, but it still wouldn’t approach the 100,000,000 positions chess engines might evaluate per second.</p>\n\n<p>But maybe that’s wrong? Or maybe the Being could find some way to avoid complex endgames?</p>\n\n<p>(Of course, if the Being had its own computer, it would reprogram it and crush us.)</p>\n\n<p>Best guess: Unsure.</p>\n\n<p><strong>Would it solve “creativity”?</strong></p>\n\n<p>Would the Being be able to create better novels or music or jokes? It would surely be amazing. Since we included Mozart, this is basically true by definition. But there are reasons to think normal-person art would remain valuable.</p>\n\n<p>One is that if you accept an extreme version of <a href=\"https://dynomight.net/bourdieu/\">Bourdieu</a>, then taste is fake and the only reason we “like” anything is so that we can play class games and oppress each other. If so, then it doesn’t matter how “good” the Being’s books are. The upper class will just continue finding ways to demonstrate their cultural capital to keep their less privileged competitors in their place.</p>\n\n<p>Alternatively, maybe you find that life is strange and cruel and beautiful, and sometimes you feel things that seem important but you can’t understand, but sometimes someone else feels the same things and they create something that transcends the gap between your minds and just for a moment you feel that you’re part of some universal story and you don’t feel so alone. Just because the Being is smart doesn’t mean it knows what it’s like to walk in your shoes.</p>\n\n<p>Best guess: It would be great, but if art is borne from experience, normal-person art will still have a place.</p>\n\n<p><strong>Would it solve physics?</strong></p>\n\n<p>If you were sufficiently smart, could you look at all our current experiments and see some underlying pattern? Is there some mathematical trick or idea that will make all the pieces fall into place?</p>\n\n<p>Maybe! Or maybe that’s impossible. Maybe there are just too many rulesets consistent with the observations we have. After all, no one <em>predicted</em> quantum physics. Starting around 1900 we <em>observed</em> strange things, and then we invented quantum physics to make peace with those observations.</p>\n\n<p>If it’s impossible, then all the Being could do in the short term would be to help design new experiments: “Go build <em>this</em> kind of super collider, or <em>this</em> kind of space telescope, please.”</p>\n\n<p>Best guess: Probably not.</p>\n\n<p><strong>Would it cure cancer?</strong></p>\n\n<p>I’ve asked many biologists this question. The universal answer is “no”. The idea seems to be that biology isn’t really limited at the moment by our intelligence, but by our experimental knowledge.</p>\n\n<p>Many people don’t realize just how cumulative modern biology research is. Take these two mental models:</p>\n\n<ol>\n  <li>\n    <p>Biology is a giant pool of phenomena, with people picking random things to investigate.</p>\n  </li>\n  <li>\n    <p>Biology is a “hard onion” that needs to be peeled away layer-by-layer. We use our current knowledge to invent new tools, then use those tools to do experiments, gain new knowledge from those experiments, and then invent new tools.</p>\n  </li>\n</ol>\n\n<p>The truth is a mixture of both, perhaps a bit more like the first. But there’s a lot of the second, too! Modern biology concerns many <em>very small</em> things that we can’t just pick up and manipulate. So instead we build tools to build tools (like <a href=\"https://en.wikipedia.org/wiki/Transcription_activator-like_effector_nuclease\">TALENs</a> or <a href=\"https://en.wikipedia.org/wiki/Molecular_beacon\">molecular beacons</a> or <a href=\"https://en.wikipedia.org/wiki/Phage_display\">phage display</a> or <a href=\"https://en.wikipedia.org/wiki/ChIP_sequencing\">ChIP-seq</a> or <a href=\"https://en.wikipedia.org/wiki/Bioluminescence_imaging\">bioluminescence imaging</a> or <a href=\"https://en.wikipedia.org/wiki/Prime_editing\">prime editing</a>) to see and manipulate them.</p>\n\n<p>So why might the Being be unable to cure cancer? Because perhaps it’s not <em>possible</em> to cure cancer right now. New knowledge and new tools are needed, and both of these depend on the other. Probably the best the Being could do is accelerate that invention loop.</p>\n\n<p>Best guess: No.</p>\n\n<p><strong>Would it solve persuasion?</strong></p>\n\n<p>Would the Being be able to convince anyone of anything? Would it be the best diplomat in history?</p>\n\n<p>Let’s just assume that the Being has the best logic, the best rhetoric, the most convincing emotional appeals, etc., and all calibrated based on who it’s speaking to. Fine. But at the same time, for what fraction of people do you think <em>exist</em> words that would change their mind about Trump or abortion, or the wars in Israel or Ukraine?</p>\n\n<p>I suspect that if you <em>decided</em> to be open-minded, then the Being would probably be extremely persuasive. But I don’t think it’s very common to do that. On the contrary, most of us live most of our lives with strong “defenses” activated.</p>\n\n<p>Would the Being be so good that defenses don’t matter? Would it convince enough people to start a social movement? Would everyone respond by refusing to listen to anything? I have no idea.</p>\n\n<p>Best guess: No idea.</p>\n\n<h2 id=\"themes\">Themes</h2>\n\n<p>There are a few repeated themes above.</p>\n\n<ol>\n  <li>\n    <p>To do many things requires new <strong>fundamental knowledge</strong> (e.g. the results of physical experiments, how molecular biology works). The Being might eventually be able to acquire this knowledge, but it wouldn’t happen automatically because it requires physical experiments.</p>\n  </li>\n  <li>\n    <p>To do other things requires <strong>situational knowledge</strong> (e.g. the voting intentions of millions of people, the temperature and humidify at every position in Earth’s atmosphere, which particular cells in your body have become cancerous as a result of what mutations). Getting this knowledge requires creating and maintaining a complex infrastructure.</p>\n  </li>\n  <li>\n    <p>To do most things requires <strong>moving molecules around</strong>.</p>\n  </li>\n  <li>\n    <p>There are lots of <strong>feedback loops</strong>. Maybe the Being could run its own experiments. But to do that would require building new machines. Which would require moving lots of molecules around. Which would require new machines and new knowledge and new experiments…</p>\n  </li>\n  <li>\n    <p>Finally, there is <strong>chaos/complexity</strong>. Many things that are predictable in principle (e.g. chess, the weather, possibly psychology or social movements) aren’t predictable in practice because the underlying dynamics are too complicated to be understood or simulated.</p>\n  </li>\n</ol>\n\n<h2 id=\"looking-back\">Looking back</h2>\n\n<p>I often think to myself, “Hey self, if super-intelligent AI is invented in a few years, you’ll almost certainly look back on 2025 and feel really stupid for not predicting many things that will seem obvious in retrospect. What are those things? xox, Self.”</p>\n\n<p>(Usually the first thought this prompts is, “Computer security is going to be <em>really</em> important, can we please for the love of god keep our critical systems simple and isolated from the internet?” But let’s put that aside.)</p>\n\n<p>The second thought this prompts is, “Maybe the <em>first-order</em> consequences wouldn’t be that big?” Perhaps it would solve math and programming and overturn all creative industries, and maybe… that’s “all”, at first?</p>\n\n<p>A super-intelligence wouldn’t be a god. I <em>would</em> expect a super-intelligence to be better than humans at creating better super-intelligences. But physics still exists! To do most things, you need to move molecules around. And humans would still be needed to do that, at least at first.</p>\n\n<p>So here’s one plausible future:</p>\n\n<ol>\n  <li>\n    <p>Super-intelligent AI is invented.</p>\n  </li>\n  <li>\n    <p>At <em>first</em>, existing robots cannot replace humans for most tasks. It doesn’t matter how brilliantly it’s programmed. There simply aren’t enough robots and the hardware isn’t good enough.</p>\n  </li>\n  <li>\n    <p>In order to make better robots, lots of research is needed. Humans are needed to move molecules around to build factories and to do that research.</p>\n  </li>\n  <li>\n    <p>So there’s a feedback loop between more/better research, robotics, energy, factories, and hardware to run the AI on.</p>\n  </li>\n  <li>\n    <p>Gradually that loop goes faster and faster.</p>\n  </li>\n  <li>\n    <p>Until one day the loop can continue without the need for humans.</p>\n  </li>\n</ol>\n\n<p>That’s still rather terrifying. But it seems likely that there’s a substantial delay between step 1 and step 6. Factories and power plants take years to build (for humans). So maybe the best mental initial model is as a “multiplier on economic growth” like all the economists have been insisting all along.</p>\n\n<h2 id=\"odds-and-ends\">Odds and ends</h2>\n\n<ul>\n  <li>\n    <p>How quickly could simulations (of, e.g., biological systems) replace physical experiments? I suspect simulations will be limited by the same feedback loops because (1) simulations are limited by available hardware and (2) new fundamental and/or situational knowledge is needed to set the simulations up.</p>\n  </li>\n  <li>\n    <p>Would the Being actually solve all the problems in math? It’s not clear, because, as you get smarter and smarter, is there more interesting math to be done, forever? And does that math keep getting more and more <a href=\"https://en.wikipedia.org/wiki/The_Unreasonable_Effectiveness_of_Mathematics_in_the_Natural_Sciences\">unreasonably effective</a>, forever? Or is an IQ of 300 still actually quite stupid in the grand scheme of things?</p>\n  </li>\n  <li>\n    <p>If you want to comment but don’t like Substack, I’ve created a <a href=\"https://old.lemmy.world/c/dynomight\">forum</a> on lemmy. (I tried this <a href=\"https://dynomight.net/survey-results/\">a year ago</a> with kbin, and 2 weeks later kbin died forever. Hopefully that won’t happen again?)</p>\n  </li>\n</ul>"
            ],
            "link": "https://dynomight.net/smart/",
            "publishedAt": "2025-03-27",
            "source": "Dynomight",
            "summary": "<p>Take me. Now take someone with the combined talents of Von Neumann, Archimedes, Ramanujan, and Mozart. Now take someone smarter again by the same margin and repeat that a few times.</p> <p><img alt=\"archanujart\" src=\"https://dynomight.net/img/smart/archanujart.svg\" /></p> <p>Say this Being is created and has an IQ of 300. Let’s also say it can think at 10,000× normal speed. But it only has access to the same resources you do.</p> <p>Now what?</p> <p>Let’s assume it would quickly solve all our problems in math and programming and philosophy. (To the extent they’re solvable.) That’s plausible since progress in these fields only requires thinking. What about other fields?</p> <h2 id=\"other-fields\">Other fields</h2> <p><strong>How good would it be at predicting the weather?</strong></p> <p>We’re constantly <a href=\"https://ourworldindata.org/weather-forecasts\">getting better</a> at predicting weather, because:</p> <ol> <li> <p>We have faster supercomputers to run simulations.</p> </li> <li> <p>We have better data from new satellites, weather stations, and radar.</p> </li> <li> <p>We use machine learning and statistics to exploit patterns in all that data.</p> </li> </ol> <p>The Being could surely design better algorithms for simulations or machine learning. But still: There’s only so much you can do with a given supercomputer or a given amount of data. Weather is a chaotic system. If",
            "title": "Limits of smart"
        },
        {
            "content": [
                "<p>Over the past two weeks, first Google and then OpenAI rolled out their multimodal image generation abilities. This is a big deal. Previously, when a Large Language Model AI generated an image, it wasn&#8217;t really the LLM doing the work. Instead, the AI would send a text prompt to a separate image generation tool and show you what came back. The AI creates the text prompt, but another, less intelligent system creates the image. For example, if prompted &#8220;<em>show me a room with no elephants in it, make sure to annotate the image to show me why there are no possible elephants</em>&#8221; the less intelligent image generation system would see the word elephant multiple times and add them to the picture. As a result, AI image generations were pretty mediocre with distorted text and random elements; sometimes fun, but rarely useful.</p><p>Multimodal image generation, on the other hand, lets the AI directly control the image being made. While there are lots of variations (and the companies keep some of their methods secret), in multimodal image generation, images are created in the same way that LLMs create text, a token at a time. Instead of adding individual words to make a sentence, the AI creates the image in individual pieces, one after another, that are assembled into a whole picture. This lets the AI create much more impressive, exacting images. Not only are you guaranteed no elephants, but the final results of this image creation process reflect the intelligence of the LLM&#8217;s &#8220;thinking&#8221;, as well as clear writing and precise control.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3bca939e-53c3-40cb-a7cc-6177d2765233_2544x985.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"985\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3bca939e-53c3-40cb-a7cc-6177d2765233_2544x985.png\" width=\"2544\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">The results of the prompt &#8220;show me a room with no elephants in it, make sure to annotate the image to show me why there are no possible elephants&#8221; in Microsoft Copilot&#8217;s traditional image generator (left), and GPT-4o&#8217;s multimodal model (right). Note the traditional model not only shows multiple elephants but also features distorted text.</figcaption></figure></div><p>While the implications of these new image models are vast (and I'll touch on some issues later), let's first explore what these systems can actually do through some examples.</p><h1>Prompting, but for images</h1><p>In my <a href=\"https://a.co/d/dsqw0b1\">book </a>and in many <a href=\"https://www.oneusefulthing.org/p/getting-started-with-ai-good-enough\">posts</a>, I talk about how a useful way to prompt AI is to treat it like a person, even though it isn&#8217;t. Giving clear directions, feedback as you iterate, and appropriate context to make a decision all help humans, and they also help AI. Previously, this was something you could only do with text, but now you can do it with images as well.</p><p>For example, I prompted GPT-4o &#8220;create an infographic about how to build a good boardgame.&#8221; With previous image generators, this would result in nonsense, as there was no intelligence to guide the image generation so words and images would be distorted. Now, I get a good first pass the first time around. However, I did not provide context about what I was looking for, or any additional content, so the AI made all the creative choices. What if I want to change it? Let&#8217;s try.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff655184d-2da2-48dc-b6a3-f97998e66d42_1024x1536.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"348\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff655184d-2da2-48dc-b6a3-f97998e66d42_1024x1536.png\" width=\"232\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>First, I asked it <em>&#8220;make the graphics look hyper realistic instead&#8221;</em> and you can see how it took the concepts from the initial draft and updated their look. I had more changes I wanted: <em>&#8220;I want the colors to be less earth toned and more like textured metal, keep everything else the same, also make sure the small bulleted text is lighter so it is easier to read</em>.&#8221; I liked the new look, but I noticed an error had been introduced, the word &#8220;Define&#8221; had become &#8220;Definc&#8221; - a sign that these systems, as good as they are, are not yet close to perfect. I prompted &#8220;<em>You spelled Define as Definc, please fix</em>&#8221; and got a reasonable output.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5272e543-aefa-4b25-83e5-bb37c78795d9_3143x1541.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"714\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5272e543-aefa-4b25-83e5-bb37c78795d9_3143x1541.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>But the fascinating thing about these models is that they are capable of producing almost any image: &#8220;<em>put this infographic in the hands of an otter standing in front of a volcano, it should look like a photo and like the otter is holding this carved onto a metal tablet</em>&#8221;</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F68702709-44f7-40d8-b8db-a12d60f1892d_1024x1536.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"354\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F68702709-44f7-40d8-b8db-a12d60f1892d_1024x1536.png\" width=\"236\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Why stop there? &#8220;<em>it is night, the tablet is illuminated by a flashlight shining directly at the center of the tablet (no need to show the flashlight)</em>&#8221;&#8212; the results of this are more impressive than it might seem because it was redoing the lighting without any sort of underlying lighting model. &#8220;<em>Make an action figure of the otter, complete with packaging, make the board game one of the accessories on the side. Call it \"Game Design Otter\" and give it a couple other accessories.&#8221; &#8220;Make an otter on an airplane using a laptop, they are buying a copy of Game Design Otter on a site called OtterExpress.&#8221; </em>Impressive, but not quite right: &#8220;<em>fix the keyboard so it is realistic and remove the otter action figure he is holding.</em>&#8221;</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdee5860b-ab5d-423e-8e4d-e9a5244a6c14_2846x1536.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"786\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdee5860b-ab5d-423e-8e4d-e9a5244a6c14_2846x1536.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>As you can see these systems are not flawless&#8230; but also remember that the pictures below are what the results of the prompt &#8220;otter on an airplane using wifi&#8221; looked like two and a half years ago. The state-of-the-art is advancing rapidly.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5922778c-fd21-41a2-a376-7d2690373712_512x512.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"306\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5922778c-fd21-41a2-a376-7d2690373712_512x512.jpeg\" width=\"306\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h1>But what is it good for?</h1><p>The past couple years have been spent trying to figure out what text AI models are good for, and new use cases are being developed continuously. It will be the same with image-based LLMs. Image generation is likely to be very disruptive in ways we don&#8217;t understand right now. This is especially true because you can upload images that the LLM can now directly see and manipulate. Some examples, all done using GPT-4o (though you can also upload and create images in Google&#8217;s <a href=\"https://aistudio.google.com/app/prompts/new_chat\">Gemini Flash</a>):</p><p>I can take a hand-drawn image and ask the AI to &#8220;<em>make this an ad for Speedster Energy drink, make sure the packaging and logo are awesome, this should look like a photograph.</em>&#8221; (This took two prompts, the first time it misspelled Speedster on the label). The results are not as good as a professional designer could create but are an impressive first prototype.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3a923b01-3666-4fbe-822a-a0010c9c8db2_3120x1727.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"806\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3a923b01-3666-4fbe-822a-a0010c9c8db2_3120x1727.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>I can give GPT-4o two photographs and the prompt &#8220;<em>Can you swap out the coffee table in the image with the blue couch for the one in the white couch?</em>&#8221; (Note how the new glass tabletop shows parts of the image that weren&#8217;t there in the original. On the other hand, the table that was swapped is not exactly the same). I then asked, &#8220;<em>Can you make the carpet less faded</em>?&#8221; Again, there are several details that are not perfect, but this sort of image editing in plain English was impossible before.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6fc34e41-837b-4ca9-b00e-c5bab98f8cdb_3297x2099.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"927\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6fc34e41-837b-4ca9-b00e-c5bab98f8cdb_3297x2099.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Or I can create an instant website mockup, ad concepts, and pitch deck for my terrific startup idea where a drone delivers guacamole to you on demand (pretty sure it is going to be a hit). You can see this is not yet a substitute for the insights of a human designer, but it is still a very useful first prototype.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f4dc076-e78c-48d2-ad9a-bce02df874fd_4161x1497.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"524\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f4dc076-e78c-48d2-ad9a-bce02df874fd_4161x1497.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Adding to this, there are many other uses that I and others are discovering including: <a href=\"https://x.com/egeberkina/status/1906088423988875617\">Visual recipes</a>, <a href=\"https://x.com/shivamdwn/status/1905468285006598358\">homepages</a>, <a href=\"https://x.com/emollick/status/1905082967979864303\">textures for video games</a>, <a href=\"https://bsky.app/profile/emollick.bsky.social/post/3lli6v6te7s2j\">illustrated poems</a>, <a href=\"https://x.com/fofrAI/status/1905769743229067326\">unhinged monologues</a>, <a href=\"https://x.com/gizakdag/status/1906038453252542806\">photo improvements</a>, and <a href=\"https://bsky.app/profile/emollick.bsky.social/post/3llfig4qzj22a\">visual adventure games</a>, to name just a few.</p><h1>Complexities</h1><p>If you have been following the online discussion over these new image generators, you probably noticed that I haven&#8217;t demonstrated their most viral use - doing style transfer, where people ask AI to convert photos into images that look like they were made for the Simpsons or by Studio Ghibli. These sorts of application highlight all of the complexities of using AI for art: Is it okay to reproduce the hard-won style of other artists using AI? Who owns the resulting art? Who profits from it? Which artists are in the training data for AI, and what is the legal and ethical status of using copyrighted work for training? These were important questions before multimodal AI, but now developing answers to them is increasingly urgent. Plus, of course, there are many other potential risks associated with multimodal AI. Deepfakes have been trivial to make for at least a year, but multimodal AI makes it easier, including adding the ability to create all sorts of other visual illusions, like <a href=\"https://x.com/deedydas/status/1905909215308447874\">fake receipts</a>. And we don&#8217;t yet understand what biases or other issues multimodal AIs might bring into image generation.</p><p>Yet it is clear that what has happened to text will happen to images, and eventually video and 3D environments. These multimodal systems are reshaping the landscape of visual creation, offering powerful new capabilities while raising legitimate questions about creative ownership and authenticity. The line between human and AI creation will continue to blur, pushing us to reconsider what constitutes originality in a world where anyone can generate sophisticated visuals with a few prompts. Some creative professions will adapt; others may be unchanged, and still others may transform entirely. As with any significant technological shift, we'll need well-considered frameworks to navigate the complex terrain ahead. The question isn't whether these tools will change visual media, but whether we'll be thoughtful enough to shape that change intentionally.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe7e379a5-6d92-496f-93ad-843f52ffe12c_1536x1024.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"218.74175824175825\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe7e379a5-6d92-496f-93ad-843f52ffe12c_1536x1024.png\" width=\"328\" /><div></div></div></a></figure></div><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/subscribe\"><span>Subscribe now</span></a></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/p/no-elephants-breakthroughs-in-image?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share\"><span>Share</span></a></p><p></p><p></p>"
            ],
            "link": "https://www.oneusefulthing.org/p/no-elephants-breakthroughs-in-image",
            "publishedAt": "2025-03-30",
            "source": "Ethan Mollick",
            "summary": "<p>Over the past two weeks, first Google and then OpenAI rolled out their multimodal image generation abilities. This is a big deal. Previously, when a Large Language Model AI generated an image, it wasn&#8217;t really the LLM doing the work. Instead, the AI would send a text prompt to a separate image generation tool and show you what came back. The AI creates the text prompt, but another, less intelligent system creates the image. For example, if prompted &#8220;<em>show me a room with no elephants in it, make sure to annotate the image to show me why there are no possible elephants</em>&#8221; the less intelligent image generation system would see the word elephant multiple times and add them to the picture. As a result, AI image generations were pretty mediocre with distorted text and random elements; sometimes fun, but rarely useful.</p><p>Multimodal image generation, on the other hand, lets the AI directly control the image being made. While there are lots of variations (and the companies keep some of their methods secret), in multimodal image generation, images are created in the same way that LLMs create text, a token at a time. Instead of adding individual words to make a sentence,",
            "title": "No elephants: Breakthroughs in image generation"
        },
        {
            "content": [],
            "link": "https://eugeneyan.com//writing/writing-faq/",
            "publishedAt": "2025-03-30",
            "source": "Eugene Yan",
            "summary": "How I started, why I write, who I write for, how I write, and more.",
            "title": "Frequently Asked Questions about My Writing Process"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/april-cools-gaming-games-for-non-gamers/",
            "publishedAt": "2025-04-01",
            "source": "Hillel Wayne",
            "summary": "<p>My <em>April Cools</em> is out! <a href=\"https://www.hillelwayne.com/post/vidja-games/\" target=\"_blank\">Gaming Games for Non-Gamers</a> is a 3,000 word essay on video games worth playing if you've never enjoyed a video game before. <a href=\"https://www.patreon.com/posts/blog-notes-gamer-125654321?utm_medium=clipboard_copy&amp;utm_source=copyLink&amp;utm_campaign=postshare_creator&amp;utm_content=join_link\" target=\"_blank\">Patreon notes here</a>.</p> <p>(April Cools is a project where we write genuine content on non-normal topics. You can see all the other April Cools posted so far <a href=\"https://www.aprilcools.club/\" target=\"_blank\">here</a>. There's still time to submit your own!)</p> <a class=\"embedded-link\" href=\"https://www.aprilcools.club/\"> <div style=\"width: 100%; background: #fff; border: 1px #ced3d9 solid; border-radius: 5px; margin-top: 1em; overflow: auto; margin-bottom: 1em;\"> <div style=\"float: left; border-bottom: 1px #ced3d9 solid;\"> <img class=\"link-image\" src=\"https://www.aprilcools.club/aprilcoolsclub.png\" /> </div> <div style=\"float: left; color: #393f48; padding-left: 1em; padding-right: 1em;\"> <h4 class=\"link-title\" style=\"margin-bottom: 0em; line-height: 1.25em; margin-top: 1em; font-size: 14px;\"> April Cools' Club</h4> </div> </div></a>",
            "title": "[April Cools] Gaming Games for Non-Gamers"
        },
        {
            "content": [
                "<p><a href=\"https://randsinrepose.com/wp-content/uploads/2025/04/scale.jpg\"><img class=\"alignleft wp-image-4474\" src=\"https://randsinrepose.com/wp-content/uploads/2025/04/scale.jpg\" /></a></p>\n<p>In our 90th epsiode, we walk through all the benefits of improving our exercise strategy.</p>\n<p>Enjoy it now, or <a href=\"https://traffic.libsyn.com/rands/theimportantthing0090.mp3\">download</a> for later. Here&#8217;s a handy <a href=\"https://rands.libsyn.com/feed\">feed</a> or subscribe via <a href=\"https://overcast.fm/itunes1195704939/the-important-thing\">Overcast</a> or <a href=\"https://podcasts.apple.com/us/podcast/the-important-thing/id1195704939\">iTunes</a>.</p>\n<audio class=\"wp-audio-shortcode\" controls=\"controls\" id=\"audio-5141-2\" preload=\"none\" style=\"width: 100%;\"><source src=\"https://traffic.libsyn.com/rands/theimportantthing0090.mp3?_=2\" type=\"audio/mpeg\" /><a href=\"https://traffic.libsyn.com/rands/theimportantthing0090.mp3\">https://traffic.libsyn.com/rands/theimportantthing0090.mp3</a></audio>"
            ],
            "link": "https://randsinrepose.com/archives/the-one-about-exercise/",
            "publishedAt": "2025-04-02",
            "source": "Rands in Repose",
            "summary": "In our 90th epsiode, we walk through all the benefits of improving our exercise strategy. Enjoy it now, or download for later. Here&#8217;s a handy feed or subscribe via Overcast or iTunes. https://traffic.libsyn.com/rands/theimportantthing0090.mp3",
            "title": "The One About Exercise"
        },
        {
            "content": [
                "<p><strong>I.</strong></p><p>In <em>Ballad of the White Horse, </em>G.K. Chesterton describes the Virgin Mary:</p><blockquote><p><em>Her face was like an open word<br />When brave men speak and choose,<br />The very colours of her coat<br />Were better than good news.</em></p></blockquote><p>Why the colors of her coat?</p><p>The medievals took their dyes very seriously. This was before modern chemistry, so you had to try hard if you wanted good colors. Try hard they did; they famously used literal gold, hammered into ultrathin sheets, to make golden highlights.</p><p>Blue was another tough one. You could do mediocre, half-faded blues with azurite. But if you wanted perfect blue, the color of the heavens on a clear evening, you needed ultramarine.</p><p>Here is the process for getting ultramarine. First, go to Afghanistan. Keep in mind, you start in England or France or wherever. Afghanistan is four thousand miles away. Your path takes you through tall mountains, burning deserts, and several dozen Muslim countries that are still pissed about the whole Crusades thing. Still alive? Climb 7,000 feet through the mountains of Kuran Wa Munjan until you reach the mines of Sar-i-Sang. There, in a freezing desert, the wretched of the earth work themselves to an early grave breaking apart the rocks of Badakhshan to mine a few hundred kilograms per year of blue stone - the only lapis lazuli production in the known world.</p><p>Buy the stone and retrace your path through the burning deserts and vengeful Muslims until you&#8217;re back in England or France or wherever. Still alive? That was the easy part. Now you need to go through a chemical extraction process that makes the Philosopher's Stone look like freshman chem lab. \"The lengthy process of pulverization, sifting, and washing to produce ultramarine makes the natural pigment &#8230; roughly ten times more expensive than the stone it came from.\"</p><p>Finally you have ultramarine! How much? I can&#8217;t find good numbers, but Claude estimates that the ultramarine production of all of medieval Europe was around the order of 30 kg per year - not enough to paint a medium-sized wall. Ultramarine had to be saved for ultra-high-value applications. </p><p>In practice, the medievals converged on a single use case - painting the Virgin Mary&#8217;s coat.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0617aea3-37e1-486b-a1ce-8581be3181af_584x793.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"793\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0617aea3-37e1-486b-a1ce-8581be3181af_584x793.png\" title=\"\" width=\"584\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Madonna and Child, by <a href=\"https://www.metmuseum.org/art/collection/search/436892\">Filippino Lippi</a></figcaption></figure></div><p>To us moderns, this seems bizarrely specific. But the Catholic Church had united Europe in a single symbolic language, with lots of rules like \"this style is only used for such-and-such a saint&#8221;. Within this context, &#8220;ultramarine = Virgin Mary&#8217;s coat&#8221; was a normal piece of symbolic vocabulary. </p><p>The Catholic Church did this because it worked. Joe Peasant would go to the festival, and his lord and lady would be wearing lovely blue robes, but the blue would always be very slightly faded. He&#8217;d go off to war, and the knights would have beautiful blue banners, but still, not quite right. Then he would go to church, and there would be a painting of the Virgin Mary, and there - and only there! - the perfect Platonic blue of Heaven would be translated down to Earth. And he would think, yeah, okay, this is the true religion.</p><p>In the 19th century, a German man named Christian Gmelin discovered the process of producing synthetic ultramarine. And in the 1960s, French artist Yves Klein came up with a new synthetic ultramarine that he thought was even bluer. This being the 1960s, Klein leveraged his invention into a bunch of entirely blue paintings - literally, he just painted an entire canvas blue and hung it in a gallery -  which caused various scandals and counterscandals and discourse.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa9b9435a-d32a-41d3-9dea-1e3b7b9c0c98_2243x1541.webp\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"375\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa9b9435a-d32a-41d3-9dea-1e3b7b9c0c98_2243x1541.webp\" title=\"\" width=\"546\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">It&#8217;s pretty, but is is art?</figcaption></figure></div><p>Klein was a provocateur, and I&#8217;m no art historian, so don&#8217;t let me tell you what he <em>actually</em> meant by his all-blue paintings. But one thing he <em>could have </em>meant was a callback to all the medieval merchants and monks and miners; everyone who died to get a few drops of ultramarine back to Europe so the Virgin&#8217;s robes could be perfectly celestially blue. &#8220;Look!&#8221; say Klein&#8217;s paintings. &#8220;Now we&#8217;re so rich, so blessed, that I can paint an <em>entire canvas</em> with the perfect blue of the heavens. I can use more blue than the total yearly output of medieval Europe, just so a couple of passers-by can frown and secretly wish that paintings still looked like stuff.&#8221;</p><p>This painting tears me apart. I - confession - am the type of person who, after hearing the story of Afghanistan and Sar-i-Sang and medieval European art economics - would be tempted to buy lapis lazuli and stare at it longingly, trying to recapture the awe that Joe Peasant must have felt staring at the Virgin&#8217;s coat. But I&#8217;m also the type of person who, if I ran across Klein in a gallery, would frown and secretly wish that paintings still looked like stuff. Should I feel bad about this?</p><p>A few stanzas later in <em>Ballad Of The White Horse</em>, the Virgin calls out those sophisticates who have lost the ability to innocently enjoy things:</p><blockquote><p><em>The wise men know all evil things<br />Under the twisted trees,<br />Where the perverse in pleasure pine<br />And men are weary of green wine<br />And sick of crimson seas</em></p></blockquote><p>If I can frown and walk past a canvas painted in pure ultramarine, would I also grow weary of green wine and crimson seas? If I went to Heaven, surely the first few days would be pretty great. But would I eventually walk past golden mountains and silver trees and crystal ships on crimson seas with the same nonchalance with which I walk past granite mountains / wooden trees / etc today?</p><p>I know the <a href=\"https://www.astralcodexten.com/p/highlights-from-the-comments-on-unpredictable\">neurology </a>behind tolerance and accommodation as well as anyone. We&#8217;re not designed to be as delighted by the thousandth sunrise as the first. It&#8217;s no sin to be able to live a normal life instead of sitting paralyzed by the dazzling variety of beauty all around me. Still, it feels like there ought to be <em>some</em> virtue of innocence, some sense in which we try not to help along our own cynicism, or at the very least we don&#8217;t drag the more-naturally-gifted-with-innocence down with us. </p><p>I sometimes imagine Heaven as a place of green wine, crimson seas, and golden mountains. Everyone goes there, good and bad alike. And if you still have enough innocence in your soul to enjoy things, then great, you&#8217;re in Heaven and presumably you have a good time. And if instead you&#8217;re one of those people who constitutionally hates everything, then you spend eternity writing thinkpieces with titles like &#8220;Can We As A Society Finally Shut Up About Golden Mountains?&#8221; or &#8220;Do The Wrong Type Of People Like Crimson Seas Too Much?&#8221;, and God and the Devil both agree that this counts as sufficient punishment. </p><p><strong>II.</strong></p><p>Erik Hoel has a new post, <a href=\"https://www.theintrinsicperspective.com/p/welcome-to-the-semantic-apocalypse\"><s>Can We As A Society Finally Shut Up About Golden Mountains</s></a>. . . no, sorry! It&#8217;s actually called <a href=\"https://www.theintrinsicperspective.com/p/welcome-to-the-semantic-apocalypse\">Welcome To The Semantic Apocalypse</a>.</p><p> Hoel is writing about the new &#8220;Ghiblification&#8221; trend, where people use OpenAI&#8217;s new art model to make photos look like Studio Ghibli anime.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F530df40b-6444-45aa-b814-d8588895c979_771x313.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"313\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F530df40b-6444-45aa-b814-d8588895c979_771x313.png\" width=\"771\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Source: https://x.com/GrantSlatton/status/1904631016356274286</figcaption></figure></div><p>Hoel can&#8217;t resist Ghiblifying his own (adorable) children:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdddcb15f-7273-4284-873c-84ab8087c68b_512x685.webp\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"476.2890625\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdddcb15f-7273-4284-873c-84ab8087c68b_512x685.webp\" width=\"356\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>&#8230;but he is also deeply worried:</p><blockquote><p>That picture of my kids reading together above, which is from a real photo&#8212;I exclaimed in delight when it appeared in the chat window like magic. So I totally get it. It&#8217;s a softer world when you have Ghibli glasses on. But by the time I made the third picture, it was less fun. A creeping sadness set in [...]</p><p>While ChatGPT can&#8217;t pull off a perfect Miyazaki copy, it doesn&#8217;t really matter. The semantic apocalypse doesn&#8217;t require AI art to be exactly as good as the best human art. You just need to flood people with close-enough creations such that the originals feel less meaningful ... Many people are reporting that their mental relationship to art is changing; that as fun as it is to Ghibli-fy at will, something fundamental has been cheapened about the original [...]</p><p>This is what I fear most about AI, at least in the immediate future. Not some superintelligence that eats the world (it can&#8217;t even beat Pok&#233;mon yet, a game many of us conquered at ten). Rather, a less noticeable apocalypse. Culture following the same collapse as community on the back of a whirring compute surplus of imitative power provided by Silicon Valley. An oversupply that satiates us at a cultural level, until we become divorced from the semantic meaning and see only the cheap bones of its structure. Once exposed, it&#8217;s a thing you have no relation to, really. Just pixels. Just syllables. In some order, yes. But who cares?</p><p>Every weekend, my son gets to pick out one movie to watch with his little sister. It&#8217;s always Totoro. The Studio Ghibli classic. Arguably, the studio&#8217;s best movie. It&#8217;s also their slowest one, more a collection of individual scenes than anything else. Green growth and cicada whines and the specter of death amid life, haunting the movie in a way children can&#8217;t possibly understand, because it never appears. No one dies, or even gets close. For my kids, it&#8217;s just about a sibling pair, one so similar to themselves, and their fun adventures. But an adult can see the threat of death as the shadow opposite of the verdant Japanese countryside, in the exact same way that, in the movie, only children can see the forest spirit Totoro. The movie&#8217;s execution is an age-reversed mirror of its plot. And for this, I love it too . . . This weekend I will watch with them, and feel more distant from it than I did before. Totoro will just be more Ghibli. </p></blockquote><p>As I read Hoel&#8217;s post, I thought of ultramarine blue. But also, I thought of the first phonographic records. In 1890, hearing Enrico Caruso sing <em>Pagliacci</em> might be the highlight of your life, the crowning glory of a months-long trip to Italy and back. By 1910, you could hear Enrico Caruso without leaving your house. You could hear him twenty times a day if you wanted. The real thing in Naples would just be more Caruso.</p><p>And I thought of computer monitors. If you wanted to see Lippi&#8217;s <em>Madonna and Child </em>when it was first painted in 1490, you would have to go to Florence and convince Lorenzo de Medici to let you in his house. Now you can see a dozen Lippi paintings in a sitting by typing their names into Wikipedia - something you never do. Why would you? They&#8217;re just more Lippi.</p><p>And what about cameras? A whole industry of portraits, landscapes, cityscapes - totally destroyed. If you wanted to know what Paris looked like, no need to choose between Manet&#8217;s interpretation or Beraud&#8217;s interpretation or anyone else&#8217;s - just glance at a photo. A Frenchman with a camera could generate a hundred pictures of Paris a day, each as cold and perspectiveless as mathematical truth. The artists, defeated, retreated into Impressionism, or Cubism, or painting a canvas entirely blue and saying it represented Paris in some deeper sense. You could still draw the city true-to-life if you wanted. But it would just be more Paris.</p><p>Even the places themselves start to feel cheap, unearned. Medieval pilgrims would brave dangerous sea voyages to reach Jerusalem, then go into such fits of rapture that some of them would have seizures on the spot, or speak in tongues, or run off to a monastery and spend the rest of their life in contemplative prayer. I visited Jerusalem once. As holy cities go, I would describe it as cleaner than Benares but not quite as cool as Bodh Gaya. I stayed three days, then took off to Tel Aviv to see the architecture (<a href=\"https://nonzionism.com/i/149457496/cheer-up\">which sucked</a>).</p><p>Are these semantic apocalypses? </p><p>What if they are? It would be facile to say that, just because technology has threatened our sense of meaning before, we shouldn&#8217;t worry when technology threatens our sense of meaning today. Some of the past apocalypses were genuinely bad. The semantic satiation of the previous forms gave us modern art and architecture, hardly known for their broad-based appeal. Do we really want Studio Ghibli anime to go the way of paintings that look like stuff?</p><p>When I contemplate these questions, I encounter a paradox. I acknowledge that my inability to marvel at a live Caruso opera in Naples has cost me something deep and beautiful. But I cannot wish that the phonograph was never invented. Does the increased variety and quantity of music compensate for the decreased profundity of each musical experience? Surely this is part of it, but I would never accept this excuse in other areas that have not yet been cheapened. A thousand moderately pleasant one-night-stands cannot equal one passionate love affair.</p><p>Maybe Progress repays us with interest for every medium it takes? Without mass-produced, mass-transmissible images, music, and bright colors, we couldn&#8217;t have Studio Ghibli. Dare we hope that, if anime becomes too cheap to appreciate, that very cheapness will open the door to new forms of art? But why should this always be true? If AI is better than all human artists, and you can run 100,000 inference copies at 10x serial speed in a data center, then why should anything be non-cheap ever again?</p><p>None of these sound fully convincing. Instead, maybe we must admit that we are relocating novelty and adventure from individual engagements with art, to the arc of history itself. Our generation will never know the once-in-a-life pleasure of hearing Caruso sing in Naples. But we will get the once-in-a-life pleasure of speaking to a generative AI for the first time. We could protect the magic of the Jerusalem pilgrimage by banning air travel, but it would be a fake and flimsy sort of magic, a sort of enforced perpetual civilizational childhood. What about the magic of seeing the clouds from above? Or the moon landing?</p><p><strong>III.</strong></p><p>We have recontextualized the semantic apocalypse from a one-time problem with GPT-4 to a recurrent historical pattern of technology undermining the uniqueness of art. But maybe we should zoom out further. This isn&#8217;t just about art. Technology breeds hedonic adaptation, and hedonic adaptation undermines everything.</p><p>My lack of appreciation for ultramarine dye is of the same kind as my lack of appreciation for not dying of cholera. Or for coffee - an ordinary latte might blend beans from Ethiopia, Ghana, and Suriname with sugar from Brazil and vanilla from a rare orchid found only in Madagascar; by now, it&#8217;s so unbearably boring that you can find <a href=\"https://www.reddit.com/r/starbucks/comments/1bad0s8/whats_a_good_way_to_spruce_up_a_blonde_vanilla/\">dozens of Reddit threads</a> asking how to spruce it up, make it feel new again. We gripe about how LLMs are destroying wonder, never thinking about how we&#8217;re speaking to an alien intelligence made by etching strange sigils on a tiny glass wafer on a mountainous jungle island off the coast of China, then converting every book ever written into electricity and blasting them through the sigils at near-light-speed. It&#8217;s all amazing, and we&#8217;re bored to death of all of it.</p><p>This has hitherto been slow enough to tolerate, but strong AI will make it all worse. You will see wonders beyond your imagination, nod, think &#8220;that&#8217;s a cool wonder&#8221;, and become inured to it. In the process, everything else that matters will wither away. If you get meaning from your job, the AI will take your job. If you get meaning from helping others, the AI will end poverty and cure cancer without your help. If you get meaning from your community, too bad - your friends are hanging out with AI sexbots now. It&#8217;ll all be great, of course. The AI taking your job means you never have to write another PowerPoint slide again; you can sit at the beach all day, sipping tropical cocktails. The AI ending poverty will be the best thing that ever happened. The sexbots . . . do you really need me to keep selling you on these? It&#8217;ll all be perfect forever, and you&#8217;ll spend the whole time writing Substack articles with titles like &#8220;Can We As A Society Finally Shut Up About The Wonders Beyond Our Imagination?&#8221; and &#8220;Do The Wrong Type Of People Like Cancer Cures Too Much?&#8221;</p><p>Is there any hope? Something bothers me about the whole semantic apocalypse framing. It focuses too much on the social level, denies personal agency. Yes, we <em>as a culture</em> are post- some semantic apocalypse where listening to the great symphonies of the past has become so easy that we never do it. But you, as an individual, could do it right now. You could type &#8220;Mozart symphony&#8221; into YouTube and see what happens.</p><p>G.K. Chesterton wrote lots of stuff about how if you were really holy and paying attention, then the thousandth sunset would be just as beautiful as the first. I used to interpret this as some kind of meaningless faux-profound slogan. Then I read his <a href=\"https://www.gutenberg.org/ebooks/67639\">biography of William Blake</a> - which made me ask myself, for the first time - what if William Blake was just describing his experience completely accurately? <em>&#8220;When the sun rises, do you not see a round disc of fire somewhat like a guinea? O no, no, I see an innumerable company of the heavenly host crying Holy, Holy, Holy is the Lord God Almighty.&#8221;</em> I know this sounds crazy, but there&#8217;s <em>so much</em> stuff like this, and he&#8217;s <em>so</em> consistent; Chesterton sort of suggests that maybe he is actually, literally, seeing the innumerable company of the heavenly host.</p><p>And the ease with which Chesterton navigates this interpretation - the way he makes it the most natural thing in the world - made me wonder - what if Chesterton is <em>also </em>just describing his experience completely accurately? The thousandth sunset thing is so prominent in his works, and he never expresses any embarrassment about it, never says anything like &#8220;a saint would be able to do this, although of course I cannot&#8221;. If anything, the mood is one of mild exasperation that nobody listens to him. This sort of thing would make complete neurological sense - it&#8217;s just an increase in <a href=\"https://www.astralcodexten.com/p/the-precision-of-sensory-evidence\">the precision of sensory evidence</a> relative to top-down priors. Young children do it naturally - as any parent can tell you after having to read their one-year-old the same book for the thousandth time. Any adult can replicate it with <a href=\"https://slatestarcodex.com/2019/09/10/ssc-journal-club-relaxed-beliefs-under-psychedelics-and-the-anarchic-brain/\">five milligrams of psilocybin</a> or <a href=\"https://www.astralcodexten.com/p/jhanas-and-the-dark-room-problem\">a few dozen hours of samatha meditation</a>. Who&#8217;s to say you can&#8217;t get it through genetics? Or through being very holy?</p><p>Chesterton&#8217;s answer to the semantic apocalypse is to will yourself out of it. If you can&#8217;t enjoy <em>My Neighbor Totoro</em> after seeing too many Ghiblified photos, that&#8217;s a skill issue. Keep watching sunsets until each one becomes as beautiful as the first (the secret is that the innumerable company of the heavenly host sings in a slightly different key each time).</p><p>I support Erik Hoel&#8217;s crusade to chart some society-level solution to the semantic apocalypse problem. You&#8217;re not allowed to say &#8220;skill issue&#8221; to society-level problems, because some people won&#8217;t have the skill; that&#8217;s why they invented the word &#8220;systemic&#8221;. But your personal relationship to the meaning in your life is not a society-level problem. While Erik Hoel works on the systemic issue, you should be thinking of your own individual soul. </p><p>If you insist that anything too common, anything come by too cheaply, must be boring, then all the wonders of the Singularity cannot save you. You will grow weary of green wine and sick of crimson seas. But if you can bring yourself to really pay attention, to see old things for the first time, then you can combine the limitless variety of modernity with the awe of a peasant seeing an ultramarine mural - or the delight of a 2025er Ghiblifying photos.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc4ba0fee-e0bb-4008-9f29-6798c4bc0d66_1376x917.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"426.51162790697674\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc4ba0fee-e0bb-4008-9f29-6798c4bc0d66_1376x917.png\" width=\"640\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">My group house&#8217;s holiday picture. I don&#8217;t really have that many kids, but GPT is an lmpressionist - it depicts how things feel from the inside, not how they really are.</figcaption></figure></div><p>People say AI art isn&#8217;t art because it doesn&#8217;t mean anything. But I think it means the same thing as Lippi&#8217;s <em>Madonna: </em>unless you become like little children, you will never enter the kingdom of heaven.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/the-colors-of-her-coat",
            "publishedAt": "2025-04-01",
            "source": "SlateStarCodex",
            "summary": "<p><strong>I.</strong></p><p>In <em>Ballad of the White Horse, </em>G.K. Chesterton describes the Virgin Mary:</p><blockquote><p><em>Her face was like an open word<br />When brave men speak and choose,<br />The very colours of her coat<br />Were better than good news.</em></p></blockquote><p>Why the colors of her coat?</p><p>The medievals took their dyes very seriously. This was before modern chemistry, so you had to try hard if you wanted good colors. Try hard they did; they famously used literal gold, hammered into ultrathin sheets, to make golden highlights.</p><p>Blue was another tough one. You could do mediocre, half-faded blues with azurite. But if you wanted perfect blue, the color of the heavens on a clear evening, you needed ultramarine.</p><p>Here is the process for getting ultramarine. First, go to Afghanistan. Keep in mind, you start in England or France or wherever. Afghanistan is four thousand miles away. Your path takes you through tall mountains, burning deserts, and several dozen Muslim countries that are still pissed about the whole Crusades thing. Still alive? Climb 7,000 feet through the mountains of Kuran Wa Munjan until you reach the mines of Sar-i-Sang. There, in a freezing desert, the wretched of the earth work themselves to an early grave breaking apart the rocks of Badakhshan",
            "title": "The Colors Of Her Coat"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Meetups this week include SF, San Jose, Melbourne, Bonn, Singapore, and Florence. And some late additions to the schedule, including Hanover, Bonn, and Ahmedabad. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">here </a>for details.</p><p><strong>2: </strong>There&#8217;s another Manifest (Manifold-sponsored fun conference on prediction markets) this year. June 6-8 in Berkeley, tickets are $538 but look for various combos/deals/discounts. More information <a href=\"https://www.manifest.is/\">here</a>.</p><p><strong>3: </strong>MATS (ML Alignment &amp; Theory Scholars) is a bootcamp / research fellowship for people who want to get into AI alignment, security, or governance. This year's cohort is Jun 16 - Aug 22, in-person, in Berkeley. It's free, travel is reimbursed, and you get a $12,000 stipend. Read more / apply <a href=\"https://www.matsprogram.org/transparency\">here</a>, application deadline is April 18.</p><p><strong>4: </strong>And there&#8217;s a <a href=\"https://www.reasonandrationality.com\">Reason &amp; Rationality summer program</a> for high school students happening at Princeton (June 8-14) and Swarthmore (July 27 - Aug 2), cost is $4300 - $6900. AFAICT this one isn&#8217;t associated with our conspiracy, but I see that Amos Wollen (<a href=\"https://wollenblog.substack.com/\">philosophy substack here</a>) is one of the instructors.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-375",
            "publishedAt": "2025-03-31",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>Meetups this week include SF, San Jose, Melbourne, Bonn, Singapore, and Florence. And some late additions to the schedule, including Hanover, Bonn, and Ahmedabad. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">here </a>for details.</p><p><strong>2: </strong>There&#8217;s another Manifest (Manifold-sponsored fun conference on prediction markets) this year. June 6-8 in Berkeley, tickets are $538 but look for various combos/deals/discounts. More information <a href=\"https://www.manifest.is/\">here</a>.</p><p><strong>3: </strong>MATS (ML Alignment &amp; Theory Scholars) is a bootcamp / research fellowship for people who want to get into AI alignment, security, or governance. This year's cohort is Jun 16 - Aug 22, in-person, in Berkeley. It's free, travel is reimbursed, and you get a $12,000 stipend. Read more / apply <a href=\"https://www.matsprogram.org/transparency\">here</a>, application deadline is April 18.</p><p><strong>4: </strong>And there&#8217;s a <a href=\"https://www.reasonandrationality.com\">Reason &amp; Rationality summer program</a> for high school students happening at Princeton (June 8-14) and Swarthmore (July 27 - Aug 2), cost is $4300 - $6900. AFAICT this one isn&#8217;t associated",
            "title": "Open Thread 375"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3745\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3745",
            "publishedAt": "2025-03-27",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3745\"> Read more </a> </p>",
            "title": "Hidden Open Thread 374.5"
        },
        {
            "content": [
                "<p>I was having a drink with my buddy <a href=\"https://robinsonsfriends.substack.com/\">Robinson Eaton</a> recently, and he dropped this interesting provocation: <em>&#8220;I&#8217;m a McLuhan absolutist now.&#8221;</em></p><p>McLuhan absolutist, as in <a href=\"https://en.wikipedia.org/wiki/Marshall_McLuhan\">Marshall McLuhan</a>, as in <a href=\"https://en.wikipedia.org/wiki/The_medium_is_the_message\">the medium is the message</a>. And the more I think about it, the more I think he&#8217;s right. More than any other lens, McLuhan is the key to understanding our present moment.</p><p>So what is McLuhan absolutism? If you&#8217;re like me, you&#8217;ve probably heard <em>the medium is the message</em>, and thought to yourself &#8220;Got it. Media influences culture&#8221;.</p><p>No. It&#8217;s not that media influences culture. <em>The medium is the culture</em>.</p><p>Medium, as in Petri dish. Medium, as in the thing in which the culture grows.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff40bf560-631c-4d39-9c0f-b6fef6a0e03f_1920x1080.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-large\" height=\"675\" src=\"https://substackcdn.com/image/fetch/w_2400,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff40bf560-631c-4d39-9c0f-b6fef6a0e03f_1920x1080.png\" width=\"1200\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">\"<a href=\"https://commons.wikimedia.org/wiki/File:Cell_to_Cell.jpg\">Cell to Cell</a>\" by microbiologists Mehmet Berkmen and Maria Pe&#241;il</figcaption></figure></div><blockquote><p>All media work us over completely. They are so pervasive in their personal, political, economic, aesthetic, psychological, moral, ethical, and social consequences that they leave no part of us untouched, unaffected, unaltered.<br /><em>(Marshall McLuhan, 1967. The Medium is the Massage)</em></p></blockquote><p>Without a medium, there is no culture.</p><ul><li><p>Without language, there is no recitation of genealogies, so there are no tribes.</p></li><li><p>Without writing, there is no accounting, so there are no empires.</p></li><li><p>Without print, there are no novels exploring the depth and diversity of subjective experience, so there is no individualism.</p></li><li><p>Without broadcast, there is no mass transmission of ideas, so there is no mass society.</p></li></ul><p>Language creates tribes, writing creates empires, print creates individualism, broadcast creates masses.</p><p>What does the network create? What would McLuhan absolutism predict?</p><div><hr /></div><p>What is the shape of network society? Let&#8217;s trace the outline, and begin to form an intuition.</p><p>First, what <strong>media</strong> defined the last four cultures?</p><p>Oral: folklore<br />Literary: books<br />Broadcast: TV, radio<br />Network: social media, AI</p><p>The medium is the message because the medium is the thing through which the message flows. So how does <strong>information flow</strong> through these media?</p><p>Oral: circular<br />Literary: sequential<br />Broadcast: one-to-many<br />Network: many-to-many </p><p>Since the behavior of a system is determined by the structure of its flows, media determine the <strong>behavior of the system</strong>. Broadcasting radiates in every direction, generating normal distribution curves. Networks, on the other hand, receive, repeat and amplify, creating traffic spikes, <a href=\"https://www.youtube.com/watch?v=-Y9I06Pvnws\">cascading failures</a>, runaway viral memes. Networks generate exponentials.</p><p>Broadcast: normal distributions<br />Network: exponential distributions</p><p>These exponentials are fractal, <a href=\"https://newsletter.squishy.computer/i/59924410/networks-arent-evenly-distributed-irl\">displaying power laws at every level</a>. Networks are highly unequal. At the same time, networks are fluid, so the <strong>balance of power</strong> is constantly shifting. Broadcast power tends to be symmetric. Network power is asymmetric.</p><p>Broadcast: symmetry<br />Network: asymmetry</p><p>When these asymmetries collide, they produce a stochastic <strong>landscape</strong> of booms and busts. Network society is volatile.</p><p>Broadcast: managed reserves<br />Network: booms and busts</p><p>Many-to-many, exponential, asymmetric, booms and busts&#8230; We&#8217;re beginning to see the outline of a new set of rules. Let&#8217;s keep going&#8230;</p><p><strong>Coordination</strong><br />Oral: genealogies<br />Literary: <a href=\"https://newsletter.squishy.computer/p/cryptography-scales-trust?utm_source=publication-search#:~:text=Writing%20scaled%20trust,an%20official%20seal.\">organized religion</a><br />Broadcast: ideologies<br />Network: algorithms</p><p><strong>Cooperation</strong><br />Oral: traditions<br />Literary: <a href=\"https://newsletter.squishy.computer/p/protocols-as-weberian-bureaucracy\">bureaucracies</a><br />Broadcast: standards<br />Network: <a href=\"https://newsletter.squishy.computer/p/cryptography-scales-trust\">protocols</a></p><p><strong>Time-perception</strong><br />Oral: generational<br />Literary: historical<br />Broadcast: scheduled<br />Network: instant</p><p><strong>Memory</strong><br />Oral: rituals<br />Literary: archives<br />Broadcast: recordings<br />Network: memes</p><p><strong>Production</strong><br />Oral: self-manufactured<br />Literary: craft-manufactured<br />Broadcast: mass-manufactured<br />Network: JIT-manufactured (3D printed, print-on-demand, etc&#8230;)</p><p><strong>Social currency</strong><br />Oral: reputation<br />Literary: credentials<br />Broadcast: fame<br />Network: attention</p><p><strong>Authority</strong><br />Oral: elders<br />Literary: texts<br />Broadcast: celebrities<br />Network: algorithms</p><p><strong>Truth</strong><br />Oral: consensus<br />Literary: facts<br />Broadcast: experts<br />Network: virality</p><p><strong>Faster now&#8230;</strong></p><p>Broadcast: centralized<br />Network: decentralized</p><p>Broadcast: efficient<br />Network: adaptive</p><p>Broadcast: standardized<br />Network: personalized</p><p>Broadcast: manufactured consensus<br />Network: runaway amplification</p><p>Broadcast: spectacle<br />Network: outrage</p><p>Broadcast: shared reality<br />Network: sharded reality</p><p>Broadcast: economies of scale<br />Network: swarms</p><p>Broadcast: welfare<br />Network: gofundme</p><p>Broadcast: institutions<br />Network: groupchats</p><p>Broadcast: countries<br />Network: cities</p><p>Broadcast: internationalism<br />Network: <a href=\"https://newsletter.squishy.computer/i/157673127/the-crypto-archipelago\">archipelagos</a></p><p>Broadcast: big cold wars<br />Network: small hot wars</p><p>Broadcast: armies<br />Network: guerillas</p><p>Broadcast: prevents damage<br />Network: routes around damage</p><p>Broadcast: coal, dams, nuclear<br />Network: microgrids, batteries, rooftop solar</p><p>Broadcast: climate mitigation<br />Network: climate adaptation</p><div><hr /></div><p>Some things that don&#8217;t exist in a network society: <strong>facts, shared truth</strong>. Facts don&#8217;t exist in oral cultures either. They are <a href=\"https://www.cornellpress.cornell.edu/book/9780801436864/a-culture-of-fact/#bookTabs=1\">a byproduct of literary culture</a>. Books, as an artifact, are permanent, unalterable, and shared, like a fact. They are tablets come down from the mountain.</p><p>Social media isn&#8217;t like that. Social media has no memory. It lives in the internal instant, amplifying and exaggerating the most salient features of signals.</p><p>What does the network amplify? </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc971478e-f46c-44a2-997f-f96e07b76f12_1600x455.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Reactions Now Available Globally | Meta\" class=\"sizing-normal\" height=\"455\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc971478e-f46c-44a2-997f-f96e07b76f12_1600x455.png\" title=\"Reactions Now Available Globally | Meta\" width=\"1600\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>&#8230;and maybe two more: <strong>aww</strong> and <strong>horny</strong>. Limbic system stuff. </p><p>Networks are constantly adapting, so hardwired instincts are the one stable point in the system. The network forms itself around them. It evolves to take on the distorted shape of our collective psyche, like a funhouse mirror. The deep, instinctual, hardwired emotions are also the easiest ones to rootkit. You&#8217;re outraged! Of course you&#8217;ll amplify.</p><p>So, networks don&#8217;t product facts. Instead, they combine the gossip of oral culture with the scale of broadcast culture. <a href=\"https://newsletter.squishy.computer/p/llms-and-hyper-orality\">Network culture is a hyper-oral culture</a>.</p><p>No facts, no shared truth. As a child of literary culture, I do not like this! But whether I like it is beside the point.</p><blockquote><p>World War 3 is a guerrilla information war with no division between military and civilian participation.<br /><em>(Marshall McLuhan, 1970, Culture Is Our Business)</em></p></blockquote><p>An absence of facts and shared truth does <em>not</em> imply an inability to coordinate. Ants don&#8217;t have shared truth, yet they coordinate. The truth doesn&#8217;t live in any one ant. It is embodied in the structure of the network.</p><div class=\"bluesky-wrap outer\" style=\"height: auto; display: flex; margin-bottom: 24px;\"></div><blockquote><p>To some, the critical test of whether a machine is or is not a &#8216;brain&#8217; would be whether it can or cannot &#8216;think.&#8217; But to the biologist the brain is not a thinking machine, it is an acting machine; it gets information and then it does something about it.<br /><em>(W. Ross Ashby, 1948, Design for a Brain)</em></p></blockquote><p>Intelligence is a scarce resource in literary culture. Experts, wonks, and researchers act as priests of knowledge.</p><p>Broadcast culture centralizes this intelligence, and scales it through mass-mobilization. That&#8217;s how it solves problems.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://en.wikipedia.org/wiki/Hands_Across_America\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Why Was Hands Across America in Us? - How Does Hands Across America Fit  Into Jordan Peele's Us Movie\" class=\"sizing-normal\" height=\"682\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F192edaff-360b-466e-8f2e-6dc6a75b1bbc_1024x682.jpeg\" title=\"Why Was Hands Across America in Us? - How Does Hands Across America Fit  Into Jordan Peele's Us Movie\" width=\"1024\" /><div></div></div></a><figcaption class=\"image-caption\"><a href=\"https://en.wikipedia.org/wiki/Hands_Across_America\">Hands across America</a>, 1986</figcaption></figure></div><p>In network culture, intelligence becomes abundant. Thousands of people and AIs and algorithms all interact.</p><blockquote><p>With the arrival of electric technology, man has extended, or set outside himself, a live model of the central nervous system itself.<br /><em>(McLuhan, 1964. Understanding Media: The Extensions of Man)</em></p></blockquote><p>It&#8217;s no accident that a network society sounds a lot like a neural net. Social media users act just like neurons, relaying messages when our <a href=\"https://en.wikipedia.org/wiki/Action_potential\">action potential</a> is reached. React, retweet, remember to like and subscribe.</p><p>AIs are, themselves, reflections of this network intelligence. LLMs crystalize the intelligence of the network by compressing an internet&#8217;s worth of text until <a href=\"https://newsletter.squishy.computer/p/llms-and-hyper-orality\">the text speaks back</a>. Intelligence becomes software. It can be scaled up and down, on demand, exactly like servers.</p><blockquote><p>A new medium&#8230; not only does not wipe out the old, but actually reinforces the older medium or media. However, in doing so it transforms the old, so that the old is no longer what it used to be. Applied to books, this means that in the foreseeable future there will be more books than ever before but that books will no longer be what books used to be.<br /><em>(Ong, 1977. <a href=\"https://archive.org/details/oralityliteracyt0000ongw\">Orality and Literacy</a>)</em></p></blockquote><p>So, AI reenforces and transforms intelligence. That means there will be more intelligence than ever before, but intelligence will no longer be what it used to be.</p><p>These AIs won&#8217;t be experts dispensing wisdom from an ivory tower. That&#8217;s literary culture. No, they&#8217;ll be wired up to the network, and they will repeat and compete and collide and be herded around by algorithms, just like the rest of us. Any aggregate intelligence will be the result of the emergent behavior of these interactions.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd23eea60-4035-4a66-884d-bccdd511dd9b_500x281.webp\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"409.136\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd23eea60-4035-4a66-884d-bccdd511dd9b_500x281.webp\" width=\"728\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>This is a world inhabited by many different agents and <a href=\"https://newsletter.squishy.computer/i/79213755/thinking-with-the-network\">emergent network spirits</a>, each with their own personalities and motivations. It&#8217;s a re-enchanted world, an animistic world, with no single locus of control.</p><p>Surviving in network society will mean learning to think together with our <a href=\"https://newsletter.squishy.computer/p/thinking-together?open=false#%C2%A7thinking-with-the-network\">egregores</a>.</p>"
            ],
            "link": "https://newsletter.squishy.computer/p/the-shape-of-network-society",
            "publishedAt": "2025-03-30",
            "source": "Squishy Computer",
            "summary": "<p>I was having a drink with my buddy <a href=\"https://robinsonsfriends.substack.com/\">Robinson Eaton</a> recently, and he dropped this interesting provocation: <em>&#8220;I&#8217;m a McLuhan absolutist now.&#8221;</em></p><p>McLuhan absolutist, as in <a href=\"https://en.wikipedia.org/wiki/Marshall_McLuhan\">Marshall McLuhan</a>, as in <a href=\"https://en.wikipedia.org/wiki/The_medium_is_the_message\">the medium is the message</a>. And the more I think about it, the more I think he&#8217;s right. More than any other lens, McLuhan is the key to understanding our present moment.</p><p>So what is McLuhan absolutism? If you&#8217;re like me, you&#8217;ve probably heard <em>the medium is the message</em>, and thought to yourself &#8220;Got it. Media influences culture&#8221;.</p><p>No. It&#8217;s not that media influences culture. <em>The medium is the culture</em>.</p><p>Medium, as in Petri dish. Medium, as in the thing in which the culture grows.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff40bf560-631c-4d39-9c0f-b6fef6a0e03f_1920x1080.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-large\" height=\"675\" src=\"https://substackcdn.com/image/fetch/w_2400,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff40bf560-631c-4d39-9c0f-b6fef6a0e03f_1920x1080.png\" width=\"1200\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\"",
            "title": "The shape of network society"
        },
        {
            "content": [],
            "link": "https://lethain.com/is-this-strategy-any-good/",
            "publishedAt": "2025-03-27",
            "source": "Will Larson",
            "summary": "<p>We&rsquo;ve read a lot of strategy at this point in the book. We can judge a strategy&rsquo;s format, and its construction: both are useful things. However, format is a predictor of quality, not quality itself. The remaining question is, how should we assess whether a strategy is any good?</p> <p><a href=\"https://lethain.com/uber-service-migration-strategy/\">Uber&rsquo;s service migration strategy</a> unlocked the entire organization to make rapid progress. It also led to a sprawling architecture problem down the line. Was it a great strategy or a terrible one? Folks can reasonably disagree, but it&rsquo;s worthwhile developing our point of view why we should prefer one interpretation or the other.</p> <p>This chapter will focus on:</p> <ul> <li>The various ways that are frequently suggested for evaluating strategies, such as input-only evaluation, output-only evaluation, and so on</li> <li>A rubric for evaluating strategies, and why a useful rubric has to recognize that strategies have to be evaluated in phases rather than as a unified construct</li> <li>Why ending a strategy is often a sign of a good strategist, and sometimes the natural reaction to a new phase in a strategy, rather than a judgment on prior phases</li> <li>How missing context is an unpierceable veil for evaluating other companies' strategies with high-conviction,",
            "title": "Is this strategy any good?"
        },
        {
            "content": [],
            "link": "https://lethain.com/components-of-eng-strategy/",
            "publishedAt": "2025-03-27",
            "source": "Will Larson",
            "summary": "<p>Often you&rsquo;ll see a disorganized collection of ideas labeled as a &ldquo;strategy.&rdquo; Even when they&rsquo;re dense with ideas, these can be hard to parse, and are a major reason why most engineers will claim their company doesn&rsquo;t have a clear strategy even though my experience is that <em>all</em> companies follow some strategy, even if it&rsquo;s undocumented.</p> <p>This chapter lays out a repeatable, structured approach to drafting strategy. It introduces each step of that approach, which are then detailed further in their respective chapters. Here we&rsquo;ll cover:</p> <ul> <li>How these five steps fit together to facilitate creating strategy, especially by preventing practitioners from skipping steps that feel awkward or challenging.</li> <li>Step 1: Exploring the wider industry&rsquo;s ideas and practices around the strategy you&rsquo;re working on. Exploration is understanding what recent research might change your approach, and how the state of the art has changed since you last tackled a similar problem.</li> <li>Step 2: Diagnosing the details of your problem. It&rsquo;s hard to slow down to understand your problem clearly before attempting to solve it, but it&rsquo;s even more difficult to solve anything well without a clear diagnosis.</li> <li>Step 3: Refinement is taking a raw, unproven set of ideas and testing them",
            "title": "Steps to build an engineering strategy."
        },
        {
            "content": [],
            "link": "https://xkcd.com/3071/",
            "publishedAt": "2025-04-02",
            "source": "XKCD",
            "summary": "<img alt=\"If you have an old phone in a drawer, and you listen very carefully, you can occasionally hear the occasional tap of an emitted SIM card hitting the side of the drawer as the phone transmutes to a lower-end model.\" src=\"https://imgs.xkcd.com/comics/decay_chain.png\" title=\"If you have an old phone in a drawer, and you listen very carefully, you can occasionally hear the occasional tap of an emitted SIM card hitting the side of the drawer as the phone transmutes to a lower-end model.\" />",
            "title": "Decay Chain"
        }
    ],
    "lookbackDays": 7,
    "publishDate": "2025-04-02"
}