{
    "articles": [
        {
            "content": [
                "<p>Here&rsquo;s a thought experiment for pondering the effects AI might have on society: What if we invented teleportation?</p>\n\n<p>A bit odd, I know, but bear with me&hellip;</p>\n\n<hr />\n\n<p>The year is 2035. The Auto Go Instant (AGI) teleporter has been invented. You can now go anywhere&hellip; instantly!</p>\n\n<p>At first the tech is expensive and unreliable. Critics laugh. &ldquo;Hah, look at these stupid billionaires who can&rsquo;t spend a minute of their time moving around like the rest of us. And 5% of the time they end up in the wrong place, LOL&rdquo;</p>\n\n<p>But soon things get cheaper and better. The tech hits mass market.</p>\n\n<p>There are huge benefits. Global commerce is supercharged. Instead of commuting, people can spend more time with family and friends. Pollution is way down. The AGI company runs a sweet commercial of people teleporting to see their parents one last time before they die.</p>\n\n<p>At the same time, some weird things start happening.</p>\n\n<p>The landscape starts reconfiguring around the new reality. Families move to remote cabins, just seconds away from urban amenities. The summit of Mt. Everest becomes crowded with influencers. (It turns out that if you stay just a few seconds, you can take a quick selfie without needing an oxygen mask!)</p>\n\n<p>Physical health takes a hit for many people. It&rsquo;s harder to justify walking or biking when you could just be there now.</p>\n\n<p>In-between moments disappear. One moment you&rsquo;re at work, the next you&rsquo;re at your dinner table at home. No more time to reset or prepare for a new context.</p>\n\n<p>But the biggest change is the loss of serendipity. When you teleport, you decide in advance where you&rsquo;re headed. You never run into an old friend on the street, or stop at a farmstand by the side of the road, or see a store you might want to stop into someday.</p>\n\n<p>To modern teenagers, the idea of wandering out without an exact destination in mind becomes unthinkable. You start with the GPS coordinates, and then you just&hellip; go.</p>\n\n<p>Advocates of the new way point out that there&rsquo;s nothing stopping anyone from choosing traditional methods for fun. And indeed, the cross-country road trip does see a mild resurgence as a hipster thing.</p>\n\n<p>But when push comes to shove, most people struggle to make the time for wandering—our schedules are now arranged around an assumption of instant transport.</p>\n\n<p>This isn&rsquo;t exactly to say that the old way was better. Most people can agree that teleportation a net win. Yet for those who remember, there&rsquo;s a vague unease, a sense that something important was lost in the world&hellip;.</p>\n\n<hr />\n\n<p>In his book Technology and the Character of Everyday Life, the philosopher Albert Borgmann talks about wooden stoves in houses.</p>\n\n<p>What is a stove? Yes, it warms the house&hellip; but it&rsquo;s also so much more than that. You gotta cut the wood, you gotta start the fire in the morning&hellip;</p>\n\n<p>&ldquo;A stove used to furnish more than mere warmth. It was a focus, a hearth, a place that gathered the work and leisure of a family and gave the house of a center.&rdquo;</p>\n\n<p>When you switch to a modern central heating system, you cut out all these inconveniences. Fantastic!</p>\n\n<p>Oh, and by the way, your family social life is totally different&hellip;.. wait what?? Yes, the inconveniences were inconvenient. But they were also holding up something in your life and culture, and now they&rsquo;re suddenly gone.</p>\n\n<p>I think of this as kind of a Chesteron&rsquo;s fence on hard mode. Yes, the stove was put there for warmth, that was the main goal. But you should also think hard about its secondary effects before replacing it.</p>\n\n<hr />\n\n<p>OK so&hellip; how does this apply to AI?</p>\n\n<p>I&rsquo;m personally excited about AI and think it can improve our lives in a lot of ways. But at the same time I&rsquo;m trying to be mindful of secondary effects and unintended consequences.</p>\n\n<p>Here&rsquo;s one example. If your mental model of reading is &ldquo;transmit facts into my head&rdquo;, then reading an AI summary of something might seem like a more efficient way to get that task done.</p>\n\n<p>But if your mental model of reading is &ldquo;spend time marinating in a world of ideas&rdquo;, then reducing the time spent reading doesn&rsquo;t help you much.</p>\n\n<p>The point was the journey you underwent while reading, and you replaced it with teleportation.</p>\n\n<p>Another example. One of the great joys of my life is having nerdy friends explain things to me. Now I can get explanations from AI with less friction, anytime, anywhere, with endless follow-up.</p>\n\n<p>Even if the AI explanations are &ldquo;better&rdquo;, there&rsquo;s a social cost. I can try to mindfully nudge myself to still ask people questions, but now it requires more effort.</p>\n\n<p>Final example: I&rsquo;m trying to be mindful of the effects of vibe coding when designing software interfaces. On the one hand, it can really speed up my iteration loop and help me explore more ideas.</p>\n\n<p>But at the same time, part of my design process is sitting with the details of the thing and uncovering it as I go—more a muscle memory process than a conscious plan. Messing with this process can change the results in ways that are hard to predict!</p>\n\n<p>I guess the throughline for all of these examples is: sometimes the friction and inconvenience is where the good stuff happens. Gotta be very careful removing it.</p>\n\n<hr />\n\n<p>The takeaway here isn&rsquo;t that &ldquo;AI is bad&rdquo;. I&rsquo;ll just say that I&rsquo;m personally trying to be mindful about keeping good friction around.</p>\n\n<p>During COVID, we kinda got teleportation via Zoom for a while. I decided to &ldquo;virtual commute&rdquo; every day, walking around the block to get some fresh air and a reset before/after work. This wasn&rsquo;t a big deal but I found it really helpful.</p>\n\n<p>As AI makes a lot of things easier, it&rsquo;ll be interesting to ponder what kinds of new frictions we&rsquo;ll want to intentionally add to our lives. Teleportation isn&rsquo;t always the best answer&hellip;</p>"
            ],
            "link": "https://www.geoffreylitt.com/2025/09/10/ai-as-teleportation.html",
            "publishedAt": "2025-09-10",
            "source": "Geoffrey Litt",
            "summary": "<p>Here’s a thought experiment for pondering the effects AI might have on society: What if we invented teleportation?</p> <p>A bit odd, I know, but bear with me…</p> <hr /> <p>The year is 2035. The Auto Go Instant (AGI) teleporter has been invented. You can now go anywhere...</p>",
            "title": "AI as teleportation"
        },
        {
            "content": [
                "<p>If you're not aware yet, in 2022 Alphabet paid Apple $20 billion for Google to be the default search engine on Apple devices, according to unsealed court documents in the Justice Department’s antitrust lawsuit against Google. This is because <a href=\"https://en.wikipedia.org/wiki/Default_effect\" target=\"_blank\">defaults matter</a>. The vast majority of people use the default search engine/browser/maps/setup that a devices comes standard with. They also just live with the default notification settings, which I've written about before in an <a href=\"https://herman.bearblog.dev/notifications/\">essay on digital hygiene</a>.</p>\n<p>Say what you will about Apple, but they do care about user experience more than the other big tech companies. This is mostly because the value-exchange with Apple is clear: You give them money, and in return they give you good hardware and software, and a commitment to privacy.</p>\n<p>With Google this relationship is more nebulous. Google gives you a free search engine, free email, free document editing and storage, a free browser, free maps, and a bunch of other useful services; but the money comes from...elsewhere. It comes from influencing your buying decisions, and selling your data and attention to marketers; along with a whole host of privacy and security infringements along the way.</p>\n<p>I understand why Google paid Apple all that money. Not only does it send lots of high value traffic to Google, but it also disincentivises Apple from creating their own search engine and competing with Google in this space.</p>\n<p>Yet Apple is also the company that runs ads like this:</p>\n<p><img alt=\"apple-privacy\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman/apple-privacy.webp\" /></p>\n<p>By accepting Alphabet's money, Apple essentially sold their user-base to Google. They paid lip-service to privacy until commercial interests dictated otherwise. If Google was the default search engine without money changing hands, Apple could argue that they just selected the best or most-popular search engine. But because that spot was bought and paid for, it's a big black mark on their commitment to privacy.</p>\n<p>Complaining about corporate interests chasing profit aside, here's my hot take: If Apple really cared about privacy, not only should they choose a different search engine, they should block ads and trackers in Safari by default.</p>\n<p>There are other browsers that do this; and it's fairly trivial to set up an <a href=\"https://adguard.com\" target=\"_blank\">ad-blocker</a> in Safari yourself. But so few people do. Every now and then I find myself on one of those content-y websites without an ad-blocker, and it feels like I've entered a casino on crack—with animated banners, sliders, and flashing ads interspersing the content.</p>\n<p>Seizure-inducing websites aside, advertising-driven tracking is a privacy nightmare, as is the personal-data-economy that underpins it all.</p>\n<p>Here's the thing: Apple could do this tomorrow. They could easily make Safari block ads by default. And yet they don't, despite it not being in their user's best interests. This would cripple Google, true; but it's asymmetric. As far as I can tell, Apple doesn't rely on Google for anything. Yet there's nothing illegal about Apple blocking ads and trackers by default. Hell, I'm surprised the EU hasn't mandated it yet.</p>\n<p>And Google isn't even paying them $20 billion a year to prevent this!</p>\n<p>So if there're any higher-ups at Apple who read my blog, hello!</p>\n<p>I'm not suggesting Apple go full nuclear right away, but this should at the very least be part of the conversation around what respecting users and their privacy means.</p>\n<p>And if Apple does pull this off, I'll finally believe the billboards.</p>"
            ],
            "link": "https://herman.bearblog.dev/apple-privacy/",
            "publishedAt": "2025-09-10",
            "source": "Herman Martinus",
            "summary": "<p>If you're not aware yet, in 2022 Alphabet paid Apple $20 billion for Google to be the default search engine on Apple devices, according to unsealed court documents in the Justice Department’s antitrust lawsuit against Google. This is because <a href=\"https://en.wikipedia.org/wiki/Default_effect\" target=\"_blank\">defaults matter</a>. The vast majority of people use the default search engine/browser/maps/setup that a devices comes standard with. They also just live with the default notification settings, which I've written about before in an <a href=\"https://herman.bearblog.dev/notifications/\">essay on digital hygiene</a>.</p> <p>Say what you will about Apple, but they do care about user experience more than the other big tech companies. This is mostly because the value-exchange with Apple is clear: You give them money, and in return they give you good hardware and software, and a commitment to privacy.</p> <p>With Google this relationship is more nebulous. Google gives you a free search engine, free email, free document editing and storage, a free browser, free maps, and a bunch of other useful services; but the money comes from...elsewhere. It comes from influencing your buying decisions, and selling your data and attention to marketers; along with a whole host of privacy and security infringements along the way.</p> <p>I understand why Google paid",
            "title": "If Apple cared about privacy"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/many-hard-leetcode-problems-are-easy-constraint/",
            "publishedAt": "2025-09-10",
            "source": "Hillel Wayne",
            "summary": "<p>In my first interview out of college I was asked the change counter problem:</p> <blockquote> <p>Given a set of coin denominations, find the minimum number of coins required to make change for a given number. IE for USA coinage and 37 cents, the minimum number is four (quarter, dime, 2 pennies).</p> </blockquote> <p>I implemented the simple greedy algorithm and immediately fell into the trap of the question: the greedy algorithm only works for \"well-behaved\" denominations. If the coin values were <code>[10, 9, 1]</code>, then making 37 cents would take 10 coins in the greedy algorithm but only 4 coins optimally (<code>10+9+9+9</code>). The \"smart\" answer is to use a dynamic programming algorithm, which I didn't know how to do. So I failed the interview.</p> <p>But you only need dynamic programming if you're writing your own algorithm. It's really easy if you throw it into a constraint solver like <a href=\"https://www.minizinc.org/\" target=\"_blank\">MiniZinc</a> and call it a day. </p> <div class=\"codehilite\"><pre><span></span><code>int: total; array[int] of int: values = [10, 9, 1]; array[index_set(values)] of var 0..: coins; constraint sum (c in index_set(coins)) (coins[c] * values[c]) == total; solve minimize sum(coins); </code></pre></div> <p>You can try this online <a href=\"https://play.minizinc.dev/\" target=\"_blank\">here</a>. It'll give you a prompt to",
            "title": "Many Hard Leetcode Problems are Easy Constraint Problems"
        },
        {
            "content": [
                "<p>The purported main purpose of school, and even of childhood, is educating children.</p>\n<p>Many people are actively opposed to this idea.</p>\n<p>Either they have other priorities that matter more, or sometimes they outright think that your child learning things is bad and you should feel bad for wanting that.</p>\n<p>Some even say it openly. They actively and openly want to stop your child from learning things, and want to put your child into settings where they will not learn things. And they say that this is good.</p>\n<p>Or they simply assert that the primary point of education is as a positional good, where what matters is your relative standing. And then they pretend this doesn’t imply they both should and are going around preventing children from learning.</p>\n<div>\n\n\n<span id=\"more-24711\"></span>\n\n\n</div>\n<p>In other places, we simply epicly fail at education and don’t seem to care. Or education ‘experts’ claim that things that obviously work don’t work, or things that obviously don’t work, do work.</p>\n\n\n<h4 class=\"wp-block-heading\">An Introductory Example</h4>\n\n\n<p>Consider this section some combination of peek into this alternative universe of thought and the fun of multiple meta levels of shooting fish in a barrel?</p>\n<p>I present, <a href=\"https://x.com/gtmom/status/1965082489950802003\">HT to Pamela Hobart who makes many of the same points</a>: Freddie DeBoer writes the long ‘<a href=\"https://freddiedeboer.substack.com/p/education-doesnt-work-30\">Education Doesn’t Work 3.0</a>’ which is ‘a comprehensive argument that education cannot close academic gaps.’</p>\n<p>What? Was it supposed to do that? Would you want it to?</p>\n<p>Very obviously the only way to close academic gaps fully is to go all handicapper general and ban bright kids from getting educations. Thus, The War on Education.</p>\n<p>Freddie starts off saying we can’t admit some kids aren’t smart, and some kids will naturally do better at school than others, to which I say you just admitted it, and I’m happy to admit it, and everyone I talk to is willing to admit it, so who is this mysterious we. It is, presumably, a Certain Type of Guy who is an ‘education expert’ of some kind and presumably has a maximum of one child who has gone to school.</p>\n<blockquote><p>Freddie DeBoer: Our educational debates are largely useless because most people engaged in those debates assume out of hand that, absent unusual circumstances like severe neglect or abuse or the presence of developmental or cognitive disabilities, any student can be taught to any level of academic success, and any failure to induce academic success in students is the result of some sort of unfortunate error.</p></blockquote>\n<p>Well, it depends.</p>\n<p>If you mean ‘those debates’ as in those between those ‘education experts’? Then perhaps yes, they make these types of absurdly stupid assumptions. If you mean ‘debates among actual regular humans,’ then no. Obviously not. One would question whether Freddie has met such people.</p>\n<blockquote><p>Education can raise the <em>absolute performance</em> of most students modestly, but it almost never meaningfully reshuffles the <em>relative</em> distribution of ability and achievement.</p></blockquote>\n<p>Um, again, what exactly were we trying to do? Educate the children? Or make sure we don’t educate the children? Half and half?</p>\n<p>I mean, I guess Freddie then does a job repeatedly exposing ‘the contradictions’ as it were in the entire equality project, but the barrel already has a lot of bullet holes, the water is leaking and the fish are dead.</p>\n<p>So we get more fun lines like this:</p>\n<blockquote><p>We have spent an immense amount of effort, manpower, time, and treasure on forcing students to meet procrustean academic standards, despite the fact that we have overwhelming evidence that their relative performance is largely fixed.</p></blockquote>\n<p>Yes, obviously, also yes the extra money is mostly being wasted but even if it wasn’t the whole point was presumably to (drum roll) educate the children.</p>\n<p>Why in the world would we spend tons of resources and time on relative education, which by definition is zero sum and a red queen’s race? That doesn’t make sense. There’s a fixed amount of relative education.</p>\n<blockquote><p>At the end of this essay, I will argue that education is important, does matter, and is worth funding &#8211; but that what’s now assumed to be its primary purpose, moving students around in quantitative educational metrics, is actually what education does worst.</p></blockquote>\n<p>Who thought that was its primary purpose, either the metrics or the thing itself?</p>\n<p>Meanwhile, the reason this was brought to my attention is that his ‘absolute learning has value’ t-shirt is raising questions supposedly answered by the shirt:</p>\n<blockquote><p><strong>What This Essay Does Not Argue:</strong></p>\n<ul>\n<li>That absolute learning (that is, learning as measured against a standard or benchmark or criterion) has no value; rather, relative learning is practically and morally dominant in these discussions because only relative learning (sometimes discussed in terms of educational mobility) can better one’s economic fortunes, and it is that potential that underlies our entire modern educational debates and the reason for obsession with achievement gaps.</li>\n</ul>\n</blockquote>\n<p>The next section is ‘I Assure You, You Do Care About Relative Learning.’</p>\n<p>I assure him that I don’t.</p>\n<p>His first argument is that relative learning indicates absolute learning. That is true but saying this means therefore you care about relative learning (checkmate, liberals?) is not how logic or words work. Caring about the territory does not mean you care about the (not very accurate) map.</p>\n<blockquote><p>Second, while I am happy to concede that absolute learning happens all the time, this should not be mistaken for saying that absolute learning is easily achieved, reliable, or consistent.</p></blockquote>\n<p>I don’t understand why this is supposed to be a relevant argument here. It seems like he’s saying I care about [X], but actually [X] is hard, so instead I care about [Y]?</p>\n<blockquote><p>Most importantly, though, is a simple reality: the <em>consequences </em>of education are derived from relative performance, not absolute.</p>\n<p>…</p>\n<p>In the vast majority of scenarios where education is relevant, applicants of whatever type are being evaluated relative to peers.</p></blockquote>\n<p>There’s saying the quiet part out loud, and then there’s this.</p>\n<p>The purpose of education is… to do well on applications?</p>\n<p>He concedes that one might learn to drive and then use this skill to usefully operate a moving vehicle, but says this type of education is rare &#8211; that most education has no actual use whatsoever, other than as a positional good to grab a larger share of stuff.</p>\n<p>Then he goes through that schools are ‘not guilty’ because improving educational outcomes is impossible anyway. Transferring does nothing. Charter schools don’t work. Interventions don’t work (literally “Nothing “Works””), full null hypothesis.</p>\n<p>All right, so now we have a section ‘So What Should We Do?’</p>\n<p>Very obviously, if you actually believed all that, you would want to dramatically reduce spending, both in money and in the time of children, on school, since school is almost entirely about relative position. Spending more on school, trying to achieve more or improve performance, in this model, is a defection against everyone else. So we should ban attempts to educate children, beyond some basic skills, and focus on practical stuff like learning to drive. Completely reorient childhood.</p>\n<p>So having pre registered that, let’s see what he recommends.</p>\n<ol>\n<li>Improve air quality. Okay, sure, that is one of the somethings that work, although again I don’t understand why he thinks improving performance is good.</li>\n<li>Lower our educational standards. Don’t make kids learn (for example) abstract math. Yes, that makes perfect sense for Freddie, if the learning is useless, you shouldn’t require it. Again, if he is right then we should go farther, and ban such learning. Why are we letting kids engage in a zero sum competition?</li>\n<li>Soft tracking. Again, good idea, not sure what it has to do with the post.</li>\n<li>Invest in a robust safety net. Maybe? That’s a different department.</li>\n</ol>\n<p>Then he tries to pivot back to ‘actually education matters.’</p>\n<blockquote><p>Education creates the conditions for children and young adults to discover ideas, literature, science, and art that might otherwise remain inaccessible.</p>\n<p>It provides the structured time and social environment where curiosity can blossom, where students can learn how to think about problems that don’t have easy answers, and where they can build lasting relationships with peers and mentors.</p>\n<p>The point of school, then, is not to guarantee that every child climbs into the top decile of performance but to offer each student the chance to cultivate knowledge, resilience, and imagination in ways that enrich their lives.</p></blockquote>\n<p>So absolute learning of something does matter after all, then. I mean, this description does not match what I know about actual schools, nor would I design anything like a current school if those were the goals. And he doesn’t seem interested in a redesign or asking how to maximize the things that he thinks matter. But hey.</p>\n<p>Meanwhile, here’s the top comment, so yes things do get pretty insane:</p>\n<blockquote><p>James K: This is what I pay you for, Freddie, thank you for being so clear-headed about this topic.</p>\n<p>I&#8217;ve been teaching for 16 years now and it boggles my mind that the band teacher can literally get on stage and say &#8220;We have the beginner, intermediate, and advanced band for you&#8221; and of course the baseball team can be divided into Varsity and JV, but I am not allowed to say that some kids are not smart enough to handle my AP classes because this means I don&#8217;t BELIEVE IN THEM or am supporting TRACKING (always said in the tones people reserve for the words &#8216;eugenics&#8217; or &#8216;segregation&#8217;).</p></blockquote>\n<p>I mean, yes. It means you support tracking because tracking is good. It means you don’t believe in them in the sense that you don’t believe in things that aren’t real.</p>\n<p>So no, in that sense Freddie isn’t arguing with a strawman. Which means that the entire system of education is being run by people who are at war with education.</p>\n\n\n<h4 class=\"wp-block-heading\">Total Failure</h4>\n\n\n<p><a href=\"https://www.thefp.com/p/high-schooler-graduates-illiterate-sues-tennessee-school\">A Tennessee teen is suing his school</a> for ‘compensatory education’ after graduating with a 3.4 GPA, but being unable to read, or even spell his own name, and the school system has the audacity to defend against that lawsuit.</p>\n<blockquote><p>But the school took no action, the suit says, other than giving him 24 hours to complete his assignments.</p>\n<p>But even this “solution” was a problem. Because when William was at home with his schoolwork, he relied on AI programs like ChatGPT and Grammarly to complete his assignments for him, according to the judge who ruled on his suit last week. As a result, William continued to achieve high marks on his classwork throughout his entire four years of high school, even though teachers knew he was illiterate.</p></blockquote>\n<p>If you can’t read, using ChatGPT is kind of crazy &#8211; you’re presumably scanning or copy pasting in text you don’t understand, then copying out text you don’t understand and hoping for the best.</p>\n\n\n<h4 class=\"wp-block-heading\">Partial Failure</h4>\n\n\n<p><a href=\"https://www.astralcodexten.com/p/what-happened-to-naep-scores?utm_source=post-email-title&amp;publication_id=89120&amp;post_id=158734157&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=67wny&amp;triedRedirect=true&amp;utm_medium=email\">Scott Alexander asks: What happened to NAEP Scores?</a> He says they are ‘not good’:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!TFqD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9a1acc82-50ae-418d-98ce-ec3e4d228d94_924x398.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Well, they’re not great obviously, to the extent you can trust the scores to map to Reality, but they are still above the start of the graph in 1998, and we’re talking about a seven point difference. That’s less than a fifth of a standard deviation. This is nothing, if anything this shows that Covid didn’t change things much?</p>\n<p>The comments section of Scott’s post is full of despair about classroom conditions getting worse, shifts to teaching strategies that don’t work (see the Mississippi reforms but in reverse), discipline collapsing and teachers having no tools if kids don’t play along, many teachers quitting, chronic absenteeism happening and being accepted and tolerated, and many families not prioritizing education, on top of the continuing trends involving smartphones. That’s on top of the obvious ‘Covid took away a lot of schooling’ concern that Scott starts with.</p>\n<p>What seems more meaningful than the overall smaller drop is the widening gap between low and high performers, another trend predating Covid. Scott has several graphs showing this, and I am convinced this is real, with a variety of causes. If you are properly equipped and motivated, you can avoid the pitfalls described above, and you have access to the entire web and world and a lot of new resources, now even including AI. Whereas when the bottom falls out, the bottom falls out.</p>\n<p><a href=\"https://t.co/mVNM5cPTr0\">Meanwhile in 12th grade, nearly half scored below ‘the basic level</a>,’ which involves things like ‘using percentages to solve real-world problems,’ and reading scores hit a new low. What we are doing, including adding funding, is clearly not working. Or rather, it is working hard, only not at the goal of children learning academic skills.</p>\n\n\n<h4 class=\"wp-block-heading\">The War on Algebra</h4>\n\n\n<p>The War on Algebra in particular is still perhaps the craziest thing I’ve ever seen, actively preventing children from learning math out of spite. In the sense that it both very clearly purely destructive and evil, and also horribly unpopular across the board, and also high salience to a lot of voters. Yes, I do know what their arguments are for doing it, and they very much do not make it any better.</p>\n<p>And yet it still happened, and it happens across the board, <a href=\"https://en.wikipedia.org/wiki/Harrison_Bergeron\">straight up Handicapper General style</a>.</p>\n<blockquote><p><a href=\"https://x.com/RoKhanna/status/1921958772706066650\">Ro Khanna</a>: It is absurd that Palo Alto School district just voted to remove honors biology for all students &amp; already removed honors English. They call it de-laning. I call it an assault on excellence. I took many honors classes at Council Rock High in PA.</p>\n<p><a href=\"https://x.com/autumnlooijen/status/1922105262002860530\">Autumn Looijen</a>: I ran the campaign to bring algebra back to SF&#8217;s middle schools.</p>\n<p>It was the most popular thing I ever worked on. Voters don&#8217;t want to take away opportunities for kids who can&#8217;t afford private school.</p>\n<p>If anyone wants to put this on the ballot in Palo Alto, happy to advise.</p>\n<p>Maud Maron: We are trying to do a version of this in NYC! Would love to have you speak to NYC parents who want to have algebra &amp; geometry options in Middle School.</p></blockquote>\n<p>Meanwhile in San Francisco, the war rages on. It seems the city has not yet been retaken by sanity on all fronts yet, although there are some promising signs. All of this seems like it has to be beyond unpopular, in a ‘cause families to move out’ way, yet here we were again not too long ago (it got better, for now):</p>\n<blockquote><p><a href=\"https://x.com/garrytan/status/1927580354581524880\">Garry Tan</a>: San Francisco schools is trying its absolute hardest to make sure all middle income families who could move out of the city do so right away.</p>\n<p>“Grading for Equity” is going to be a real disaster and I guess this is a boon for SF private schools and Burlingame housing prices.</p>\n<p>For education bureaucrats who ruin our public schools with the most unfair and anti-merit polices: BUSINESS IS BOOMING.</p>\n<p>Someone needs to investigate the Schools of Education that spawn these policies because it is a real danger to public schools everywhere.</p>\n<p>Basically this scam is Idiocracy in real life.</p>\n<p><a href=\"https://x.com/micsolana/status/1927744126151237696\">Mike Solana</a>: the san francisco board of education must immediately fire the superintendent. if they do not, they must all be removed from power.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">The War on Evaluation</h4>\n\n\n<p>I don’t get how this falls under ‘you can just do things’ but it seems it did, at least until people sounded the alarm?</p>\n<blockquote><p>John Trasvina (The Voice of SF): Without seeking approval of the San Francisco Board of Education, Superintendent of Schools Maria Su plans to unveil a new <a href=\"https://go.boarddocs.com/ca/sfusd/Board.nsf/files/DGX5KX10AEAA/$file/%5BBOE%5D%20SFUSD%202025-26%20Interim%20Goals%20and%20Initiatives%202025-05-22.pdf\">Grading for Equity</a> plan on Tuesday that will go into effect this fall at 14 high schools and cover over 10,000 students.</p>\n<p>The school district is already negotiating with an outside consultant to train teachers in August in a system that awards a passing C grade to as low as a score of 41 on a 100-point exam.</p>\n<p>Were it not for an intrepid <a href=\"https://docs.google.com/document/d/16Z956H8rG5ZtflJyyDj642LJi4si8IoIz-DKG-5ynb8/edit?pli=1&amp;tab=t.0\">school board member</a>, the drastic change in grading with implications for college admissions and career readiness would have gone unnoticed and unexplained. It is buried in a three-word phrase on the last page of a PowerPoint presentation embedded in the school board meeting’s 25-page agenda.</p>\n<p>…</p>\n<p>Grading for Equity eliminates homework or weekly tests from being counted in a student’s final semester grade. All that matters is how the student scores on a final examination, which can be taken multiple times.</p>\n<p>Under the San Leandro Unified School District’s grading for equity system touted by the San Francisco Unified School District and its consultant, a student with a score as low as 80 can attain an A and as low as 21 can pass with a D.</p>\n<p><a href=\"https://x.com/DKThomp/status/1927700160337117617\">Derek Thompson</a>: New SF public school plan would</p>\n<p>&#8211; eliminate homework and weekly tests from counting toward semester grade</p>\n<p>&#8211; allow students to take the final exam multiple times</p>\n<p>&#8211; convert all B grades into As, and all Fs into Cs</p>\n<p>It’s hard to see the difference between this policy and what you’d get if a bunch of 10yos locked the teachers in a closet and rewrote the rules.</p>\n<p><a href=\"https://x.com/karenvaites/status/1927710420569035088\">Karen Vaites</a>: More media attention here, please! <img alt=\"🚩\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f6a9.png\" style=\"height: 1em;\" /><img alt=\"🚩\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f6a9.png\" style=\"height: 1em;\" /><img alt=\"🚩\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f6a9.png\" style=\"height: 1em;\" /></p>\n<p>Jared Walczak: The sad irony is that Grading for Equity is virtually the opposite of Teaching for Equity, because under this system, the only kids who might get a real education are those from families that take more into their own hands, bringing higher expectations and resources to bear.</p></blockquote>\n<p>So, effectively no grading, then. You can do whatever you want all semester, no homework (so perhaps there’s some upside here?), phone out in class every day, whatever, all you have to do to pass is get 21% on an exam you can take multiple times. That was going to be it.</p>\n<p>And Maria Su could just do this on her own? What?</p>\n<p>It <a href=\"https://x.com/sdamico/status/1927841467692896310\">turns out that enough backlash does matter</a>, and this combination of graft and civilizational suicide took the loss on this one.</p>\n<blockquote><p>SF Standard: Just in: SFUSD is delaying a planned “grading for equity” initiative after the proposal sparked furious backlash.</p>\n<p><a href=\"https://x.com/KelseyTuoc/status/1927856552649634085\">Kelsey Piper</a>: SF superintendent backed off immediately after the flood of negative feedback. This strikes me as a pretty dramatic change from how previous standards erosions were received, and a really good sign.</p>\n<p>Most politicians want to make their constituents happy, and often their information environment is kind of terrible for that. It&#8217;s worth advocating for the stuff that matters to you. Don&#8217;t be an asshole, but be clear and outspoken.</p>\n<p>San Francisco&#8217;s turnaround happened very fast. The Bay Area could become one of the best-governed parts of the United States inside a few years if we work to make it happen.</p></blockquote>\n<p><a href=\"https://sfstandard.com/2025/05/28/sfusd-equity-grading-san-francisco-controversy/?taid=68377086684c790001349b69&amp;utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter\">Well, maybe. They say they are ‘delaying’ the initiative</a>. Which means they’re presumably going to keep paying the consultants, and they are going to try again to destroy all the incentives and measurements involved in education.</p>\n\n\n<h4 class=\"wp-block-heading\">The War on Reading</h4>\n\n\n<p>Fighting against algebra and grading is bad enough, but reading?</p>\n<p>As in, people who want to ban teaching kids to read until age 6. No. Seriously.</p>\n<p>Because they’re ‘not ready.’</p>\n<blockquote><p><a href=\"https://x.com/erikphoel/status/1950947139359482188\">Erik Hoel</a>: 62% of American kids have a tablet at age 6.</p>\n<p>They spend 3.5 hours every day on screens (increasingly, TikTok).</p>\n<p>And because our school system waits so long to teach reading, they never get a chance to become readers.</p>\n<p>&#8220;Education experts&#8221; have been saying for decades that we must wait to start teaching reading until 6-7 for neuroscientific reasons. These reasons appear, as far as I can tell, to be basically made up. Consider this recent article, which quotes a bunch of experts on this.</p>\n<p>E.g., Maryanne Wolf says that brain myelination needs to reach a certain stage, and that teaching reading prior to 5 is &#8220;really wrong&#8221; and that she would ban teaching reading prior to 6 nationwide if she could.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!QHpb!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0792798b-96b0-4f2f-9cbf-f5919c3ff10e_1138x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/SilverVVulpes/status/1951291986096402766\">Siberian Fox:</a> what in the fuck</p>\n<p>I was playing Pokémon before 6 if I recall correctly, if not, other games that require reading</p>\n<p>good to know that there are people in the US that think this should be super illegal</p></blockquote>\n<p><a href=\"https://x.com/oscredwin/status/1965200291705618526\">In a good school, a 1st grader will be reading quite a lot, actually.</a></p>\n<p>I’m not going to bother quoting more of the evidence because this is so utterly Obvious Nonsense as to be beyond belief. Frankly, if I had a child that was 6 years old and couldn’t read I would not be thinking ‘good it is finally time,’ I would be debating exactly how much to panic and reassuring my wife not to panic far more.</p>\n<p>The 3 year old I am currently supervising can somewhat read. I could read before my first memory (which was at 5 and involves reading books) so I don’t know exactly when it happened, and I learned without anyone trying to teach me.</p>\n<p>I am going maximum opposite. There is no higher priority than teaching a child to read as early as they can handle it, and every actual parent knows this. There is a reason why the advice is constantly read to them, read with them, push reading. Reading enables everything else. The entire ‘education’ establishment really does need to flat out join the delenda est club.</p>\n\n\n<h4 class=\"wp-block-heading\">The War to Enslave Bright Students</h4>\n\n\n<p>In the name of them developing empathy for the people you force them to teach? As long as they pass a certain threshold of knowledge, the rest of their childhood, and indeed life, belongs to the people, and they’re a horrible person if they think otherwise, and the purpose of school is to teach them this?</p>\n<p>No, seriously, this is something quite a lot of people, especially those in education, actually believe.</p>\n<p>Setting all ethical or moral considerations aside, and even assuming that is the goal, what in the world makes you think this is going to work in the direction you want?</p>\n<blockquote><p>Tracing Woods: If a child is in a class, they should be there because it is the best environment to help them learn, not so they can act as an unpaid tutor to provide vague &#8220;peer effects&#8221; to others A system that abuses children as resources instead of teaching them to their level is unethical.</p>\n<p><a href=\"https://x.com/McReynoldsJoe/status/1942228589635682381\">Joe McReynolds</a> (3.4m views): That&#8217;s what life *is*, though! If you&#8217;re unusually smart/talented, your primary purpose in life is to help lift up others who weren&#8217;t born/raised as lucky as you were. Learning that sooner rather than later is important for developing a sense of altruism and communitarianism.</p>\n<p>&#8220;With great power comes great responsibility&#8221; is a simple, true statement. To the extent being born with unusual (intellectual) power is an &#8220;innate characteristic,&#8221; that good luck means that you owe the universe hard work. You&#8217;re born with a debt that takes a lifetime to repay.</p></blockquote>\n<p>There it is, very explicitly. These people actually believe this. If you’re talented, your purpose in life is to be enslaved, to be forced to help others. Your life does not belong to you. Your labor does not belong to you. Your time does not belong to you. Who cares whether that benefits you? You belong to the people, from each according to their ability, at the barrel of a gun.</p>\n<blockquote><p><a href=\"https://x.com/KelseyTuoc/status/1942397388855107588\">Kelsey Piper</a>: If I were actively trying to extinguish my children&#8217;s sense of altruism, compassion and responsibility I can&#8217;t think of a better plan than forcing them to spend all of their time doing random &#8216;altruistic&#8217; chores they didn&#8217;t choose, and aren&#8217;t equipped to succeed at.</p>\n<p>If you say to your kid &#8220;I&#8217;m going to volunteer this weekend to help socialize cats&#8221;, they&#8217;ll probably come along and they may discover a lifelong love of helping animals! if you force them to spend all their time on it, guess what, they&#8217;re gonna hate it.</p>\n<p>if you want your children to be people who give generously to their communities and their broader world, be that kind of person yourself and let them witness the ways in which this is part of the good for you and for your community.</p>\n<p>SteelBlaidd: Why do they need to go to college to learn to be teachers if kids can be expected to do it in elementary school?</p>\n<p>Kelsey Piper: some people out here believe that homeschooling is immoral since you don&#8217;t know enough to teach your kids and also that a smart 9 yo can do it.</p>\n<p>Ben Hoffman: The important thing is that the 9yo is forced to do it without pay to teach them that being educated means going along with nonsense dramas, which qualifies them to get paid to go along with nonsense dramas when old enough that that&#8217;s dramatically appropriate.</p></blockquote>\n<p>Not only that the smart 9you can do it, that they should be forced to do it without pay. While the parent is forbidden to do it, because they are unqualified.</p>\n<blockquote><p><a href=\"https://x.com/scottleibrand/status/1942826058832830693\">Ryan Moulton</a> (QTing Joe above): Everybody is dunking on this, and I get why, but I&#8217;m a little more sympathetic. Particularly in lower grades, developing empathy for people different from you or dumber than you is a really important thing to get out of school, comparably important to getting through math faster.</p>\n<p>Sarah Constantin: t is super common for kids to openly taunt anyone who&#8217;s not as good as them (at anything!) and i do think it&#8217;s important for them to learn manners, grace, and sportsmanship&#8230;</p>\n<p>but it doesn&#8217;t deserve as much time in the day as math class.</p>\n<p>Gallabytes: I would add that these kinds of assignments don&#8217;t necessarily breed empathy it&#8217;s pretty easy for it to create contempt instead.</p>\n<p>Sarah Constantin: yeahhh.</p>\n<p>Gallabytes: feels like people talk about school in far mode as some inscrutable thing.</p>\n<p>if I put *you* in a room with people you had 4 sigma on and told you to teach them math Or Else, how would you feel? how would this make you feel about them?</p></blockquote>\n<p>I believe we should treat Joe’s perspective the same way we would treat others who would force people with certain characteristics to labor for no compensation.</p>\n\n\n<h4 class=\"wp-block-heading\">The War on Ability Grouping</h4>\n\n\n<p>See my<a href=\"https://thezvi.substack.com/p/on-alpha-school?r=67wny\"> discussion of Alpha School</a> for extensive previous discussions.</p>\n<blockquote><p><a href=\"https://x.com/tracewoodgrains/status/1943125012535185816\">Tracing Woods</a> (reference documents and more details in thread): in 1930, researchers studied ability grouping and concluded you needed to adjust the curriculum to make it work</p>\n<p>in 1960, more confidently so</p>\n<p>then in 1990, they studied grouping without changing curriculum, concluded it was useless, and advocated to get rid of ability grouping</p>\n<p>over time the field got better and better at studying the form of ability grouping that everybody had known was pointless for sixty years while just sorta disregarding the form that kept getting results</p>\n<p>I get so mad every time I read this stupid study</p>\n<p>the field of education set itself back generations because it kept listening to people who thought ability grouping was &#8220;antidemocratic and antiegalitarian&#8221; and as such badly wanted it not to work</p>\n<p>we had it figured out in 1936 and then we threw it away for kicks.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Bdf2!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F33d0af75-99e1-43d9-ae8e-c2984c28a2b3_490x278.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I am not a fan of the idea of educating children in 2025 primary via traditional classes. Traditional classes feel like learning a lot more than they actually cause learning.</p>\n<p>But I accept that we are going to keep doing this for a while.</p>\n<p>Given you are going to have traditionally shaped classes on various subjects, very obviously you want to track their progress and group those children by ability.</p>\n<p>Grouping children into classes by ability has the advantages that it, <a href=\"https://thezvi.substack.com/i/166603368/lack-of-tracking-hurts-actual-everyone\">as covered in Education #11</a>:</p>\n<ol>\n<li><a href=\"https://x.com/tracewoodgrains/status/1936903680281677873\">Helps almost all children learn more</a>, <a href=\"https://t.co/FpLLSVqJjc\">whether</a> <a href=\"https://t.co/7tGmTxjQcz\">they</a> <a href=\"https://t.co/l8L5vdnSlZ\">are</a> behind, ahead or neither. There are some corner cases where kids are ‘on the bubble’ between tracks, or get tracked wrong, but mostly this is opportunity cost, that they missed benefits.</li>\n<li><a href=\"https://x.com/davidshor/status/1922330645218422928\">Is universally popular with parents</a>, to the extent that ‘ending tracking’ is the least popular serious policy proposal we have ever seen. As in David Shor says ‘removing advanced classes from schools’ is literally the single most unpopular policy Blue Rose has ever polled (<a href=\"https://x.com/RoKhanna/status/1921958772706066650\">yet there goes Palo Alto doing exactly this</a>.)</li>\n<li>Is even <a href=\"https://x.com/tracewoodgrains/status/1941997311233568835\">popular with the classroom teachers themselves</a>.</li>\n</ol>\n<p>Ability grouping, done wisely, so utterly obviously works as to make the alternate hypothesis absurd.</p>\n<blockquote><p><a href=\"https://x.com/tracewoodgrains/status/1941547152829796430\">Tracing Woods</a>: will someone struggling with basic arithmetic and someone who knows calculus benefit from the same instruction? no.</p>\n<p>would selective schools and the students in them benefit from opening their doors to everyone? they certainly don&#8217;t seem to think so!</p>\n<p>do athletics orgs advocate grouping young LeBron into his local mixed-ability rec league so he can trarin and progress? no.</p>\n<p>do gifted kids who accelerate learn more advanced material when they&#8217;re presented with it? yes.</p>\n<p>if people see school as a democratic equalizer where everyone should learn the same things, they find ability grouping doesn&#8217;t work (doesn&#8217;t accomplish that goal). if people see school as a place where people should learn specific subjects and progess to whatever level they can, they find it does work (does accomplish that goal). and because education research is dominated by the former, onlookers glance at its output and say &#8220;huh, the results are mixed. guess we&#8217;ll never know!&#8221;</p>\n<p>there is no substitute for understanding what is going on at a ground level.</p></blockquote>\n<p>The question is how to make it work best, not whether it works. Very obviously, as the next section discusses, it is possible to massively screw it up if you try hard enough.</p>\n<blockquote><p>Jordan Michelson: Why would *teacher’s unions* oppose ability grouping? It makes no sense.</p>\n<p><a href=\"https://x.com/mattyglesias/status/1943633517281198125\">Matthew Yglesias</a>: Ideology.</p>\n<p>Karen Vaites: The average American would be shocked by the degree to which K-12 education is ruled by ideology. Beliefs about teaching and how we want learning to work often trump evidence about what does, in fact, work.</p>\n<p><a href=\"https://x.com/tracewoodgrains/status/1941514271797715142\">Tracing Woods</a>: &#8220;Trace, why are you making such a big deal out of something everybody already agrees with?&#8221;</p>\n<p>Because the people we trust to direct society on this topic at every level oppose it.</p>\n<p>And I hope that maybe if I shout enough about that people will really internalize what that means.</p></blockquote>\n<p>Exactly. Everyone agrees we want [X], where [X] is tracking. We keep talking about it because [~X] keeps actually happening.</p>\n<p>I presume opposition is mostly ideology. Full stop. They want to prevent the wrong kids learning too much. They are sacrificing the kids on their alter.</p>\n<p>Academics and education ‘experts,’ despite the literature and all actual observations and everyone involved saying that tracking helps all kids learn better, keep lamenting that parents want tracking, and work to destroy it, often in the name of ‘equity.’</p>\n<p>It is <a href=\"https://x.com/Cam_Oflage/status/1936881487510728876\">common to see people claim</a> ‘the research’ says that ‘downstreamed’ kids who are grouped at lower ability do worse rather than better as a result and that ‘the research’ supports this. As far as I can tell this is simply not true, these people simply think it ‘should’ be true, and seek out ways to say it anyway.</p>\n<blockquote><p><a href=\"https://x.com/tracewoodgrains/status/1941997311233568835\">Tracing Woods</a>: what happens when academics study parental perception of ability grouping?</p>\n<p>They lament that parents of students at all levels favor it even though it&#8217;s BAD.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!I_7U!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff0167a65-8a00-46bf-8d70-fd7ea7d5dd45_839x522.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Virtually no parents support ending ability grouping.</p>\n<p>Parents of kids in both remedial and G/T programs agreed that their kids should be grouped with kids of equal ability</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!4Q3x!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9a537963-f9d0-4256-a2d3-c23a1e8deb98_793x346.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>80% of special-ed parents, 90% of parents with kids in remedial courses, and 98% of parents with kids in advanced programs agreed that their kids were helped by it.</p>\n<p>This was all very disappointing to the authors.</p></blockquote>\n<p>Why do the authors <a href=\"https://t.co/7YzJ2iiGHN\">here</a>, like many other academics and education experts and many school principals who somehow end up actually destroying such programs, say that this is bad, despite everyone involved in the actual schools agreeing it helps all of the students?</p>\n<p>Because the ‘educators’ who determine policy (as opposed to the teachers whose job is to actually educate children) consistently have decided that they do not care about the life experiences of families and children or helping children learn.</p>\n<p>What they care about, other than money, is preventing learning rather than causing learning. Or, as they call it, ‘equality’ or ‘equity.’ Never mind that this ‘equity’ directly hurts the students who are otherwise being ‘denied’ it, what matters is that they be given ‘opportunity to learn and equality of educational opportunity.’ Educational opportunity shall be destroyed until this is achieved. If that leads to everyone getting a worse education, even the worst off kids, well, that’s not their department’s KPI.</p>\n<p>I don’t quite agree with Anton that <a href=\"https://x.com/atroyn/status/1941505189946732948\">these people ‘hate you and your children</a>.’ They only hate that you and your children might do better than other children, and want to prevent this from happening. They only hate you if you oppose this goal.</p>\n<blockquote><p><a href=\"https://x.com/garrytan/status/1941557239040573824\">Garry Tan</a>: Ability grouping in school (honors/AP) depends on your frame. If school’s job is to equalize, grouping looks like a fail. If it’s to let kids sprint ahead, it works.</p>\n<p>Academia worships equalizing— so the School of Education bureaucrats become anti-education, ruining schools.</p>\n<p><a href=\"https://x.com/garrytan/status/1941492240393830598\">When you examine the list</a> of nonprofits and academics that want to remove advanced math from classrooms and water down the standards for all students it will leave you shaken.</p>\n<p>It’s not a fringe movement. It is School of Education Orthodoxy.</p>\n<p>Tracing Woods: This is a fair question! Opposition to ability grouping is a fringe idea opposed by the great majority of parents. So which obscure, fringe organizations are pushing it?</p>\n<p>Let&#8217;s ask the National Council of Teachers of English what they think:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!3KPz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Faeba1dec-78f4-4fe5-b735-1a443a4b2001_924x1044.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Or what about the most prominent law casebook publishers?</p>\n<p>Or consider the National Association of Secondary School Principals.</p>\n<p>How about the Association of State</p>\n<p>Supervisors of Mathematics, NCSM: Leadership in</p>\n<p>Mathematics Education, and the National Council of Teachers of Mathematics (NCTM)?</p>\n<p>You know it.</p></blockquote>\n<p>If it is a choice between the form of academia that wants to prevent children from learning, and the form of academia that helps teach useful things, and one or the other must be destroyed?</p>\n<p>The choice seems clear.</p>\n<blockquote><p><a href=\"https://x.com/tracewoodgrains/status/1941497238020293083\">Tracing Woods</a>: my modest proposal to every university that has published research claiming ability grouping (with paired curricular modification) doesn&#8217;t work:</p>\n<p>detrack. remove your admissions standards. remove course prerequisites.</p>\n<p>if detracking works, let&#8217;s create Harvard Community College.</p></blockquote>\n<p>However, you do have to choose a reasonable implementation. Is it possible we also in some ways are screwing implementation up so badly that adding what we call ability grouping to the mix, as implemented in practice, could make things worse?</p>\n\n\n<h4 class=\"wp-block-heading\">The Battle of North Carolina Ability Grouping</h4>\n\n\n<p><a href=\"https://x.com/tracewoodgrains/status/1950187400996466986\">North Carolina excluded half its qualified students from advanced math</a>. They tried to pass a law to fix some of this. The schools fought back.</p>\n<blockquote><p><a href=\"https://x.com/tracewoodgrains/status/1950336426928984365\">Tracing Woods</a>: What happened when North Carolina changed its laws to require top-scoring students to be placed in advanced math?</p>\n<p>The state board of education changed the test cutoffs, subverting the intent of the law by dropping almost all students from the top-scoring category.</p>\n<p><a href=\"https://www.educationprogress.org/p/the-algebra-gatekeepers?utm_campaign=post&amp;utm_medium=web&amp;hide_intro_popup=true\">Janet Johnson and John Wittle</a>: The law was intended to help high school students who excelled in their math classes move into the advanced track. Before the scoring change, 11% of high school students statewide scored at Level 5, the highest level, with some districts seeing rates as high as 25%. The EVAAS Prediction vs. Performance table (above) showed that in 2009, 42,144 students were predicted to be successful in 8th-grade algebra, and only 18,670 students were enrolled. Using EVAAS prediction as the metric would have given 23,474 more students access to advanced math.</p>\n<p>After the law passed, which required schools to admit all Level 5 students to advanced classes, and the state changed the scoring scale, fewer than 1,500 (too few to report) high school students in the entire state achieved Level 5.</p>\n<p>The schools had technically complied with the law while completely subverting its intent. These charts are from the NC School Report Cards.14 After 2019, the Math 1 Performance charts show no Level 5 and very little Level 4, similar to this.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!nW8w!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0446901a-56a2-472c-8015-0df81b64a743_1346x744.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p><a href=\"https://www.educationprogress.org/p/the-algebra-gatekeepers\">The full post</a> on ‘the Algebra gatekeepers’ keeps outlining all the tactics used to ensure that kids do not learn algebra, especially disadvantaged kids. As you read it, it keeps getting worse.</p>\n<blockquote><p>For example, we attended a meeting with the parents of a middle school girl who had earned an A in 7th-grade pre-algebra but was denied enrollment in 8th-grade algebra despite her and her parents&#8217; wishes. The teachers argued that her formative assessments didn&#8217;t align with her summative performance, suggesting her previous success didn&#8217;t guarantee future outcomes.</p>\n<p>The language arts teacher claimed the student had &#8220;appeared to struggle&#8221; during benchmark activities and that earning an A seemed &#8220;harder for her than for other students who achieved similar summative data results.&#8221; The math teacher who had given her an A pointed to C grades on some earlier formative assessments, arguing that despite her subsequent A performance on chapter tests and other summative data points, these initial benchmark scores indicated she &#8220;sometimes struggles with foundational concepts during the formative assessment process.&#8221;</p>\n<p>The administrators nodded knowingly as teachers referenced &#8220;inconsistent performance across benchmark measures&#8221; and &#8220;concerns about the gap between formative and summative data trends.&#8221; They suggested that while her final grades represented solid summative data, the formative assessment patterns revealed &#8220;areas of concern&#8221; that made advanced placement inadvisable, regardless of what the summative data actually showed about her mastery of the subject matter. This is just an example of the kind of talk the parents encountered, so the church advocacy group started bringing someone from our staff to the meetings to help them cut through this.</p>\n<p><strong>This type of circular reasoning, where success was reframed as evidence of potential failure, was typical of how schools justified excluding qualified students from advanced courses.</strong></p>\n<p>Administrators would routinely promise that students could move to advanced tracks &#8220;later, in high school,&#8221; but our analyses and other research we found indicate students rarely moved to the advanced track after the 8th grade.</p>\n<p>The tracking system created rigid pathways where missing 8th-grade algebra typically meant students couldn&#8217;t reach calculus by graduation, limiting their college and career options.</p>\n<p>…</p>\n<p>One fifth grader exemplified the problem. He had scored at the highest level on every test, had a 98% EVAAS prediction for success, and straight As on his report card. He was also officially classified as Academically Gifted by the school. When a new advanced math class was created, he wasn&#8217;t invited. When he asked to join, his parents were told no, he needed to be &#8220;recommended.&#8221; School officials told us, with straight faces, that his consistent past success was no indication he could succeed in advanced math, that they were keeping him out for his own good.</p></blockquote>\n<p>What North Carolina is doing here, excluding lots of qualified students, does at least seem better than ending algebra entirely for everyone, I suppose.</p>\n<p><a href=\"https://x.com/gtmom/status/1951008656675447211\">Pamela Hobart also looked into the same writeup and offers her own thread,</a> notes that this steps fully into cartoon villainy.</p>\n<p>The true teaching of algebra to kids who are ready for it is almost impossible to find. <a href=\"https://t.co/UplE9wrtxm\">Even if you send your child to a ‘gifted’ school</a>, <a href=\"https://x.com/Raemon777/status/1954035704729882747\">they mostly won’t let kids get more than a year or two ahead of ‘schedule.’</a> Schools instead think it is better kids be bored for five years, for their own good you see.</p>\n<p>Raymond Arnold points to the best objection I have seen, which is that if a more advanced option exists then many parents will push for it even when it is inappropriate for their particular child, or use it to push their child way too hard, and while this means some kids are bored it is saving a lot of families from being forced into a red queen’s race.</p>\n<p>This is a real cost, but the prior should be rather extremely stacked against ‘if we let kids learn more then parents would try to have their kids learn too much and this would be bad,’ especially when you can gate the advanced classes with objective tests. Yes, parents can push their kids to study harder to try and pass those tests, but that’s a risk I am willing to take.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">The War on Reading Ability Grouping In Particular</h4>\n\n\n<p>What is the steelman case that ‘ability grouping doesn’t work’ or ‘ability grouping has been tried and didn’t work’ in some particular context?</p>\n<p><a href=\"https://www.karenvaites.org/p/leveled-reading-groups-dont-work?utm_campaign=post&amp;utm_medium=web\">This by Karen Vaites is perhaps the closes</a>t, in particular on early reading grouping, convinced me that in practice you really can mess it up badly enough to make things actively worse. This was convincing that we’re messing up badly enough that this is a real possibility.</p>\n<p>As in, what happens in practice is that you group kids by a measurement of abstract ‘reading level’ and then focus on ‘achievement’ of ‘reading level,’ forbid them to read anything beyond ‘reading level,’ and don’t ask what actual skills they need, don’t move them between groupings as their skills change, and then wonder why it isn’t working.</p>\n<p>One could almost say, <a href=\"https://www.edweek.org/teaching-learning/are-classroom-reading-groups-the-best-way-to-teach-reading-maybe-not/2018/08?cmp=soc-li-shr\">if you look at the details</a>, that the teachers are using ‘reading groups’ as a substitute for actually teaching the children to read. You put them in a group and then you did your job. Again, yeah, I can see how that wouldn’t work. Indeed, if you are outsourcing the teaching job to other kids, then at that point you actively want uneven groups, because you want to group students with student teachers.</p>\n<p>Whereas once students get to ‘escape velocity’ on reading, which the better students have relatively early, they no longer need a teacher, they just need motivation and permission to read books. Whereas the system seems designed to stop kids from reading books they want to read if they are deemed ‘too hard’? A kid can tell you if a book is too hard, they won’t want to read it.</p>\n<p>One big complaint is that it is ‘hard to measure reading level.’ I don’t think it is hard. <a href=\"https://www.goodreads.com/quotes/35566-you-can-observe-a-lot-just-by-watching\">You can observe a lot just by watching</a>. The problem is that you’re measuring a set of distinct reading skills as if it was one number, and then treating that one number as real, and also abdicating all the real work.</p>\n<blockquote><p>Sarah Sparks: <a href=\"https://www.edweek.org/teaching-learning/are-classroom-reading-groups-the-best-way-to-teach-reading-maybe-not/2018/08?cmp=soc-li-shr\">But evidence suggests</a> that the practice may be less beneficial than teachers think: It can exacerbate achievement gaps and even slow reading growth for some children unless the groups are fluid and focused on skills rather than overall achievement.</p>\n<p>…</p>\n<p>“What we’ve discovered is that it’s fine to have a group of students of different levels, as long as they all are working on the same learning needs,” said Carol Connor, an education professor at the University of California, Irvine, who developed the program. “You can have students of different reading abilities who all need to work on decoding. &#8230; What doesn’t work is if you put your kids who already know how to code in a group to learn how to code, again. You receive more behavior problems because they’re really bored, &#8230; and our research suggests that it has a negative effect on their growth.”</p>\n<p>Karen Vaites: Tim Shanahan breaks down key research and its instructional implications in <a href=\"https://shanahanonliteracy.com/blog/the-instructional-level-concept-revisited-teaching-with-complex-text#sthash.kNFa1zLD.dpbs\"><em>The Instructional Level Concept Revisited: Teaching with Complex Text</em></a><em>. </em>As researchers looked into the effectiveness working at reading level, studies found that it &#8220;has made no difference—that is the kids taught from grade level materials do as well as those at an instructional level—or the instructional level placements have led to less learning.&#8221;</p>\n<p>More recently, <a href=\"https://shanahanonliteracy.com/blog/new-evidence-on-teaching-reading-at-frustration-levels\">he highlights additional new evidence</a> from a study of third graders: “Results indicate that weaker readers, using texts at two, three, and four grade levels above their instructional levels with the assistance of lead readers [other, better reading, third graders], outscored both proficient and less proficient students in the control group across multiple measures of reading achievement.”</p>\n<p><a href=\"https://www.readingrockets.org/blogs/shanahan-on-literacy/what-text-levels-are-appropriate-independent-reading\">From a question</a>: My daughter is in first grade. Her classroom teachers have all the books in the classroom library leveled, and students are not allowed to go beyond their reading level during “Independent” reading.</p>\n<p>From the answer: Your daughter’s aspirations as a reader are the problem here. Some kids are allowed to read the red-dot books and others are stuck with the baby books with the blue dots. She wants to be a red dot kid, to hang with the red dot kids, to be seen as a red dot kid … but her teacher can only see her as a blue dot kid and she must learn to stay to her own bookshelf with her own kind if she is going to succeed in this classroom.</p>\n<p>…</p>\n<p>In the meantime, explain to your daughter that the teacher is trying to help her but that we teachers sometimes don’t get it right, and that you can’t always “fight city hall.”</p></blockquote>\n<p>So yes, you group primarily by what aspects the kids need to work on most, and that works better. Sure. I can totally believe that is a better strategy. Skill issue.</p>\n<p>Instead of using it to figure out what kids need to do to learn to read and putting them in position to learn that, it sounds like grouping is being used to prevent kids from meaningfully reading? The purpose is to gate reading behind general tests? To spread ‘equality’ to progress on different reading aspects?</p>\n<blockquote><p>Sarah Sparks<strong>: It sounds like good sense.</strong> &#8220;Kids should be reading just-right texts as they grow as readers.&#8221; That just <em>sounds</em> <em>sensible</em>, doesn&#8217;t it? Many urban legends do&#8230; until you know better.</p></blockquote>\n<p>I can see why that might actively backfire. This isn’t about ‘ability grouping’ not working. It’s about failing to actually group by the relevant ability, and it’s about the ‘just-right text’ theory that seems to me obviously wrong.</p>\n<blockquote><p>Sarah Sparks: During Tier 1 instruction, you want all kids working with grade level texts; students reading below grade level will need scaffolding and support (as well as targeted Tier 2 and/or 3 intervention).</p>\n<p>This promotes equity, for it&#8217;s the best mechanism for helping below-benchmark students to catch up.</p>\n<p>It also honors the fact that a fifth grader who reads at second grade level is still <em>thinking</em> at the level of a fifth grader, and he or she will remain engaged and motivated by learning content and vocabulary at his or her developmental level. (No more baby books for big kids, y&#8217;all!)</p>\n<p>For details on how to do this, check out:</p>\n<ul>\n<li><a href=\"https://shanahanonliteracy.com/blog/eight-ways-to-help-kids-to-read-complex-text\"><em>Eight Ways to Help Kids Read Complex Text</em></a> by Tim Shanahan</li>\n<li><a href=\"https://achievethecore.org/aligned/supporting-all-learners-with-complex-texts/\">Supporting All Learners with Complex Text</a>, a resource collection from Achieve the Core.</li>\n<li>The <a href=\"https://achievethecore.org/page/3190/reading-instruction-with-the-end-in-mind-rethinking-reading-levels-2018-december-webinar\">Rethinking Reading Levels</a> webinar.</li>\n</ul>\n</blockquote>\n<p>Ignore the ‘this promotes equity’ framing, since you could simply say ‘this promotes learning to read.’ Equity via catching up those lagging is good, and you call it learning.</p>\n<p>The theory here is that age matters a lot. That if you are a fifth grader, your ability to learn is inherently much stronger than that of a second grader, whereas the ability of different second graders is alike? Equality (of those at the same age) for me, inequality (of those at different ages) for thee. Whereas the correct model is that each kid has a different ability to learn different things, that usually improves steadily with age.</p>\n<p>But also note that this is saying that the best way for many students at second grade reading level to learn reading is to assign them to read fifth grade level books, indeed to mandate it. Yes, I can believe that. So why are we so often telling kids at second grade reading level or literally in second grade or both that they can’t read the fifth grade books even when they want to?</p>\n<p>The other theory present in this proposal is, how about using techniques that actually teach kids reading. And yeah, I agree, that would be great.</p>\n<blockquote><p><a href=\"https://x.com/tracewoodgrains/status/1944760629098647564\">Tracing Woods</a> (replying to Vaites): This is an extremely useful article that deserves a full, thorough response.</p>\n<p>My short response is that I agree narrowly (most leveled readers seem quite bad, training specific skills matters, in-class grouping for reading is quite popular and often pretty uninspired) and disagree broadly (there is pretty strong evidence for the value of several forms of ability grouping, drawing from eg Direct Instruction, Success for All, acceleration/gifted literature; ability grouping has acquired a bad reputation for reasons mostly unrelated to its performance; “grade level” is the wrong measure) in a way that would be productive to hash out more fully.</p>\n<p>I agree fully that the real question is cultural.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">The War Will Continue</h4>\n\n\n<p>In case you didn’t realize that there is a war. There has been for a while.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!qiHh!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffc8a9d08-88fd-4e79-9888-3ed53c671613_1034x1727.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/09/10/childhood-and-education-14-the-war-on-education/",
            "publishedAt": "2025-09-10",
            "source": "TheZvi",
            "summary": "The purported main purpose of school, and even of childhood, is educating children. Many people are actively opposed to this idea. Either they have other priorities that matter more, or sometimes they outright think that your child learning things is &#8230; <a href=\"https://thezvi.wordpress.com/2025/09/10/childhood-and-education-14-the-war-on-education/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Childhood and Education #14: The War On Education"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3140/",
            "publishedAt": "2025-09-10",
            "source": "XKCD",
            "summary": "<img alt=\"Welcome to the Linguistics Department - It has been [2] [DAYS] since someone noticed that the Biology Department sign has a one-day-long singular/plural disagreement after it resets.\" src=\"https://imgs.xkcd.com/comics/biology_department.png\" title=\"Welcome to the Linguistics Department - It has been [2] [DAYS] since someone noticed that the Biology Department sign has a one-day-long singular/plural disagreement after it resets.\" />",
            "title": "Biology Department"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-09-10"
}