{
    "articles": [
        {
            "content": [
                "<p>I’m storing more and more of my data <a href=\"https://alexwlchan.net/2024/static-websites/\">as static websites</a>, and about a year ago I switched to using a local, static site to manage my bookmarks.\nIt’s replaced <a href=\"https://pinboard.in\">Pinboard</a> as the way I track interesting links and cool web pages.\nI save articles I’ve read, talks I’ve watched, fanfiction I’ve enjoyed.</p>\n\n\n  \n  <source type=\"image/png\" />\n  \n  <img alt=\"Screenshot of a web page titled ‘bookmarks’, and a list of three bookmarks below it. Each bookmark has a blue link as the title, a grey URL below the title, and some descriptive text below it.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2025/bookmarks/all_bookmarks_1x.png\" width=\"500\" />\n\n\n<p>It’s taken hundreds of hours to get all my bookmarks and saved web pages into this new site, and it’s taught me a lot about archiving and building the web.\nThis post is the first of a four-part series about my bookmarks, and I’ll publish the rest of the series over the next three weeks.</p>\n\n<blockquote class=\"toc\">\n  <h3>Bookmarking mini-series</h3>\n  <ol>\n    <li>\n      <strong>Creating a static site for all my bookmarks</strong> (this article)\n      <ul>\n        <li><a href=\"https://alexwlchan.net/2025/bookmarks-static-site/#why_bookmark\">Why do I bookmark?</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/bookmarks-static-site/#why_static\">Why use a static website?</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/bookmarks-static-site/#how_it_looks\">What does it look like?</a></li>\n        <li><a href=\"https://alexwlchan.net/2025/bookmarks-static-site/#how_it_works\">How does it work?</a></li>\n      </ul>\n    </li>\n    <li>\n      <strong>How I built a personal archive of the web</strong> (coming 19 May) – how I built a web archive by hand, the tradeoffs between manual and automated archiving, and what I learnt about preserving the web.\n    </li>\n    <li>\n      <strong>What I learnt about building websites by reading two thousand web pages</strong> (coming 26 May) – how to write thoughtful HTML, new-to-me features of CSS, and some quirks and relics I found while building my personal web archive.\n    </li>\n    <li>\n      <strong>Some cool websites from my bookmark collection</strong> (coming 2 June) – my favorite sites I rediscovered while reviewing my bookmarks. Fun, creative corners of the web that make me smile.\n    </li>\n  </ol>\n</blockquote>\n\n\n\n<hr />\n\n<h2 id=\"why_bookmark\">Why do I bookmark?</h2>\n\n<h3 id=\"i-bookmark-because-i-want-to-find-links-later\">I bookmark because I want to find links later</h3>\n\n<p>Keeping my own list of bookmarks means that I can always find old links.\nIf I have a vague memory of a web page, I’m more likely to find it in my bookmarks than in the vast ocean of the web.\nLinks rot, websites break, and a lot of what I read isn’t indexed by Google.</p>\n\n<p>This is particularly true for fannish creations.\nA lot of fan artists deliberately publish in closed communities, so their work is only visible to like-minded fans, and not something that a casual Internet user might stumble upon.\nIf I’m looking for an exact story I read five years ago, I’m far more likely to find it in my bookmarks than by scouring the Internet.</p>\n\n<p>Finding old web pages has always been hard, and the rise of generative AI has made it even harder.\nSearch results are full of AI slop, and people are trying to hide their content from scrapers.\nLocking the web behind paywalls and registration screens might protect it from scrapers, but it also makes it <a href=\"https://www.citationneeded.news/free-and-open-access-in-the-age-of-generative-ai/\">harder to find</a>.</p>\n\n<h3 id=\"i-bookmark-to-remember-why-i-liked-a-link\">I bookmark to remember why I liked a link</h3>\n\n<p>I write notes on each bookmark I keep, so I remember why a particular link was fun or interesting.</p>\n\n<p>When I save articles, I write a short summary of the key points, information, arguments.\nI can review a one paragraph summary much faster than I can reread the entire page.</p>\n\n<p>When I save fanfiction, I write notes on the plot or key moments.\nIs this the story where they live happily ever after?\nOr does this have a gut wrenching ending that needs a box of tissues?</p>\n\n<p>These summaries could be farmed out to generative AI, but I much prefer writing them myself.\nI can phrase things in my own words, write down connections to other ideas, and write a more personal summary than I get from a machine.\nAnd when I read those summaries back later, I remember writing them, and it revives my memories of the original article or story.\nIt’s slower, but I find it much more useful.</p>\n\n<hr />\n\n<h2 id=\"why_static\">Why use a static website?</h2>\n\n<p>I was a happy <a href=\"https://pinboard.in\">Pinboard</a> customer for over a decade, but the site <a href=\"https://ask.metafilter.com/368202/Is-Pinboardin-bookmarking-site-still-supported-software\">feels abandoned</a>.\nI’ve not had catastrophic errors, but I kept running into broken features or rough edges – search timeouts, unreliable archiving, unexpected outages.\nThere does seem to be some renewed activity in the last few months, but it was too late – I’d already moved away.</p>\n\n<p>I briefly considered Pinboard alternatives like <a href=\"https://raindrop.io\">Raindrop</a>, <a href=\"https://getpocket.com/home\">Pocket</a> and <a href=\"https://www.instapaper.com\">Instapaper</a> – but I’d still be trusting an online service.\nI’ve been burned too many times by services being abandoned, and so I’ve gradually been moving the data I care about to <a href=\"https://alexwlchan.net/2024/static-websites/\">static websites</a> on my local machine.\nIt takes a bit of work to set up, but then I have more control and I’m not worried about it going away.</p>\n\n<p>My needs are pretty simple – I just want a list of links, some basic filtering and search, and a saved copy of all my links.\nI don’t need social features or integrations, which made it easier to walk away from Pinboard.</p>\n\n<p>I’ve been using static sites for all sorts of data, and I’m enjoying the flexibility and portability of vanilla HTML and JavaScript.\nThey need minimal maintenance and there’s no lock-in, and I’ve made enough of them now that I can <a href=\"https://alexwlchan.net/2025/mildly-dynamic-websites/\">create new ones</a> pretty quickly.</p>\n\n<hr />\n\n<h2 id=\"how_it_looks\">What does it look like?</h2>\n\n<p>The main page is a scrolling list of all my bookmarks.\nThis is a single page that shows every link, because my collection is small enough that I don’t need pagination.</p>\n\n\n  \n  <source type=\"image/png\" />\n  \n  <img alt=\"Screenshot of a web page titled ‘bookmarks’, and a list of three bookmarks below it. Each bookmark has a blue link as the title, a grey URL below the title, and some descriptive text below it.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2025/bookmarks/all_bookmarks_small_1x.png\" width=\"400\" />\n\n\n<p>Each bookmark has a title, a URL, my hand-written summary, and a list of tags.</p>\n\n<p>If I’m looking for a specific bookmark, I can filter by tag or by author, or I can use my browser’s in-page search feature.\nI can sort by title, date saved, or “random” – this is a fun way to find links I might have forgotten about.</p>\n\n<p>Let’s look at a single bookmark:</p>\n\n\n  \n  <source type=\"image/png\" />\n  \n  <img alt=\"Close-up view of a single bookmark.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2025/bookmarks/single_bookmark_1x.png\" width=\"600\" />\n\n\n<p>The main title is blue and underlined, and the URL of the original page is shown below it.\nCall me old-fashioned, but I still care about URL design, I think it’s cool to underline links, and I have nostalgia for #0000ff blue.\nI want to see those URLs.</p>\n\n<p>If I click the URL in grey, I go to the page live on the web.\nBut if I click the title, I go to a local snapshot of the page.\nBecause these are the links I care about most, and links can rot, I’ve saved a local copy of every page as a mini-website – an HTML file and supporting assets.\nThese local snapshots will always be present, and they work offline – that’s why I link to them from the title.</p>\n\n<p>This is something I can only do because this is a personal tool.\nIf a commercial bookmarking website tried to direct users to their self-hosted snapshots rather than the original site, they’d be accused of stealing traffic.</p>\n\n<p>Creating these archival copies took months, and I’ll discuss it more in the rest of this series.</p>\n\n<hr />\n\n<h2 id=\"how_it_works\">How does it work?</h2>\n\n<p>This is a static website buildt using the pattern I described in <a href=\"https://alexwlchan.net/2025/mildly-dynamic-websites/\">How I create static websites for tiny archives</a>.\nI have my metadata in a JavaScript file, and a small viewer that renders the metadata as an HTML page I can view in my browser.</p>\n\n<p>I’m not sharing the code because it’s deeply personalised and tied to my specific bookmarks, but if you’re interested, that tutorial is a good starting point.</p>\n\n<p>Here’s an example of what a bookmark looks like in the metadata file:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>\"https://notebook.drmaciver.com/posts/2020-02-22-11:37.html\": {\n  \"title\": \"You should try bad things\",\n  \"authors\": [\n    \"David R. MacIver\"\n  ],\n  \"description\": \"If you only do things you know are good, eventually some of them will fall out of favour and you'll have an ever-shrinking pool of things.\\r\\n\\r\\nSome of the things you think will be bad will end up being good \\u2013 trying them helps expand your pool.\",\n  \"date_saved\": \"2024-12-03T07:29:10Z\",\n  \"tags\": [\n    \"self-improvement\"\n  ],\n  \"archive\": {\n    \"path\": \"archive/n/notebook.drmaciver.com/you-should-try-bad-things.html\",\n    \"asset_paths\": [\n      \"archive/n/notebook.drmaciver.com/static/drmnotes.css\",\n      \"archive/n/notebook.drmaciver.com/static/latex.css\",\n      \"archive/n/notebook.drmaciver.com/static/pandoc.css\",\n      \"archive/n/notebook.drmaciver.com/static/pygments.css\",\n      \"archive/n/notebook.drmaciver.com/static/tufte.css\"\n    ],\n    \"saved_at\": \"2024-12-03T07:30:21Z\"\n  },\n  \"publication_year\": \"2020\",\n  \"type\": \"article\"\n}\n</code></pre></div></div>\n\n<p>I started with the data model from the <a href=\"https://pinboard.in/api/\">Pinboard API</a>, which in turn came from an older bookmarking site called <a href=\"https://en.wikipedia.org/wiki/Delicious_(website)\">Delicious</a>.\nOver time, I’ve added my own fields.\nPreviously I was putting everything in the title and the tags, but now I can have dedicated fields for things like authors, word count, and fannish tropes.</p>\n\n<p>The <code class=\"language-plaintext highlighter-rouge\">archive</code> object is new – that’s my local snapshot of a page.\nThe <code class=\"language-plaintext highlighter-rouge\">path</code> points to the main HTML file for the snapshot, and then <code class=\"language-plaintext highlighter-rouge\">asset_paths</code> is a list of any other files that get used in the webpage (CSS files, images, fonts and so on).\nI have a Python script to checks that every archived file has been saved properly.</p>\n\n<p>This is another advantage of writing my own bookmarking tool – I know exactly what data I want to store, and I can design the schema to fit.</p>\n\n<p>When I want to add a bookmark or make changes, I open the JSON in my text editor and make changes by hand.\nI have a script that checks the file is properly formatted and the archive paths are all correct, and I track changes in Git.</p>\n\n<p>Now you know what my new bookmarking site looks like, and how it works.\nOver the next three weeks, I’ll publish the remaining parts in this series.\nIn part 2, I’ll explain how I created local snapshots of every web page.\nIn part 3, I’ll tell you what that process taught me about building web pages.\nIn the final part, I’ll highlight some fun stuff I found as I went through my bookmarks.</p>\n\n<p>If you’d like to know when those articles go live, <a href=\"https://alexwlchan.net/subscribe/\">subscribe to my RSS feed or newsletter</a>!</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2025/bookmarks-static-site/\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2025/bookmarks-static-site/?utm_source=rss",
            "publishedAt": "2025-05-12",
            "source": "Alex Chan",
            "summary": "To help me keep track of interesting links, I created a static website that keeps all my data locally. Why do I care about bookmarks, and how does my new site work?",
            "title": "Creating a static website for all my bookmarks"
        },
        {
            "content": [
                "<p>So you’ve made a thing. I’ll pretend it’s a blog post, though it doesn’t really matter. If people read your thing, some would like it, and some wouldn’t.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot1.svg\" /></p>\n\n<p>You should try to make a good thing, that many people would like. That presents certain challenges. But our subject today is only how to give your thing a <em>title</em>.</p>\n\n<p>My advice is: Think of the title as “classifier”.</p>\n\n<p>When people see the title, some are likely to click on it and some won’t. Abstractly speaking, the title adds a second dimension to the above figure:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot2.svg\" /></p>\n\n<p>A title has two goals. First, think of all the people in the world who, if they clicked on your thing, would finish it and love it. Ideally, those people would click. That is, you want there to be people in the like + click region:</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot3.svg\" /></p>\n\n<p>Other people will hate your thing. It’s fine, some people hate everything. But if they click on your thing, they’ll be annoyed and tell everyone you are dumb and bad. You don’t want that. So you <em>don’t</em> want people in the hate + click region.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot4.svg\" /></p>\n\n<p>I find it helpful to think about all title-related issues from this perspective.</p>\n\n<ol>\n  <li>\n    <p>Everyone is deluged with content. Few people will <em>hate</em> your thing, because very few will care enough to have any feelings about it at all.</p>\n  </li>\n  <li>\n    <p>The good news is that it’s a big world and none of us are that unique. If you make a thing that <em>you</em> would love, then I guarantee you at least 0.0001% of other people would love it too. That’s still 8000 people! The problem is finding them.</p>\n  </li>\n  <li>\n    <p>That’s hard. Because—you don’t like most things, right? So you start with a strong prior that most things are bad (for you). Life is short, so you only click on things when there’s a very strong signal they’ll be good (for you).</p>\n  </li>\n  <li>\n    <p>Say you write a post about concrete. Should you call it, “My favorite concrete pozzolanic admixtures”, even though 99.9% of people have no idea what pozzolanic means? Well, think of the people who’d actually like your thing. Do <em>they</em> know? If so, use “pozzolanic”. That gives a strong signal to Concrete People: “Hey! This is for you! And you <em>know</em> I’m not lying about that, because I’ve driven away all the noobs.”</p>\n  </li>\n  <li>\n    <p>So ideally you’re aiming for something like this:</p>\n\n    <p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot5.svg\" /></p>\n  </li>\n  <li>\n    <p>Be careful imitating famous people. If Barack Obama made a thing called “Thoughts on blockchain”, everyone would read it, because the implicit title is “Thoughts on blockchain, <em>by Barack Goddamn Obama</em>”. Most of the titles you see probably come from people who have some kind of established “brand”. If you don’t have that, you probably don’t want to choose the same kind of titles.</p>\n  </li>\n  <li>\n    <p>The title isn’t just about the subject. I called this post, “How to title your blog post <em>or whatever</em>” partly because I hope some of this applies to other things beyond blog posts. But mostly I did that because it signals that my style is breezy and informal. I think people really underrate this.</p>\n  </li>\n  <li>\n    <p>Some people choose clever punny titles. If you have a big audience that reads all your things, then your title doesn’t need to be a good classifier. I’m not in that situation, but I sometimes find a pun so amusing that I can’t resist. <a href=\"https://dynomight.net/fahren-height/\">“Fahren-height”</a> was worth it. <a href=\"https://dynomight.net/taste-games/\">“Taste games”</a> was not.</p>\n  </li>\n  <li>\n    <p>Traditional advice says that you should put your main “message” in the title. I have mixed feelings about that. On the one hand, it provides a lot of signal. On the other hand, it seems to get people’s hackles up. The world is full of bad things that basically pick a conclusion and ignore or distort all conflicting evidence. If you’re attempting to be fair or nuanced, putting your conclusion in the title might signal that you’re going to be a typical biased/bad thing. It will <em>definitely</em> lead to lots of comments “refuting” you from people who didn’t read your thing.</p>\n  </li>\n  <li>\n    <p>Putting your conclusion in the title may also ruin your “story”. Though you should ask: Do the people who’d like your thing really care about your story?</p>\n  </li>\n  <li>\n    <p>A difficult case is things that create new “labels”. Sometimes there’s an idea floating around, and we need someone to make a canonical thing with a Name. To serve that role, the thing’s title needs to be that name. This presents a trade-off. A post titled <a href=\"https://www.lesswrong.com/posts/D7PumeYTDPfBTp3i7/the-waluigi-effect-mega-post\">“The Waluigi Effect”</a> is great for people who want to know what that is, but terrible for everyone else.</p>\n  </li>\n  <li>\n    <p>For the best <em>title</em> ever I nominate, <a href=\"https://www.slowboring.com/p/im-worried-about-chicago\">“I’m worried about Chicago”</a>. It doesn’t look fancy, but do you see how elegantly it balances all the above issues?</p>\n  </li>\n  <li>\n    <p>You’d think that, by 2025, technology would have solved the problem of things getting to people. I think it’s the opposite. Social media is optimized to keep people engaged and does not want people leaving the walled garden. Openly prohibiting links would cause a revolt, so instead they go as close as people will tolerate. Which, it turns out, is pretty close.</p>\n  </li>\n  <li>\n    <p>Boring titles are OK. I know that no one will click on <a href=\"https://dynomight.net/links-2/\">“Links for April”</a> who doesn’t already follow me. But I think that’s fine, because I don’t think anyone else would like it.</p>\n  </li>\n  <li>\n    <p>Consider title-driven thing creation. That is, consider <em>first</em> choosing a title and <em>then</em> creating a thing that delivers on the title. It’s sad to admit, but I think there are many good things that simply don’t have good titles. Consider not making those things. The cynical view of this is that without a good title, no one will read your thing, so why bother? The optimistic view is that we’re all drowning in content, so what the world actually needs is good things that can find their way to the people who will benefit from them. In practice, it’s often something in the middle: You start to create your thing, <em>then</em> you choose a title, then you structure your thing to deliver on the title.</p>\n  </li>\n  <li>\n    <p>My favorite thing category is “Lucid examination of all sides of an issue which finds some evidence pointing in various directions and doesn’t reach a definitive conclusion because the world is complicated”. Some people make fun of me for spending so much time researching seed oils and then lamely calling my thing <a href=\"https://dynomight.net/seed-oil/\">“Thoughts on seed oil”</a>. But what should I have called that instead? Lots of bloggers create things in this category, and no one seems to have solved the problem.</p>\n  </li>\n  <li>\n    <p>[Insert joke about how bad the title of this post is.]</p>\n  </li>\n</ol>"
            ],
            "link": "https://dynomight.net/titles/",
            "publishedAt": "2025-05-12",
            "source": "Dynomight",
            "summary": "<p>So you’ve made a thing. I’ll pretend it’s a blog post, though it doesn’t really matter. If people read your thing, some would like it, and some wouldn’t.</p> <p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot1.svg\" /></p> <p>You should try to make a good thing, that many people would like. That presents certain challenges. But our subject today is only how to give your thing a <em>title</em>.</p> <p>My advice is: Think of the title as “classifier”.</p> <p>When people see the title, some are likely to click on it and some won’t. Abstractly speaking, the title adds a second dimension to the above figure:</p> <p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot2.svg\" /></p> <p>A title has two goals. First, think of all the people in the world who, if they clicked on your thing, would finish it and love it. Ideally, those people would click. That is, you want there to be people in the like + click region:</p> <p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot3.svg\" /></p> <p>Other people will hate your thing. It’s fine, some people hate everything. But if they click on your thing, they’ll be annoyed and tell everyone you are dumb and bad. You don’t want that. So you <em>don’t</em> want people in the hate + click region.</p> <p><img alt=\"\" src=\"https://dynomight.net/img/titles/plot4.svg\"",
            "title": "How to title your blog post or whatever"
        },
        {
            "content": [
                "<p>I just noticed an interesting question that I&#8217;ve never heard anyone ask. To explain it, I need to review the basics of behavior, and of abstraction levels.</p><p>First, we explain agent behavior in terms of agent choices and the actual states of the world. Standard decision theory explains choices in terms of beliefs and preferences, also known as goals or motives, some of which are conscious, and others unconscious. Beliefs are explained using info and priors. Deviations from standard decision theory are often well explained in terms of random noise and habits, which come from patterns of prior choices by this agent and others this agent has observed. Thus agent behavior is explained in terms of noise, the world, and agent info, priors, habits, and motives both conscious and unconscious.</p><p>Second, construal level or &#8220;<a href=\"https://www.overcomingbias.com/p/near-far-summaryhtml?utm_source=publication-search\">near-far</a>&#8221; theory, which I&#8217;ve discussed often, says that human behavior varies greatly with level of abstraction. That is, some behavior is on very small units of time and space, and driven by very local goals and considerations, while other behavior is driven by very broad stable goals and considerations, and made regarding large units of time and space. For example, re traveling to work one makes many small choices that adjust one&#8217;s legs or a car steering wheel, intermediate choices about which routes to take, and big choices about what time of day to drive and where to work.</p><p>Okay, here is the interesting question: <em>how does the relative explanatory power of noise, world, info, priors, habits, and motives vary with choice level of abstraction?</em></p><p>Very small scale choices are mostly made unconsciously. They seem roughly explained by the world, our info and our nearby conscious immediate goals. But noise, unconscious goals, and learned habits also seem to make big contributions. For example, our body language is driven by status considerations that we&#8217;d deny, and experts can often find more efficient ways to achieve our goals than our habits achieve.</p><p>Mid scale choices seem especially well explained by our info and conscious goals, with less room for explanation by noise, unconscious goals, and habits. These are the choices that we mention when telling stories about our events, and for which our languages are well designed. We are quite ready and able to explain that we went to the grocery story because we needed some groceries, and that we drove because it was too hot to walk. We locked the door to deter thieves, and we called the police on a thief because that&#8217;s what good citizens do. And such explanations do in fact account rather well for our specific choices at that level of abstraction.</p><p>In contrast, compared to noise and habits, our info and conscious goals seem to do much worse at explaining our high level choices, such as of where to live, which jobs to take, which people to marry, or which laws and norms to enforce in which ways. Our book <em><a href=\"http://elephantinthebrain.com\">The Elephant in the </a></em>Brain shows how unconscious goals often do a much better job explaining many broad behaviors, like going to school or the doctor. And critics like <a href=\"https://www.overcomingbias.com/p/what-would-socrates-do\">Socrates</a> have long shown how easy it is to find incoherence in the habits and rationales of our high level choices.</p><p>Why do our conscious motives do so much better a good job of explaining mid level choices, compared to smaller or larger scale choices? Re smaller choices a standard answer is that conscious thinking requires a large overhead that isn&#8217;t worth the bother for smaller scale choices. And re larger choices a standard answer is that we make those choices a lot less often, and so get a lot less personal data on which to base them.</p><p>Yet our societies contain vast numbers of people making rather similar large scale choices; why can&#8217;t we learn from those? I think a better explanation here is that our larger scale choices are much more strongly set by cultural evolution. We copy the habits of associates, even when such habits are not especially coherent. Then we make up incoherent rationales to justify them, These inherited habits are specified at some modestly high level of abstraction, and implemented via conscious calculation, which is what makes our intermediate scale choices so well explained by our conscious goals.</p><p>In a faster changing world, habits encoded at overly low levels of abstraction run real risks of not generalizing well to new environments. For this reason, we moderns, living in a faster changing world, have increased the level of abstraction at which we infer and encode our inherited behavioral habits. Alas, this makes it harder to reliably infer habits from observed behaviors, creating more risks of cultural drift.</p><p>Worse, &#8220;<a href=\"https://www.overcomingbias.com/p/sincerity-adds-to-drift\">sincerity</a>&#8221; describes a modern pattern of trying to modify our habit ideals to be more easily explained by a simple set of ideal motives, such as true love, true patriotism, or truly saved. This might, if successful, make our high level choices as coherently justified, and as well explained by conscious motives, as our mid level choices. We might then feel satisfyingly rational.</p><p>However, such modified habits would plausibly fail to inherit a great deal of the adaptiveness info embodied in unmodified habits, risking even more cultural drift. At any one moment the process of natural selection offers an incoherent mishmash of inherited habits that are nevertheless more adaptive than would be a far more coherent great simplification of them. Here a foolish consistency is indeed the hobgoblin of little minds.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/choice-at-different-abstraction-levels",
            "publishedAt": "2025-05-12",
            "source": "Robin Hanson",
            "summary": "<p>I just noticed an interesting question that I&#8217;ve never heard anyone ask. To explain it, I need to review the basics of behavior, and of abstraction levels.</p><p>First, we explain agent behavior in terms of agent choices and the actual states of the world. Standard decision theory explains choices in terms of beliefs and preferences, also known as goals or motives, some of which are conscious, and others unconscious. Beliefs are explained using info and priors. Deviations from standard decision theory are often well explained in terms of random noise and habits, which come from patterns of prior choices by this agent and others this agent has observed. Thus agent behavior is explained in terms of noise, the world, and agent info, priors, habits, and motives both conscious and unconscious.</p><p>Second, construal level or &#8220;<a href=\"https://www.overcomingbias.com/p/near-far-summaryhtml?utm_source=publication-search\">near-far</a>&#8221; theory, which I&#8217;ve discussed often, says that human behavior varies greatly with level of abstraction. That is, some behavior is on very small units of time and space, and driven by very local goals and considerations, while other behavior is driven by very broad stable goals and considerations, and made regarding large units of time and space. For example, re traveling to work one makes many",
            "title": "Choice At Different Abstraction Levels"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX meetups this week in Bengaluru, Mexico City, Phoenix, Ann Arbor, and Denver. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">the post</a> for details.</p><p><strong>2: </strong>Remember, the due date for the <a href=\"https://www.astralcodexten.com/p/everything-except-book-review-contest\">Everything-Except-Book Review Contest</a> is TODAY, May 12. I will keep accepting entries until the end of the day, Pacific time, then start working on getting things organized so you can vote for finalists.</p><p><strong>3: </strong>Curtis Yarvin aka Moldbug has <a href=\"https://x.com/curtis_yarvin/status/1921526333739319458\">responded </a>to my <a href=\"https://www.astralcodexten.com/p/moldbug-sold-out\">post </a>accusing him of selling out:</p><blockquote><p>Scott asks a perfectly fair question: why I used to pearl-clutch so hard about authoritarian populism in 2008, but am perfectly okay with the Trump administration in 2025&#8211;despite all its manifest errors, incompetences, and even cruelties? Surely the answer is that I&#8217;ve Sold Out. No, Scott, I pearl-clutched in 2008 for the same reasons you&#8217;re doing it now: I was a libtard and a coward. I still am. I&#8217;ve just recovered a bit more.</p></blockquote><p>&#8230;and goes on to &#8220;explain the logic of [his] corrected attitude toward authoritarian populism&#8221;. I respond to his response <a href=\"https://x.com/slatestarcodex/status/1921765932130848901\">here</a>.</p><p><strong>4: </strong>A correspondent with an interest in hallucinogen persisting perceptual disorder and visual snow syndrome asks readers with either of these conditions and the ability to create images/animations showing what it's like to get in touch. Specifically, he would like to know which condition you have, who diagnosed it (self, psychiatrist, ophthalmologist, etc), whether they ruled out the other condition, your image, and whether he has permission to use and share the images for scientific purposes. Please send to <a href=\"mailto:visual_disturbance_images.a71bn@simplelogin.com\">visual_disturbance_images.a71bn@simplelogin.com</a> .</p><p><strong>5: </strong>New subscriber-only post, <a href=\"https://www.astralcodexten.com/p/the-twins-join-the-linguistic-symbolic\">The Twins Join The Linguistic-Symbolic Order</a>, on my children&#8217;s first steps to language-learning. Includes my Seuss-Lovecraft mashups:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fab0b995e-6ecf-4acb-a68f-c606c9f7af16_978x677.webp\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"443.02658486707566\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fab0b995e-6ecf-4acb-a68f-c606c9f7af16_978x677.webp\" width=\"640\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-381",
            "publishedAt": "2025-05-12",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><p><strong>1: </strong>ACX meetups this week in Bengaluru, Mexico City, Phoenix, Ann Arbor, and Denver. See <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-spring-2025-times\">the post</a> for details.</p><p><strong>2: </strong>Remember, the due date for the <a href=\"https://www.astralcodexten.com/p/everything-except-book-review-contest\">Everything-Except-Book Review Contest</a> is TODAY, May 12. I will keep accepting entries until the end of the day, Pacific time, then start working on getting things organized so you can vote for finalists.</p><p><strong>3: </strong>Curtis Yarvin aka Moldbug has <a href=\"https://x.com/curtis_yarvin/status/1921526333739319458\">responded </a>to my <a href=\"https://www.astralcodexten.com/p/moldbug-sold-out\">post </a>accusing him of selling out:</p><blockquote><p>Scott asks a perfectly fair question: why I used to pearl-clutch so hard about authoritarian populism in 2008, but am perfectly okay with the Trump administration in 2025&#8211;despite all its manifest errors, incompetences, and even cruelties? Surely the answer is that I&#8217;ve Sold Out. No, Scott, I pearl-clutched in 2008 for the same reasons you&#8217;re doing it now: I was a libtard and a coward. I still am. I&#8217;ve just recovered a bit more.</p></blockquote><p>&#8230;and goes on to",
            "title": "Open Thread 381"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3088/",
            "publishedAt": "2025-05-12",
            "source": "XKCD",
            "summary": "<img alt=\"P.S. If you have time travel, come to my birthday party Saturday!\" src=\"https://imgs.xkcd.com/comics/deposition.png\" title=\"P.S. If you have time travel, come to my birthday party Saturday!\" />",
            "title": "Deposition"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-12"
}