{
    "articles": [
        {
            "content": [
                "<p>My problem with the phrase &#8220;Managing Up&#8221; involves a hard-earned historical observation regarding its weaponization. The helpful version of this practice is a clear understanding between you and your manager that there are uncommon, intriguing, or worrying developments that you — without hesitation — share with your manager.</p>\n<p>Isn&#8217;t that their responsibility, as well? It is. Also, wouldn&#8217;t you expect them to have significantly more of these observations because their observational blast radius is larger? They do. Do we call this &#8220;Managing Down&#8221;? Gross. No, we call this bi-directional effective communication, which is a mouthful. This is also only half of a correct strategy.</p>\n<p>&#8220;Managing Up&#8221; is problematic because it often describes a subset of humans who perform this task, believing, &#8220;I am artisanally selecting the most important bits of information to share upwardly because my judgment is incredibly sound.&#8221;</p>\n<p>This is not what they are doing. What they are doing is manipulating perception. They have a specific selfish narrative they want their manager to build, so they carefully select a subset of the truth and market it as the complete picture. They believe their manager is so busy and <a href=\"https://randsinrepose.com/archives/act-last-read-the-room-and-taste-the-soup/\">soup tasting</a> that their interpreted version of the story will become canonical.</p>\n<p>Bad news, truth tweakers. A competent leader will source their facts. They will share that partial story with a trusted other not because they don&#8217;t trust you but because a story must defend itself, stand up to scrutiny, and prove its worth. They don&#8217;t do this because they don&#8217;t believe you; they do this because it&#8217;s perfectly reasonable communication hygiene. When they discover you&#8217;ve delivered half the story, they will quietly ask themselves, &#8220;Why half? Are they trying to save me time, or are they trying to lead me astray?&#8221; One occurrence of this behavior is no big deal. A small error. Two occurances? Is this a pattern? Probably not. Wait, three? Ok, why are they deliberately choosing to tell me a dubious version of the truth?</p>\n<p>Managing up. If you were drawing a word cloud of dubious management-related phrases, chances are, &#8220;Managing Up&#8221; would be proximate to &#8220;Kissing Ass.&#8221; To me, &#8220;Managing Up&#8221; has that &#8220;your boss&#8217;s job is more important than yours&#8221; feel, which pisses me off.</p>\n<p>Your boss isn&#8217;t more important than you; it&#8217;s different. You are responsible for yourself and the professional well-being of your team of seven engineers and your product. Your boss is responsible for her job, you, your six peers, their 57 respective employees, and the four products. That&#8217;s 72 humans and five products if you&#8217;re keeping count.</p>\n<p>As you move &#8220;up&#8221; the organization chart, the amount of responsibility that weighs on a manager increases significantly, and, yes, this does mean they often make more money than you, but that is often because they have more years of experience. This experience allegedly means they can complete a more diverse set of work at vaster scale because they are you in 5-10 years, but — I remain steadfast — it&#8217;s different work.</p>\n<p>But each of you has equal responsibility for sharing information.</p>\n<h2>Essential Information</h2>\n<p>Okay, thanks for letting me vent. With that out of the way, let&#8217;s get practical.</p>\n<p>The amount of aggregated information you need to do your job increases as a function of the magnitude of your responsibility. This means you must become adept at finding, confirming, understanding, and passing it along in the correct direction.</p>\n<p>That&#8217;s what you&#8217;re looking for — information that has passed through the bright minds of your team, where they&#8217;ve coalesced the vast amount of information they see into informative, crisp narratives. One challenge is they know you have six other leaders doing precisely the same thing, so they need to prioritize and choose which narratives to share.</p>\n<p>What&#8217;s important to share? I&#8217;m glad you asked. There are three areas where the information requires constant vigilance:</p>\n<ul>\n<li><strong>Projects</strong> — the things you build, the large tasks you complete, and the significant work involving many humans. </li>\n<li><strong>People</strong> — all the humans around you in every direction helping you complete the projects.</li>\n<li><strong>Politics</strong> — the connective communication that binds all the humans together &#8212; easily manipulated for good and evil. </li>\n</ul>\n<p>In this piece, I will explain the projects, people, and political developments you always want to share — no matter what. While I will strive to make this complete, there is one type of development you must always report:</p>\n<p><strong>Unexpected developments.</strong> A situation appears in front of you, a non-threatening one but unexpected. Strange. Something is up, but you can&#8217;t discern the backstory story or the intent. It is unfamiliar. Tell your manager. <strong>Now</strong>. Just a brief note. A heads up. It&#8217;s probably nothing — it usually is — but there is a chance your manager&#8217;s context plus your suspicions equals additional clarity.</p>\n<p>I want to start by acknowledging a fundamental professional tension. Your managers want you to believe you can do your job without them (which everyone wants, by the way), but when you fail to keep them informed about important developments within the team, it looks like you don&#8217;t know how to do your job (which no one wants, by the way). Confusingly put, neither you nor your manager is doing your job correctly when you&#8217;re sharing too much or too little information.</p>\n<p>Here are the areas:</p>\n<p>People</p>\n<ul>\n<li>A significant unexpected change for a key individual on the team. Life situation, odd conversation that doesn&#8217;t add up, or, again, a perception that something is up. </li>\n<li>Major successes. It needs to be communicated even if it was supposed to happen like this for them. Exceeding expectations is worth noting. Every time.</li>\n<li>For humans on your team, with an agreed-upon growth plan you&#8217;ve shared with your manager, you report minor successes against this plan. Failures, too.</li>\n<li>Anytime ever that anyone ever thinks about saying the words or phrases &#8220;Human Resources,&#8221; &#8220;People Team,&#8221; or &#8220;Legal.&#8221; Even if they claim to be joking, the fact they are thinking of these teams is a fact that must be shared. </li>\n</ul>\n<p>Projects</p>\n<ul>\n<li>A significant positive or negative development on a critical project. Not the resolution but the observance of the development at first sight. This is even more critical when your manager has a professional stake in the project&#8217;s outcome.</li>\n<li>Projected-related gossip from external high-trust parties. Might be gossip. Might be an early warning system. Could be political. Keep reading.</li>\n<li>Achieved milestones. Missed milestones. Contributing factors and recommended fixes are appreciated for those missed milestones, but waiting until these are perfectly defined is often a tactic motivated by not wanting to share bad news. The sooner I hear bad news, the more I can help. </li>\n<li>Impending doom. Just the hint of it. A slight smell in the air. </li>\n</ul>\n<p>Politics</p>\n<ul>\n<li>Interesting developments on external teams where we have a project dependency. </li>\n<li>Gossip, rumors, and lies about the project. Yes, much of this information is false, but the fact these rumors are wandering the hallways is news. Folks are spreading this misinformation for a reason that is worth discovering. True story: there are humans out there who insert lies into the organizational bloodstream to see the reaction. They call this pressure testing, and these humans are jerks. </li>\n<li>Just. Plain. Weird. Yeah, it&#8217;s a catch-all. Yeah, it&#8217;s the hardest to define, but sometimes people say the darndest, strangest things, and rather than scratching your head and staring at the ceiling, tell someone else this weirdness and see what happens.</li>\n</ul>\n<p>Do all this consistently with your manager and team; again, you&#8217;re working with half the information.</p>\n<h2>Managing Sideways</h2>\n<p>My actual problem isn&#8217;t with &#8220;Managing Up&#8221; or &#8220;Managing Down&#8221;; if you do this well, you&#8217;re still only working with half the necessary information. You and your manager collectively represent half the information required to do your job. HALF.</p>\n<p>Look to your right. Look to your left. That&#8217;s the other half, and you&#8217;re probably ignoring much of it. It took me a couple of decades to properly value horizontal relationships and their context. Why? Because everyone kept asking me if I was &#8220;Managing Up&#8221;.  [facepalm] My manager told me what to do; they set my compensation, so I managed the relationship because they managed me.</p>\n<p>People, projects, and politics. Your relationship with your manager represents half the information you need, half the context. It doesn&#8217;t mean you can&#8217;t do your job, but it&#8217;s not a stretch that you are missing critical developments because of the absence of this context.</p>\n<p>If you don&#8217;t believe me, it&#8217;s because the lesson hasn&#8217;t been hammered into you by the path of senior leadership, where you become increasingly distant from the measurable familiarity of hands-on work and become adept at building a sense of satisfaction and productively finding, confirming, understanding, and passing along critical information.</p>\n<p>And you are not doing this alone.</p>"
            ],
            "link": "https://randsinrepose.com/archives/managing-up/",
            "publishedAt": "2024-12-30",
            "source": "Rands in Repose",
            "summary": "My problem with the phrase &#8220;Managing Up&#8221; involves a hard-earned historical observation regarding its weaponization. The helpful version of this practice is a clear understanding between you and your manager that there are uncommon, intriguing, or worrying developments that you — without hesitation — share with your manager. Isn&#8217;t that their responsibility, as well? It&#8230; <a class=\"read-more\" href=\"https://randsinrepose.com/archives/managing-up/\">More</a>",
            "title": "Managing Up"
        },
        {
            "content": [
                "<p><a href=\"https://randsinrepose.com/wp-content/uploads/2024/12/it_being_geek_second_edition.png\"><img class=\"alignleft wp-image-4474\" src=\"https://randsinrepose.com/wp-content/uploads/2024/12/it_being_geek_second_edition.png\" /></a></p>\n<p>In our 88th episode and WAY AFTER the book was published, Lyle and I talk about the Software Developer&#8217;s Career Handbook. Yes, this book was published a year ago. </p>\n<p>Enjoy it now, or <a href=\"https://traffic.libsyn.com/rands/theimportantthing0088.mp3\">download</a> for later. Here&#8217;s a handy <a href=\"https://rands.libsyn.com/feed\">feed</a> or subscribe via <a href=\"https://overcast.fm/itunes1195704939/the-important-thing\">Overcast</a> or <a href=\"https://podcasts.apple.com/us/podcast/the-important-thing/id1195704939\">iTunes</a>.</p>\n<audio class=\"wp-audio-shortcode\" controls=\"controls\" id=\"audio-5106-4\" preload=\"none\" style=\"width: 100%;\"><source src=\"https://traffic.libsyn.com/rands/theimportantthing0088.mp3?_=4\" type=\"audio/mpeg\" /><a href=\"https://traffic.libsyn.com/rands/theimportantthing0088.mp3\">https://traffic.libsyn.com/rands/theimportantthing0088.mp3</a></audio>"
            ],
            "link": "https://randsinrepose.com/archives/the-one-about-the-software-developers-handbook/",
            "publishedAt": "2024-12-29",
            "source": "Rands in Repose",
            "summary": "In our 88th episode and WAY AFTER the book was published, Lyle and I talk about the Software Developer&#8217;s Career Handbook. Yes, this book was published a year ago. Enjoy it now, or download for later. Here&#8217;s a handy feed or subscribe via Overcast or iTunes. https://traffic.libsyn.com/rands/theimportantthing0088.mp3",
            "title": "The One About the Software Developer’s Handbook"
        },
        {
            "content": [
                "<p><a href=\"https://randsinrepose.com/wp-content/uploads/2024/12/IT_World_Building.jpg\"><img class=\"alignleft wp-image-4474\" src=\"https://randsinrepose.com/wp-content/uploads/2024/12/IT_World_Building.jpg\" /></a></p>\n<p>In our 87th episode, we talk about world-building, but we mostly talk about shows that we love with a minimal amount of spoiler alerts.</p>\n<p>Enjoy it now, or <a href=\"https://traffic.libsyn.com/rands/theimportantthing0087.mp3\">download</a> for later. Here&#8217;s a handy <a href=\"https://rands.libsyn.com/feed\">feed</a> or subscribe via <a href=\"https://overcast.fm/itunes1195704939/the-important-thing\">Overcast</a> or <a href=\"https://podcasts.apple.com/us/podcast/the-important-thing/id1195704939\">iTunes</a>.</p>\n<audio class=\"wp-audio-shortcode\" controls=\"controls\" id=\"audio-5104-6\" preload=\"none\" style=\"width: 100%;\"><source src=\"https://traffic.libsyn.com/rands/theimportantthing0087.mp3?_=6\" type=\"audio/mpeg\" /><a href=\"https://traffic.libsyn.com/rands/theimportantthing0087.mp3\">https://traffic.libsyn.com/rands/theimportantthing0087.mp3</a></audio>"
            ],
            "link": "https://randsinrepose.com/archives/the-one-about-world-building/",
            "publishedAt": "2024-12-28",
            "source": "Rands in Repose",
            "summary": "In our 87th episode, we talk about world-building, but we mostly talk about shows that we love with a minimal amount of spoiler alerts. Enjoy it now, or download for later. Here&#8217;s a handy feed or subscribe via Overcast or iTunes. https://traffic.libsyn.com/rands/theimportantthing0087.mp3",
            "title": "The One About World Building"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. </p><p><strong>1: </strong>RIP Jimmy Carter. One of the 2022 Book Review contest finalists was <a href=\"https://www.astralcodexten.com/p/your-book-review-the-outlier\">a Carter biography</a>, which I reread today in his honor.</p><p><strong>2: </strong>Happy New Year! ACX should return to a regular posting schedule shortly.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-362",
            "publishedAt": "2024-12-30",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. 95% of content is free, but for the remaining 5% you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. </p><p><strong>1: </strong>RIP Jimmy Carter. One of the 2022 Book Review contest finalists was <a href=\"https://www.astralcodexten.com/p/your-book-review-the-outlier\">a Carter biography</a>, which I reread today in his honor.</p><p><strong>2: </strong>Happy New Year! ACX should return to a regular posting schedule shortly.</p>",
            "title": "Open Thread 362"
        },
        {
            "content": [],
            "link": "https://everythingstudies.com/2024/12/27/after-2024-on-the-cusp/",
            "publishedAt": "2024-12-27",
            "source": "Everything Studies",
            "summary": "Another year comes to an end. If you&#8217;re reading this you might know that I&#8217;m currently writing a book. After a few years writing 100+ essays on this blog, some of them achieving some modest success, I received a grant from the Mercatus Institute at George Mason University in the middle of 2022. They were &#8230; <a class=\"more-link\" href=\"https://everythingstudies.com/2024/12/27/after-2024-on-the-cusp/\">Continue reading <span class=\"screen-reader-text\">After 2024: On the&#160;Cusp</span></a>",
            "title": "After 2024: On the Cusp"
        },
        {
            "content": [
                "<blockquote><a href=\"https://www.sciencedirect.com/science/article/pii/S1470160X17308592?ref=bramadams.dev#:~:text=Highlights&amp;text=The%20water%20footprint%20of%20one,12%20liters%20(3.2%20gallons).\">A single almond requires an average of <strong>12 liters</strong> (3.2 gallons) of water to grow.</a> <br />Almond milk: It takes about <strong>1,600 gallons of water to produce one liter of almond milk</strong>. The ratio of almonds to water in almond milk is usually 1:3 or 1:4. </blockquote><blockquote>According to a report, <strong>Chat GPT consumes approximately 500 ml of fresh, clean water every twenty to fifty questions</strong>. Although it may not appear to be a large volume of water each time, the fact that Chat GPT has over 100 million users monthly and is consistently responding to queries and producing answers accumulates quickly. <strong>It is estimated that during its training, Chat GPT consumed about 700,000 liters of water</strong>, which is equivalent to the amount of water used by an average American household in about 20 years</blockquote><div class=\"kg-card kg-file-card\"><a class=\"kg-file-card-container\" href=\"https://www.bramadams.dev/content/files/2024/12/Research-Article-39.pdf\" title=\"Download\"><div class=\"kg-file-card-contents\"><div class=\"kg-file-card-title\">GPT Water Use</div><div class=\"kg-file-card-caption\"></div><div class=\"kg-file-card-metadata\"><div class=\"kg-file-card-filename\">Research Article 39.pdf</div><div class=\"kg-file-card-filesize\">180 KB</div></div></div><div class=\"kg-file-card-icon\"><svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\"><defs></defs><title>download-circle</title><polyline class=\"a\" points=\"8.25 14.25 12 18 15.75 14.25\"><line class=\"a\" x1=\"12\" x2=\"12\" y1=\"6.75\" y2=\"18\"><circle class=\"a\" cx=\"12\" cy=\"12\" r=\"11.25\"></svg></div></a></div><img alt=\"Almonds Can&apos;t Do Math\" src=\"https://www.bramadams.dev/content/images/2024/12/Wari-Main-Image.jpeg\" /><p>To keep the numbers visibly fair, ChatGPT training according to above took ~185,000 gallons of water.</p><p>That is equal to <strong>115 liters of almond milk</strong>. There is more almond milk at my local Whole Foods rn than it took to train ChatGPT.</p><p>As for usage (again, using the source above), it takes roughly between 150 and 380 messages to reach a gallon at 500ml for 20-50 messages, which means you need to send between 480 and ~1210 messages (let&apos;s call it <strong>845 messages</strong> for convenience) to equal the water consumption of <strong>one almond</strong>.</p><p>In sustainability, it is important not to look at numbers just quantitatively, but also to consider them qualitatively. We need to consider what are appropriate replacements for the things that we are trying to replace. For example, does almond milk have any particular replacements that serve the same purpose of a non-dairy milk substitute?</p><p>As a user of these models, particularly ChatGPT, we need to recognize that they are doing math and thinking. We are outsourcing our thinking to these models, and these models are creating new things collaboratively with their users that can&apos;t be replaced currently.</p><p>I pray that one day we can look forward to a future of nuclear energy, and more efficient algorithms, and where public opinion doesn&apos;t run away with a few headlines without comparing problems to each other in a vacuum from a level headed perspective.<br /><br /><strong>Almonds can&apos;t do math, after all.</strong></p><blockquote>It&#x2019;s not that nuclear energy never kills. It&#x2019;s that its death toll is vanishingly small. Here are some annual death totals: walking (270,000), driving (1.35 million), working (2.3 million), air pollution (4.2 million). By contrast, nuclear&#x2019;s known total death toll is just over one hundred. Nuclear&#x2019;s worst accidents show that the technology has always been safe for the same inherent reason that it has always had such a small environmental impact: the high energy density of its fuel. Splitting atoms to create heat, rather than splitting chemical bonds through fire, requires tiny amounts of fuel. A single Coke can of uranium can provide enough energy for an entire high-energy life. As a result, when the worst occurs with nuclear&#x2014;and the fuel melts&#x2014;the amount of particulate matter that escapes from the plant is insignificant in comparison to the particulate matter from fossil- and biomass-burning homes, cars, and power plants, which killed eight million people in 2016. Nuclear is thus the safest way to make reliable electricity. In fact, nuclear has saved more than two million lives to date by preventing the deadly air pollution that shortens the lives of seven million people per year. For that reason, replacing nuclear energy with fossil fuels costs lives. A study published in late 2019 found that Germany&#x2019;s nuclear phase-out is costing its citizens $12 billion per year, with more than 70 percent of the cost resulting from 1,100 excess deaths from &#x201c;local air pollution emitted by the coal-fired power plants operating in place of the shutdown nuclear plants.&#x201d;<br /><br />...<br /><br />Only nuclear, not solar and wind, can provide abundant, reliable, and inexpensive heat. Thus, only nuclear can affordably create the hydrogen gas and electricity that will provide services such as heating, cooking, and transportation, which are currently provided by fossil fuels. And only nuclear can accommodate the rising energy consumption that will be driven by the need for things like fertilizer production, fish farming, and factory farming&#x2014;all of which are highly beneficial to both people and the natural environment. And yet the people who say they care and worry the most about climate change tell us we don&#x2019;t need nuclear.<br /><br />...<br /><br />Solar panels can become more efficient and wind turbines can become larger, but solar and wind have hard physical limits. The maximum efficiency of wind turbines is 59.3 percent, something scientists have known for more than one hundred years. The achievable power density of a solar farm is up to 50 watts of electricity per square meter. By contrast, the power density of natural gas and nuclear plants ranges from 2,000 to 6,000 watts per square meter.<br /><br />Apocolypse Never by Michael Schellenberger</blockquote>"
            ],
            "link": "https://www.bramadams.dev/almonds-cant-do-math/",
            "publishedAt": "2024-12-31",
            "source": "Bram Adams",
            "summary": "<blockquote><a href=\"https://www.sciencedirect.com/science/article/pii/S1470160X17308592?ref=bramadams.dev#:~:text=Highlights&amp;text=The%20water%20footprint%20of%20one,12%20liters%20(3.2%20gallons).\">A single almond requires an average of <strong>12 liters</strong> (3.2 gallons) of water to grow.</a> <br />Almond milk: It takes about <strong>1,600 gallons of water to produce one liter of almond milk</strong>. The ratio of almonds to water in almond milk is usually 1:3 or 1:4. </blockquote><blockquote>According to a report, <strong>Chat GPT consumes approximately 500 ml of fresh, clean water every twenty to fifty questions</strong>. Although it may not appear to be a large volume of water each time, the fact that Chat GPT has over 100 million users monthly and is consistently responding to queries and producing answers accumulates quickly. <strong>It is estimated that during its training, Chat GPT consumed about 700,000 liters of water</strong>, which is equivalent to the amount of water used by an average American household in about 20 years</blockquote><div class=\"kg-card kg-file-card\"><a class=\"kg-file-card-container\" href=\"https://www.bramadams.dev/content/files/2024/12/Research-Article-39.pdf\" title=\"Download\"><div class=\"kg-file-card-contents\"><div class=\"kg-file-card-title\">GPT Water Use</div><div class=\"kg-file-card-caption\"></div><div class=\"kg-file-card-metadata\"><div class=\"kg-file-card-filename\">Research Article 39.pdf</div><div class=\"kg-file-card-filesize\">180 KB</div></div></div><div class=\"kg-file-card-icon\"><svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\"><defs></defs><title>download-circle</title><polyline class=\"a\" points=\"8.25 14.25 12 18 15.75 14.25\"><line class=\"a\" x1=\"12\" x2=\"12\" y1=\"6.75\" y2=\"18\"><circle class=\"a\" cx=\"12\" cy=\"12\" r=\"11.25\"></svg></div></a></div><img alt=\"Almonds Can&apos;t Do Math\" src=\"https://www.bramadams.dev/content/images/2024/12/Wari-Main-Image.jpeg\" /><p>To keep the numbers visibly fair, ChatGPT training according to above took ~185,000 gallons of water.</p><p>That is equal to <strong>115 liters of",
            "title": "Almonds Can't Do Math"
        },
        {
            "content": [
                "<img alt=\"Time Unhelpful\" src=\"https://www.bramadams.dev/content/images/2024/12/Currier-Ives-The-Rescue.jpeg\" /><p>As I work on habits and good behaviors (<a href=\"https://www.bramadams.dev/priority-list-for-2025/\">Priority List for 2025</a>), I&apos;ve noticed that time (aka a calendar invite) is never really a good trigger for me. I don&apos;t find it easy to do anything at any specified time to any level of consistency that doesn&apos;t just end up making me feel guilty about not doing it at the time that I specified.</p><p>There are just way too many factors including how well you slept the night before, how sunny it is outside, the type of work that I&apos;m taking on, or where I am in the middle or beginning or end of a project.  Time is &#x2013; at best &#x2013; a guideline for being able to accomplish roughly what I intend to during any given hour.</p><p>This being said, I&apos;m a huge proponent of time-block planning from Cal Newport (see <a href=\"https://www.bramadams.dev/issue-37/\">Issue 37: Sixteen Weeks of Time Blocking</a>), but the way that I use it often ends up with a lot of amendments and bandages to the schedule that I start with. I like time-block planning because it sets an intention, but that intention doesn&apos;t really end up always getting followed because there&apos;s always going to be some kind of shower or nap or long lunch or a walk where I go outside for a while or just doing something entirely different because I feel like it.</p><p>A better system for me has been to rely on my energy levels to serve me as a guide. </p><p>For example, when I&apos;m in a low energy state, I try to read or to do synthesis activities in Your Commonbase. At medium energy levels, I try to do project management style work or chores. Or working out &#x2013; something that doesn&apos;t require peak mental attention but does require some non trivial level of investment. At the highest energy levels during the day, that&apos;s where I try to accomplish my deep work goals, including working on Your Commonbase and some creative coding generally.</p>"
            ],
            "link": "https://www.bramadams.dev/time-unhelpful/",
            "publishedAt": "2024-12-31",
            "source": "Bram Adams",
            "summary": "<img alt=\"Time Unhelpful\" src=\"https://www.bramadams.dev/content/images/2024/12/Currier-Ives-The-Rescue.jpeg\" /><p>As I work on habits and good behaviors (<a href=\"https://www.bramadams.dev/priority-list-for-2025/\">Priority List for 2025</a>), I&apos;ve noticed that time (aka a calendar invite) is never really a good trigger for me. I don&apos;t find it easy to do anything at any specified time to any level of consistency that doesn&apos;t just end up making me feel guilty about not doing it at the time that I specified.</p><p>There are just way too many factors including how well you slept the night before, how sunny it is outside, the type of work that I&apos;m taking on, or where I am in the middle or beginning or end of a project. Time is &#x2013; at best &#x2013; a guideline for being able to accomplish roughly what I intend to during any given hour.</p><p>This being said, I&apos;m a huge proponent of time-block planning from Cal Newport (see <a href=\"https://www.bramadams.dev/issue-37/\">Issue 37: Sixteen Weeks of Time Blocking</a>), but the way that I use it often ends up with a lot of amendments and bandages to the schedule that I start with. I like time-block planning because it sets an intention, but that intention doesn&apos;t really end up always getting followed because there&apos;s always going",
            "title": "Time Unhelpful"
        },
        {
            "content": [
                "<img alt=\"Priority List for 2025\" src=\"https://www.bramadams.dev/content/images/2024/12/Double-Capital-Image.jpeg\" /><p>I&apos;ve been feeling really good about the priority list that I&apos;m bringing into 2025 with me. So good in fact, that I&apos;ve been able to pretty much narrow it down to a list that I can recite in my head or out loud to myself or others, depending on the situation. The priority list is as follows:</p><ol><li>If after midnight, sleep. If before midnight, work on your commonbase.</li><li>Work on bramadams.dev. <em>I&apos;m of the strong opinion that personal websites are going to become really important in the continued increase of real world culture from the internet, as well as being able to exist in a language model world. And they&apos;re just really fun</em>.</li><li>Mental, physical, and home cleaning. This basically means cleaning up my physical space, cleaning up my mental space with meditation, working out, building a body to die in, etc.</li><li>If under 5 books of the month, read a book. If over 5 books of the month, work on a deliberate practice skill. Right now, this is drawing and a little bit of creative coding.</li></ol><p>This priority list has served me pretty well because it&apos;s fast enough that I can go through really quickly in my head. It has a few conditionals that make it easier to decide which is more important. </p><p>And if I really go through all four and don&apos;t do want to do, then I can just easily reference back to doing what I want to do (which might be watching TV or doing something a little bit more laissez-faire). </p><p>But I often notice that I end up wanting to do at least something on the priority list. </p><p>And these things align really well with my long-term goals.</p><hr /><p>In a similar vein, my values in 2025 are as follows: Agency, ambition, craft, collegiality, and solitude. </p><p>These five habits and values are things that I am striving towards / using as a baseline for judgment and decision making, particularly for the bigger decisions that I need to make in life. </p><p>I don&apos;t really know how I settled on these five, but these five resonate with me, and I think that resonance is probably a good enough signal as to whether or not something is a value that you believe in. </p><p>I think a value is something that you&apos;d be willing to &quot;die for,&quot; which means that you&apos;d be willing to uproot huge amounts of your life to make these things a reality. </p><p>For example, with <strong>Agency</strong> and <strong>Ambition</strong>, I have already done that. I quit my job back in 2019 and have been on my own as an entrepreneur since, leaning into having <strong>Agency</strong> meaning no one is my boss, and <strong>Ambition</strong> by taking on really big, hard software projects as well as writing projects.</p><p>My <strong>craft</strong> is a little bit more untested than other people&apos;s crafts. I&apos;m not trying to be the best at a art form that is hundreds of years old or has a lot of immediate and obvious competition. </p><p>To me, <strong>craft</strong> is being able to take the patterns that are in my mind and convey them through real computational data structures and effort, even though I&apos;m learning along the way, sometimes there are a lot of compromises to be made.</p><p><strong>Collegiality</strong> is something rather new for me. I&apos;ve decided going forward that the types of friendships I want to foster are those that are strongly connected to communities and interest groups. </p><p>I don&apos;t have many people who I have on a daily rotation in my life. People that I hang out with just to spend time with. I&apos;ve had those people in my life, and I&apos;m really grateful for the times that we had together. But because of the other four values, particularly <strong>Solitude</strong>, I don&apos;t really have time to over-invest my needs into another person who I don&apos;t already have a prior investment to (be it through blood or previous friend relationships). </p><p>I think that this is OK. I think in a world where my goals are priority, and I desire to create with the time that I have on this planet, finding friends who are on the same journey as me and being really grateful for their time but then being able to move away from them when the time calls for it is beautiful. </p><p>This is an advantage of living in a huge city. I don&apos;t think I&apos;d be able to pull this particular collegiality value off if I was in a smaller rural or small suburban area; there needs to be a certain density of a number of types of folks for this thing to work, which ties into the final value &#x2013; <strong>solitude</strong>.</p><p>How do you deal with loneliness? What does it mean to be alone? For me, <strong>solitude</strong> is the act of being with yourself and the priority list above (specifically, reading books and meditation). <strong>Solitude</strong> to me means the ability to sit with yourself or do things with yourself to be okay with being bored. That&apos;s something that I need to work towards; it&apos;s not being antisocial and scrolling on your phone for hours on end. It&apos;s being grateful that you get to spend time with yourself and being <strong>agentic</strong> with the person that you are.</p><blockquote>I placed the highest priority on the sort of life that lets me focus on writing, not associating with all the people around me. I felt that the indispensable relationship I should build in my life was not with a specific person, but with an unspecified number of readers. As long as I got my day-to-day life set so that each work was an improvement over the last, then many of my readers would welcome whatever life I chose for myself. Shouldn&#x2019;t this be my duty as a novelist, and my top priority? My opinion hasn&#x2019;t changed over the years. I can&#x2019;t see my readers&#x2019; faces, so in a sense it&#x2019;s a conceptual type of human relationship, but I&#x2019;ve consistently considered this invisible, conceptual relationship to be the most important thing in my life. In other words, you can&#x2019;t please everybody.<br /><br />What I Talk About When I Talk About Running - Haruki Murakami and Philip Gabriel</blockquote>"
            ],
            "link": "https://www.bramadams.dev/priority-list-for-2025/",
            "publishedAt": "2024-12-31",
            "source": "Bram Adams",
            "summary": "<img alt=\"Priority List for 2025\" src=\"https://www.bramadams.dev/content/images/2024/12/Double-Capital-Image.jpeg\" /><p>I&apos;ve been feeling really good about the priority list that I&apos;m bringing into 2025 with me. So good in fact, that I&apos;ve been able to pretty much narrow it down to a list that I can recite in my head or out loud to myself or others, depending on the situation. The priority list is as follows:</p><ol><li>If after midnight, sleep. If before midnight, work on your commonbase.</li><li>Work on bramadams.dev. <em>I&apos;m of the strong opinion that personal websites are going to become really important in the continued increase of real world culture from the internet, as well as being able to exist in a language model world. And they&apos;re just really fun</em>.</li><li>Mental, physical, and home cleaning. This basically means cleaning up my physical space, cleaning up my mental space with meditation, working out, building a body to die in, etc.</li><li>If under 5 books of the month, read a book. If over 5 books of the month, work on a deliberate practice skill. Right now, this is drawing and a little bit of creative coding.</li></ol><p>This priority list has served me pretty well because it&apos;s fast enough that I can go through really quickly in my head.",
            "title": "Priority List for 2025"
        },
        {
            "content": [
                "<img alt=\"The Leverage of Programming Keeps Going Up\" src=\"https://www.bramadams.dev/content/images/2024/12/IMG_0140.jpg\" /><p>In 1945 in the first generation of computing (ENIAC mainframes), there were just as many programmers as there were computers and users, it was pretty much a 1:1:1 ratio. </p><p>In fact, there were probably more programmers than there were computers. And there was for sure less users than people who were programmers because computers were so opaque and hard to figure out. </p><p>80ish years later, there are way fewer programmers than there are users and there are fewer users than there are computers. Another way to phrase this is that a single user has multiple computers and most people can&apos;t program.</p><p>From the data that I&apos;ve been able to source, fluent programmers (i.e., people who can get paid to program) occupy about one-third of one percent of the global population.</p><p>This is dwarfed by the 70% of the global population that has access to a smartphone.</p><p>And of the members of a society who do own a computational device, like a smartphone, they generally don&apos;t just own a smartphone; they&apos;ll own a laptop, and a tablet too, and all three will run separately. Not to mention smart TVs and smart appliances all over people&apos;s houses these days.</p><p>I don&apos;t think that the world will ever be as programmer = user = computer ratio ever again in the future. If anything, I think the number of computers is going to keep rising, and depending on population growth or decline, that number will change too but the users but will always stay much greater percentage wise than the programmers, even with the advent of LLM enabled programming. </p><p>This makes it an interesting comparison to something like literacy where the world strives to approach 100% literacy &#x2013; but I don&apos;t ever think we&apos;ll get to a point where the world is 100% programmers, even with movements like the &quot;Learn to Code&quot; movement in the 2010s pioneered by the large tech companies and bootcamps like Code.org. I guess an apt comparison is that even in a world where everyone can read, few people are published authors.</p><p>Programmers have the added benefit of not writing to one audience like writers do (the reader), but to three separate audiences (other programmers, the end users, and the computers that run your code).</p><p>Archimedes said that if you gave him a lever big enough, he&apos;d be able to move the world. If you are a programmer in 2024, you can move over 24 billion computers from the comfort of your living room. </p><p>Maybe go write some code?</p>"
            ],
            "link": "https://www.bramadams.dev/programmer-generations/",
            "publishedAt": "2024-12-30",
            "source": "Bram Adams",
            "summary": "<img alt=\"The Leverage of Programming Keeps Going Up\" src=\"https://www.bramadams.dev/content/images/2024/12/IMG_0140.jpg\" /><p>In 1945 in the first generation of computing (ENIAC mainframes), there were just as many programmers as there were computers and users, it was pretty much a 1:1:1 ratio. </p><p>In fact, there were probably more programmers than there were computers. And there was for sure less users than people who were programmers because computers were so opaque and hard to figure out. </p><p>80ish years later, there are way fewer programmers than there are users and there are fewer users than there are computers. Another way to phrase this is that a single user has multiple computers and most people can&apos;t program.</p><p>From the data that I&apos;ve been able to source, fluent programmers (i.e., people who can get paid to program) occupy about one-third of one percent of the global population.</p><p>This is dwarfed by the 70% of the global population that has access to a smartphone.</p><p>And of the members of a society who do own a computational device, like a smartphone, they generally don&apos;t just own a smartphone; they&apos;ll own a laptop, and a tablet too, and all three will run separately. Not to mention smart TVs and smart appliances all over people&apos;s",
            "title": "The Leverage of Programming Keeps Going Up"
        },
        {
            "content": [
                "<figure class=\"kg-card kg-embed-card\"></figure>"
            ],
            "link": "https://www.bramadams.dev/the-five-books-im-reading-in-january/",
            "publishedAt": "2024-12-28",
            "source": "Bram Adams",
            "summary": "a video about the five books im reading in january 2025",
            "title": "The Five Books Im Reading in January"
        },
        {
            "content": [
                "<figure class=\"kg-card kg-embed-card\"></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"Searching, Sharing, and a Launch Party\" class=\"kg-image\" height=\"903\" src=\"https://www.bramadams.dev/content/images/2024/12/Screenshot-2024-12-28-11-37-22.png\" width=\"2000\" /><figcaption><span style=\"white-space: pre-wrap;\">fig 0</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"Searching, Sharing, and a Launch Party\" class=\"kg-image\" height=\"1340\" src=\"https://www.bramadams.dev/content/images/2024/12/Screenshot-2024-12-28-11-32-18.png\" width=\"1488\" /><figcaption><span style=\"white-space: pre-wrap;\">fig 1</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"Searching, Sharing, and a Launch Party\" class=\"kg-image\" height=\"2036\" src=\"https://www.bramadams.dev/content/images/2024/12/Screenshot-2024-12-28-11-30-17.png\" width=\"1546\" /><figcaption><span style=\"white-space: pre-wrap;\">fig 2</span></figcaption></figure>"
            ],
            "link": "https://www.bramadams.dev/searching-sharing-and-a-launch-party/",
            "publishedAt": "2024-12-28",
            "source": "Bram Adams",
            "summary": "<figure class=\"kg-card kg-embed-card\"></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"Searching, Sharing, and a Launch Party\" class=\"kg-image\" height=\"903\" src=\"https://www.bramadams.dev/content/images/2024/12/Screenshot-2024-12-28-11-37-22.png\" width=\"2000\" /><figcaption><span style=\"white-space: pre-wrap;\">fig 0</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"Searching, Sharing, and a Launch Party\" class=\"kg-image\" height=\"1340\" src=\"https://www.bramadams.dev/content/images/2024/12/Screenshot-2024-12-28-11-32-18.png\" width=\"1488\" /><figcaption><span style=\"white-space: pre-wrap;\">fig 1</span></figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img alt=\"Searching, Sharing, and a Launch Party\" class=\"kg-image\" height=\"2036\" src=\"https://www.bramadams.dev/content/images/2024/12/Screenshot-2024-12-28-11-30-17.png\" width=\"1546\" /><figcaption><span style=\"white-space: pre-wrap;\">fig 2</span></figcaption></figure>",
            "title": "Searching, Sharing, and a Launch Party"
        },
        {
            "content": [],
            "link": "https://olano.dev/blog/software-design-is-knowledge-building",
            "publishedAt": "2024-12-29",
            "source": "Facundo Olano",
            "summary": "The product of software development is not code but a mental model, a theory: a specific way of explaining the world.",
            "title": "Software Design is Knowledge Building"
        }
    ],
    "lookbackDays": 7,
    "publishDate": "2025-01-01"
}