{
    "articles": [
        {
            "content": [
                "<p><em>This is part 2 of a 3 part series on digital hygiene. I suggest starting at <a href=\"https://herman.bearblog.dev/digital-hygiene-emails/\">part 1</a>.</em></p>\n<p>Over the past few years I've cultivated a decent relationship with my phone. Not a good one, mind you, but one I'm fairly comfortable with. There is a part of me that yearns for a return to simple, black-and-white phones, with Internet access limited to whichever room in the house had the phone line and computer. But there's no going back; and so I had to find a way to live with the Internet (and the hyper-connectivity it entails) in my pocket.</p>\n<p>Developing a good relationship to your phone is an intentional process. It doesn't happen by accident. All apps and media, by design, are fighting for your attention. I've heard the term \"attention economy\" thrown around, and I feel like it's an apt description of the battle for our increasingly fractured attentions.</p>\n<p>And the easiest way to grab your attention is via notifications.</p>\n<p>Sometimes I see a person's phone covered in notifications and I get anxiety-by-proxy. Red toasts in the triple-digits; the notification bar an endless list of banners, messages, friend requests, and marketing content. I can't imagine this is a pleasant experience, but it seems to be the norm.</p>\n<p>In my opinion, notifications need to be reeled in as a priority. At the end of the day my phone is a tool. I want to choose how to use it. I don't want it to \"keep me engaged\" or sell me things. I want to own my own time, and have full control of my attention.</p>\n<p>A more utilitarian reason to get notifications under control is that when all notifications are active, none of them are. When I use the Reminders app on my iPhone I <em>actually want to be reminded of something</em>, instead of that notification being buried beneath unimportant stuff.</p>\n<p>Here's the method I used for breaking free of notification hell (you'll notice a lot of overlap with my previous post on emails):</p>\n<p><strong>1. Remove social media apps (or completely mute them at the very least)</strong></p>\n<p>I don't have traditional social media (think Instagram, Facebook, Twitter, or LinkedIn). I've <a href=\"https://herman.bearblog.dev/quitting-social-media/\">written</a> about it before. But in a nutshell, these apps consume my time and energy without giving me much value in return. Instead I try to nurture in-person relationships, or use longer-form digital communication, like calls or email.</p>\n<p>Regardless of my personal preferences around <em>having social media</em>, it goes without saying that those apps should, at the very least, be muted. No banners, no toasts, no sounds. It should be up to you when to engage with these platforms; because if left up to them you would never log off. Another way to manage this is to put social media apps on a separate device, like an iPad left at home, which takes this pernicious time-suck out of your pocket.</p>\n<p>If you're trying to smoke less, don't carry a box of cigarettes around with you.</p>\n<p><strong>2. Opt-in instead of opt-out notifications</strong></p>\n<p>A simple but effective way of cleaning up phone notifications is to go and turn them all off, then selectively turn on the ones you actually need. The idea is that all notifications should be opt-in, instead of opt-out. Notifications should also be set to the least-intrusive method, depending on the application. For example, here are my only notifications on my phone:</p>\n<ul>\n<li>Messaging apps (Telegram, WhatsApp, Messages)<ul>\n<li>✅ Toasts</li>\n<li>❌ Banners</li>\n<li>❌ Sounds</li>\n</ul>\n</li>\n<li>Phone calls<ul>\n<li>❌ Toasts</li>\n<li>✅ Banners</li>\n<li>✅ Sounds</li>\n</ul>\n</li>\n<li>Calendar and reminders<ul>\n<li>✅ Toasts</li>\n<li>✅ Banners</li>\n<li>✅ Sounds</li>\n</ul>\n</li>\n<li>Uptime monitor<ul>\n<li>❌ Toasts</li>\n<li>✅ Banners</li>\n<li>✅ Sounds</li>\n</ul>\n</li>\n<li>RSS reader<ul>\n<li>✅ Toasts</li>\n<li>❌ Banners</li>\n<li>❌ Sounds</li>\n</ul>\n</li>\n</ul>\n<p>Everything else is left turned off, since most things aren't time sensitive. I used to have Uber's notifications turned on, since I didn't want to miss my ride, but found that Uber doesn't respect marketing opt-out and would send me \"special offers\" that were impossible to turn off. Now I just make sure I don't forget that I've ordered an Uber.</p>\n<p>With group-chats on messaging apps (which can become overwhelming), I mute all of the ones that have a lot of noise and archive them; checking them every now and then.</p>\n<p><strong>3. Managing sounds</strong></p>\n<p>Sounds and vibrations are the worst kinds of notifications since they grab your attention even when not using your device. Because of this you'll notice that only calls, calendar and reminders, and uptime monitors have sounds enabled, since these are the time sensitive ones. But even then I still have sleep mode active after 7pm, so only my uptime monitor and repeat phone calls get through.</p>\n<p><strong>4. Report telemarketers and robo-calls</strong></p>\n<p>In South Africa we have a public National Opt-Out Register (you may have something like this in your jurisdiction). This can be used by companies to determine if you're open to direct marketing communications. When I receive a marketing call from a company, if it's a human I politely ask them to remove my number from their marketing list. If I receive another call from that company (or any robo-call) I report them to the Information Regulator of South Africa for processing my personal importation without my consent, as well as not respecting the National Opt-Out Register. I then leave a <a href=\"https://www.hellopeter.com/metropolitan-life/reviews/robo-calls-and-harassment-5795160\" target=\"_blank\">public</a> <a href=\"https://www.hellopeter.com/dial-a-bed/reviews/breaking-information-privacy-law-5414191\" target=\"_blank\">review</a> <a href=\"https://www.hellopeter.com/cell-c/reviews/cell-c-illegally-spamming-me-and-refusing-to-stop-3809770\" target=\"_blank\">for</a> <a href=\"https://www.hellopeter.com/discovery-insure/reviews/marketing-communications-in-contravention-of-popia-5533815\" target=\"_blank\">that</a> company stating that they've broken the law by contacting me.</p>\n<p>I'm very careful to never opt-in to any marketing communications, so I can say with certainty that any direct marketing I receive is definitively against privacy legislation where I live.</p>\n<p>This has proven to be <strong>very</strong> effective. I have not received a single robo-call or direct marketing call in the past few months. It may seem like a lot of work up front, but it pays dividends since I never get pulled out of whatever I'm doing just to answer a call from a company I don't care about. It's also punishment for them trying to advertise to me in the privacy of my own home. That feels like crossing a boundary.</p>\n<p>All of this applies to the computer as well. I don't allow any banners to pop-up on my computer, which easily pull me out of work. Slack only shows a red small toast (sans the number) to let me know there's an unread mesage, and even then the sidebar on my Mac is hidden by default. Your mileage may vary, depending on the work you do, but protecting deep work is important. At least to me.</p>\n<p>So why all of this effort? I try to live an intentional and present life. I want to be <strong>here</strong> right now. Technology isn't going to regress back to the 90s and so we need to cultivate good relationships with our devices, so we can cultivate a good relationship with ourselves and the people around us.</p>\n<p>Take back your attention.</p>"
            ],
            "link": "https://herman.bearblog.dev/notifications/",
            "publishedAt": "2025-08-06",
            "source": "Herman Martinus",
            "summary": "<p><em>This is part 2 of a 3 part series on digital hygiene. I suggest starting at <a href=\"https://herman.bearblog.dev/digital-hygiene-emails/\">part 1</a>.</em></p> <p>Over the past few years I've cultivated a decent relationship with my phone. Not a good one, mind you, but one I'm fairly comfortable with. There is a part of me that yearns for a return to simple, black-and-white phones, with Internet access limited to whichever room in the house had the phone line and computer. But there's no going back; and so I had to find a way to live with the Internet (and the hyper-connectivity it entails) in my pocket.</p> <p>Developing a good relationship to your phone is an intentional process. It doesn't happen by accident. All apps and media, by design, are fighting for your attention. I've heard the term \"attention economy\" thrown around, and I feel like it's an apt description of the battle for our increasingly fractured attentions.</p> <p>And the easiest way to grab your attention is via notifications.</p> <p>Sometimes I see a person's phone covered in notifications and I get anxiety-by-proxy. Red toasts in the triple-digits; the notification bar an endless list of banners, messages, friend requests, and marketing content. I can't imagine this is",
            "title": "Digital hygiene: Notifications"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/software-books-i-wish-i-could-read/",
            "publishedAt": "2025-08-06",
            "source": "Hillel Wayne",
            "summary": "<h3>New Logic for Programmers Release!</h3> <p><a href=\"https://leanpub.com/logic/\" target=\"_blank\">v0.11 is now available</a>! This is over 20% longer than v0.10, with a new chapter on code proofs, three chapter overhauls, and more! <a href=\"https://github.com/logicforprogrammers/book-assets/blob/master/CHANGELOG.md\" target=\"_blank\">Full release notes here</a>.</p> <p><img alt=\"Cover of the boooooook\" class=\"newsletter-image\" src=\"https://assets.buttondown.email/images/92b4a35d-2bdd-416a-92c7-15ff42b49d8d.jpg?w=960&amp;fit=max\" /></p> <h1>Software books I wish I could read</h1> <p>I'm writing <em>Logic for Programmers</em> because it's a book I wanted to have ten years ago. I had to learn everything in it the hard way, which is why I'm ensuring that everybody else can learn it the easy way.</p> <p>Books occupy a sort of weird niche in software. We're great at sharing information via blogs and git repos and entire websites. These have many benefits over books: they're free, they're easily accessible, they can be updated quickly, they can even be interactive. But no blog post has influenced me as profoundly as <a href=\"https://buttondown.com/hillelwayne/archive/why-you-should-read-data-and-reality/\" target=\"_blank\">Data and Reality</a> or <a href=\"https://www.oreilly.com/library/view/making-software/9780596808310/\" target=\"_blank\">Making Software</a>. There is no blog or talk about debugging as good as the <a href=\"https://debuggingrules.com/\" target=\"_blank\">Debugging</a> book.</p> <p>It might not be anything deeper than \"people spend more time per word on writing books than blog posts\". I dunno.</p> <p>So here are some other books I wish I",
            "title": "Software books I wish I could read"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3935\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3935",
            "publishedAt": "2025-08-06",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3935\"> Read more </a> </p>",
            "title": "Hidden Open Thread 393.5"
        },
        {
            "content": [
                "<p>There are ACX meetup groups all over the world. Lots of people are vaguely interested, but don't try going to a meetup until I make a big deal about it on the blog. Since learning that, I've tried to make a big deal about it on the blog twice annually, and it's that time of year again.</p><p><strong>If you're willing to run a meetup for your city, please<a href=\"https://tinyurl.com/acx-volunteer\"> fill out the organizer form</a>.</strong></p><p>Here&#8217;s the plan:</p><ul><li><p>Interested organizers fill out the form by August 23rd.</p></li><li><p>The list of meetups gets posted around August 24th.</p></li><li><p>ACX Everywhere Meetups can take place anytime between September 1st and October 31st.</p></li><li><p>People enjoy each other&#8217;s company and keep having meetups throughout the year.</p></li></ul><p>The form will ask you to pick a location, time, and date, and to provide an email address where people can reach you for questions. It will also ask a few short questions about how excited you are to run the meetup to help pick between multiple organizers in the same city. One meetup per city will be advertised on the blog, and people can email you if they have questions. </p><p>Organizing an ACX Everywhere meetup can be easy. Pick a time and a place (parks work well if you think there will be a lot of people, cafes or apartments work fine for fewer) and show up with a sign saying &#8220;ACX Meetup.&#8221; You don&#8217;t need to have discussion plans or a group activity. If you want to make the experience better for people, you can bring nice things like nametags/markers, food/drinks, or games. Meetups Czar Skyler can reimburse you for the nametags, markers, food, and drinks.</p><p>If you feel more ambitious, collect people&#8217;s names and emails if they&#8217;re interested in future meetups. You could do this with a pen and paper, or if you&#8217;re concerned about reading people&#8217;s handwriting you could use a QR code/bitly link to a Google Form.</p><p>Here&#8217;s a short FAQ for potential meetup organizers:</p><p><strong>1. How do I know if I would be a good meetup organizer?</strong></p><p>If you can put a name/time/date in a box on Google Forms and show up there, you have the minimum skill necessary to be a meetup organizer for your city, and I recommend you sign up.</p><p>Don't worry, you signing up won't randomly take the job away from someone else. The form will ask people how excited/qualified they are about being an organizer, and if there are many options, I'll choose whoever I think is best. (Or whoever Meetup Czar Skyler thinks is best.) But a lot of cities might not have an excited/qualified person, in which case I would rather the unexcited/unqualified people sign up, than have nobody available at all. <a href=\"https://docs.google.com/spreadsheets/d/1uGbesPvy_66ECd1Gd1nkugurLpo3x8orfjPyvyryY28/edit?gid=0#gid=0\">This spreadsheet</a> shows the cities where someone has filled out the form, updated manually after a basic check.</p><p>Lots of cities have existing meetup groups and we&#8217;ll probably prioritize them, but we always appreciate more options. Sometimes people assume their city is big enough that someone else will do it, nobody signs up before the announcement, and then afterwards people say they wish there was a meetup in their city. Beware the Bystander Effect!</p><p>If you <em>are</em> the leader of your city&#8217;s existing meetup group, please fill in the form anyway and say so.</p><p><strong>2. How will people hear about the meetup?</strong></p><p>You give me the information, and on August 24 (or so), I&#8217;ll post it on ACX. An event will also be created on <a href=\"https://www.lesswrong.com/community\">LessWrong&#8217;s Community</a> page.</p><p><strong>3. When should I plan the meetup for?</strong></p><p>Since I&#8217;ll post the list of meetup times and dates around August 24, please choose sometime after that. Any day September 1st through October 31st is okay. I recommend a weekend, since it's when most people are available. You&#8217;ll probably get more attendance if you schedule for at least one week out, but not so far out that people will forget - so mid September or early October would be best. Check your local calendar for holidays where people might be busy: If you're in the US, that probably means avoid Labor Day and Halloween.</p><p><strong>4. How many people should I expect?</strong></p><p>Last spring, meetups ranged from one person (just the organizer) to around two hundred. Meetups in big US cities (especially ones with universities or tech hubs) had the most people; meetups in non-English-speaking countries had the fewest. You can see a list of every city and how many people most of them got last time <a href=\"https://docs.google.com/spreadsheets/d/1awPp1g2YigcGXOqaLPb8ecED0kRra9Q_KRcG-uyHomA/edit?usp=sharing\">here</a>. (If it&#8217;s blank, it means either no ACX Everywhere was run <em>or </em>we didn&#8217;t get a count of attendees in the post-event survey.`) Plan accordingly.</p><p><strong>5. Where should I hold the meetup?</strong></p><p>A good venue should be easy for people to get to, not too loud, and have basic things like places to sit, access to toilets, and the option of acquiring food and water. City parks and mall common areas work well. If you want to hold the meetup at your house, remember that this will involve me posting your address on the Internet.</p><p><strong>6. What should I do at the meetup?</strong></p><p>Mostly people just show up and talk. If you&#8217;re worried about this not going well, here are some things that can help:</p><ul><li><p>Have people indicate topics they&#8217;re interested in by writing something on their nametag</p></li><li><p>Bring a list of icebreakers / conversation starters (e.g. &#8220;What have you been excited about recently?&#8221; or &#8220;How did you find the blog?&#8221; or &#8220;How many feet of giraffe neck do you think there are in the world?&#8221;)</p></li><li><p>Bring one extroverted friend who&#8217;s read the blog</p></li></ul><p>In general I would warn against trying to impose mandatory activities (e.g. &#8220;now we're all going to sit down and watch a PowerPoint presentation&#8221;), but it&#8217;s fine to give people the <em>option</em> to do something other than freeform socializing (e.g. &#8220;go over to that table if you want to play a game&#8221;).</p><p>It&#8217;s also useful to have a signup sheet for a local mailing list or other way to announce meetups in the future, but this is optional both for the organizers and the attendees. Look at point 8 for more information about this. It can also be nice to include a checkbox on the signup sheet for adjacent local groups if your city happens to have those.</p><p><strong>7. Is it okay if I already have an existing meetup group?</strong></p><p>Yes. If you run an existing ACX meetup group, just choose one of your meetings which you'd like me to advertise on my blog as the official meetup for your city, and be prepared to have a larger-than-normal attendance who might want to do generic-new-people things that day.</p><p>If you're a LW, EA, or other affiliated community meetup group, consider carefully whether you want to be affiliated with ACX. If you decide yes, that's fine, but I might still choose an ACX-specific meetup over you, if I find one. I guess this would depend on whether you're primarily a social group (good for this purpose) vs. a practical group that does rationality/altruism/etc activism (good for you, but not really appropriate for what I'm trying to do here). I'll ask about this on the form.</p><p><strong>8. If this works, am I committing to continuing to organize meetup groups forever for my city?</strong></p><p>The short answer is no.</p><p>The long answer is no, but running more meetups seems like the sort of thing somebody should do. Many cities already have permanent meetup groups. For the others, I'll prioritize would-be organizers who are interested in starting one. If you end up organizing one meetup but not being interested in starting a longer-term group, see if you can find someone at the meetup who you can hand this responsibility off to.</p><p>I know it sounds weird, but due to the way human psychology works, once you're the meetup organizer people are going to respect you, coordinate around you, and be wary of doing anything on their own initiative lest they step on your toes. If you can just bang something loudly at the meetup, get everyone's attention, and say \"HEY, ANYONE WANT TO BECOME A REGULAR MEETUP ORGANIZER?\", somebody might say yes, even if they would never dream of asking you on their own and wouldn&#8217;t have decided to run things without someone offering.</p><p><strong>9. Are you (Scott) going to come to some of the meetups?</strong></p><p>I have in the past and had a lot of fun, but also found it pretty tiring. Since I expect to have less time and energy for travel, I&#8217;ll probably just attend the local one in Berkeley. </p><p>Again,<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc48qgxgm8lW42ZEe1HmoGP7PIo_jwWk7OBnB4anEjHSPoVsQ/viewform?usp=sf_link\"> </a><strong><a href=\"https://tinyurl.com/acx-volunteer\">you can find the meetup organizer volunteer form here</a></strong>. If you want to know if anyone has signed up to run a meetup for your city, you can view that <a href=\"https://docs.google.com/spreadsheets/d/1uGbesPvy_66ECd1Gd1nkugurLpo3x8orfjPyvyryY28/edit?gid=0#gid=0\">here</a>. Everyone else, just wait until 8/24 and I'll give you more information on where to go then.</p><p><strong>10. What if I have other questions?</strong></p><p>Skyler and I will read the comments here.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/fall-meetups-everywhere-call-for",
            "publishedAt": "2025-08-06",
            "source": "SlateStarCodex",
            "summary": "<p>There are ACX meetup groups all over the world. Lots of people are vaguely interested, but don't try going to a meetup until I make a big deal about it on the blog. Since learning that, I've tried to make a big deal about it on the blog twice annually, and it's that time of year again.</p><p><strong>If you're willing to run a meetup for your city, please<a href=\"https://tinyurl.com/acx-volunteer\"> fill out the organizer form</a>.</strong></p><p>Here&#8217;s the plan:</p><ul><li><p>Interested organizers fill out the form by August 23rd.</p></li><li><p>The list of meetups gets posted around August 24th.</p></li><li><p>ACX Everywhere Meetups can take place anytime between September 1st and October 31st.</p></li><li><p>People enjoy each other&#8217;s company and keep having meetups throughout the year.</p></li></ul><p>The form will ask you to pick a location, time, and date, and to provide an email address where people can reach you for questions. It will also ask a few short questions about how excited you are to run the meetup to help pick between multiple organizers in the same city. One meetup per city will be advertised on the blog, and people can email you if they have questions. </p><p>Organizing an ACX Everywhere meetup can be easy. Pick a time and a place (parks work",
            "title": "Fall Meetups Everywhere - Call for Organizers"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3125/",
            "publishedAt": "2025-08-06",
            "source": "XKCD",
            "summary": "<img alt=\"Chemistry grad students have been spotted trying to lure campus squirrels into laundry hampers in the hope that it sparks inspiration.\" src=\"https://imgs.xkcd.com/comics/snake_in_the_box_problem.png\" title=\"Chemistry grad students have been spotted trying to lure campus squirrels into laundry hampers in the hope that it sparks inspiration.\" />",
            "title": "Snake-in-the-Box Problem"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-08-06"
}