{
    "articles": [
        {
            "content": [
                "<p>I was creating a new S3 bucket today, and I had an idea – what if I add a README?</p>\n\n<p>Browsing a list of S3 buckets is often an exercise in code archeology.\nAlthough people try to pick meaningful names, it’s easy for context to be forgotten and the purpose lost to time.\nLooking inside the bucket may not be helpful either, if all you see is binary objects in an unknown format named using UUIDs.\nA sentence or two of prose could really help a future reader.</p>\n\n<p>We manage our infrastructure with Terraform and the Terraform AWS provider can <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/s3_object\">upload objects to S3</a>, so I only need to add a single resource:</p>\n<pre><code><span class=\"k\">resource</span> <span class=\"s2\">\"aws_s3_bucket\"</span> <span class=\"s2\">\"example\"</span> <span class=\"p\">{</span>\n  <span class=\"nx\">bucket</span> <span class=\"o\">=</span> <span class=\"s2\">\"alexwlchan-readme-example\"</span>\n<span class=\"p\">}</span>\n\n<span class=\"k\">resource</span> <span class=\"s2\">\"aws_s3_object\"</span> <span class=\"s2\">\"readme\"</span> <span class=\"p\">{</span>\n  <span class=\"nx\">bucket</span>  <span class=\"o\">=</span> <span class=\"nx\">aws_s3_bucket</span><span class=\"p\">.</span><span class=\"nx\">example</span><span class=\"p\">.</span><span class=\"nx\">id</span>\n  <span class=\"nx\">key</span>     <span class=\"o\">=</span> <span class=\"s2\">\"README.txt\"</span>\n  <span class=\"nx\">content</span> <span class=\"o\">=</span> <span class=\"s2\">&lt;&lt;EOF</span>\n<span class=\"s2\">This bucket stores log files for the Widget Wrangler Service.</span>\n\n<span class=\"s2\">These log files are anonymised and expire after 30 days.</span>\n\n<span class=\"s2\">Docs: http://internal-wiki.example.com/widget-logs</span>\n<span class=\"s2\">Contact: logging@example.com</span>\n<span class=\"s2\">EOF</span>\n  <span class=\"nx\">content_type</span> <span class=\"o\">=</span> <span class=\"s2\">\"text/plain\"</span>\n<span class=\"p\">}</span>\n</code></pre>\n<p>Now when the bucket is created, it comes with its own explanation.\nWhen you open the bucket in the S3 console, the README appears as a regular object in the list of files.</p>\n\n<p>This is an example, but a real README needn’t be much longer:</p>\n\n<ul>\n  <li>What is the bucket for?</li>\n  <li>Who do I talk to about what’s in this bucket?</li>\n  <li>Where can I find out more?</li>\n</ul>\n\n<p>This doesn’t replace longer documentation elsewhere, but it can be a useful pointer in the right direction.\nIt’s a quick and easy way to help the future sysadmin who’s trying to understand an account full of half-forgotten S3 buckets, and my only regret is that I didn’t think to use <code>aws_s3_object</code> this way sooner.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2025/s3-bucket-readme/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2025/s3-bucket-readme/?ref=rss",
            "publishedAt": "2025-12-19",
            "source": "Alex Chan",
            "summary": "If you create an S3 bucket in Terraform, you can also create a README to help a future sysadmin understand what the bucket is for.",
            "title": "Adding a README to S3 buckets with Terraform"
        },
        {
            "content": [
                "<p><img alt=\"unnamed\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/karpathy/unnamed.webp\" /></p>\n<p>2025 has been a strong and eventful year of progress in LLMs. The following is a list of personally notable and mildly surprising \"paradigm changes\" - things that altered the landscape and stood out to me conceptually.</p>\n<h3 id=\"1-reinforcement-learning-from-verifiable-rewards-rlvr\">1. Reinforcement Learning from Verifiable Rewards (RLVR)</h3><p>At the start of 2025, the LLM production stack in all labs looked something like this:</p>\n<ol>\n<li>Pretraining (GPT-2/3 of ~2020)</li>\n<li>Supervised Finetuning (InstructGPT ~2022) and</li>\n<li>Reinforcement Learning from Human Feedback (RLHF ~2022)</li>\n</ol>\n<p>This was the stable and proven recipe for training a production-grade LLM for a while. In 2025, Reinforcement Learning from Verifiable Rewards (RLVR) emerged as the de facto new major stage to add to this mix. By training LLMs against automatically verifiable rewards across a number of environments (e.g. think math/code puzzles), the LLMs spontaneously develop strategies that look like \"reasoning\" to humans - they learn to break down problem solving into intermediate calculations and they learn a number of problem solving strategies for going back and forth to figure things out (see DeepSeek R1 paper for examples). These strategies would have been very difficult to achieve in the previous paradigms because it's not clear what the optimal reasoning traces and recoveries look like for the LLM - it has to find what works for it, via the optimization against rewards.</p>\n<p>Unlike the SFT and RLHF stage, which are both relatively thin/short stages (minor finetunes computationally), RLVR involves training against objective (non-gameable) reward functions which allows for a lot longer optimization. Running RLVR turned out to offer high capability/$, which gobbled up the compute that was originally intended for pretraining. Therefore, most of the capability progress of 2025 was defined by the LLM labs chewing through the overhang of this new stage and overall we saw ~similar sized LLMs but a lot longer RL runs. Also unique to this new stage, we got a whole new knob (and and associated scaling law) to control capability as a function of test time compute by generating longer reasoning traces and increasing \"thinking time\". OpenAI o1 (late 2024) was the very first demonstration of an RLVR model, but the o3 release (early 2025) was the obvious point of inflection where you could intuitively feel the difference.</p>\n<h3 id=\"2-ghosts-vs-animals-jagged-intelligence\">2. Ghosts vs. Animals / Jagged Intelligence</h3><p>2025 is where I (and I think the rest of the industry also) first started to internalize the \"shape\" of LLM intelligence in a more intuitive sense. We're not \"evolving/growing animals\", we are \"summoning ghosts\". Everything about the LLM stack is different (neural architecture, training data, training algorithms, and especially optimization pressure) so it should be no surprise that we are getting very different entities in the intelligence space, which are inappropriate to think about through an animal lens. Supervision bits-wise, human neural nets are optimized for survival of a tribe in the jungle but LLM neural nets are optimized for imitating humanity's text, collecting rewards in math puzzles, and getting that upvote from a human on the LM Arena. As verifiable domains allow for RLVR, LLMs \"spike\" in capability in the vicinity of these domains and overall display amusingly jagged performance characteristics - they are at the same time a genius polymath and a confused and cognitively challenged grade schooler, seconds away from getting tricked by a jailbreak to exfiltrate your data.</p>\n<p><img alt=\"G6zymj4a0AMNJkJ\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/karpathy/g6zymj4a0amnjkj.webp\" />(human intelligence: blue, AI intelligence: red. I like this version of the meme (I'm sorry I lost the reference to its original post on X) for pointing out that human intelligence is also jagged in its own different way.)</p>\n<p>Related to all this is my general apathy and loss of trust in benchmarks in 2025. The core issue is that benchmarks are almost by construction verifiable environments and are therefore immediately susceptible to RLVR and weaker forms of it via synthetic data generation. In the typical benchmaxxing process, teams in LLM labs inevitably construct environments adjacent to little pockets of the embedding space occupied by benchmarks and grow jaggies to cover them. Training on the test set is a new art form.</p>\n<p>What does it look like to crush all the benchmarks but still not get AGI?</p>\n<p>I have written a lot more on the topic of this section here:</p>\n<ul>\n<li><a href=\"https://karpathy.bearblog.dev/animals-vs-ghosts/\">Animals vs. Ghosts</a></li>\n<li><a href=\"https://karpathy.bearblog.dev/verifiability/\">Verifiability</a></li>\n<li><a href=\"https://karpathy.bearblog.dev/the-space-of-minds\">The Space of Minds</a></li>\n</ul>\n<h3 id=\"3-cursor-new-layer-of-llm-apps\">3. Cursor / new layer of LLM apps</h3><p>What I find most notable about Cursor (other than its meteoric rise this year) is that it convincingly revealed a new layer of an \"LLM app\" - people started to talk about \"Cursor for X\". As I highlighted in my Y Combinator talk this year (<a href=\"https://www.donnamagi.com/articles/karpathy-yc-talk\">transcript</a> and <a href=\"https://www.youtube.com/watch?v=LCEmiRjPEtQ\">video</a>), LLM apps like Cursor bundle and orchestrate LLM calls for specific verticals:</p>\n<ol>\n<li>They do the \"context engineering\"</li>\n<li>They orchestrate multiple LLM calls under the hood strung into increasingly more complex DAGs, carefully balancing performance and cost tradeoffs.</li>\n<li>They provide an application-specific GUI for the human in the loop</li>\n<li>They offer an \"autonomy slider\"</li>\n</ol>\n<p>A lot of chatter has been spent in 2025 on how \"thick\" this new app layer is. Will the LLM labs capture all applications or are there green pastures for LLM apps? Personally I suspect that LLM labs will trend to graduate the generally capable college student, but LLM apps will organize, finetune and actually animate teams of them into deployed professionals in specific verticals by supplying private data, sensors and actuators and feedback loops.</p>\n<h3 id=\"4-claude-code-ai-that-lives-on-your-computer\">4. Claude Code / AI that lives on your computer</h3><p>Claude Code (CC) emerged as the first convincing demonstration of what an LLM Agent looks like - something that in a loopy way strings together tool use and reasoning for extended problem solving. In addition, CC is notable to me in that it runs on your computer and with your private environment, data and context. I think OpenAI got this wrong because they focused their early codex / agent efforts on cloud deployments in containers orchestrated from ChatGPT instead of simply <code>localhost</code>. And while agent swarms running in the cloud feels like the \"AGI endgame\", we live in an intermediate and slow enough takeoff world of jagged capabilities that it makes more sense to run the agents directly on the developer's computer. Note that the primary distinction that matters is not about where the \"AI ops\" happen to run (in the cloud, locally or whatever), but about everything else - the already-existing and booted up computer, its installation, context, data, secrets, configuration, and the low-latency interaction. Anthropic got this order of precedence correct and packaged CC into a delightful, minimal CLI form factor that changed what AI looks like - it's not just a website you go to like Google, it's a little spirit/ghost that \"lives\" on your computer. This is a new, distinct paradigm of interaction with an AI.</p>\n<h3 id=\"5-vibe-coding\">5. Vibe coding</h3><p>2025 is the year that AI crossed a capability threshold necessary to build all kinds of impressive programs simply via English, forgetting that the code even exists. Amusingly, I coined the term \"vibe coding\" in <a href=\"https://x.com/karpathy/status/1886192184808149383\">this shower of thoughts tweet</a> totally oblivious to how far it would go :). With vibe coding, programming is not strictly reserved for highly trained professionals, it is something anyone can do. In this capacity, it is yet another example of what I wrote about in <a href=\"https://karpathy.bearblog.dev/power-to-the-people/\">Power to the people: How LLMs flip the script on technology diffusion</a>, on how (in sharp contrast to all other technology so far) regular people benefit a lot more from LLMs compared to professionals, corporations and governments. But not only does vibe coding empower regular people to approach programming, it empowers trained professionals to write a lot more (vibe coded) software that would otherwise never be written. In nanochat, I vibe coded my own custom highly efficient BPE tokenizer in Rust instead of having to adopt existing libraries or learn Rust at that level. I vibe coded many projects this year as quick app demos of something I wanted to exist (e.g. see <a href=\"https://karpathy.bearblog.dev/vibe-coding-menugen\">menugen</a>, <a href=\"https://github.com/karpathy/llm-council\">llm-council</a>, <a href=\"https://github.com/karpathy/reader3\">reader3</a>, <a href=\"https://github.com/karpathy/hn-time-capsule\">HN time capsule</a>). And I've vibe coded entire ephemeral apps just to find a single bug because why not - code is suddenly free, ephemeral, malleable, discardable after single use. Vibe coding will terraform software and alter job descriptions.</p>\n<h3 id=\"6-nano-banana-llm-gui\">6. Nano banana / LLM GUI</h3><p>Google Gemini Nano banana is one of the most incredible, paradigm-shifting models of 2025. In my world view, LLMs are the next major computing paradigm similar to computers of the 1970s, 80s, etc. Therefore, we are going to see similar kinds of innovations for fundamentally similar kinds of reasons. We're going to see equivalents of personal computing, of microcontrollers (cognitive core), or internet (of agents), etc etc. In particular, in terms of the UIUX, \"chatting\" with LLMs is a bit like issuing commands to a computer console in the 1980s. Text is the raw/favored data representation for computers (and LLMs), but it is not the favored format for people, especially at the input. People actually dislike reading text - it is slow and effortful. Instead, people love to consume information visually and spatially and this is why the GUI has been invented in traditional computing. In the same way, LLMs should speak to us in our favored format - in images, infographics, slides, whiteboards, animations/videos, web apps, etc. The early and present version of this of course are things like emoji and Markdown, which are ways to \"dress up\" and lay out text visually for easier consumption with titles, bold, italics, lists, tables, etc. But who is actually going to build the LLM GUI? In this world view, nano banana is a first early hint of what that might look like. And importantly, one notable aspect of it is that it's not just about the image generation itself, it's about the joint capability coming from text generation, image generation and world knowledge, all tangled up in the model weights.</p>\n<hr />\n<p><strong>TLDR</strong>. 2025 was an exciting and mildly surprising year of LLMs. LLMs are emerging as a new kind of intelligence, simultaneously a lot smarter than I expected and a lot dumber than I expected. In any case they are extremely useful and I don't think the industry has realized anywhere near 10% of their potential even at present capability. Meanwhile, there are so many ideas to try and conceptually the field feels wide open. And as I mentioned on my <a href=\"https://www.dwarkesh.com/p/andrej-karpathy\">Dwarkesh pod</a> earlier this year, I simultaneously (and on the surface paradoxically) believe that we will both see rapid and continued progress <em>and</em> that yet there is a lot of work to be done. Strap in.</p>"
            ],
            "link": "https://karpathy.bearblog.dev/year-in-review-2025/",
            "publishedAt": "2025-12-19",
            "source": "Andrej Karpathy",
            "summary": "<p><img alt=\"unnamed\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/karpathy/unnamed.webp\" /></p> <p>2025 has been a strong and eventful year of progress in LLMs. The following is a list of personally notable and mildly surprising \"paradigm changes\" - things that altered the landscape and stood out to me conceptually.</p> <h3 id=\"1-reinforcement-learning-from-verifiable-rewards-rlvr\">1. Reinforcement Learning from Verifiable Rewards (RLVR)</h3><p>At the start of 2025, the LLM production stack in all labs looked something like this:</p> <ol> <li>Pretraining (GPT-2/3 of ~2020)</li> <li>Supervised Finetuning (InstructGPT ~2022) and</li> <li>Reinforcement Learning from Human Feedback (RLHF ~2022)</li> </ol> <p>This was the stable and proven recipe for training a production-grade LLM for a while. In 2025, Reinforcement Learning from Verifiable Rewards (RLVR) emerged as the de facto new major stage to add to this mix. By training LLMs against automatically verifiable rewards across a number of environments (e.g. think math/code puzzles), the LLMs spontaneously develop strategies that look like \"reasoning\" to humans - they learn to break down problem solving into intermediate calculations and they learn a number of problem solving strategies for going back and forth to figure things out (see DeepSeek R1 paper for examples). These strategies would have been very difficult to achieve in the previous paradigms because it's not clear what the optimal",
            "title": "2025 LLM Year in Review"
        },
        {
            "content": [
                "<img alt=\"The gift card accountability sink\" src=\"https://www.bitsaboutmoney.com/content/images/2025/12/gift-card-accountability-sink.png\" /><p><em>Programming note</em>: <em>Merry Christmas</em>! <em>There will likely be another Bits about Money after the holiday but before New Year. </em></p><p><em>Bits about Money is </em><a href=\"https://www.bitsaboutmoney.com/memberships/\" rel=\"noreferrer\"><em>supported by our readers</em></a><em>. If your education budget or business can underwrite the coming year of public goods in financial-infrastructure education, commentary, and policy analysis, please consider supporting it. I&#x2019;m told this is particularly helpful for policymakers and others who cannot easily expense a subscription, and who benefit from all issues remaining publicly available with no paywall.</em></p><p>The American Association of Retired People (AARP, an advocacy non-profit for older adults) has paid for ads on podcasts I listen to. The ad made a claim which felt raspberry-worthy (in service of an important public service announcement), which they <a href=\"https://www.aarp.org/money/scams-fraud/gift-card-payment/\"><u>repeat in writing</u></a>: <em>Asking to be paid by gift card is always a scam</em>.</p><p>Of course it isn&#x2019;t. Gift cards are a payments rail, and an <em>enormous</em> business independently of being a payments rail. Hundreds of firms will indeed ask you to pay them on gift cards! They also exist, and are marketed, explicitly to do the thing that the AARP implicitly asserts no business or government entity will ever do: provide a method for transacting for people who do not have a banked method of transacting. [0]</p><p>Gift card scams are also enormous. The FBI&#x2019;s Internet Crime Complaint Center received <a href=\"https://www.ic3.gov/AnnualReport/Reports/2024_IC3Report.pdf\"><u>$16.6 billion</u></a> in reports in 2024 across several payment methods; this is just for those consumers who bothered reporting it, in spite of the <em>extremely real</em> received wisdom that reporting is unlikely to improve one&#x2019;s direct situation.</p><p>The flavor texts of scams vary wildly, but in substance they&#x2019;ll attempt to convince someone, often someone socially vulnerable, to part with sometimes very large sums of money by buying gift cards and conveying card information (card number and PIN number, both printed on the card) to the scammer. The scammer will then use the <a href=\"https://www.bitsaboutmoney.com/archive/the-fraud-supply-chain/\"><u>fraud supply chain</u></a>, generally to swap the value on the card to another actor in return for value unconnected to the card. This can be delivered in many ways: cash, crypto, products and services in the scamming economy (such as purloined credit cards or even &#x201c;lead lists&#x201d; of vulnerable people to run more scams on), or <a href=\"https://www.bitsaboutmoney.com/archive/kyc-and-aml-beyond-the-acronyms/\"><u>laundered</u></a> funds within regulated financial institutions which obscure the link between the crime and the funds (layering, in the parlance of AML professionals). A huge portion of <a href=\"https://www.bitsaboutmoney.com/archive/gift-card-marketplaces/\"><u>running a gift card marketplace</u></a> is trying to prevent yourself from being exploited or made into an instrumentality in exploiting others.</p><p>It surprises many people to learn that the United States <a href=\"https://www.consumerfinance.gov/rules-policy/regulations/1005/\"><u>aggressively defends customers from fraud over some payment methods</u></a>, via a liability transfer to their financial institution, which transfers it to intermediaries, who largely transfer it to payment-accepting businesses. Many people think the U.S. can&#x2019;t make large, effective, pro-consumer regulatory regimes. They are straightforwardly wrong&#x2026; some of the time.</p><p>But the AARP, the FBI, and your friendly local payments nerd will all tell you that if you&#x2019;re abused on your debit card you are quite likely to be made whole, and if you&#x2019;re abused via purchasing gift cards, it is unlikely any deep pockets will cover for you. The difference in treatment is partially regulatory carveouts, partially organized political pressure, and partly a side effect of an accountability sink specific to the industrial organization of gift cards.</p><h2 id=\"most-businesses-do-not-run-their-own-gift-card-programs\">Most businesses do not run their own gift card programs</h2><p>There exists an ecosystem of gift card program managers, who are essentially financial services businesses with a sideline in software. (I should probably mention that I previously worked for and am currently an advisor to Stripe, whose self conception would not be precisely that, but which a) supports many ways for people to pay money for things and b) does not necessarily endorse what I say in my personal spaces.)</p><p>Why does the program manager exist? Why not simply have the retailer keep some internal database of who the retailer owes money to, updating this when someone buys or loads a gift card and when they spend the balance at the store? Because this implies many capabilities that retailers do not necessarily have, such as e.g. software development teams.</p><p>There is also a large regulatory component to running a gift card program, despite gift cards&#x2019; relatively lax regulatory drag (we&#x2019;ll return to that in a moment). Card programs are regulated at both the federal and state levels. One frequent requirement in several states is escheatment. (Essentially all states have a requirement for escheatment; many but not all <a href=\"https://www.alston.com/en/insights/publications/2024/11/developments-impacting-gift-card-programs\"><u>exempt gift cards from it</u></a>.)</p><p>As <a href=\"https://www.bitsaboutmoney.com/archive/more-than-you-want-to-know-about-gift-cards/\"><u>discussed previously</u></a> in Bits about Money, a major component of the gift card business model is abandonment (&#x201c;breakage&#x201d;). Consumer advocates felt this was unfair to consumers, bordering on fraudulent really. They convinced states to take the money that retailers were keeping for themselves. (Many states didn&#x2019;t take all that much convincing.)&#xa0;</p><p>In theory, and sometimes even in practice, a consumer can convince a state treasurer&#x2019;s office of unclaimed property (e.g. <a href=\"https://icash.illinoistreasurer.gov/\"><u>Illinois</u></a>&#x2019;) that the $24.37 that Target remitted as part of its quarterly escheatment payment for an unused gift card 13 years ago was actually theirs. A consumer who succeeds at this, which is neither easy nor particularly inexpensive to do, will receive a $24.37 check in the mail. The state keeps the interest income; call it a fee for service. It also keeps the interest income of the tens of billions of dollars of accumulated unclaimed property, which it generally promises to dutifully custody awaiting a legitimate claim for as long as the United States shall exist.</p><p>And so if you are a regional or national retailer who wants to offer gift cards, you have a choice. You can dedicate a team of internal lawyers and operations specialists to understanding both what the laws of the several states require with respect to gift cards, which are a <em>tiny</em> portion of your total operations, not merely today but as a result of the next legislative session in Honolulu, because you <em>absolutely must </em>order the software written to calculate the payment to remit accurately several quarters in advance of the legal requirement becoming effective. Or you can make the much more common choice, and outsource this to a specialist.</p><p>That specialist, the gift card program manager, will sell you a Solution&#x2122; which integrates across all the surfaces you need: your point-of-sale systems, your website, your accounting software, the 1-800 number and website for customers to check balances, ongoing escheatment calculation and remittance, cash flow management, <em>carefully titrated </em>amounts of attention to other legal obligations like AML compliance, etc. Two representative examples: Blackhawk Network and InComm Payments. You&#x2019;ve likely never heard of them, even if you have their product on your person right now. Their <em>real</em> customer has the title Director of Payments at e.g. a Fortune 500 company.</p><p>And here begins the accountability sink: by standard practice and contract, when an unsophisticated customer is abused by being asked to buy a BigCo gift card, BigCo will say, truthfully and unhelpfully, that BigCo does not issue BigCo gift cards. It sells them. It accepts them. But it does not issue them. Your princess is in another castle.</p><p>BigCo may very well have a large, well-staffed fraud department. But, not due to any sort of malfeasance whatsoever, that fraud department may consider BigCo gift cards <em>entirely out of their own scope</em>. They <em>physically cannot access the database with the cards</em>. Their security teams, sensitive that gift card numbers are dangerous to keep lying around, very likely made it impossible for anyone at BigCo to reconstruct what happened to a particular gift card between checkout and most recent use. &#x201c;Your privacy is important to us!&#x201d; they will say, and they are not cynically invoking it in this case.</p><h2 id=\"gift-cards-are-not-regulated-like-other-electronic-payments-instruments\">Gift cards are not regulated like other electronic payments instruments</h2><p>As mentioned above, Regulation E is the primary driver for the private enforcement edifice that makes scarily smart professionals (and their attached balance sheets) swing into action on behalf of consumers. Reg E has a carveout for certain prepaid payments. Per <a href=\"https://files.consumerfinance.gov/f/documents/cfpb_prepaid_small-entity-compliance-guide.pdf\"><u>most recent guidance</u></a>, that includes prepaid gift cards, gift certificates, and similar.</p><p>And so, if you call your bank and say, &#x201c;I was defrauded! Someone called me and pretended to be the IRS, and I read them my debit card number, and now I&#x2019;ve lost money,&#x201d; the state machine obligates the financial institution to have the customer service representative click a very prominent button on their interface. This will restore your funds very quickly and have some side effects you probably care about much less keenly. One of those is an &#x201c;investigation,&#x201d; which is not really an investigation in the commanding majority of cases.</p><p>And if you call the program manager and say, &#x201c;I was defrauded! Someone called me and pretended to be the IRS, and I read them a gift card number, and now I&#x2019;ve lost money,&#x201d; there is&#x2026; no state machine. There is no legal requirement to respond with alacrity, no statutorily imposed deadline, no button for a CS rep to push, and no investigation to launch. You will likely be told by a low-paid employee that this is unfortunate and that you should file a police report. The dominant reason for this is that suggesting a concrete action to you gets you off the phone faster, and the call center aggressively minimizes time to resolution of calls and recidivism, where you call back because your problem is not solved. Filing a police report will, in most cases, not restore your money&#x2014;but if it causes you not to call the 1-800 number again, then from the card program manager&#x2019;s perspective <em>this issue has been closed successfully</em>.</p><h2 id=\"why-do-we-choose-this-difference-in-regulation\">Why do we choose this difference in regulation?</h2><p>The people of the United States, through their elected representatives and the civil servants who labor on their behalf, intentionally exempt gift cards from the Reg E regime in the interest of facilitating commerce.</p><p>It is the ordinary and appropriate work of a democracy to include input from citizens in the rulemaking process. The Retail Industry Leaders Association <a href=\"https://rilastagemedia.blob.core.windows.net/rila-web/rila.web/media/media/pdfs/regulatory%20letters/fincen/2011/comments-on-prepaid-access-regulations.pdf?ext=.pdf\"><u>participated</u></a>, explaining to FinCEN that it would be quite burdensome for retailers to fall into KYC scope, etc etc. Many other lobbyists and industry associations made directionally similar comments.</p><p>The Financial Crimes Enforcement Network, for example, has an <a href=\"https://www.fincen.gov/news/news-releases/fincen-issues-prepaid-access-final-rule\"><u>explicit carveout</u></a> in its regulations: while FinCEN will <a href=\"https://www.bitsaboutmoney.com/archive/debanking-and-debunking/\"><u>aggressively police rogue bodegas</u></a>, it has no interest in you if you sell closed-loop gift cards of less than $2,000 face value. This is explicitly to balance the state&#x2019;s interest in law enforcement against, quote, preserving innovation and the many legitimate uses and societal benefits offered by prepaid access, endquote.</p><p>FinCEN&#x2019;s rules clarify that higher-value activity&#x2014;such as selling more than $10,000 in gift cards to a single individual in a day&#x2014;brings sellers back into scope. Given the relatively lax enforcement environment for selling a $500 gift card, you very likely might not build out systems which will successfully track customer identities and determine that the same customer has purchased twenty-one $500 gift cards in three transactions. That likely doesn&#x2019;t rate as a hugely important priority for Q3.&#xa0;</p><p>And so the fraud supply chain comes to learn which firms haven&#x2019;t done that investment, and preferentially suggests those gift cards to their launderers, <a href=\"https://theintercept.com/2018/11/23/bitcoin-gift-card-trading-scams/\"><u>mules</u></a>, <a href=\"https://globalchinapulse.net/moving-bricks-money-laundering-practices-in-the-online-scam-industry/\"><u>brick movers</u></a>, and scam victims.</p><p>And that&#x2019;s why the AARP tells fibs about gift cards: we have, with largely positive intentions and for good reasons, exposed them to less regulation than most formal payment systems in the United States received. That decision has a cost. Grandma sometimes pays it.</p><p>[0] Indeed, there are entire companies which exist to turn gift cards into an alternate financial services platform, explicitly to give unbanked and underbanked customers a payments rail. <a href=\"https://www.paysafe.com/us-en/\"><u>Paysafe</u></a>, for example, is a publicly traded company with thousands of employees, the constellation of regulatory supervision you&#x2019;d expect, and a subsidiary <a href=\"https://www.openbucks.com/company/about/\"><u>Openbucks</u></a> which is designed to give businesses the ability to embed Pay Us With A Cash Voucher in their websites/invoices/telephone collection workflows. This is exactly the behavior that &#x201c;never happens from a legitimate business&#x201d; except when it does by the tens of billions of dollars.</p><p>As Bits about Money has frequently observed, people who write professionally about money&#x2014;including professional advocates for financially vulnerable populations&#x2014;often misunderstand alternative financial services, largely because those services are designed to serve a social class that professionals themselves do not belong to, rarely interact with directly, and do not habitually ask how they pay rent, utilities, or phone bills.</p>"
            ],
            "link": "https://www.bitsaboutmoney.com/archive/gift-card-accountability-sink/",
            "publishedAt": "2025-12-19",
            "source": "Bits About Money",
            "summary": "<img alt=\"The gift card accountability sink\" src=\"https://www.bitsaboutmoney.com/content/images/2025/12/gift-card-accountability-sink.png\" /><p><em>Programming note</em>: <em>Merry Christmas</em>! <em>There will likely be another Bits about Money after the holiday but before New Year. </em></p><p><em>Bits about Money is </em><a href=\"https://www.bitsaboutmoney.com/memberships/\" rel=\"noreferrer\"><em>supported by our readers</em></a><em>. If your education budget or business can underwrite the coming year of public goods in financial-infrastructure education, commentary, and policy analysis, please consider supporting it. I&#x2019;m told this is particularly helpful for policymakers and others who cannot easily expense a subscription, and who benefit from all issues remaining publicly available with no paywall.</em></p><p>The American Association of Retired People (AARP, an advocacy non-profit for older adults) has paid for ads on podcasts I listen to. The ad made a claim which felt raspberry-worthy (in service of an important public service announcement), which they <a href=\"https://www.aarp.org/money/scams-fraud/gift-card-payment/\"><u>repeat in writing</u></a>: <em>Asking to be paid by gift card is always a scam</em>.</p><p>Of course it isn&#x2019;t. Gift cards are a payments rail, and an <em>enormous</em> business independently of being a payments rail. Hundreds of firms will indeed ask you to pay them on gift cards! They also exist, and are marketed, explicitly to do the thing that the AARP implicitly asserts no business or government entity will ever do: provide",
            "title": "The gift card accountability sink"
        },
        {
            "content": [
                "<p>I recently posted <a href=\"https://charity.wtf/2025/12/14/moving-from-wordpress-to-substack/\" rel=\"\">a short note </a>about moving from WordPress to Substack <a href=\"https://charity.wtf/2015/12/27/hello-world/\" rel=\"\">after ten years on WP</a>. A number of people replied, commented, or DM’d me to express their dismay, along the lines of “why are you supporting Nazis?”. A few begged me to reconsider.</p>\n<p>So I did. I paused the work I was doing on migration and setup, and I paused the post I was drafting on Substack. I read the <a href=\"http://leavesubstack.com/\" rel=\"\">LeaveSubstack</a> site, and talked with its author (thank you, Sean 💜). I had a number of conversations with people I consider experts in content creation, and people I consider stakeholders (my coworkers and customers), as well as my own personal Jiminy Cricket, Liz Fong-Jones. I also slept on it.</p>\n<p>I’ve decided to stay.</p>\n<p>I said I would share my thinking once I made a decision, and it comes down to this: I have a job to do, and I haven’t been doing it.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\">\n<source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"302\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21P8j_%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b2baccb-7a3e-46c5-a75f-c5db161df844_800x800.png?resize=302%2C302&#038;ssl=1\" title=\"\" width=\"302\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"></div>\n</div>\n</div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">I have not been doing my job 💔</h2>\n<p>I’ve gone increasingly dark on social media over the past few years, and while this has been delightful from a personal perspective, I have developed an uncomfortable conviction that I have also been abdicating a core function of my job in doing so.</p>\n<p>The world of software is changing—<em>fast</em>. It’s exciting. But it is not enough to have interesting ideas and say them once, or write them down in a single book. You need to be out there mixing it up with the community every day, or at least every week. You need to be experimenting with what language works for people, what lands, what sparks a light in people’s eyes.</p>\n<p>You (by which I mean me) also need to be <em>listening</em> more— reading and interacting with other people’s thoughts, volleying back and forth, polishing each other like diamonds.</p>\n<p><em>How many times </em>did we define observability or high cardinality or the sins of aggregation? Cool. How many times have we talked about the ways that AI has made the honeycomb vision technologically realizable for the first time? Uh, less, by an order of thousands.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\">\n<source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"340\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21s9aw%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F39c68c93-92f2-46fd-a585-e62956cda3b3_1222x1402.jpeg?resize=297%2C340&#038;ssl=1\" title=\"\" width=\"297\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"></div>\n</div>\n</div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">Write more, engage with mainstream tech</h2>\n<p>My primary goal is to get back into the mainstream of technical discussion and mix it up a lot more. Unfortunately, to the extent there is a tech mainstream, it still exists on X. I am not ruling out the possibility of returning, but I would strongly prefer not to. I’m going to see if I can do my job by being much more active on LinkedIn and Substack.</p>\n<p>My secondary goal is to remove friction and barriers to posting. WordPress just feels so heavyweight. Like I’m trying to craft a web page, not write a quick post. Substack feels more like writing an email. I’ve been trying to make myself post more all year on WP, and it hasn’t happened. I have a lot of shit backed up to talk about, and I think this will help grease the wheels.</p>\n<p>There are platforms that are outside the pale, that exist solely to platform and support Nazis and violent extremists—your Gabs, your Parlers. Substack is <em>very</em> far from being one of those. All of these content platforms exist on some continuum of grey, and governance is hard, hard, hard in an era of mainstreaming right wing extremism.</p>\n<p>Substack may not make all the decisions I would make, but I feel like it is a light dove grey, all things considered.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\">\n<source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"304\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21AQYt%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcc6a358e-9654-44a8-9f91-0e3dafddb0f4_1024x1024.png?resize=304%2C304&#038;ssl=1\" width=\"304\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"></div>\n</div>\n</div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">Some mitigations</h2>\n<div class=\"pencraft pc-display-flex pc-alignItems-center pc-position-absolute pc-reset header-anchor-parent\">\n<div class=\"pencraft pc-display-contents pc-reset pubTheme-yiXxQA\">\n<div class=\"pencraft pc-reset header-anchor offset-top\" id=\"§some-mitigations\"></div>\n<p>I have received some tips and done some research on how to minimize the value of my writing to Substack. Here they are.</p>\n</div>\n</div>\n<ul>\n<li>Substack makes money from paid subscriptions, so I don’t accept money. Ever.</li>\n<li>I am told that if you use email or RSS, it benefits Substack less than if you use the app. <a href=\"http://charitydotwtf.substack.com/feed\" rel=\"\">RSS feed here</a>.</li>\n<li>I will set up an auto-poster from Substack to WordPress (at some point… probably whenever I find the time to fix the url rewriter and change domain pointer)</li>\n</ul>\n<p>I hope these will allow conscientous objectors continue to read and engage with my work, but I also understand if not.</p>\n<p>A vegan friend of mine once used an especially vivid metaphor to indignantly tell us why no, he could NOT just pick the meat and dairy off his plate and eat the vegetables and grains left behind (they were <em>not</em> cooked together). He said, “If somebody shit on your plate, would you just <em>pick the shit off</em> and keep eating?”</p>\n<p>So. If Substack is the shit in your social media plate, and you feel morally obligated to reject anything that has ever so much as touched the domain, I can respect that.</p>\n<p>Everyone has to decide which battles are theirs to fight. This one is not mine.</p>\n<p>💜💙💚💛🧡❤️💖,<br />\ncharity.</p>"
            ],
            "link": "https://charity.wtf/2025/12/19/hello-world-xpost-from-substack/",
            "publishedAt": "2025-12-19",
            "source": "Charity Majors",
            "summary": "I recently posted a short note about moving from WordPress to Substack after ten years on WP. A number of people replied, commented, or DM’d me to express their dismay, along the lines of “why are you supporting Nazis?”. A few begged me to reconsider. So I did. I paused the work I was doing on migration and [&#8230;]",
            "title": "Hello World (xpost from substack)"
        },
        {
            "content": [],
            "link": "https://overreacted.io/introducing-rsc-explorer/",
            "publishedAt": "2025-12-19",
            "source": "Dan Abramov",
            "summary": "My new hobby project.",
            "title": "Introducing RSC Explorer"
        },
        {
            "content": [
                "<h3 id=\"the-year-we-used-tools\">The Year We Used Tools</h3>\n\n<p>I was poking around <a href=\"https://github.com/BerriAI/litellm\">LiteLLM’s Github repository</a> and stumbled upon an interesting file. <a href=\"https://github.com/BerriAI/litellm/blob/main/model_prices_and_context_window.json\"><code class=\"language-plaintext highlighter-rouge\">model_prices_and_context_window.json</code></a> is a registry of all the models and inference providers you can call with LiteLLM. This is the core value of <a href=\"https://www.litellm.ai\">LiteLLM</a>, wrapping this diverse array of models behind a consistent yet capable API, allowing applied AI builders to swap out models and providers without a major code rewrite.</p>\n\n<p>This registry file is impressive, and well communicates the value of LiteLLM. It’s over 30,000 lines detailing over 2,000 model and provider combinations. At the top of the JSON file, LiteLLM provides a <code class=\"language-plaintext highlighter-rouge\">sample_spec</code>, their schema for the information they store for each model. Curious, I poked into the repository’s commit history to see how this schema has evolved over the months.</p>\n\n<p>And boy if this isn’t the story of LLMs in 2025:</p>\n\n<p><img alt=\"\" src=\"https://www.dbreunig.com/img/litellm_schema_2025.jpg\" /></p>\n\n<p>On the left is the schema on January 1st, 2025. On the right is the schema today. The orange lines were added in 2025. The schema has doubled in size, as more and more tools and logic has been embedded in models and their providers. We aren’t just asking for text completion or chat, a good chunk of us are now hitting a single endpoint that can execute code, use a computer, manipulate files, and search the web. These types of calls are being made to an appliance, not a function, complete with its own environment to complete a task.</p>\n\n<p>2025 may not have been the year of the agent, but perhaps it was the year of the tool.</p>\n\n<p>Now, of course, this isn’t everyone. Such an appliance is essentially a blackbox that is difficult to eek reliability out of, if your agent or application is struggling. We still have and use ‘naked’ inference calls all the time.</p>\n\n<p>But for human-in-the-loop chat apps, the surface area of what happens behind a model call is growing in size and structure.</p>"
            ],
            "link": "https://www.dbreunig.com/2025/12/19/how-model-use-has-changed-in-2025.html",
            "publishedAt": "2025-12-19",
            "source": "Drew Breunig",
            "summary": "We aren't just asking for text completion or chat, a good chunk of us are now hitting a single endpoint that can execute code, use a computer, manipulate files, and search the web.",
            "title": "How Model Use Has Changed in 2025"
        },
        {
            "content": [
                "<p>I've been working through some testing of OpenAI's new skills support in their codex CLI tool.</p>\n<p>Skills are currently gated behind a feature flag. You turn them on by running <code>codex --enable skills</code>.</p>\n<p>As I was trying to debug why a skill I'd installed wasn't triggering, Codex told me a bit about its' &quot;Discovery&quot; skill.</p>\n<p>Claude Code finds skills in the <code>skills</code> subdirectories of installed plugins and the <code>skills</code> directory of your <code>.claude</code> directory at startup. It then shoves those into the system prompt as a list of available skills. At least the last time I looked, there was no way to enable specific skills for specific projects or subdirectories.</p>\n<p>It looks like Codex is doing something very different. It allows you to list additional skills in project documentation. I think I like this?</p>\n<p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251219-100316.png\"><img alt=\"pasted image 20251219 100316\" src=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251219-100316.png\" /></a></p>\n<p>OpenAI ship some &quot;global&quot; skills in <code>~/.codex/skills/.system</code> - a 'plan' skill and a 'skill-creator' skill. You can drop your own global skills into <code>~/.codex/skills/</code>.  And because it looks like they're just using a system prompt, the &quot;Discovery&quot; meta-skill, and the &quot;File read&quot; tool rather than custom skill tools, any sort of directory layout inside <code>~/.codex/skills/</code> works. They're just looking for any directory in that tree with a 'SKILL.md' file and going from there.</p>\n<p>This is Codex's detailed description of what's going on. (You can likely find the 'real' version of this in the publicly available source code.)</p>\n<pre><code>  The complete “Discovery” entry I have in this chat is:\n\n  - Skill Creator: Guide for creating effective skills. This skill should be\n    used when users want to create a new skill (or update an existing skill)\n    that extends Codex's capabilities with specialized knowledge, workflows, or\n    tool integrations. (file: /Users/jesse/.codex/skills/.system/skill-creator/\n    SKILL.md)\n  - plan: Plan lifecycle management for Codex plans stored in $CODEX_HOME/plans\n    (default ~/.codex/plans). Use when a user asks to create, find, read,\n    update, delete, or manage plan documents for implementation work or\n    overview/reference documentation. (file: /Users/jesse/.codex/skills/.system/\n    plan/SKILL.md)\n  - Discovery: Available skills are listed in project docs and may also appear\n    in a runtime &quot;## Skills&quot; section (name + description + file path). These are\n    the sources of truth; skill bodies live on disk at the listed paths.\n  - Trigger rules: If the user names a skill (with $SkillName or plain text) OR\n    the task clearly matches a skill's description, you must use that skill for\n    that turn. Multiple mentions mean use them all. Do not carry skills across\n    turns unless re-mentioned.\n  - Missing/blocked: If a named skill isn't in the list or the path can't be\n    read, say so briefly and continue with the best fallback.\n  - How to use a skill (progressive disclosure):\n      1. After deciding to use a skill, open its SKILL.md. Read only enough to\n         follow the workflow.\n      2. If SKILL.md points to extra folders such as references/, load only the\n         specific files needed for the request; don't bulk-load everything.\n      3. If scripts/ exist, prefer running or patching them instead of retyping\n         large code blocks.\n      4. If assets/ or templates exist, reuse them instead of recreating from\n         scratch.\n  - Description as trigger: The YAML description in SKILL.md is the primary\n    trigger signal; rely on it to decide applicability. If unsure, ask a brief\n    clarification before proceeding.\n  - Coordination and sequencing:\n      - If multiple skills apply, choose the minimal set that covers the request\n        and state the order you'll use them.\n      - Announce which skill(s) you're using and why (one short line). If you\n        skip an obvious skill, say why.\n  - Context hygiene:\n      - Keep context small: summarize long sections instead of pasting them;\n        only load extra files when needed.\n      - Avoid deeply nested references; prefer one-hop files explicitly linked\n        from SKILL.md.\n      - When variants exist (frameworks, providers, domains), pick only the\n        relevant reference file(s) and note that choice.\n  - Safety and fallback: If a skill can't be applied cleanly (missing files,\n    unclear instructions), state the issue, pick the next-best approach, and\n    continue.\n\n</code></pre>"
            ],
            "link": "https://blog.fsck.com/2025/12/19/codex-skills/",
            "publishedAt": "2025-12-19",
            "source": "Jesse Vincent",
            "summary": "<p>I've been working through some testing of OpenAI's new skills support in their codex CLI tool.</p> <p>Skills are currently gated behind a feature flag. You turn them on by running <code>codex --enable skills</code>.</p> <p>As I was trying to debug why a skill I'd installed wasn't triggering, Codex told me a bit about its' &quot;Discovery&quot; skill.</p> <p>Claude Code finds skills in the <code>skills</code> subdirectories of installed plugins and the <code>skills</code> directory of your <code>.claude</code> directory at startup. It then shoves those into the system prompt as a list of available skills. At least the last time I looked, there was no way to enable specific skills for specific projects or subdirectories.</p> <p>It looks like Codex is doing something very different. It allows you to list additional skills in project documentation. I think I like this?</p> <p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251219-100316.png\"><img alt=\"pasted image 20251219 100316\" src=\"https://blog.fsck.com/assets/2025/12/pasted-image-20251219-100316.png\" /></a></p> <p>OpenAI ship some &quot;global&quot; skills in <code>~/.codex/skills/.system</code> - a 'plan' skill and a 'skill-creator' skill. You can drop your own global skills into <code>~/.codex/skills/</code>. And because it looks like they're just using a system prompt, the &quot;Discovery&quot; meta-skill, and the &quot;File read&quot; tool rather than custom skill tools, any sort of directory layout inside <code>~/.codex/skills/</code> works. They're",
            "title": "Skills in OpenAI Codex"
        },
        {
            "content": [],
            "link": "https://interconnected.org/home/2025/12/19/filtered",
            "publishedAt": "2025-12-19",
            "source": "Matt Webb",
            "summary": "<div> <h3>1.</h3> <p><a href=\"https://jamiefreeman.news/why-were-all-the-bells-in-the-world-removed-the-forgotten-power-of-sound-and-frequency/\">Why Were All the Bells in the World Removed? The Forgotten Power of Sound and Frequency</a> (Jamie Freeman).</p> <p>Church bells: <em>\"something strange happened in the 19th and 20th centuries: nearly all of the world’s ancient bells were removed, melted down, or destroyed.\"</em></p> <p>(I don’t know whether that’s true, but go with it for a second.)</p> <blockquote> <p>Why? Mainstream historians attribute this mass removal to wars and the need for metal, but when you dig deeper, the story doesn’t add up.</p> </blockquote> <p>An explanation:</p> <blockquote> <p>Some theorists believe that these bells were part of a Tartarian energy grid, designed to harmonise human consciousness, balance electromagnetic fields, and even generate free energy. Removing the bells would have disrupted this energy network, cutting us off from an ancient technology we no longer understand.</p> </blockquote> <p>Tartarian?</p> <p><a href=\"https://en.wikipedia.org/wiki/Tartarian_Empire\">Tartarian Empire</a> (Wikipedia):</p> <blockquote> <p>Tartary, or Tartaria, is a historical name for Central Asia and Siberia. Conspiracy theories assert that Tartary, or the Tartarian Empire, was a lost civilization with advanced technology and culture.</p> </blockquote> <h3>2.</h3> <p><a href=\"https://www.ancient-origins.net/ancient-places-asia/risky-wealth-would-you-dare-open-mysterious-sealed-door-padmanabhaswamy-temple-021616\">Risky Wealth: Would You Dare to Open the Mysterious Sealed Door of Padmanabhaswamy Temple?</a> (Ancient Origins).</p> <p><em>\"The Padmanabhaswamy Temple is a Hindu temple situated in Thiruvananthapuram, Kerala,",
            "title": "Filtered for conspiracy theories"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/12/19/style/modern-love-revenge-of-the-people-pleaser.html",
            "publishedAt": "2025-12-19",
            "source": "Modern Love - NYT",
            "summary": "After being assaulted, I worked for years to make myself invisible. Ryan saw me anyway.",
            "title": "The Revenge of the People Pleaser"
        },
        {
            "content": [
                "<p><strong>I.</strong></p><p>Hating Boomers is the new cool thing. Amazon offerings include <em><a href=\"https://www.amazon.com/A-Generation-of-Sociopaths-audiobook/dp/B01N5VLZNN/\">A Generation Of Sociopaths: How The Baby Boomers Betrayed America</a>,</em> the two apparently unrelated books <em><a href=\"https://www.amazon.com/dp/1848872321/\">How The Boomers Took Their Children&#8217;s Future</a></em> and <em><a href=\"https://www.amazon.com/dp/1541742362/\">How The Boomers Stole Millennials&#8217; Future</a></em>, and <em><a href=\"https://www.amazon.com/Boomers-Promised-Freedom-Delivered-Disaster/dp/0593086759\">Boomers: The Men And Women Who Promised Freedom But Delivered Disaster</a></em>. &#8220;You don&#8217;t hate Boomers enough&#8221; <a href=\"https://x.com/search?q=%22you%20don%27t%20hate%20boomers%20enough%22&amp;src=typed_query\">has become a popular Twitter catchphrase. </a>Richard Hanania, who has tried hating every group once, has decided that hating Boomers <a href=\"https://www.richardhanania.com/p/start-demagoguing-against-the-old\">is his favorite</a>. </p><p>Some people might say we just experienced a historic upwelling of identity politics, that it was pretty terrible for everyone involved, and that perhaps we need a new us-vs-them conflict like we need a punch to the face. This, the Boomer-haters will tell you, would be a mistaken generalization. <em>This time</em>, we have finally discovered a form of identity politics which carves reality at its joints, truly separating the good and bad people.</p><p>I think these arguments fall short. Even if they didn&#8217;t, the usual bias against identity politics should make us think twice about pursuing them too zealously. </p><p><strong>II.</strong></p><p>Why, exactly, are Boomers so bad?</p><p>Zooming out, it seems sort of like Boomers have delivered the greatest period of peace and prosperity in history: global, American, take your pick. The window of Boomer dominance, c. 1980 - 2010, saw the fall of Communism, steadily rising incomes, steadily growing life expectancy, and no foreign wars bigger than Iraq (total American death toll: 4,500). </p><p>The Boomers could reasonably blame their Greatest Generation fathers for sending them to die in Vietnam. Those Greatest Generation fathers could reasonably blame <em>their </em>fathers for plunging the country into a Great Depression. In comparison, we&#8217;re mad about - what, exactly? Higher housing prices? Hardly seems World-War-level bad.</p><p>Earlier this month, we investigated <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted\">the Vibecession</a>: the economists&#8217; claim that, despite everyone thinking the economy is bad, actually, the economy is good. We reached no firm conclusion, but in the process, we dug up <a href=\"https://x.com/besttrousers/status/1987478944681951276\">this chart</a>:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!dds-!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F67c591eb-cca5-40c3-980c-4da6d2f7e98f_333x387.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"468.35135135135135\" src=\"https://substackcdn.com/image/fetch/$s_!dds-!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F67c591eb-cca5-40c3-980c-4da6d2f7e98f_333x387.jpeg\" title=\"\" width=\"403\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>&#8230;which shows that Millennials and Generation Z have more money (adjusted for inflation ie cost-of-living, and compared at the same age) than their Boomer parents, to about the same degree that the Boomers exceeded their own parents. This is good and how it should be. The Boomers have successfully passed on a better life to their children. </p><p>The liberals make fun of Schrodinger&#8217;s Immigrant, who is both a lazy welfare parasite and also stealing your job. But equally sinister is Schrodinger&#8217;s Boomer, who destroyed America through being simultaneously too far right and too far left.  Progressives accuse Boomers of instituting market-worshipping <a href=\"https://branko2f7.substack.com/p/defeated-by-the-real-world\">neoliberalism</a>, failing the challenge of <a href=\"https://www.eli.org/vibrant-environment-blog/okay-boomer-young-adults-and-climate-future-they-face\">climate change,</a> and resisting the arc of history on issues like trans rights and Palestine. But conservatives accuse the same Boomers of <a href=\"https://lawliberty.org/forum/the-managerial-tyranny-of-boomer-environmentalism/\">overregulating</a> everything in the name of &#8220;the environment&#8221;, shutting down the nuclear plants, and starting the trend towards &#8220;gay race communism&#8221; with their hippy-dippy 60s values. </p><p>In reality, the difference between generations on any of these things is barely noticeable.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!rtpv!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3fe76f30-02f7-4543-b799-a12659b976ac_571x232.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"232\" src=\"https://substackcdn.com/image/fetch/$s_!rtpv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3fe76f30-02f7-4543-b799-a12659b976ac_571x232.png\" width=\"571\" /><div></div></div></a><figcaption class=\"image-caption\">Sources: <a href=\"https://climatecommunication.yale.edu/publications/do-younger-generations-care-more-about-global-warming/\">1</a>, <a href=\"https://www.bisconti.com/blog/public-opinion-2023\">2</a>, <a href=\"https://www.thecivicscenter.org/blog/youth-voting-in-2024-election\">3</a></figcaption></figure></div><p>It&#8217;s not even clear that Boomers are that much more likely to be NIMBYs. From Pew:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!wf8x!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F04a7f2e8-2f78-4441-9620-6549bf9abc86_774x644.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"532.5064599483204\" src=\"https://substackcdn.com/image/fetch/$s_!wf8x!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F04a7f2e8-2f78-4441-9620-6549bf9abc86_774x644.png\" width=\"640\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">Source: selected the most interesting questions from <a href=\"https://www.pew.org/en/research-and-analysis/articles/2025/08/15/policies-that-allow-more-homebuilding-can-help-older-adults\">here</a>. If you&#8217;re worried that this is too theoretical and want to see numbers for a live proposal, here&#8217;s what people think of <a href=\"https://report.growsf.org/p/74-support-luries-family-zoning-plan\">a particular San Francisco upzoning plan</a>:</figcaption></figure></div><p>And this is all focusing on the anti-Boomer-ists&#8217; chosen topics. You can find others where the Boomers look downright saintly compared to their kids:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!ooi2!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbcb69933-f767-4a8c-8007-795b4c271b83_568x343.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"343\" src=\"https://substackcdn.com/image/fetch/$s_!ooi2!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbcb69933-f767-4a8c-8007-795b4c271b83_568x343.png\" width=\"568\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">Source: <a href=\"https://iop.harvard.edu/press-releases/nearly-two-thirds-young-americans-fearful-about-future-democracy-america-harvard\">1</a>, <a href=\"https://ohiocapitaljournal.com/2025/05/15/from-defenders-to-skeptics-the-sharp-decline-in-young-americans-support-for-free-speech/\">2</a>, <a href=\"https://www.reddit.com/r/dataisbeautiful/comments/1449mho/oc_american_adults_attitudes_towards_political/\">3</a></figcaption></figure></div><p>I don&#8217;t think the Boomer-Millennial difference in most political opinions is big enough to matter much either way. </p><p><strong>III.</strong></p><p>There&#8217;s a more developed theory of Boomer-hating. The more developed theory goes: Boomers are plundering the young. We know this, because their share of resources is high and keeps increasing. They use their large population share and good voter turnout to vote themselves ever-higher pensions at the expense of working taxpayers.</p><p>How might we investigate this theory? We can&#8217;t use total social security spending, because the number of elderly has gone up. Can we use social security spending per elderly person? No; the amount of social security paid out depends on the amount paid in. If each year&#8217;s retirees earned more during their career than the previous year&#8217;s did (this is true), then each year&#8217;s will get a higher SSI payment, even if the system&#8217;s &#8220;generosity&#8221; stays the same.</p><p>We might start by looking at change in social security payment divided by change in median income. Over the past fifty years, average Social Security payment in inflation-adjusted dollars <a href=\"https://www.reddit.com/r/dataisbeautiful/comments/1ctkh6m/average_social_security_payment_19672023_oc/\">increased 60%</a>. If we expect these payments to reflect earnings twenty years before disbursement, we can look at real median personal income from 1953 to 2003; this also <a href=\"https://politicalcalculations.blogspot.com/2012/12/the-discovery-of-unseen.html\">also increased 60%</a>. There is no increase in generosity.</p><p>Or we can just look at the history. The Social Security Administration&#8217;s <a href=\"https://www.ssa.gov/history/benefittypes.html\">own website</a> says that its generosity peaked in 1972, when the program primarily served the Greatest Generation; since then, it&#8217;s been one contraction after another. In 1983, the government increased the full retirement age from 65 to 67; in 1993, they made Social Security more taxable. Since then, most of the changes have been cost-of-living increases, which are indexed to inflation and not the result of active lobbying on old people&#8217;s behalf.</p><p>Why do so many believe that old people have discovered a vote-themselves-infinite-benefits hack? Since old people represent an increasing fraction of the population, are living longer, and face a secular trend of rising healthcare costs, even when their benefits per capita per year are stable or declining the government will spend more money on them as a group. This spending is indeed rapidly becoming unsustainable, the elderly will need to accept big benefit cuts to make it sustainable again, and they are resisting those cuts.</p><p>So have we finally discovered the fabled Boomer selfishness? Call it what you want. But remember that the Boomers did pay money into Social Security to support their own parents, believing that they would be supported in turn. Learning that yours is the generation where the pyramid collapses is a hard pill to swallow. Maybe they should suck it up and take the sacrifice. You&#8217;d do this, right? Voluntarily give up money which is yours by right, in order to help other generations? Oh, sorry, you didn&#8217;t hear the question, you were too busy writing your 500th &#8220;You don&#8217;t hate Boomers enough, why won&#8217;t they hurry up and die, we need to declare intergenerational warfare and seize our rightful inheritance&#8221; post.</p><p><strong>IV.</strong></p><p>Maybe I&#8217;m wrong about all of this. There are different ways to analyze the data. For example, Medicare Part D is a genuine expansion of healthcare to the old - albeit one passed at a time when it benefited Silent Generationers instead of Boomers. I counted it under &#8220;healthcare is getting more expensive so we need more healthcare programs&#8221;, but maybe I shouldn&#8217;t have. Maybe it&#8217;s greed. And what about Europe? I hear the pension situation is even worse there, maybe the Boomers there are greedy, and I&#8217;m missing it due to my Americocentrism.</p><p>If that&#8217;s so, my question becomes: do we really want to do this again?</p><p>Consider <a href=\"https://www.wusf.org/politics-issues/2025-11-01/florida-legislature-begins-review-efforts-reduce-eliminate-property-taxes\">the campaign against property taxes</a>, another purported example of Boomer malevolence (I couldn&#8217;t find polling on this, so I didn&#8217;t include it above). If the polls come in, and they prove that it&#8217;s disproportionately supported by Boomers, does this prove their greed and selfishness? After all, Boomers own most of the property, so shifting the tax burden elsewhere directly benefits them.</p><p>I&#8217;ll answer this question with a question: suppose that the polls show that support is concentrated among white people. This is very likely true; white people are <a href=\"https://www.pewresearch.org/politics/wp-content/uploads/sites/4/2018/01/1-24-18-Taxes-release-1.pdf\">usually </a>the biggest tax cut proponents. And we know white people on average own more property than black people, and therefore stand to benefit more. Does this make the tax cuts a form of race warfare? A perpetuation of white supremacy? An example of greedy white people trying to keep minorities down for their own selfish gain? You sure can find one billion people talking about how tax cuts are racially biased or opposed to equity or something (<a href=\"https://journalistsresource.org/economics/tax-policy-racial-ethnic-bias/\">1</a>, <a href=\"https://www.pbs.org/newshour/show/how-tax-laws-disadvantage-black-americans-but-subsidize-white-americans\">2</a>, <a href=\"https://publicintegrity.org/inequality-poverty-opportunity/taxes/unequal-burden/how-four-decades-of-tax-cuts-fueled-inequality/\">3</a>, <a href=\"https://www.nmvoices.org/archives/17862\">4</a>, <a href=\"https://itep.org/trump-and-congress-tax-package-likely-to-worsen-racial-inequities/\">5</a>, <a href=\"https://publicintegrity.org/inequality-poverty-opportunity/how-trumps-tax-cuts-favor-whites-over-minorities/\">6</a>, <a href=\"https://www.nytimes.com/2018/10/11/business/trump-tax-cuts-white-americans.html\">7</a>, <a href=\"https://ncbudget.org/corporate-tax-cuts-worsen-racial-inequality-in-north-carolina-and-us/\">8</a>, <a href=\"https://calbudgetcenter.org/resources/last-years-federal-tax-law-exacerbates-the-racial-wealth-gap/\">9</a>, <a href=\"https://www.nmvoices.org/wp-content/uploads/2023/03/Tax-equity-fact-sheet.pdf\">10</a>, etc)</p><p>It&#8217;s no devastating rebuttal to declare oneself tired of something. Still, I&#8217;m tired of this. After a decade of this discussion, I think many people are ready to stop thinking of every policy in terms of <a href=\"https://en.wikipedia.org/wiki/Who,_whom%3F\">who-whom</a>, and ready to discuss other facets like whether it overall increases or decreases net welfare, or how it manages the tradeoff between individual freedom and the public good. I think the decade we spent turning everything into identity politics resulted in worse policy than we got back when we were more reluctant to do that. Everyone knows that some groups are richer than others, that the rich groups are more likely to oppose redistribution, and that the poor groups more often support it. You can reframe this as a story of whites vs. blacks, or Boomers vs. Millennials, or the educated elite vs. the working class, or the abled vs. the disabled, or Jews vs. Gentiles, or any of a thousand other dichotomies that all correlate with wealth and with one another. Is this valuable? Does it dry a single human tear? I haven&#8217;t noticed.</p><p>But it gets worse. Consider the way that &#8220;capitalism&#8221; gets used in socialist spaces. Although there are still a few classical Marxists with a clear conception of what capitalism is and why they hate it, most lefties just use &#8220;capitalism&#8221; to mean <em>*gestures around expansively at everything*</em>, with no concern about whether it involves market processes at all. Israel bombing Palestine? That&#8217;s capitalism. Trump arresting immigrants? Somehow that&#8217;s capitalism too. It&#8217;s true that our society is very capitalist, and that capitalism touches <em>in some way</em> upon almost everything. But that gets laundered into an excuse to believe you&#8217;re being a good communist by hating everything about everything.</p><p>In the same way, 60% of Americans are white. The white fraction of the most powerful Americans, and among the forebears who got us into this position, is even higher. Say that you hate everything, and you sound like a nihilist who is hard to take seriously. But say that you hate &#8220;white people&#8221;, or &#8220;white culture&#8221;, or &#8220;whiteness&#8221;, and this is broad enough to give you an excuse to hate every specific thing, without having to admit you are doing this.</p><p>This is my true objection to the term &#8220;Boomer&#8221;. By this point, every institution in the world is either run by Boomers, used to be run by Boomers, or was shaped by Boomers in some way. It&#8217;s a cheap way of hating everything. </p><p>One might argue that at least anti-Boomerism has a time limit; at some point they&#8217;ll be gone and people will have to blame something else. Still, this is a double-edged sword. You shouldn&#8217;t be racist or sexist. But if you have to be one or the other, be racist. You can be racist purely and honestly, but if you&#8217;re hetero, then sexism will inevitably make you miserable: it can&#8217;t help but be a love-hate relationship. Yet ageism is even worse: you are doomed to one day become what you hate. You may never be a Boomer. But you will be in the position, vis-a-vis the younger generation, that the Boomers are in now. Hopelessly uncool, increasingly distant from the engines of memetogenesis, sitting upon assets that you are not at this moment using for market labor or family formation and which could easily be redistributed to others. Is it too hard to believe that the decisions you make now about stereotypes and identities and the level of respect due to elders will stick around a few decades?</p><p>What will our children think of Millennials and Zoomers? Might they get mad about wokeness and the pillaging of the American education system for temporary political cred? What about Trump, DOGE, and the decline of federal state capacity? Any of these seems worse than whatever happened in the Boomers&#8217; heyday. The US has a way of bouncing back; maybe it&#8217;ll happen again. Still, the Boomers can boast that they passed on a better life to their children. How sure are you that you&#8217;ll be able to say the same? </p><p>I think a fair analysis by some sort of unbiased far-future historian might well conclude that Boomers were a perfectly normal American generation, maybe a little too fond of cringe Minion memes but otherwise decent enough; on the other hand, Millennials and Zoomers were some sort of mutant nightmare people. I hope my grandkids, if I have them, will love me anyway. Nobody ever controls that; nobody can ever know for sure. But I think respecting Boomers would be a good start.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/against-against-boomers",
            "publishedAt": "2025-12-19",
            "source": "SlateStarCodex",
            "summary": "<p><strong>I.</strong></p><p>Hating Boomers is the new cool thing. Amazon offerings include <em><a href=\"https://www.amazon.com/A-Generation-of-Sociopaths-audiobook/dp/B01N5VLZNN/\">A Generation Of Sociopaths: How The Baby Boomers Betrayed America</a>,</em> the two apparently unrelated books <em><a href=\"https://www.amazon.com/dp/1848872321/\">How The Boomers Took Their Children&#8217;s Future</a></em> and <em><a href=\"https://www.amazon.com/dp/1541742362/\">How The Boomers Stole Millennials&#8217; Future</a></em>, and <em><a href=\"https://www.amazon.com/Boomers-Promised-Freedom-Delivered-Disaster/dp/0593086759\">Boomers: The Men And Women Who Promised Freedom But Delivered Disaster</a></em>. &#8220;You don&#8217;t hate Boomers enough&#8221; <a href=\"https://x.com/search?q=%22you%20don%27t%20hate%20boomers%20enough%22&amp;src=typed_query\">has become a popular Twitter catchphrase. </a>Richard Hanania, who has tried hating every group once, has decided that hating Boomers <a href=\"https://www.richardhanania.com/p/start-demagoguing-against-the-old\">is his favorite</a>. </p><p>Some people might say we just experienced a historic upwelling of identity politics, that it was pretty terrible for everyone involved, and that perhaps we need a new us-vs-them conflict like we need a punch to the face. This, the Boomer-haters will tell you, would be a mistaken generalization. <em>This time</em>, we have finally discovered a form of identity politics which carves reality at its joints, truly separating the good and bad people.</p><p>I think these arguments fall short. Even if they didn&#8217;t, the usual bias against identity politics should make us think twice about pursuing them too zealously. </p><p><strong>II.</strong></p><p>Why, exactly, are Boomers so bad?</p><p>Zooming out, it seems sort of like Boomers have delivered the greatest",
            "title": "Against Against Boomers"
        },
        {
            "content": [
                "<p>People remember their childhood world too fondly.</p>\n<p>You adapt to it. You forget the parts that sucked, many of which sucked rather really badly. It resonates with you and sticks with you. You think it was better.</p>\n<p>This is famously true for music, but also in general, including places it makes no sense like ‘most reliable news reporting.’</p>\n<blockquote><p><a href=\"https://x.com/mattyglesias/status/1997030575941865926\">Matthew Yglesias:</a> Regardless of how old they are, people tend to think that things were better when they were young.</p>\n<p>As a result, you’d expect more negativity as the median age goes up and up.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!KZwV!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb3bdce91-9a32-4285-85df-9dac83cc6630_664x1230.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Very obviously these views are not objective.</p>\n<div>\n\n\n<span id=\"more-24968\"></span>\n\n\n</div>\n<p>As a fun and also useful exercise, as part of the affordability sequence, now that we’ve <a href=\"https://thezvi.substack.com/p/the-140000-question?r=67wny\"><strong>looked at claims of modern impoverishment</strong></a> and <a href=\"https://thezvi.substack.com/p/the-140k-question-cost-changes-over?r=67wny\"><strong>asked when things were cheaper</strong></a>, it’s time to ask ourselves: When were various things really at their best?</p>\n<p>In some aspects, yes, the past was better, and those aspects are an important part of the picture. But in many others today is the day and people are wrong about this.</p>\n<p>I’ll start with the things on the above graph, in order, include some claims from another source, and also include a few important other considerations that help set up the main thesis of the sequence.</p>\n\n\n<h4 class=\"wp-block-heading\">The Most Close-Knit Communities</h4>\n\n\n<p>Far in the past. You wouldn’t like how they accomplished it, but they accomplished it.</p>\n<p>The top candidates for specific such communities are either:</p>\n<ol>\n<li>Hunter-gatherer bands.</li>\n<li>Isolated low-tech villages that all share an intense mandatory religion.</li>\n<li>Religious minority ethnic enclave communities under severe external threat.</li>\n</ol>\n<p>You’re not going to match that without making intensive other sacrifices. Nor should you want to. Those communities were too close-knit for our taste.</p>\n<p>In terms of on average most close knit communities in America, it’s probably right after we closed the frontier, so around 1900?</p>\n<p>Close-knit communities, on a lesser level that is now rare, are valuable and important, but require large continuous investments and opportunity costs. You have to frequently choose engagement with a contained group over alternatives, including when those alternatives are otherwise far superior. You also, to do this today, have to engineer conditions to make the community possible, because you’re not going to be able to form one with whoever happens to live in your neighborhood.</p>\n<p>Intentional communities are underrated, as is simply coordinating to live near your friends. I highly recommend such things, but <a href=\"https://www.lesswrong.com/posts/P6fSj3t4oApQQTB7E/coordination-as-a-scarce-resource\">coordination is hard</a>, and they are going to remain rare.</p>\n\n\n<h4 class=\"wp-block-heading\">The Most Moral Society</h4>\n\n\n<p>I’m torn between today and about 2012.</p>\n<p>There are some virtues and morals that are valuable and have been largely lost. Those who remember the past fondly focus on those aspects.</p>\n<p>One could cite, depending on your comparison point, some combination of loyalty to both individuals, groups and institutions, honor and personal codes, hospitality, respect for laws and social norms, social trust, humility, some forms of mercy and forgiveness, stoicism, courage, respect for the sacred and adherence to duty and one’s commitments, especially the commitment to one’s family, having better and higher epistemic and discourse norms, plus religiosity.</p>\n<p>There’s varying degrees of truth in those.</p>\n<p>But they pale in comparison to the ways that things used to be terrible. People used to have highly exclusionary circles of concern. By the standards of today, until very recently and even under relatively good conditions, approximately everyone was horribly violent and tolerant of violence and bullying of all kinds, cruel to animals, tolerant of all manner of harassment, rape and violations of consent, cruel, intolerant, religiously intolerant often to the point of murder, drunk out of their minds, discriminatory, racist, sexist, homophobic, transphobic, neglectful, unsafe, physically and emotionally abusive to children including outright torture and frequent sexual abuse, and distrustful and dishonest dealing with strangers or in commerce.</p>\n<p>It should be very clear which list wins.</p>\n<p>This holds up to the introduction of social media, at which point some moral dynamics got out of control in various ways, on various sides of various questions, and many aspects went downhill. There were ways in which things got absolutely nuts. I’m not sure if we’ve recovered enough to have fully turned that around.</p>\n\n\n<h4 class=\"wp-block-heading\">The Least Political Division</h4>\n\n\n<p>Within recent memory I’m going to say 1992-1996, which is the trap of putting it right in my teenage years. But I’m right. This period had extraordinarily low political division and partisanship.</p>\n<p>On a longer time frame, the correct answer is the Era of Good Feelings, 1815-1825.</p>\n<p>The mistake people make is to think that today’s high level of political division is some outlier in American history. It isn’t.</p>\n\n\n<h4 class=\"wp-block-heading\">The Happiest Families</h4>\n\n\n<p>Good question. The survey data says 1957.</p>\n<p>I also don’t strongly believe it is wrong, but I don’t trust survey data to give the right answer on this, for multiple reasons.</p>\n<p>Certainly a lot more families used to be intact. That does not mean they were happy by our modern understanding of happy. The world of the 1950s was quite stifling. A lot of the way families stayed intact was people pretended everything was fine, including many things we now consider very not fine.</p>\n<p>People benefited (in happiness terms) from many forms of lower expectations. That doesn’t mean that if you duplicated their life experiences, your family would be happy.</p>\n<p>Fertility rates, having the most children, was during the Baby Boom, if we exclude the bad old times when children often failed to survive.</p>\n<p>Marriage rates used to be near-universal, whether or not you think that was best.</p>\n\n\n<h4 class=\"wp-block-heading\">The Most Reliable News Reporting</h4>\n\n\n<p>Believe it or not, today. Yikes. We don’t believe it because of the Revolution of Rising Expectations. We now have standards for the press that the press has never met.</p>\n<p>People used to trust the media more. Now we trust it a lot less. While there are downsides to this lack of trust, especially when people turn to even less worthy alternatives, that loss of trust is centrally good. The media was never worthy of trust.</p>\n<p>There’s great fondness for the Walter Cronkite era, where supposedly we had high authority news sources worthy of our high trust. The thing is, that past trust was also misplaced, and indeed was even more misplaced.</p>\n<p>There was little holding the press to account. They had their own agendas and biases, even if it was often ‘the good of the nation’ or ‘the good of the people,’ and they massively misunderstood things and often got things wrong. Reporters talking on the level of saying ‘wet ground causes rain’ is not a new phenomenon. When they did make mistakes or slant their coverage, there was no way to correct them back then.</p>\n<p>Whereas now, with social media, we can and do keep the media on its toes.</p>\n<p>If your goal is to figure out what is going on and you’re willing to put in the work, today you have the tools to do that, and in the past you basically didn’t, not in any reasonable amount of time.</p>\n<p>The fact that other people do that, and hold them to account, makes the press hold itself to higher standards.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Music</h4>\n\n\n<p>There are several forms of ‘the best music.’ It’s kind of today, kind of the 60s-80s.</p>\n<p>If you are listening to music on your own, it is at its best today, by far. The entire back catalogue of the world is available at your fingertips, with notably rare exceptions, for a small monthly fee, on demand and fully customizable. If you are an audiophile and want super high quality, you can do that too. There’s no need to spend all that time seeking tings out.</p>\n<p>If you want to create new music, on your own or with AI? Again, it’s there for you.</p>\n<p>In terms of the creation of new music weighted by how much people listen, or in terms of the quality of the most popular music, I’d say probably the 1980s? A strong case can be made for the 60s or 70s too, my guess is that a bunch of that is nostalgia and too highly valuing innovation, but I can see it. What I can’t see is a case for the 1990s or 2000s, or especially 2010s or 2020s.</p>\n<p>This could be old man syndrome talking, and it could be benefits of a lot of selection, but when I sample recent popular music it mostly (with exceptions!) seems highly non-innovative and also not very good. It’s plausible that with sufficiently good search and willingness to take highly deep cuts that today is indeed the best time for new music, but I don’t know how to do that search.</p>\n<p>In terms of live music experiences, especially for those with limited budgets, my guess is this was closer to 1971, as so much great stuff was in hindsight so amazingly accessible.</p>\n<p>The other case for music being better before is that music was better when it was worse. As in, you had to search for it, select it, pay for it, you had to listen to full albums and listen to them many times, so it meant more, that today’s freedom brings bad habits. I see the argument, but no, and you can totally set rules for yourself if that is what you want. I often have for brief periods, to shake things up.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Radio</h4>\n\n\n<p>My wild guess for traditional radio is the 1970s? There was enough high quality music, you had the spirit of radio, and video hadn’t killed the radio star.</p>\n<p>You could make an argument for the 1930s-40s, right before television displaced it as the main medium. Certainly radio back then was more important and central.</p>\n<p>The real answer is today. We have the best radio today.</p>\n<p>We simply don’t call it radio.</p>\n<p>Instead, we mostly call it podcasts and music streaming.</p>\n<p>If you want pseudorandom music, Pandora and other similar services, or Spotify-style playlists, are together vastly better than traditional radio.</p>\n<p>If you want any form of talk radio, or news radio, or other word-based radio programs that doesn’t depend on being broadcast live, podcasts rule. The quality and quantity and variety on offer are insane and you can move around on demand.</p>\n<p>Also, remember reception problems? Not anymore.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Fashion</h4>\n\n\n<p>Long before any of us were born, or today, depending on whether you mean ‘most awesome’ or ‘would choose to wear.’</p>\n<p>Today’s fashion is not only cheaper, it is easier and more comfortable. In exchange, no, it does not look as cool.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Economy</h4>\n\n\n<p>As the question is intended, 2019. Then Covid happened. We still haven’t fully recovered from that.</p>\n<p>There were periods with more economic growth or that had better employment conditions. You could point to 1947-1973 riding the postwar wave, or the late 1990s before the dot com bubble burst.</p>\n<p>I still say 2019, because levels of wealth and real wages also matter.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Movies</h4>\n\n\n<p>In general I choose today. Average quality is way up and has been going up steadily except for a blip when we got way too many superhero movies crowding things out, but we’ve recovered from that.</p>\n<p>The counterargument I respect is that the last few years have had no top tier all-time greats, and perhaps this is not an accident. We’ve forced movies to do so many other things well that there’s less room for full creativity and greatness to shine through? Perhaps this is true, and this system gets us fewer true top movies. But also that’s a Poisson distribution, you need to get lucky, and the effective sample size is small.</p>\n<p>If I have to pick a particular year I’d go with 1999.</p>\n<p>The traditional answer is the 1970s, but this is stupid and disregards the Revolution of Rising Expectations. Movies then were given tons of slack in essentially every direction. Were there some great picks? No doubt, although many of what we think of as all-time greats are remarkably slow to the point where if they weren’t all time greats they’d almost not be watchable. In general, if you think things were better back then, you’re grading back then on a curve, you have an extreme tolerance for not much happening, and also you’re prioritizing some sort of abstract Quality metric over what is actually entertaining.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Television</h4>\n\n\n<p>Today. Stop lying to yourself.</p>\n<p>The experience of television used to be terrible, and the shows used to be terrible. So many things very much do not hold up today even if you cut them quite a lot of slack. Old sitcoms are sleep inducing. Old dramas were basic and had little continuity. Acting tended to be quite poor. They don’t look good, either.</p>\n<p>The interface for watching was atrocious. You would watch absurd amounts of advertisements. You would plan your day around when things were there, or you’d watch ‘whatever was on TV.’ If you missed episodes they would be gone. DVRs were a godsend despite requiring absurd levels of effort to manage optimally, and still giving up a ton of value.</p>\n<p>The interface now is most of everything ever made at your fingertips.</p>\n<p>The alternative argument to today being best is that many say that in terms of new shows the prestige TV era of the 2000s-2010s was the golden age, and the new streaming era can’t measure up, especially due to fractured experiences.</p>\n<p>I agree that the shared national experiences were cool and we used to have more of them and they were bigger. We still get them, most recently for Severance and perhaps The White Lotus and Plurebis, which isn’t the same, but there really are still a ton of very high quality shows out there. Average quality is way up. Top talent going on television shows is way up, they still let top creators do their thing, and there are shows with top-tier people I haven’t even looked at, that never used to happen.</p>\n\n\n<h4 class=\"wp-block-heading\">Best Sporting Events</h4>\n\n\n<p>Today. Stop lying to yourself.</p>\n<p>Average quality of athletic performance is way, way up. Modern players do things you wouldn’t believe. Game design has in many ways improved as well, as has the quality of strategic decision making.</p>\n<p>Season design is way better. We get more and better playoffs, which can go too far but typically keeps far more games more relevant and exciting and high stakes. College football is insanely better for this over the last few years, I doubted and I was wrong. Baseball purists can complain but so few games used to mean anything. And so on.</p>\n<p>Unless people are going to be blowing up your phone, you can start an event modestly late and skip all the ads and even dead time. You can watch sports on your schedule, not someone else’s. If you must be live, you can now get coverage in lots of alternative ways, and also get access to social media conversations in real time, various website information services and so on.</p>\n<p>If you’re going to the stadium, the modern experience is an upgrade. It is down to a science. All seats are good seats and the food is usually excellent.</p>\n<p>There are three downside cases.</p>\n<ol>\n<li>We used to all watch the same sporting events live and together more often. That was cool, but you can still find plenty of people online doing this anyway.</li>\n<li>In some cases correct strategic play has made things less fun. Too many NBA three pointers are a problem, as is figuring out that MLB starters should be taken out rather early, or analytics simply homogenized play. The rules have been too slow to adjust. It’s a problem, but on net I think a minor one. It’s good to see games played well.</li>\n<li>Free agency has made teams retain less identity, and made it harder to root for the same players over a longer period. This one hurts and I’d love to go back, even though there are good reasons why we can’t.</li>\n</ol>\n<p>Mostly I think it’s nostalgia. Modern sports are awesome.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Cuisine</h4>\n\n\n<p>Today, and it’s really, really not close. If you don’t agree, you do not remember. So much of what people ate in the 20th century was barely even food by today’s standards, both in terms of tasting good and its nutritional content.</p>\n<p>Food has gotten The Upgrade.</p>\n<p>Average quality is way, way up. Diversity is way up, authentic or even non-authentic ethnic cuisines mostly used to be quite rare. Delivery used to be pizza and Chinese. Quality and diversity of available ingredients is way up. You can get it all on a smaller percentage of typical incomes, whether at home or from restaurants, and so many more of us get to use those restaurants more often.</p>\n<p>A lot of this is driven by having access to online information and reviews, which allows quality to win out in a way it didn’t before, but even before that we were seeing rapid upgrades across the board.</p>\n\n\n<h4 class=\"wp-block-heading\">Bonus: The Best Job Security</h4>\n\n\n<p>Some time around 1965, probably? We had a pattern of something approaching lifetime employment where it was easy to keep one’s job for a long period, and count on this. The chance of staying in a job for 10+ or 20+ years has declined a lot. That makes people feel a lot more secure, and matters a lot.</p>\n<p>That doesn’t mean you actually want the same job for 20+ years. There are some jobs where you totally do want that, but a lot of the jobs people used to keep for that long are jobs we wouldn’t want. Despite people’s impressions, the increased job changes have mostly not come from people being fired.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Everything</h4>\n\n\n<p>We don’t have the best everything. There are exceptions.</p>\n<p>Most centrally, we don’t have the best intact families or close-knit communities, or the best dating ecosystem or best child freedoms. Those are huge deals.</p>\n<p>But there are so many other places in which people are simply wrong.</p>\n<p>As in:</p>\n<blockquote><p><a href=\"https://x.com/MattWalshBlog/status/1996601760140374413\">Matt Walsh</a> (being wrong, lol at ‘empirical,’ 3M views): It’s an empirical fact that basically everything in our day to day lives has gotten worse over the years. The quality of everything &#8212; food, clothing, entertainment, air travel, roads, traffic, infrastructure, housing, etc &#8212; has declined in observable ways. Even newer inventions &#8212; search engines, social media, smart phones &#8212; have gone down hill drastically.</p>\n<p>This isn’t just a random “old man yells at clouds” complaint. It’s true. It’s happening. The decline can be measured. Everyone sees it. Everyone feels it. Meanwhile political pundits and podcast hosts (speaking of things that are getting worse) focus on anything and everything except these practical real-life problems that actually affect our quality of life.</p>\n<p><a href=\"https://x.com/RogerPielkeJr/status/1994790779945193759\">The Honest Broke</a>r: There is an entire movement focused on trying to convince people that everything used to be better and everything is also getting worse and worse</p>\n<p>That creates a market for reality-based correctives like the excellent thread below by @ben_golub [on air travel.]</p>\n<p><a href=\"https://x.com/mattyglesias/status/1996743442404122797\">Matthew Yglesias</a>: <a href=\"https://t.co/piWcG5YgDg\">I think everyone should take seriously</a>:</p>\n<ol>\n<li>Content distribution channels have become more competitive and efficient</li>\n<li>Negative content tends to perform better</li>\n<li>Marinating all day in negativity-inflected content is cooking people’s brains</li>\n</ol>\n</blockquote>\n<p>My quick investigation confirmed that American roads, traffic and that style of infrastructure did peak in the mid-to-late 20th century. We have not been doing a good job maintaining that.</p>\n<p>On food, entertainment, clothing and housing he is simply wrong (have you heard of this new thing called ‘luxury’ apartments, or checked average sizes or amenities?), and to even make some of these claims requires both claiming ‘this is cheaper but it’s worse’ and ‘this is worse because it used to be cheaper’ in various places.</p>\n<blockquote><p><a href=\"https://x.com/bumbadum14/status/1996974375803691249\">bumbadum</a>: People are chimping out at Matt over this but nobody has been able to name one thing that has significantly grown in quality in the past 10-20 years.</p>\n<p>Every commodity, even as they have become cheaper and more accessible has decreased in quality.</p>\n<p>I am begging somebody to name 1 thing that is all around a better product than its counterpart from the 90s</p>\n<p><a href=\"https://x.com/asymmetricinfo/status/1997136876994433270\">Megan McArdle</a>: Tomatoes, raspberries, automobiles, televisions, cancer drugs, women’s shoes, insulin monitoring, home security monitoring, clothing for tall women (which functionally didn’t exist until about 2008), telephone service (remember when you had to PAY EXTRA to call another area code?), travel (remember MAPS?), remote work, home video … sorry, ran out of characters before I ran out of hedonic improvements.</p></blockquote>\n<p>Thus:</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Information Sources, Electronics, Medical Care, Dental Care, Medical (and Non-Medical) Drugs, Medical Devices, Home Security Systems, Telephone Services and Mobile Phones, Communication, and Delivery Services of All Kinds</h4>\n\n\n<p>Today. No explanation required on these.</p>\n<p>Don’t knock the vast improvements in computers and televisions.</p>\n<p>Saying the quality of phones has gone down, as Matt Walsh does, is absurdity.</p>\n<p>That does still leave a few other examples he raised.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Air Travel</h4>\n\n\n<p>Today, or at least 2024 if you think Trump messed some things up.</p>\n<p>I say this as someone who used to fly on about half of weekends, for several years.</p>\n<p><a href=\"https://x.com/ben_golub/status/1994231545104564431\">Air travel has decreased in price</a>, the most important factor, and safety improved. Experiential quality of the flight itself declined a bit, but has risen again as airport offerings improved and getting through security and customs went back from a nightmare to trivial. Net time spent, given less uncertainty, has gone down.</p>\n<p>If you are willing to pay the old premium prices, you can buy first class tickets, and get an as good or better experience as the old tickets.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Cars</h4>\n\n\n<p>Today. We wax nostalgic about old cars. They looked cool. They also were cool.</p>\n<p>They were also less powerful, more dangerous, much less fuel efficient, much less reliable, with far fewer features and of course absolutely no smart features. That’s even without considering that we’re starting to get self-driving cars.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Roads, Traffic and Infrastructure</h4>\n\n\n<p>This is one area where my preliminary research did back Walsh up. America has done a poor job of maintaining its roads and managing its traffic, and has not ‘paid the upkeep’ on many aspects what was previously a world-class infrastructure. These things seem to have peaked in the late 20th century.</p>\n<p>I agree that this is a rather bad sign, and we should both fix and build the roads and also fix the things that are causing us not to fix and build the roads.</p>\n<p>As a result of not keeping up with demand for roads or demand for housing in the right areas, average commute times for those going into the office have been increasing, but post-Covid we have ~29% of working days happening from home, which overwhelms all other factors combined in terms of hours on the road.</p>\n<p>I do expect traffic to improve due to self-driving cars, but that will take a while.</p>\n\n\n<h4 class=\"wp-block-heading\">The Best Transportation</h4>\n\n\n<p>Today, or at least the mobile phone and rideshare era. You used to have to call for or hail a taxi. Now in most areas you open your phone and a car appears. In some places it can be a Waymo, which is now doubling yearly. The ability to summon a taxi matters so much more than everything else, and as noted above air travel is improved.</p>\n<p>This is way more important than net modest issues with roads and traffic.</p>\n<p>Trains have not improved but they are not importantly worse.</p>\n\n\n<h4 class=\"wp-block-heading\">It’s Getting Better All The Time</h4>\n\n\n<p>Not everything is getting better all the time. Important things are getting worse.</p>\n<p>We still need to remember and count our blessings, and not make up stories about how various things are getting worse, when those things are actually getting better.</p>\n<p>To sum up, and to add some additional key factors, the following things did indeed peak in the past and quality is getting worse as more than a temporary blip:</p>\n<ol>\n<li>Political division.</li>\n<li>Average quality of new music, weighted by what people listen to.</li>\n<li>Live music and live radio experiences, and other collective national experiences.</li>\n<li>Fashion, in terms of awesomeness.</li>\n<li>Roads, traffic and general infrastructure.</li>\n<li>Some secondary but important moral values.</li>\n<li>Dating experiences, ability to avoid going on apps.</li>\n<li>Job security, ability to stay in one job for decades if desired.</li>\n<li>Marriage rates and intact families, including some definitions of ‘happy’ families.</li>\n<li>Fertility rates and felt ability to have and support children as desired.</li>\n<li>Childhood freedoms and physical experiences.</li>\n<li>Hope for the future, which is centrally motivating this whole series of posts.</li>\n</ol>\n<p>The second half of that list is freaking depressing. Yikes. Something’s very wrong.</p>\n<p>But what’s wrong isn’t the quality of goods, or many of the things people wax nostalgic about. The first half of this list cannot explain the second half.</p>\n<p>Compare that first half to the ways in which quality is up, and in many of these cases things are 10 times better, or 100 times better, or barely used to even exist:</p>\n<ol>\n<li>Morality overall, in many rather huge ways.</li>\n<li>Access to information, including the news.</li>\n<li>Logistics and delivery. Ease of getting the things you want.</li>\n<li>Communication. Telephones including mobile phones.</li>\n<li>Music as consumed at home via deliberate choice.</li>\n<li>Audio experiences. Music streams and playlists. Talk.</li>\n<li>Electronics, including computers, televisions, medical devices, security systems.</li>\n<li>Television, both new content and old content, and modes of access.</li>\n<li>Movies, both new content and old content, and modes of access.</li>\n<li>Fashion in terms of comfort, cost and upkeep.</li>\n<li>Sports.</li>\n<li>Cuisine. Food of all kinds, at home and at restaurants.</li>\n<li>Air travel.</li>\n<li>Taxis.</li>\n<li>Cars.</li>\n<li>Medical care, dental care and medical (and nonmedical) drugs.</li>\n</ol>\n<p>That only emphasizes the bottom of the first list. Something’s very wrong.</p>\n\n\n<h4 class=\"wp-block-heading\">We Should Be Doing Far Better On All This</h4>\n\n\n<p><a href=\"https://thezvi.substack.com/i/181829363/we-should-be-doing-far-better-on-all-this\">Once again</a>, us doing well does not mean we shouldn’t be doing better.</p>\n<p>We see forms of the same trends.</p>\n<ol>\n<li>Many things are getting better, but often not as much better as they could be.</li>\n<li>Other things are getting worse, both in ways inevitable and avoidable.</li>\n<li>This identifies important problems, but the changes in quantity and quality of goods and services do not explain people’s unhappiness, or why many of the most important things are getting worse. More is happening.</li>\n</ol>\n<p>Some of the things getting worse reflect changes in technological equilibria or the running out of low-hanging fruit, in ways that are tricky to fix. Many of those are superficial, although a few of them aren’t. But these don’t add up to the big issues.</p>\n<p>More is happening.</p>\n<p>That more is what I will, in the next post, be calling The Revolution of Rising Expectations, and the Revolution of Rising Requirements.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/19/when-were-things-the-best/",
            "publishedAt": "2025-12-19",
            "source": "TheZvi",
            "summary": "People remember their childhood world too fondly. You adapt to it. You forget the parts that sucked, many of which sucked rather really badly. It resonates with you and sticks with you. You think it was better. This is famously &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/19/when-were-things-the-best/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "When Were Things The Best?"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3183/",
            "publishedAt": "2025-12-19",
            "source": "XKCD",
            "summary": "<img alt=\"My goal in life is to be personally responsible for at least one sports rule change.\" src=\"https://imgs.xkcd.com/comics/pole_vault_pole.png\" title=\"My goal in life is to be personally responsible for at least one sports rule change.\" />",
            "title": "Pole Vault Pole"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-19"
}