{
    "articles": [
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/you-can-cheat-a-test-suite-with-a-big-enough/",
            "publishedAt": "2025-06-24",
            "source": "Hillel Wayne",
            "summary": "<p>Hi nerds, I'm back from <a href=\"https://systemsdistributed.com/\" target=\"_blank\">Systems Distributed</a>! I'd heartily recommend it, wildest conference I've been to in years. I have a lot of work to catch up on, so this will be a short newsletter.</p> <p>In an earlier version of my talk, I had a gag about unit tests. First I showed the test <code>f([1,2,3]) == 3</code>, then said that this was satisfied by <code>f(l) = 3</code>, <code>f(l) = l[-1]</code>, <code>f(l) = len(l)</code>, <code>f(l) = (129*l[0]-34*l[1]-617)*l[2] - 443*l[0] + 1148*l[1] - 182</code>. Then I progressively rule them out one by one with more unit tests, except the last polynomial which stubbornly passes every single test.</p> <p>If you're given some function of <code>f(x: int, y: int, …): int</code> and a set of unit tests asserting <a href=\"https://buttondown.com/hillelwayne/archive/oracle-testing/\" target=\"_blank\">specific inputs give specific outputs</a>, then you can find a polynomial that passes every single unit test.</p> <p>To find the gag, and as <a href=\"https://en.wikipedia.org/wiki/Satisfiability_modulo_theories\" target=\"_blank\">SMT</a> practice, I wrote a Python program that finds a polynomial that passes a test suite meant for <code>max</code>. It's hardcoded for three parameters and only finds 2nd-order polynomials but I think it could be generalized with enough effort.</p> <h2>The code</h2> <p>Full code <a href=\"https://gist.github.com/hwayne/0ed045a35376c786171f9cf4b55c470f\" target=\"_blank\">here</a>, breakdown",
            "title": "You can cheat a test suite with a big enough polynomial"
        },
        {
            "content": [
                "<p>In <em>Seeing Like a State</em>, James C. Scott</p><blockquote><p>shows how central governments attempt to force legibility on their subjects, and fail to see complex, valuable forms of local social order and knowledge. (<a href=\"https://en.wikipedia.org/wiki/Seeing_Like_a_State\">More</a>)</p></blockquote><p>Previously, people used concepts, norms, names, physical units, locations, and assets that were deeply entwined with local culture and practice. Concepts that states found hard to understand and apply, when they tried to enforce laws or extract taxes. So states, once they arose a few centuries ago, pushed people to instead use concepts that states could better see and apply from their bureaucratic distance. Such as unique names, global locations, and standardized languages, units, measures, laws, and accounting procedures.</p><p>It seems to me that the <a href=\"https://www.overcomingbias.com/p/systems-explain-stem-vs-culture-style?utm_source=publication-search\">distinction</a> between STEM and arts/humanities is related. STEM uses concepts and systems that allow very different and widely separated things to be compared and analyzed in similar and consistent ways, using a &#8220;view from nowhere.&#8221; Arts/humanities, in contrast tend to have a stronger grip on our aesthetic, emotional, and moral reactions in particular situations and communities, when we very much do and want to see our world differently than do outsiders.</p><p>Consider an analogy. Imagine you&#8217;ve lived in the same small town all your life. And you are thinking about where to move to live next in that town. Such thoughts would be richly informed by your emotions and life experience there. You&#8217;d let your intuitions flow on where you&#8217;ve lived, worked, and schooled before, where your friends live, and what areas seem pleasant and prestigious. You might do some calculations, but you&#8217;d be mostly vibing on feels. And anyone who is to usefully talk to you about this situation, or to describe it to others, will need to share many feels.</p><p>Now imagine that a flood is coming to your town, and you want to know where to go to be safe. For this analysis, you&#8217;ll want to set aside most of your feelings and just think about the physical structure of the town, and of the water that is rising. The water won&#8217;t care about what areas are precious to you, just about elevation of routes and stiffness of obstacles. A stranger who knows little about your town could use a objective STEM/state map of your town to calculate flood changes nearly as well as could a town resident.</p><p>While we moderns have learned to think about many things in state- and STEM-like terms, our aesthetic, moral, and cultural judgements are what we most do and want to see in rooted and partisan pre-state and arts/humanities ways, resisting STEM-like standardized views from nowhere.</p><p>This is a problem for those of us trying to get people to see our big <a href=\"https://www.overcomingbias.com/p/our-big-oops?utm_source=publication-search\">problem</a> of cultural drift. We need people to see their precious culture, which they love more than family, via a neutral STEM-like view from nowhere. In particular, we need them to see their cultural world using the robust and general biological concept of adaption. Which of course, like the STEM flood analysis of a town, ignores a great many details very important to us. Even so, when you actually face a flood-like crisis, STEM-like concepts and their implications are often ones you must master to survive. </p>"
            ],
            "link": "https://www.overcomingbias.com/p/seeing-like-a-stem",
            "publishedAt": "2025-06-24",
            "source": "Robin Hanson",
            "summary": "<p>In <em>Seeing Like a State</em>, James C. Scott</p><blockquote><p>shows how central governments attempt to force legibility on their subjects, and fail to see complex, valuable forms of local social order and knowledge. (<a href=\"https://en.wikipedia.org/wiki/Seeing_Like_a_State\">More</a>)</p></blockquote><p>Previously, people used concepts, norms, names, physical units, locations, and assets that were deeply entwined with local culture and practice. Concepts that states found hard to understand and apply, when they tried to enforce laws or extract taxes. So states, once they arose a few centuries ago, pushed people to instead use concepts that states could better see and apply from their bureaucratic distance. Such as unique names, global locations, and standardized languages, units, measures, laws, and accounting procedures.</p><p>It seems to me that the <a href=\"https://www.overcomingbias.com/p/systems-explain-stem-vs-culture-style?utm_source=publication-search\">distinction</a> between STEM and arts/humanities is related. STEM uses concepts and systems that allow very different and widely separated things to be compared and analyzed in similar and consistent ways, using a &#8220;view from nowhere.&#8221; Arts/humanities, in contrast tend to have a stronger grip on our aesthetic, emotional, and moral reactions in particular situations and communities, when we very much do and want to see our world differently than do outsiders.</p><p>Consider an analogy. Imagine you&#8217;ve lived in the same small town all your",
            "title": "Seeing like a STEM"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-24"
}