{
    "articles": [
        {
            "content": [
                "<p>My expectation early in my career was that promotions just showed up. You worked hard, and you figured out how to get along with your teammates. Every year or so, my boss would have a one-off conversation with me and alert me that I had a new role along with increased compensation. This hands-off cycle went on a lot longer than I am comfortable admitting. Years.</p>\n<p>You start your career believing that your boss &#8220;knows.&#8221; They know how to do the job, how to get the project done, and how to grow you professionally. Most do, but many do not. More importantly, most are compulsively quite busy, and the essential strategic work of growing the team becomes a lower priority than whatever fire drill we&#8217;re all worrying about this week.</p>\n<p>My advice: while you are not the decision maker regarding your next promotion, you are 100% accountable for driving it.</p>\n<p>Before I start, we need to frame this piece:</p>\n<ol>\n<li>You can replace the word promotion with review for much of this piece. Promotions usually align with the review process, but this article is focused on the promotion, not the review process. </li>\n<li>Promotion processes are a reflection of a company&#8217;s culture. While I&#8217;ve seen a lot of different engineering cultures and there are common elements to their processes, there is always something slightly different in each company. One place promotions were never spoken of, ever, to anyone. Another place left it totally up to the manager — no oversight other than budgets. While I hope threads of this article resonate with you, there is something essential about your current promotion process that I&#8217;ve never seen. </li>\n</ol>\n<p>We good? Ok, we&#8217;re going to start this process with you answering three questions:</p>\n<ol>\n<li>Is there a publicly available rubric that clearly describes the different job levels at your company? </li>\n<li>Is there a repeating, usually annual, process whereby promotions are reviewed and approved?</li>\n<li>Do you understand both the rubric and the process?</li>\n</ol>\n<p>It would be easier on all of us if your answer to all of the above questions were a confident &#8220;Yes,&#8221; but, well, there are well-known forces that act in opposition to defining clear rubrics and processes and making sure everyone understands them. The greatest hits of these oppositional forces include:</p>\n<ul>\n<li><strong>Growth</strong>. A rapidly growing start-up that has not kept up with the growth of the team and has not invested in job levels or a promotion process.</li>\n<li><strong>Experience</strong>. Managers who have not been or have little experience in understanding and applying job levels, or adeptly using the promotion process, and/or managers who are just poor communicators.</li>\n<li><strong>Risk</strong>. This is more of a big company oppositional force, but the larger a company becomes, the more it dismantles what used to be a pretty rich job level and promotion process. Why? Risk mitigation. Having a rich and well-documented process that captures a lot of information about the individuals on the team, their accomplishments, and promotions often comes back to bite you — legally speaking, so <em>&#8220;Let&#8217;s simplify the process and save the team a lot of time!&#8221;</em> This is how you end up with a review form comprised of two text fields: Accomplishments and Goals combined with simple 1 to 5 rating systems, <em>&#8220;You are 4, but with work I&#8217;m certain you can be a solid 5.&#8221;</em> I wish I were joking.</li>\n<li><strong>Budget</strong>. One of the most disappointing outcomes from a promotion process is when you hear back from your boss, &#8220;Sorry, we don&#8217;t have the budget this year,&#8221; except they don&#8217;t say that. They find some aspect of your work this year that barely justifies the lack of a promotion because they know you did the work and deserve the promotion, but budgets didn&#8217;t align this year, and that&#8217;s the last thing they want to say. This oppositional force increases in intensity and confusion with the seniority of the job, where the compensation is higher and there is more competition for fewer roles. </li>\n<li><strong>Power</strong>. Similar to risk, the holders of this information have been burned in the past when they&#8217;ve shared this information completely, so they are reluctant to share complete job levels and the detailed promotion process. If you find this odd or unsatisfying, I&#8217;ll raise you a &#8220;this is complete bullshit.&#8221; I&#8217;ve professionally screwed up by sharing too much information or sharing job or promotion information sans proper context, and this has blown up in my face. This was my error to learn from, and the lesson wasn&#8217;t &#8220;share less,&#8221; it was &#8220;do better.&#8221;</li>\n</ul>\n<p>I have constructive advice on specific work you can do to invest in your future promotion, but this advice will be less helpful until you discover what boils down to two pieces of critical information.</p>\n<p>A <strong>document</strong> that describes the job expectations for your current level. It&#8217;s usually a table of some form. It&#8217;d be great if you could get the expectations for all levels, but, again, folks get twitchy sharing the complete set of this information. This is one of the reasons I advise you to get a document. Word of mouth on this information <strong>guarantees</strong> misunderstanding regarding expectations.</p>\n<p>A <strong>schedule</strong> for the promotion process. There is one for managers and one for individuals, but they contain similar information and dates:</p>\n<ul>\n<li>This is when the promotion cycle begins.</li>\n<li>This is the deadline for promotions. </li>\n<li>This is when promotions will be decided.</li>\n<li>This is when promotions will be communicated and take effect.</li>\n</ul>\n<p>I&#8217;m less tense about finding a document for this information because the core of what we need to know here is timing: when can we expect what?</p>\n<p>You have questions. Many questions.</p>\n<ul>\n<li>Who wrote these job levels? In smaller companies, it&#8217;s the leadership team along with the HR/People team. In larger organizations, it&#8217;s the HR/People team. I&#8217;ve written many; here&#8217;s a cleaned-up and anonymized one I wrote for a start-up that you can <a href=\"https://randsinrepose.com/assets/a-career-path.pdf\">have</a> right now<sup id=\"fnref-5358-1\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5358-1\" title=\"Read footnote.\">1</a></sup>.</li>\n<li>Why are promotions at this particular time? It&#8217;s usually annual budget dependent, which is why this process happens in the early Fall in the United States. Sometimes, the promotion process happens twice a year, with the non-Fall process existing to error correct a handful of heinous promotion situations.  </li>\n<li>How are promotions decided?  It&#8217;s usually a group of managers with additional oversight for more senior promotions. Some companies have invested a lot in having this review group be an anonymous entity that knows nothing about you except what is included in your promotion packet. The idea is to make the approval as neutral and unbiased as possible. More on the promotion process and this packet shortly. </li>\n<li>What if I can&#8217;t find some or all of this information? In this likely scenario, you need to push a little harder because the answer will help you. Ask your boss, ask your HR person. Listen to their answer. What oppositional force do they invoke? Does it make sense? Are you buying it? Pushing a little usually results in more information, and you get all you can get because your initial question remains:</li>\n</ul>\n<p>How do I get promoted?</p>\n<p>I&#8217;m glad you asked. I think you&#8217;ll like Part 2 next week.<sup id=\"fnref-5358-2\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5358-2\" title=\"Read footnote.\">2</a></sup></p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-5358-1\">\nThe comparison levels at other companies were derived from public sources and are six years old, so I wouldn&#8217;t trust them.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5358-1\" title=\"Return to main content.\">&#8617;</a>\n</li>\n<li id=\"fn-5358-2\">\nThanks to the denizens of #perf-management channel on the <a href=\"https://randsinrepose.com/welcome-to-rands-leadership-slack/\">Rands Leadership Slack</a>for jamming on the hard questions about promotions. Their questions improved this piece.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5358-2\" title=\"Return to main content.\">&#8617;</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://randsinrepose.com/archives/so-you-want-to-be-promoted-pt-1/",
            "publishedAt": "2025-10-14",
            "source": "Rands in Repose",
            "summary": "My expectation early in my career was that promotions just showed up. You worked hard, and you figured out how to get along with your teammates. Every year or so, my boss would have a one-off conversation with me and alert me that I had a new role along with increased compensation. This hands-off cycle&#8230; <a class=\"excerpt-more\" href=\"https://randsinrepose.com/archives/so-you-want-to-be-promoted-pt-1/\">more</a>",
            "title": "So You Want to Be Promoted, Pt. 1"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Oct/14/nvidia-dgx-spark/#atom-entries",
            "publishedAt": "2025-10-14",
            "source": "Simon Willison",
            "summary": "<p>NVIDIA sent me a preview unit of their new <a href=\"https://www.nvidia.com/en-us/products/workstations/dgx-spark/\">DGX Spark</a> desktop \"AI supercomputer\". I've never had hardware to review before! You can consider this my first ever sponsored post if you like, but they did not pay me any cash and aside from an embargo date they did not request (nor would I grant) any editorial input into what I write about the device.</p> <p>The device retails for around $4,000. They officially go on sale tomorrow.</p> <p>First impressions are that this is a snazzy little computer. It's similar in size to a Mac mini, but with an exciting textured surface that feels refreshingly different and a little bit <a href=\"https://www.indiewire.com/awards/industry/devs-cinematography-rob-hardy-alex-garland-1234583396/\">science fiction</a>.</p> <p><img alt=\"A rectangular small computer, sitting horizontally on a box. It is about the width of a Mac Mini. It has a NVIDIA logo on a reflective handle portion, then textured silver metal front, then another reflective handle at the other end. It's pretty and a bit weird looking. It sits on the box it came in, which has NVIDIA DGX Spark written on it in white text on green.\" src=\"https://static.simonwillison.net/static/2025/nvidia-spark.jpg\" /></p> <p>There is a <em>very</em> powerful machine tucked into that little box. Here are the specs,",
            "title": "NVIDIA DGX Spark: great hardware, early days for the ecosystem"
        },
        {
            "content": [
                "<p>What is going on with, and what should we do about, the Chinese <a href=\"https://www.nytimes.com/2025/10/09/business/china-rare-earth-exports.html\">declaring extraterritorial exports controls on rare earth metals</a>, <a href=\"https://x.com/niubi/status/1976319737173856447?s=46\">which threaten to go way beyond semiconductors</a> and also beyond rare earths into things like lithium and also antitrust investigations?</p>\n<p>China also took other actions well beyond only rare Earths, <a href=\"https://www.cnbc.com/2025/10/10/qualcomm-shares-today-after-china-opens-antitrust-probe.html\">including going after Qualcomm</a>, lithium and everything else that seemed like it might hurt, as if they are confident that a cornered Trump will fold and they believe they have escalation dominance and are willing to use it.</p>\n<p>China now has issued reassurances that it will allow all civilian uses of rare earths and not to worry, but it seems obvious that America cannot accept a Chinese declaration of extraterritorial control over entire world supply chains, even if China swears it will only narrowly use that power. In response, Trump has threatened massive tariffs and cancelled our APAC meeting with China, while also trying to calm the markets rattled by the prospect of massive tariffs and the cancellation of the meeting with China.</p>\n<div>\n\n\n<span id=\"more-24788\"></span>\n\n\n</div>\n<p>World geopolitics and America-China relations are not areas where I am an expert, so all of this could be highly misguided, but I’m going to do my best to understand it all.</p>\n\n\n<h4 class=\"wp-block-heading\">Was This Provoked?</h4>\n\n\n<p><a href=\"https://x.com/Brad_Setser/status/1976698190385512917\">There are some claiming</a> this is in response to a new BIS ‘50% rule’ where majority owned subsidiaries are now subject to the same trade restrictions as their primary owners, or that this and other actions on America’s side ‘broke the truce.’</p>\n<p><a href=\"https://x.com/pstAsiatech/status/1976728076223758487\">I acknowledge that ownership can get complex</a> and thus this can impose non-trivial costs and cause some amount of risk mitigating action, but I don’t buy it as a central cause. It never made sense that we’d refuse to trade with [X] but would trade with [X]’s majority owned subsidiary, and imposing full extraterritoriality on 0.1% value adds plus taking other steps is not remotely proportionate retaliation for that, especially without any sort of loud warning. If that’s the stated justification, then it’s for something they were looking to do anyway.</p>\n<p>If you buy the most pro-China argument being made here (which I don’t), <a href=\"https://x.com/stevehou0/status/1976917466803565016\">that Lutnik and others ‘went rogue’ and did the 50% rule and other things behind Trump’s back</a> to ‘get tough’ or sabotage the talks, thus making us untrustworthy, then the Chinese response seems quite unstrategic to me.</p>\n<p>Whereas the right move if this did happen would have been to loudly call out the moves as having been done behind his back and give Trump a chance to look good, and only retaliate later if that fails. And even if China did feel the need to retaliate, the audacity of what China is trying to do is well beyond a reasonable countermove.</p>\n\n\n<h4 class=\"wp-block-heading\">What Is China Doing?</h4>\n\n\n<p><a href=\"https://x.com/semianalysis_/status/1976317626692321444?s=46\">SemiAnalysis offers their thoughts</a> on the rare earth portion and does not think they are aiming at a widespread supply chain cutoff.</p>\n<p><a href=\"https://x.com/Brad_Setser/status/1976691234103058664\">Brad Setser views this as a maximum pressure strategy</a> to try and get it all, as in full tariff rollback, rollback of export controls, even relaxation of national security reviews on Chinese investments. They’re laying many of their most powerful asymmetric cards on the table, perhaps most of them. That does seem like what is going on?</p>\n<p>The export controls on chips presumably aren’t China’s primary goal here in any case. I assume they mostly want tariff relief, this is a reasonable thing to want, and on that we should be willing to negotiate. They get to play this card once before we (I hope) get our own production house in order on this, the card was losing power over time already, they played it, that’s that.</p>\n\n\n<h4 class=\"wp-block-heading\">How Is America Responding?</h4>\n\n\n<p><a href=\"https://x.com/RapidResponse47/status/1976663787911758320\">The initial response from Trump</a> was to plan not to meet Xi at APAC and to threaten massive new tariffs, now that China is no longer ‘lying in wait’ after six months of what he claims were ‘good relations with China,’ hence the question we are now about to answer of what bad relations with China might look like, yikes. He says ‘things that were routine are no longer routine at all,’ which might be the best way to sum up the entire 2025 Trump experience.</p>\n<p><a href=\"https://x.com/Vivek4real_/status/1976787212491801051\">Also, 30 minutes before Trump made the tariff announcement</a>, someone opened an account on that day, created a Bitcoin short and closed with $88 million in profit. It’s 2025, you can just trade things.</p>\n<p>That threat was always going to be part of the initial reaction, and thus does not itself provide strong evidence that China overreached, although the exact degree of <a href=\"https://www.youtube.com/watch?v=RoFQc7cV05g\">how genuinely pissed off he would be</a> was unpredictable, and this does seem to be on the upper end of plausible degrees of pissed.</p>\n<p>The question is what happens next. China’s move effectively bets that China holds all the cards, and on TACO, that they can escalate to de-escalate and get concessions, and that Trump will fold and give them a ‘great deal.’</p>\n<p>We are <a href=\"https://x.com/unusual_whales/status/1977366392166109259\">launching a $1 billion Pentagon buying spree to stockpile critical minerals,</a> which we should have presumably done a long time ago given the ratio of the cost of a stockpile versus the strategic risk of being caught without, especially in an actual war.</p>\n<p>We also are announcing this:</p>\n<blockquote><p><a href=\"https://x.com/FirstSquawk/status/1977706393575551467\">First Squawk</a>: BESSENT ON SUPPLY CHAINS, RARE EARTHS: GOING TO DO EQUIVALENT OF OPERATION WARP SPEED TO TACKLE PROCESSING.</p></blockquote>\n<p>I am excited to do the equivalent of by far the most successful government program of the past decade and Trump’s greatest success.</p>\n<p><a href=\"https://www.wsj.com/world/china/trump-tariffs-us-china-stock-market-e2652d66?mod=author_content_page_1_pos_1\">America then, as is Trump’s common pattern, looked to show signs of desire for de-escalation</a>, as Trump tries to calm the markets <a href=\"https://www.wsj.com/finance/stocks/asia-stock-markets-fall-as-u-s-china-trade-tensions-flare-up-731a8acb?mod=WTRN_pos1\">(which are down in Asia as well</a>), and both nations express privately they want to reduce tensions. No one actually wants a big trade war and both sides have escalated to de-escalate. So Trump is both making big threats and sending out the message that everything is fine. He’s repeating that America is prepared to retaliate if China doesn’t back down, and is going to demand full rescinding of the rare-earth export rule.</p>\n\n\n<h4 class=\"wp-block-heading\">How Is China Responding To America’s Response?</h4>\n\n\n<p>China quickly <a href=\"https://x.com/shanghaimacro/status/1977195161974452447?s=46&amp;t=z6D47Orn-Cugu5LQE2XPFg\">attempted to walk back the implications</a> and indicate intention to de-escalate, saying that the ban is only for military purposes and civilian uses will be approved, all you have to do is get all the Chinese licenses, as in acknowledge Chinese extraterritorial jurisdiction and turn over lots of detail about what you’re doing, and hope they don’t alter the deal any further. No need to worry.</p>\n<p><a href=\"https://x.com/RushDoshi/status/1977368655387127814\">Rush Doshi interprets these same recent PRC Ministry of Commerce public remarks</a> <a href=\"https://t.co/l6yfm7rBZL\">as Beijing being ‘a little rattled’</a> and worried about global reaction, and declining to respond to Trump’s threats yet, but resolved to keep their new rare earths regime.</p>\n<blockquote><p>Rush Doshi: <strong>Bottom Line:</strong> Trump wants this regime withdrawn. Beijing won’t do that, but is trying to reassure it won’t implement it punitively. Obviously, that is not a credible promise on Beijing’s part, and US and PRC positions are at odds.</p></blockquote>\n<p>Beijing is emphasizing that this is ‘not a ban’ except for military use. Thinking this is what needs to be emphasized indicates they misunderstand the dynamics involved. This was not something that was misunderstood.</p>\n\n\n<h4 class=\"wp-block-heading\">What To Make Of China’s Attempted Reassurances?</h4>\n\n\n<p>Perhaps it was intended as a warning that they could have done a ban and chose not to? Except that implicit threat is exactly the most unacceptable aspect of all this.</p>\n<p>The argument that others need not worry does not hold water. Any reasonable business would worry. As for governments, you can’t be permitted by others to remain the sole supplier of vital military supplies if you don’t let them go into others military equipment, even if the rules are only ever enforced as announced.</p>\n<p>Nor is America going to let China demand unlimited information transfer about everything that touches their rare earths, or accept China having a legal veto point over the entire global supply chain even if they pledge to only use it for military applications.</p>\n<p>As in, this is not merely ‘Trump wants this regime withdrawn.’ This is an unacceptable, dealbreaker-level escalation that America cannot reasonably accept.</p>\n<p>So we are at an impasse that has to give way in some fashion, or this escalates again.</p>\n\n\n<h4 class=\"wp-block-heading\">How Should We Respond From Here?</h4>\n\n\n<p><a href=\"https://x.com/KhanSaifM/status/1976278646051479573\">I agree with Saif Khan and Dean Ball that we absolutely should not negotiate</a> on our chip export controls, indeed given this move we should tighten them, especially on wagers and other manufacturing components.</p>\n<p>We must use this as an impetus to finally pay the subsidies and give the waivers needed and do whatever else we need to do, in order to get rare earth production and refining in the West.</p>\n<p>It’s not like all the deposits happen to be in China. America used to be the top producer and could be again. I strongly <a href=\"https://x.com/deanwball/status/1976260051351343195\">agree with Dean</a> that we should (among other things) Declare Defense Production Act as needed on this one, as this is a key strategic vulnerability that we can and must fix quickly. As Dean points out, and economists always say, supply in the medium term is almost always more elastic than you think.</p>\n<p>Note the justification China used for this new restriction, which is that any chip below 14nm or 256 layer memory has ‘military applications.’ Well then, where should we put the limit on our chip sales to them? They certainly have military applications.</p>\n<p><a href=\"https://x.com/RushDoshi/status/1976686186195206618\">Rush Doshi initially predicted financial sanctions from America may follow</a>, which would solidify this as a very serious escalation all around if it came to that. Presumably such an escalation is unlikely, but possible.</p>\n\n\n<h4 class=\"wp-block-heading\">It Looks Like China Overplayed Its Hand</h4>\n\n\n<p>The way this is playing out now does update us towards China having miscalculated and overplayed their hand, potentially quite badly if they are unable to offer an acceptable compromise while saving face and dealing with internal pressures.</p>\n<p>Asserting control over supply and terms of trade is a trick you hopefully can only pull once. Demonstrate you have the world over a barrel because no one else was willing to pay a modest price to secure alternative supplies, and everyone is going to go pay a modest price to secure alternative supplies, not only of this but of everything else too, and look hard at any potential choke points.</p>\n<p>That dynamic is indeed also one of the big problems with Trump’s tariff shenanigans. If you prove yourself willing to use leverage and an unreliable trading partner (provoked, fairly or otherwise) then everyone is going to look to take away your leverage and stop depending on you. Hold up problems that get exploited get solved.</p>\n\n\n<h4 class=\"wp-block-heading\">We Need To Mitigate China’s Leverage Across The Board</h4>\n\n\n<p>In this sense, the response must inevitably go well beyond rare earths, even if a deal is reached and both sides back down.</p>\n<blockquote><p><a href=\"https://x.com/deanwball/status/1977074238663123175\">Dean Ball</a>: We should not miss the fundamental point on rare earths: China has crafted a policy that gives it the power to forbid any country on Earth from participating in the modern economy.</p>\n<p>They can do this because they diligently built industrial capacity no one else had the fortitude to build. They were willing to tolerate costs—financial and environmental and otherwise—to do it.</p>\n<p>Now the rest of the world must do the same.</p>\n<p>China has created an opportunity of tremendous proportions for all countries that care about controlling their destiny: the opportunity to rebuild.</p>\n<p>Every non-Chinese infrastructure investment, sovereign wealth, and public pension fund; every corporation that depends on rare earths; and every government can play a role.</p>\n<p>This is an opportunity not just for the US, but for every country on Earth that wants to control its destiny. Together, we can build a new supply chain designed to withstand unilateral weaponization by a single country—one spread throughout the world.</p>\n<p>Always remember that supply is elastic. If our lives depend on it, we can surmount many challenges far faster than the policy planners in Beijing, Brussels, and Washington realize.</p></blockquote>\n<p><a href=\"https://stratechery.com/2025/china-and-rare-earth-metals-chips-and-rare-earths-the-u-s-s-self-inflicted-challenge/?access_token=eyJhbGciOiJSUzI1NiIsImtpZCI6InN0cmF0ZWNoZXJ5LnBhc3Nwb3J0Lm9ubGluZSIsInR5cCI6IkpXVCJ9.eyJhdWQiOiJzdHJhdGVjaGVyeS5wYXNzcG9ydC5vbmxpbmUiLCJhenAiOiJIS0xjUzREd1Nod1AyWURLYmZQV00xIiwiZW50Ijp7InVyaSI6WyJodHRwczovL3N0cmF0ZWNoZXJ5LmNvbS8yMDI1L2NoaW5hLWFuZC1yYXJlLWVhcnRoLW1ldGFscy1jaGlwcy1hbmQtcmFyZS1lYXJ0aHMtdGhlLXUtcy1zLXNlbGYtaW5mbGljdGVkLWNoYWxsZW5nZS8iXX0sImV4cCI6MTc2Mjk0MjAzOSwiaWF0IjoxNzYwMzUwMDM5LCJpc3MiOiJodHRwczovL2FwcC5wYXNzcG9ydC5vbmxpbmUvb2F1dGgiLCJzY29wZSI6ImZlZWQ6cmVhZCBhcnRpY2xlOnJlYWQgYXNzZXQ6cmVhZCBjYXRlZ29yeTpyZWFkIGVudGl0bGVtZW50cyIsInN1YiI6IjAxOTY0MGE3LTNjYzUtNzc1My04MzY4LWZiMjg5MTI0Y2YxMyIsInVzZSI6ImFjY2VzcyJ9.GjRmh3TvnIB3VNYUmM9hPpISEQ3S8Df2FVOL_7mFA66Ki-x8T9LTti1kfL5c7gdNhaIJQgsv42zvNOExi0QtSHdDVL1Z21XNyXGJSpToFe82nuqc6d9wkvlDFMFnjVGgrX_jhlg0LmyLlDYzVJvn7k3tPcKoq3-ZD7hvAF7MbDOxAQ0c9a5ujpD3zPo0ZHXQEV-dqzHypiwjjjbG4T7Gkojv7rz2Oo0ZhNBS6zGkC_-KSKPjL5GEEz5xtfDli0DDwmm6Hm_YrxtJaqWm3kMTmPPlok4Gz2mTRb3YYCsmxqDtQTlVvSKNn8SA8Kt2QAaQAiG5scf8ISyynTJGznAZWQ\">Ben Thompson echoes similar points</a>, that America gave the rare earth mining industry away by letting the Nuclear Regulatory Commission classify waste as nuclear, thus skyrocketing costs (so a fully pointless self-own, the same as on nuclear power) followed by letting the Chinese buy out what was left of our operations. We could absolutely get back in this game quickly if we decided we wanted to do that.</p>\n<p><a href=\"https://x.com/petereharrell/status/1977416330065158397\">Peter Harrell goes into why getting American or friendshored production</a> going is hard. Permitting and lawsuits make mining in America difficult (read: borderline impossible), it’s hard to get politics going for things that don’t come online for years, and profitability is rough without purchase and price guarantees.</p>\n<p>That is very hard under our current equilibria, but is eminently solvable given political will. You can overcome the permitting. You can pass reforms that bypass or greatly mitigate the lawsuits. You can use advance market commitments to lock in profitability. The strategic value greatly exceeds the associated costs. If you care enough.</p>\n\n\n<h4 class=\"wp-block-heading\">What About The Chip Export Controls?</h4>\n\n\n<p>What about the parallel with advanced AI chips themselves, you ask? Isn’t that the same thing in reverse? There are some similarities, but no. That is aimed squarely at only a few geopolitical rivals, contained to one particular technology that happens to be the most advanced and difficult to duplicate on Earth, and one that China is already going full speed ahead to get domestically, and where share of global chip supply is a key determinant of the future.</p>\n<p>Yes, there are elements of ‘China doesn’t get to do extraterritorial controls on strategic resources, only America gets to do extraterritorial controls on strategic resources.’ And indeed, to an extent that is exactly our position, and it isn’t new, and it’s not the kind of thing you give up in such a spot.</p>\n\n\n<h4 class=\"wp-block-heading\">This May Be A Sign Of Weakness</h4>\n\n\n<p>We also should consider the possibility that <a href=\"https://foreignpolicy.com/2025/10/10/china-tech-ai-innovation-economy-stagnation/\">China’s economy may not be going well</a> and they could feel backed into various corners, including internal pressures. Authoritarian states with central planning can often do impressive looking things, such as China going on history’s largest real estate building binge or its focus on hypercompetitive manufacturing and technology sectors, hiding the ways it is unsustainable or wasteful for quite a long time.</p>\n<p>China has a huge slow moving demographic problem and youth that are by all reports struggling, which is both a crisis and indicates that many things are deeply wrong, mounting debt and a large collapsed real estate sector.</p>\n<p>Recently China started clamping down on ‘negative emotional contagion’ on social media. <a href=\"https://marginalrevolution.com/marginalrevolution/2025/10/china-understands-negative-emotional-contagion.html\">Tyler Cowen suggests this shows wisdom</a> but I would instead suggest the primary thing to observe is that this is not what you do when things are going well. It only makes the vibe more creepily dystopian and forces everyone’s maps to diverge even more from reality. It reflects and creates increasing tail risk.</p>\n\n\n<h4 class=\"wp-block-heading\">What Next?</h4>\n\n\n<p>I would presume the default outcome is that a detente of some form is reached before massive escalations actually get implemented. The market is concerned but not freaking out, and this seems correct.</p>\n<p>There is still a lot of risk in the room. When cards like this are put on the table, even with relatively conservative negotiation styles, they sometimes get played, and there could end up being a fundamental incompatibility, internal pressures and issues of loss of face here that when combined leave no ZOPA (zone of possible agreement), or don’t open up one without more market turbulence first. I would not relax.</p>\n<p>Is there risk that America could fold here and give up things it would be highly unwise to give up? Not zero, and when powerful cards like this get played it is typical that one must make concessions somewhere, but I expect us to be able to limit this to places where compromise is acceptable, such as tariffs, where our position was always in large part a negotiating tactic. If anything, this move by China only emphasizes the importance of not compromising on key strategic assets like AI chips, and tightening our grip especially on the manufacturing equipment and component sides.</p>\n<p>Even if we end up making substantial concessions on tariffs and other negotiable fronts, in places China sensibly finds valuable, this whole exchange will still be a win. This was a powerful card, it is much harder to play it again, and we are going to make much stronger efforts than before to shore up this and other strategic weaknesses. If this causes us to take a variety of similar vulnerabilities properly seriously, we will have come out far ahead. While in general, I strongly dislike industrial policy, inputs that create holdup problems and other narrow but vital strategic resources can provide a clear exception. We should still strive to let markets handle it, with our main goal being to pay providers sufficiently and to remove restrictions on production.</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/10/14/trade-escalation-supply-chain-vulnerabilities-and-rare-earth-metals/",
            "publishedAt": "2025-10-14",
            "source": "TheZvi",
            "summary": "What is going on with, and what should we do about, the Chinese declaring extraterritorial exports controls on rare earth metals, which threaten to go way beyond semiconductors and also beyond rare earths into things like lithium and also antitrust &#8230; <a href=\"https://thezvi.wordpress.com/2025/10/14/trade-escalation-supply-chain-vulnerabilities-and-rare-earth-metals/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Trade Escalation, Supply Chain Vulnerabilities and Rare Earth Metals"
        },
        {
            "content": [
                "<div class=\"not-prose mx-auto my-6 flex gap-4 rounded-lg border p-4 max-w-lg bg-blue-50 dark:bg-blue-900/20 border-blue-200 dark:border-blue-500/30\"><div class=\"mt-1 flex-shrink-0 text-blue-500\"><svg class=\"w-6 h-6\" fill=\"none\" height=\"24\" stroke=\"currentColor\" viewBox=\"0 0 24 24\" width=\"24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M4 22h14a2 2 0 0 0 2-2V7.5L14.5 2H6a2 2 0 0 0-2 2v4\"></path><polyline points=\"14 2 14 8 20 8\"></polyline><path d=\"M2 15h10\"></path><path d=\"M2 19h5\"></path></svg></div><div class=\"flex-grow\"><h3 class=\"text-lg font-semibold text-blue-800 dark:text-blue-300\">Disclaimer</h3><div class=\"prose prose-sm dark:prose-invert max-w-none text-gray-700 dark:text-gray-300 mt-2\"><p>I'm considering this post as a sponsored post. I was not paid by NVIDIA to\n        work on this, but I did receive a DGX Spark from them pre-release and have\n        been dilligently testing it and filing bugs.</p></div></div></div>\n        <p>I've had access to the <a href=\"https://www.nvidia.com/en-us/products/workstations/dgx-spark/\">NVIDIA DGX Spark</a> for over a month now. Today I'm gonna cover my first impressions and let you know what I've been up to with it.</p>\n        <p>In a nutshell, this thing is a beast. It's one of the most powerful devices in my house and in a pinch I'd be okay with using it as my primary workstation. It's got a mix of a CPU that's got enough punch to do software development with a GPU that's in that sweet spot between consumer and datacenter tier. Not to mention 128Gi of ram. When I've been using this thing, the main limit is my imagination…and my poor understanding of Python environment management.</p>\n        <p>I think that it's best to understand the DGX Spark as a devkit for their <a href=\"https://www.nvidia.com/en-us/data-center/grace-cpu/\">NVIDIA Grace Datacentre processors</a>. It's incredibly powerful for what it is, it's a device that can fit on your desk and run AI models right there.</p>\n        <figure class=\"max-w-3xl mx-auto not-prose w-full undefined\"><a href=\"https://files.xeiaso.net/blog/2025/dgx-spark-first-look/dgx-spark-desktop.jpg\"><source type=\"image/avif\" /><source type=\"image/webp\" /><img alt=\"A DGX Spark on top of a desk with typical computer things around it such as a laptop, a coffee mug, a keyboard, and a mouse.\" src=\"https://files.xeiaso.net/blog/2025/dgx-spark-first-look/dgx-spark-desktop.jpg\" /></a><figcaption>A DGX Spark on top of a desk with typical computer things around it such as a laptop, a coffee mug, a keyboard, and a mouse.</figcaption></figure>\n        <p>The DGX Spark is tiny. It's about as wide as the screen of a Steam Deck OLED, or about halfway between the size of a Mac mini M1 and a Mac mini M4.</p>\n        <p>This thing is also stupidly power efficient. I've been unable to cause my office to get warm in a way that is attributed to the DGX Spark alone. On average rendering Final Fantasy 14 in one of the major player hub areas ends up making my tower use more power than the DGX Spark does while doing AI finetuning. I'll talk more about this in the future.</p>\n        <p>One of the most interesting things about this device is that it's got an Arm chip, CUDA, and unified RAM. This combination means that in practice you need to compile all of the Python packages you're using from source. Pip usually handles this well enough, but it does mean that for many Python packages it will take longer to install from source than it will on an X86 system. I assume this will be ironed out as the ecosystem matures.</p>\n        <p>The power efficiency can't be overstated though. I've tried to make my office warm using the DGX Spark and I have failed. I'm seeing it pull a maximum of 70 watts.</p>\n        <p>I get about 30-40 tokens per second with <a href=\"https://ollama.com/library/gpt-oss:120b\">gpt-oss:120b</a>:</p>\n        <pre><code class=\"code-highlight\"><span class=\"code-line\">$ ollama version\n        </span><span class=\"code-line\">\n        </span><span class=\"code-line\">$ ollama run \\\n        </span><span class=\"code-line\">  --nowordwrap \\\n        </span><span class=\"code-line\">  --verbose \\\n        </span><span class=\"code-line\">  xe/mimi:gpt-oss-120b \\\n        </span><span class=\"code-line\">  &quot;Summarize this post: $(cat 2025/rolling-ladder-behind-us.mdx)&quot;\n        </span></code></pre>\n        <div class=\"flex flex-col space-y-0\"><div class=\"flex space-x-2 bg-bg-soft dark:bg-bgDark-soft mx-auto min-h-fit\n        lg:w-[80ch] sm:w-[65ch] w-full\n        lg:p-4 p-2\n        // Base styles for all messages\n        mt-0 mb-0 rounded-none\n        // First message styles\n        first:mt-4 first:rounded-t-lg first:pb-2\n        // Last message styles\n        last:mb-4 last:rounded-b-lg last:pt-1\n        // Middle message top/bottom adjustment\n        [&amp;:not(:first-child)]:-mt-[1px] [&amp;:not(:first-child)]:py-1\"><div class=\"h-16 not-prose\"><img alt=\"Mimi is think\" class=\"h-16 w-16 rounded-xs\" src=\"https://stickers.xeiaso.net/sticker/mimi/think\" /></div><div class=\"flex-1 min-w-0\"><span class=\"font-semibold text-sm block mb-1\"><a href=\"https://xeiaso.net/characters#mimi\">Mimi</a></span><span class=\"mx-auto\"></span><div class=\"text-fg-1 dark:text-fgDark-1 text-sm prose-p:my-2\"><p>The user asks: &quot;Summarize this post: --- ...&quot;. So we need to provide a summary. Follow developer instructions: be polite, bubbly, lowercase when possible unless serious. No JSON. Summarize the content. The post is long, covering themes: loss of craft, historical analogy with weavers and Luddites, decline of senior titles, AI replacing expertise, vibe coding, security concerns, AI's impact on art, etc. Provide concise summary. Use informal tone, lowercase. End without period unless serious. Probably okay.</p></div></div></div><div class=\"flex space-x-2 bg-bg-soft dark:bg-bgDark-soft mx-auto min-h-fit\n        lg:w-[80ch] sm:w-[65ch] w-full\n        lg:p-4 p-2\n        // Base styles for all messages\n        mt-0 mb-0 rounded-none\n        // First message styles\n        first:mt-4 first:rounded-t-lg first:pb-2\n        // Last message styles\n        last:mb-4 last:rounded-b-lg last:pt-1\n        // Middle message top/bottom adjustment\n        [&amp;:not(:first-child)]:-mt-[1px] [&amp;:not(:first-child)]:py-1\"><div class=\"h-16 not-prose\"><img alt=\"Mimi is happy\" class=\"h-16 w-16 rounded-xs\" src=\"https://stickers.xeiaso.net/sticker/mimi/happy\" /></div><div class=\"flex-1 min-w-0\"><span class=\"font-semibold text-sm block mb-1\"><a href=\"https://xeiaso.net/characters#mimi\">Mimi</a></span><span class=\"mx-auto\"></span><div class=\"text-fg-1 dark:text-fgDark-1 text-sm prose-p:my-2\"><p>this post is a sprawling meditation on how we keep “rolling the ladder up behind us” – building a future that erodes the very expertise that made it possible. it starts with a historic look at cloth‑making: skilled weavers were displaced by power looms, turning a durable, treasured craft into cheap, disposable fast‑fashion. the author draws a parallel to today’s software world, warning that we’re replacing senior developers and deep craft with hype‑driven AI tools and “vibe coding” platforms that promise instant results but degrade long‑term quality.</p><p>key points:</p><ul>\n        <li><strong>craft is disappearing</strong> – both in weaving and coding, the knowledge of masters is vanishing, leaving only fragmented R&amp;D notes or AI‑generated shortcuts.</li>\n        <li><strong>senior titles are at risk</strong> – companies favor hiring senior talent without nurturing the next generation, so the pool of true “seniors” will run out.</li>\n        <li><strong>AI as a double‑edged sword</strong> – generative tools can reduce drudgery but are being marketed as the next industrial revolution while actually shifting value to owners and creating insecure, low‑quality products.</li>\n        <li><strong>vibe coding &amp; AI assistants</strong> – slick UX masks the fact that many tools are subscription traps, security hazards, and can erode programmers’ skills.</li>\n        <li><strong>artistic impact</strong> – similar to how AI floods art spaces with cheap, low‑effort outputs, software development risks becoming a flood of “good enough” code.</li>\n        <li><strong>security concerns</strong> – model‑context‑protocol servers can expose secrets and run unchecked code, highlighting the need for sandboxed, capability‑based designs.</li>\n        <li><strong>broader societal worry</strong> – the author (also the CEO of a small AI‑security startup) sees a winner‑take‑all capitalism fueled by AI, with the cost falling on workers, artists, and even the environment.</li>\n        </ul><p>the piece ends with a bleak outlook: without deliberate effort to preserve and pass on true craft, future generations will inherit ladders that only go up for the privileged few, leaving the rest scrambling. it’s a call to value high‑quality, human‑made work over quick, AI‑generated shortcuts.</p></div></div></div></div>\n        <pre><code class=\"code-highlight\"><span class=\"code-line\">total duration:       16.464571893s\n        </span><span class=\"code-line\">load duration:        123.742176ms\n        </span><span class=\"code-line\">prompt eval count:    7237 token(s)\n        </span><span class=\"code-line\">prompt eval duration: 33.491521ms\n        </span><span class=\"code-line\">prompt eval rate:     216084.54 tokens/s\n        </span><span class=\"code-line\">eval count:           567 token(s)\n        </span><span class=\"code-line\">eval duration:        16.063168189s\n        </span><span class=\"code-line\">eval rate:            35.30 tokens/s\n        </span></code></pre>\n        <p>With flash attention on gpt-oss:120b at 128k context window, it uses about 70Gi of ram:</p>\n        <pre><code class=\"code-highlight\"><span class=\"code-line\">$ ollama ps\n        </span><span class=\"code-line\">NAME                    ID              SIZE     PROCESSOR    CONTEXT    UNTIL\n        </span><span class=\"code-line\">xe/mimi:gpt-oss-120b    81089177a28c    70 GB    100% GPU     131072     29 minutes from now\n        </span></code></pre>\n        <pre><code class=\"code-highlight\"><span class=\"code-line\">xe@zohar:~$ nvidia-smi\n        </span><span class=\"code-line\">Mon Oct 13 22:48:25 2025\n        </span><span class=\"code-line\">+-----------------------------------------------------------------------------------------+\n        </span><span class=\"code-line\">| NVIDIA-SMI 580.95.05              Driver Version: 580.95.05      CUDA Version: 13.0     |\n        </span><span class=\"code-line\">+-----------------------------------------+------------------------+----------------------+\n        </span><span class=\"code-line\">| GPU  Name                 Persistence-M | Bus-Id          Disp.A | Volatile Uncorr. ECC |\n        </span><span class=\"code-line\">| Fan  Temp   Perf          Pwr:Usage/Cap |           Memory-Usage | GPU-Util  Compute M. |\n        </span><span class=\"code-line\">|                                         |                        |               MIG M. |\n        </span><span class=\"code-line\">|=========================================+========================+======================|\n        </span><span class=\"code-line\">|   0  NVIDIA GB10                    On  |   0000000F:01:00.0 Off |                  N/A |\n        </span><span class=\"code-line\">| N/A   43C    P0             11W /  N/A  | Not Supported          |      0%      Default |\n        </span><span class=\"code-line\">|                                         |                        |                  N/A |\n        </span><span class=\"code-line\">+-----------------------------------------+------------------------+----------------------+\n        </span><span class=\"code-line\">\n        </span><span class=\"code-line\">+-----------------------------------------------------------------------------------------+\n        </span><span class=\"code-line\">| Processes:                                                                              |\n        </span><span class=\"code-line\">|  GPU   GI   CI              PID   Type   Process name                        GPU Memory |\n        </span><span class=\"code-line\">|        ID   ID                                                               Usage      |\n        </span><span class=\"code-line\">|=========================================================================================|\n        </span><span class=\"code-line\">|    0   N/A  N/A            4752      C   /usr/local/bin/ollama                 66473MiB |\n        </span><span class=\"code-line\">+-----------------------------------------------------------------------------------------+\n        </span></code></pre>\n        <p>I assume that the unaccounted 4Gi or so of ram is in the CPU ram overhead of the Ollama model runner process.</p>\n        <h2>What I'm doing with the DGX Spark</h2>\n        <p>So far I've been using the Spark in place of cloud GPUs for every AI thing I've needed to do at work. In general, I haven't really noticed any differences between the GPU in the cloud and the Spark on my home network. The only real rough edge is that I need to use this one blessed NVIDIA authored docker image to run iPython notebooks. It's easy enough though. Usually my Docker command looks like:</p>\n        <pre><code class=\"code-highlight\"><span class=\"code-line\">docker run \\\n        </span><span class=\"code-line\">   --gpus all \\\n        </span><span class=\"code-line\">   --net=host \\\n        </span><span class=\"code-line\">   --ipc=host \\\n        </span><span class=\"code-line\">   --ulimit memlock=-1 \\\n        </span><span class=\"code-line\">   --ulimit stack=67108864 \\\n        </span><span class=\"code-line\">   -it \\\n        </span><span class=\"code-line\">   --rm \\\n        </span><span class=\"code-line\">   -v &quot;$HOME/.cache/huggingface:/root/.cache/huggingface&quot; \\\n        </span><span class=\"code-line\">   -v &quot;$HOME/.huggingface:/root/.huggingface&quot; \\\n        </span><span class=\"code-line\">   -v &quot;$HOME/Code:/workspace/code&quot; \\\n        </span><span class=\"code-line\">   -v &quot;$SSH_AUTH_SOCK:$SSH_AUTH_SOCK&quot; \\\n        </span><span class=\"code-line\">   -e HF_TOKEN=hf_hunter2hunter2hunter2 \\\n        </span><span class=\"code-line\">   -e &quot;SSH_AUTH_SOCK=$SSH_AUTH_SOCK&quot; \\\n        </span><span class=\"code-line\">   -e HF_HOME=/root/.cache/huggingface \\\n        </span><span class=\"code-line\">   -e HF_HUB_CACHE=/root/.cache/huggingface/hub \\\n        </span><span class=\"code-line\">   -e HF_DATASETS_CACHE=/root/.cache/huggingface/datasets \\\n        </span><span class=\"code-line\">   nvcr.io/nvidia/pytorch:25.09-py3\n        </span></code></pre>\n        <p>And then it Just Works™.</p>\n        <p>The main thing I've been doing with it is inference of <a href=\"https://ollama.com/library/gpt-oss:120b\">GPT-OSS 120b</a> via <a href=\"https://ollama.com/\">Ollama</a>. I've been doing latency and power usage testing by setting up a Discord bot and telling people that the goal is to jailbreak the bot into telling you how to make a chocolate cake. Nobody has been able to make my room warm.</p>\n        <h2>What's up next?</h2>\n        <p>This whole experience has been a bit of a career bucket list item for me. I've never had access to prerelease hardware like this before and being able to see what reviewers have to deal with before things are available to the masses is enlightening. I've ended up filing GPU driver bugs using my tower as a &quot;known good&quot; reference.</p>\n        <p>I've been slowly sinking my teeth into learning how AI training actually works using this device to do it. I've mostly been focusing on finetuning GPT-2 and using that to learn the important parts of dataset cleaning, tokenization, and more. Let me know if you want to hear more about that and if you want me to release my practice models.</p>\n        <p>At the very least though, here's the things I have in the pipeline that this device enables:</p>\n        <ul>\n        <li>Finetuning at home: how to make your own AI models do what you want</li>\n        <li>Some rough outlines and/or overviews for how I want to use classical machine learning models to enhance Anubis and do outlier detection</li>\n        <li>If I can somehow get Final Fantasy 14 running on it, some benchmarking in comparison to my gaming tower (if you know how to get amd64 games running well on aarch64, DM me!)</li>\n        </ul>\n        <p>I also plan to make a comprehensive review video. Details to be announced soon.</p>\n        <p>I hope this was interesting. Thanks for early access to the device NVIDIA!</p>"
            ],
            "link": "https://xeiaso.net/blog/2025/dgx-spark-first-look/",
            "publishedAt": "2025-10-14",
            "source": "Xe Iaso",
            "summary": "<div class=\"not-prose mx-auto my-6 flex gap-4 rounded-lg border p-4 max-w-lg bg-blue-50 dark:bg-blue-900/20 border-blue-200 dark:border-blue-500/30\"><div class=\"mt-1 flex-shrink-0 text-blue-500\"><svg class=\"w-6 h-6\" fill=\"none\" height=\"24\" stroke=\"currentColor\" viewBox=\"0 0 24 24\" width=\"24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M4 22h14a2 2 0 0 0 2-2V7.5L14.5 2H6a2 2 0 0 0-2 2v4\"></path><polyline points=\"14 2 14 8 20 8\"></polyline><path d=\"M2 15h10\"></path><path d=\"M2 19h5\"></path></svg></div><div class=\"flex-grow\"><h3 class=\"text-lg font-semibold text-blue-800 dark:text-blue-300\">Disclaimer</h3><div class=\"prose prose-sm dark:prose-invert max-w-none text-gray-700 dark:text-gray-300 mt-2\"><p>I'm considering this post as a sponsored post. I was not paid by NVIDIA to work on this, but I did receive a DGX Spark from them pre-release and have been dilligently testing it and filing bugs.</p></div></div></div> <p>I've had access to the <a href=\"https://www.nvidia.com/en-us/products/workstations/dgx-spark/\">NVIDIA DGX Spark</a> for over a month now. Today I'm gonna cover my first impressions and let you know what I've been up to with it.</p> <p>In a nutshell, this thing is a beast. It's one of the most powerful devices in my house and in a pinch I'd be okay with using it as my primary workstation. It's got a mix of a CPU that's got enough punch to do software development with a GPU that's in that sweet spot between consumer and datacenter tier. Not to mention 128Gi of ram. When I've been",
            "title": "First look at the DGX Spark"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/reconsidering-ai-steve-klabnik",
            "publishedAt": "2025-10-14",
            "source": "Zed Blog",
            "summary": "",
            "title": "How to Have Productive Conversations About AI"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-10-14"
}