{
    "articles": [
        {
            "content": [
                "<p><img alt=\"\" src=\"https://www.dbreunig.com/img/school_of_fish.jpg\" /></p>\n\n<h3 id=\"a-blue-ocean-turns-red-in-18-months\">A Blue Ocean Turns Red in &lt;18 Months</h3>\n\n<p>If we look at the ecosystem of AI-powered products, there’s a clear pattern of how they emerge and roll out to the world:</p>\n\n<ol>\n  <li><strong>Initial POC:</strong> Someone throws together a software demo – not a robust product ready for public consumption – proving a capability. Often this comes from an open source developer, academic researcher, or an R&amp;D team at a larger company. The demo catches fire, hits the frontpage of Hacker News, and circulates through social media.</li>\n  <li><strong>Open Experimentation:</strong> Open source devs and projects start to experiment with the concept, adding support for the feature to their framework or shipping usable software. This is a Cambrian Era, when lots of variants hit Github and get kicked around.</li>\n  <li><strong>Fast-Mover Launch:</strong> Eventually, a fast moving company brings a product to market. This could be a start up built around the core idea or it could be an existing organization that quickly adds the feature or product to their offering. For the first time, people are paying (or not paying, depending on if the demand is there and the demo works in production).</li>\n  <li><strong>Incumbent Clone:</strong> Finally, large companies bring the product or feature to their offerings.</li>\n</ol>\n\n<p>For example, let’s look at <strong>text-to-SQL</strong>.</p>\n\n<p>In 2022, prior to ChatGPT’s launch, Immanuel Trummer published <a href=\"https://itrummer.github.io/CodexDB/\">CodexDB</a>, which translated natural language into SQL queries<sup id=\"fnref:codex\"><a class=\"footnote\" href=\"https://www.dbreunig.com/2025/09/13/the-ai-product-cycle.html#fn:codex\" rel=\"footnote\">1</a></sup>. As ChatGPT juiced the AI ecosystem, text-to-SQL became an early example of a business application. LangChain and others shipped components for building and enabling text-to-SQL use cases. In short order, all the large data platforms cloned the feature, including Tableau, Snowflake, and Databricks.</p>\n\n<p>Usually, this cycle happens relatively fast, in less than 18 months.</p>\n\n<p>How many times has it happened? I count at least 8:</p>\n\n<ul>\n  <li><strong>Text-to-SQL:</strong> See above.</li>\n  <li><strong>Customer Service Bots:</strong> Chatbot interfaces to FAQs</li>\n  <li><strong>Document Q&amp;A:</strong> Turnkey RAG applications with chatbot interfaces</li>\n  <li><strong>Note Taking &amp; Summarization:</strong> Meeting transcription with extracted summaries and follow-ups.</li>\n  <li><strong>Search:</strong> Perplexity-style search that uses LLMs to package information gathered from web queries.</li>\n  <li><strong>Code Text Completion:</strong> Auto-suggest in IDEs as you edit code, powered by AI.</li>\n  <li><strong>Coding Agents:</strong> Tools like Cursor and Claude Code that perform whole coding tasks for you.</li>\n  <li><strong>Deep Research:</strong> Like search, but with longer depth, wider breadth, and more depth in pursuit of assembling a report.</li>\n  <li><strong>Browser Control:</strong> Browsers driven by AI to accomplish tasks the user provides.</li>\n</ul>\n\n<p>I’m sure there’s some product archetypes we’ve missed.</p>\n\n<p>What can we learn from this pattern and the way we’ve been steadily encountering new archetypes, then walking them through the process above?</p>\n\n<ol>\n  <li><strong>Ideas come from hackers, not customers.</strong> Few people know how to conceptualize products and cobble together unique applications with AI. This skill comes only through experience and play, and for these first few years most ideas come from the open source community in the form of demos. Not from designers, product managers, or feedback from customers. Applied AI ideas are hard, but execution is cheap. Which is a nice set up to our next take-away…</li>\n  <li><strong>Cloning happens faster when the model is the magic.</strong> Cloning happened in previous eras, but nowhere near as fast. Start ups would create markets, prove their worth, and only <em>then</em> would larger companies invest in their own teams, projects, and (often) acquisition. Today, when so much of the lift comes from the model itself, there’s little reason to wait (especially when there are few other low-hanging ideas).</li>\n  <li><strong>Applied AI start-ups need a niche.</strong> When big companies can enter the market in a matter of months, it’s more imperative than ever that start-ups focus on a niche. Google or OpenAI can clone your product, but they’re not nimble enough to invest in your outreach with a specific community and tailoring their product for a segment doesn’t make business sense. Most of the general-purpose RAG start-ups from 2023 have pivoted or failed, but those that focused on one sector (legal, medical, insurance, financing, etc.) are <em>thriving</em>.</li>\n  <li><strong>If you’re not niche, you better build a beachhead in &lt;12 months.</strong> If you insist on shipping a general purpose applied AI product, and think being early to market is an advantage…well…think again. Cloning moves so fast, you better have an incredble gameplan to pull off significant market acquisition in a handful of months – which will then fuel you through user feedback, training data, and more. But unless you launch with both an <em>incredible</em> marketing advantage and a killer product, you’ll face incredibly tough competition once the big players enter.</li>\n</ol>\n\n<p>The idea that fast-following occurs faster than ever, thanks to everyone having access to the same models, is related to the, “<a href=\"https://www.dbreunig.com/2025/05/27/will-the-model-eat-your-stack.html\">Will the model eat your stack?</a>” problem we discussed earlier.</p>\n\n<p>Considering both the rapid cloning problem and the speed of model advancements, I think every non-niche, applied AI start up needs to ask themselves two questions:</p>\n\n<ol>\n  <li><strong>If a better model arrives tomorrow, does your product get better or does your backend get simpler?</strong> If your product doesn’t get better, you need to rethink. A better model simplifying your backend (by reducing the complexity of your prompts, <a href=\"https://x.com/antonosika/status/1926719161935233139\">your error handling</a>, your infra, etc.) makes your product easier to clone.</li>\n  <li><strong>If you are early to market with this use case, what are you going to do in a handful of months that will fend off Google/OpenAI/whomever’s entry into your market?</strong> Cursor and Perplexity are the rare examples that have managed to grow fast enough to be able to fend off larger entrants. What are you going to do, if you can’t go niche, to prepare your defenses?</li>\n</ol>\n\n<hr />\n\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/dbreunig\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <label for=\"bd-email\">Enter your email to receive the occasional update.</label>\n  <div class=\"form-input\">\n    <input id=\"bd-email\" name=\"email\" type=\"email\" />\n    <input type=\"submit\" value=\"Subscribe\" />\n  </div>\n</form>\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:codex\">\n      <p>CodexDB used OpenAI’s <a href=\"https://en.wikipedia.org/wiki/OpenAI_Codex\">Codex model</a>, published in 2021. This is <em>not</em> their <a href=\"https://openai.com/codex/\">coding tool named Codex</a>. <a class=\"reversefootnote\" href=\"https://www.dbreunig.com/2025/09/13/the-ai-product-cycle.html#fnref:codex\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>"
            ],
            "link": "https://www.dbreunig.com/2025/09/13/the-ai-product-cycle.html",
            "publishedAt": "2025-09-13",
            "source": "Drew Breunig",
            "summary": "Markets for new AI use cases turn from blue oceans to red oceans in under 18 months. Start-ups need to go niche or have one helluva plan.",
            "title": "AI Companies School Like Fish"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-09-13"
}