{
    "articles": [
        {
            "content": [
                "<p>Two weeks ago, I was at Queer Craft – a fortnightly meet-up at <a href=\"https://slipstitchldn.co.uk\">Slipstitch</a>, a haberdashery and yarn shop near Alexandra Palace.\nI was working on a cross stitch piece of a train in a snowy landscape, chatting to my friends, admiring their creations, and gently snacking on a variety of baked goods.</p>\n\n<p>This week, I wasn’t there, because Slipstitch closed its doors on Saturday.</p>\n\n\n\n<figure>\n  \n\n\n\n\n  \n  <source type=\"image/avif\" />\n  \n  <source type=\"image/webp\" />\n  \n  <source type=\"image/jpeg\" />\n  \n  <img alt=\"A photo of the shop's exterior. It has bright turquoise paint with the word ‘Slipstitch’ in gold lettering across the top, and large windows that show the shop interior. You can see shelves, balls of wool, and two large wooden knitting needles.\" src=\"https://alexwlchan.net/images/2025/slipstitch_exterior_1x.jpg\" width=\"600\" />\n\n\n\n\n  <figcaption>\n    Slipstitch in sunnier times.\n    Photo from the <a href=\"https://slipstitchldn.co.uk/pages/about-us\">Slipstitch website</a>.\n  </figcaption>\n</figure>\n\n<p>I can’t remember exactly when I first came across Slipstitch, but I remember why.\nSlipstitch was sometimes the target of stickering campaigns from TERFs and anti-trans campaigners, who objected to Rosie’s <a href=\"https://www.instagram.com/p/DIjI4ukoH8D/\">vocal support of trans people</a>. (Rosie is the shop’s owner and a dear friend.)</p>\n\n<p>This discussion spilled onto Twitter, and at some point Rosie’s tweets appeared in my timeline.\nI saw the shop account calling out the stickers and re-affirming its support of trans people, and since I’m trans and I do <a href=\"https://alexwlchan.net/tags/cross-stitch/\">lots of cross-stitch</a>, I decided to check it out.\nI looked around the online store, thinking I might buy some thread – then I found an event called “Queer Craft”, and booked.</p>\n\n<p>Turning up the next Monday, I was a bit nervous – would I be queer enough?\nWould I be crafty enough?\nFor whatever reason, my mental image of a craft meetup is people doing knitting or crochet – does anybody bring cross-stitch to these things?</p>\n\n<p>My nerves were quickly put at ease – Rosie welcomed me enthusiastically, and I settled in.\nI sat down at the table, put on a name badge, and took out my cross-stitch.\nAs I stitched away, I started chatting to strangers who would soon become friends.</p>\n\n<p>Queer Craft was every other Monday, and I began making regular trips to Muswell Hill for two hours of crafting and conversation.\nWe’d admire each other’s work, and share tips and advice if somebody was struggling.\nThe group was always generous with knowledge, equipment, and sympathy for unexpected snags – but the conversation often drifted away from our crafts.</p>\n\n<hr />\n\n<p>As we got to know each other more, we developed in-jokes and stories and familiar topics.\nWe’d talk about Taskmaster and <a href=\"https://taskmaster.fandom.com/wiki/Give_your_guest_the_best_service\">the careers of cutlery salesmen</a>.\nWe’d discuss what it’s like to grow up in Cornwall.\nWe’d chat about <a href=\"https://operationmincemeat.com\">theatre shows</a> and West End drama.\nEveryone made jokes about how I’m a spy.\n(<a href=\"https://www.gchq.gov.uk\">I’m not a spy</a>.)\nRosie would tell us about <a href=\"https://en.wikipedia.org/wiki/Paprika\">the wrong way to make coffee</a>.\nWe passed around many, many photos of our pets.</p>\n\n<p>I know that Rosie was always keen for Queer Craft to be welcoming to newcomers and not too “clique”-y – I suspect the rate of in-jokes made that difficult, but I admire the effort.\n(I wonder if that’s the fate of all groups designed to help strangers meet?\nEither it fizzles out, or a group of regulars gradually forms that makes it harder for new people to join.)\nI confess I was never too worried about this, because I was too busy having a nice time with my friends.</p>\n\n<!-- Queer Craft became an important fixture in my diary.\nI'd look forward to Mondays, when I could make light-hearted conversation with my friends and make progress on whatever cross-stitch project I was working on.\nI arranged my day job so I could make a prompt exit, and I was always upset when I had to miss a session. -->\n\n<p>Craft is such a personal hobby, and we saw glimpses of each other’s lives through the things we were making, especially when they were gifts for somebody else.\nSomebody making a baby blanket for a friend, or a stuffed toy for a parent, or some socks for a partner.\nEveryone poured so much time and love into their work.\nIt felt very intimate and special.</p>\n\n<p>I’m always a bit nervous about how visibly trans to be, but that was never an issue at Queer Craft – something I should have known from the start, thanks to Rosie’s vocal support of her trans staff and customers.\nEveryone treated transness as so self-evidently normal, it didn’t bear comment.</p>\n\n<p>Sometimes I was femme, and sometimes I was masc, and nobody batted an eyelid.\n(Apart from the time Rosie took one look at my officewear and described it as “corporate drag”, a burn so savage I may never recover.)\nThat sense of casual, unconditional trans acceptance feels like it’s getting more common – but it’s still nice every time.</p>\n\n<p>These friendships have spilled out of Slipstitch and into the world beyond.\nOne Queer Craft regular is a published author, and some of us went to celebrate her at a book event.\nSeveral others are in choirs, and I’ve been to see them sing.\nLast year, I invited people round to my house for “Queer Crafternoon”, where we all crafted in my living room and ate scones with jam and cream.</p>\n\n<hr />\n\n<p>Nine weeks ago, Rosie told us that <a href=\"https://www.instagram.com/p/DJ3tL2co13-/\">she’d decided to close the physical shop</a>.\nThe world is tough for small businesses, and tougher for the person running them.\nI’m sad, but I could see how much stress it was putting on Rosie, and I respect her decision to put her own wellbeing first, and to close the doors on her own terms.</p>\n\n<p>On Saturday, Rosie held a party to mark the closing of the space.\nThe shelves were empty, the room anything but.\nThere were Queer Craft friends, regulars from the other Meet &amp; Make group, people who’d come to Rosie’s classes, regular customers, and other friends of the shop.\nThe community around Slipstitch is much more than just the queers who met on Monday evenings.\nThe shop was the busiest I’ve ever seen it, and it was lovely to see so many people there to celebrate and mourn.</p>\n\n<figure>\n  \n\n\n\n\n  \n  <source type=\"image/avif\" />\n  \n  <source type=\"image/webp\" />\n  \n  <source type=\"image/jpeg\" />\n  \n  <img alt=\"A rendition of the shopfront in cross-stitch, mounted in a gold frame on a brick wall. The shop is a simple geometric design in turquoise thread, and each of the three windows shows a mini-display – a pair of barbies, a pair of jumpers on stands, six balls of wool in rainbow colours.\" src=\"https://alexwlchan.net/images/2025/slipstitch_1x.jpg\" width=\"600\" />\n\n\n\n\n  <figcaption>\n    My closing gift for Rosie was her shopfront, rendered in cross-stitch.\n    I had a lot of fun designing the little details – the <a href=\"https://www.instagram.com/p/DDHUgVuIW8E/\">barbies in the shop window</a>, the jumpers on display, the balls of wool in a rainbow pattern.\n    And of course, I bought all the thread from her, but fortunately she never thought to ask why I was buying so much <a href=\"https://www.lakesideneedlecraft.co.uk/959----dmc-stranded-cotton-thread-27895-p.asp\">turquoise thread</a>.\n  </figcaption>\n</figure>\n\n<p>I’m sure Queer Craft and our friendships will continue in some shape or form, but sitting here now, I can’t help but be a little upset about what we’ve lost.\nOf course, there are other haberdasheries, and there are other queer craft groups – it’s hardly a unique idea – but Slipstitch was the haberdashery where <em>I</em> shopped, it’s where <em>our</em> group met, and I’m sad to know it’s gone.</p>\n\n<p>In <a href=\"https://alexwlchan.net/files/2025/so-long-slipstitch.html\">her final newsletter</a> before the closure, Rosie wrote “[Slipstitch] never wanted for community”.\nI think that’s a lovely sentiment, and one that rung true in my experience – it always felt like such a friendly, welcoming space, and I’m glad I found it.\nI hope the friendships forged in Queer Craft will survive a long time after the physical shop is gone.\nI know that Rosie wants Slipstitch to continue as an idea, if not a physical venue, and I’m excited to see what happens next.</p>\n\n<p>Her words also made me reflect on the fragility of our community spaces – those places where we can meet strangers and bond over a common interest.\nThey’re getting scarcer and scarcer.\nAs every bit of land is forced into more and more commercialisation, we’re running out of places to just hang out and meet people.\nWe often talk about how hard it is to make friends as an adult – and that’s in part because the spaces where we might do so are dwindling.</p>\n\n<p>These community spaces are precious for queer people, yes, but for everyone else too.\nI’m sad that the shop has closed, and I’m sad that this iteration of Queer Craft is over, and I’m sad that this is a trend.\nThese spaces are rare, and getting rarer – we shouldn’t take them for granted.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2025/slipstitch/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2025/slipstitch/?ref=rss",
            "publishedAt": "2025-07-30",
            "source": "Alex Chan",
            "summary": "<p>Two weeks ago, I was at Queer Craft – a fortnightly meet-up at <a href=\"https://slipstitchldn.co.uk\">Slipstitch</a>, a haberdashery and yarn shop near Alexandra Palace. I was working on a cross stitch piece of a train in a snowy landscape, chatting to my friends, admiring their creations, and gently snacking on a variety of baked goods.</p> <p>This week, I wasn’t there, because Slipstitch closed its doors on Saturday.</p> <figure> <source type=\"image/avif\" /> <source type=\"image/webp\" /> <source type=\"image/jpeg\" /> <img alt=\"A photo of the shop's exterior. It has bright turquoise paint with the word ‘Slipstitch’ in gold lettering across the top, and large windows that show the shop interior. You can see shelves, balls of wool, and two large wooden knitting needles.\" src=\"https://alexwlchan.net/images/2025/slipstitch_exterior_1x.jpg\" width=\"600\" /> <figcaption> Slipstitch in sunnier times. Photo from the <a href=\"https://slipstitchldn.co.uk/pages/about-us\">Slipstitch website</a>. </figcaption> </figure> <p>I can’t remember exactly when I first came across Slipstitch, but I remember why. Slipstitch was sometimes the target of stickering campaigns from TERFs and anti-trans campaigners, who objected to Rosie’s <a href=\"https://www.instagram.com/p/DIjI4ukoH8D/\">vocal support of trans people</a>. (Rosie is the shop’s owner and a dear friend.)</p> <p>This discussion spilled onto Twitter, and at some point Rosie’s tweets appeared in my timeline. I saw the shop",
            "title": "Slipstitch, Queer Craft, and community spaces"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/2000-words-about-arrays-and-tables/",
            "publishedAt": "2025-07-30",
            "source": "Hillel Wayne",
            "summary": "<p>I'm way too discombobulated from getting next month's release of <a href=\"https://leanpub.com/logic/\" target=\"_blank\">Logic for Programmers</a> ready, so I'm pulling a idea from the slush pile. Basically I wanted to come up with a mental model of arrays as a concept that explained APL-style multidimensional arrays and tables but also why there weren't multitables.</p> <p>So, arrays. In all languages they are basically the same: they map a sequence of numbers (I'll use <code>1..N</code>)<sup id=\"fnref:1-indexing\"><a class=\"footnote-ref\" href=\"https://buttondown.com/hillelwayne/rss#fn:1-indexing\">1</a></sup> to homogeneous values (values of a single type). This is in contrast to the other two foundational types, associative arrays (which map an arbitrary type to homogeneous values) and structs (which map a fixed set of keys to <em>heterogeneous</em> values). Arrays appear in PLs earlier than the other two, possibly because they have the simplest implementation and the most obvious application to scientific computing. The OG FORTRAN had arrays. </p> <p>I'm interested in two structural extensions to arrays. The first, found in languages like nushell and frameworks like Pandas, is the <em>table</em>. Tables have string keys like a struct <em>and</em> indexes like an array. Each row is a struct, so you can get \"all values in this column\" or \"all values for this row\". They're",
            "title": "2000 words about arrays and tables"
        },
        {
            "content": [
                "<p>I promised some people longer responses:</p><ul><li><p><a href=\"https://substack.com/@astralcodexten/note/c-124794836\">Thomas Cotter asks</a> why people think &#8220;consistency&#8221; is an important moral value. After all, he says, the Nazis and Soviets were &#8220;consistent&#8221; with their evil beliefs. I&#8217;m not so sure of his examples - the Soviets massacred workers striking for better conditions, and the Nazis were so bad at race science that they banned IQ tests after Jews outscored Aryans - but I&#8217;m sure if he looked harder he could find some evil person who was superficially consistent with themselves.</p></li><li><p><a href=\"https://x.com/HenMazzig\">Hen Mazzig on Twitter</a> is suspicious that lots of people oppose the massacres in Gaza without having objected equally strenuously to various other things. Again, he&#8217;s bad at examples - most of the things he names are less bad than the massacres in Gaza - but I&#8217;m sure if he looked harder he could find some thing which was worse than Gaza and which not quite as many people had protested. Therefore, people who object to the massacres in Gaza must be motivated by anti-Semitism.</p></li><li><p>An r/TrueUnpopularOpinion poster argues that <a href=\"https://www.reddit.com/r/TrueUnpopularOpinion/comments/1jea1p1/no_one_actually_cares_about_gaza_your_anger_is/\">No One Actually Cares About Gaza; Your Anger Is Performative</a>. They say that (almost) nobody can actually sustain strong emotions about the deaths of some hard-to-pin-down number of people they don&#8217;t know, and so probably people who claim to care are virtue-signaling or luxury-believing or one of those things.</p></li></ul><p>Since 2/3 of these are about Gaza, we&#8217;ll start there. And since there&#8217;s so much virtue-signaling and luxury-believing going around these days, I assure you that what I am about to share is my absolute most honest and deepest opinion, the one I hold in my heart of hearts.</p><p>A few months ago, I read an article by an aid worker in Gaza recounting the horrors he&#8217;d seen. Among a long litany, one stood out. A little kid came into the hospital with a backpack. The doctors told him he had to put it down so they could treat him, and he refused. The doctors insisted. The kid fought back. Finally someone opened the bag. It was some body part fragments from the kid&#8217;s dead brother. He couldn&#8217;t bear to leave him, so he carried them everywhere he went.</p><p>I am a Real Man and therefore do not cry. But I confess to getting a little misty at this story, and I know exactly why. When my 1.5-year-old son wakes up early, the first words out of his mouth when I extract him from his crib are &#8220;Yaya? Yaya?&#8221; which is how he says his sister Lyra&#8217;s name. No matter how I distract him, he&#8217;ll keep saying &#8220;Yaya? Yaya?&#8221; and pointing at the door to her room until she wakes up, at which point he&#8217;ll get a big smile and run over to her. It&#8217;s impossible for me to read this story without imagining her body parts in the backpack and him saying &#8220;Yaya? Yaya?&#8221; in an increasingly distressed voice, over and over again, until the doctors drag him away.</p><p>So my absolute most honest and deepest opinion on the war in Gaza, the one I hold in my heart of hearts, is: I would kill everyone in the entire region, on both sides, if it would give that kid his brother back.</p><p>Probably this is why God doesn&#8217;t connect people&#8217;s heart-of-hearts directly to their motor cortex. Instead, He wisely intermediates other brain regions with names like &#8220;anterior cingulate gyrus&#8221; and &#8220;dorsolateral prefrontal area&#8221;, the places where rationality happens. When I use my anterior cingulate gyrus and dorsolateral prefrontal area, I have thoughts like these:</p><ul><li><p>Probably there are many other people in that region who have stories which are objectively just as sad as that boy&#8217;s, but not precisely targeted to my personal heart-strings.</p></li><li><p>Probably there are many other people in that region who have stories which <em>would </em>tug on my heart-strings just as much if I knew about them, but nobody has written articles about them. Or someone did, but I didn&#8217;t read them.</p></li><li><p>Even if I could kill everyone in the region to get that kid his brother back (how? some kind of deal with the Devil?) probably some of those people who I killed would have brothers, and some of <em>those</em> people would meet aid workers who would write sad articles, and then I&#8217;d be sad about <em>them</em>.</p></li><li><p>If <em>my</em> country were being bombed, and <em>my</em> kids were being killed, and someone in another country had the capacity to affect the situation - even in the tiniest of ways - I would want that person doing the most sophisticated utility-maximization possible, not making semi-random bad decisions based on who got sympathetic articles written about them or tugged at their heart-strings the most.</p></li></ul><p>If I were to get all Kantian about it, I would say it feels <em>beneath my dignity as a rational being </em>to let my opinion on important world affairs be determined by which journalist managed to get the most horrifying story in front of my eyeballs today - and maybe pivot to the opposite side tomorrow when someone else catches my attention.</p><p>Instead I try to have general principles. It&#8217;s bad to kill people. It&#8217;s bad to make people suffer. Then I add epicycle upon epicycle - is there a principle that countries which suffer terrorist attacks have the right to defend themselves? If no, then kids might lose their siblings in terrorist attacks that haven&#8217;t been disincentivized; if yes, that &#8220;defense&#8221; might produce &#8220;collateral damage&#8221;. Is there a principle that people who have had their land stolen can launch terrorist attacks to get it back? If yes, those terrorist attacks might kill kids&#8217; siblings; if no, land-stealing might be so costless that rights become meaningless and the world devolves into constant colonial conflict, which seems like the sort of thing where lots of siblings might die. I won&#8217;t mention where I stand on these questions - partly because I don&#8217;t want to start WWIII in the comments, partly because I&#8217;m not that sure myself - but I want to defend considering them. But at the end of considering them, I should treat whatever answer I get not as an <em>alternative</em> to doing something about my grief at the few stories that really catch my attention, but as an <em>apotheosis</em> of that grief - a stronger, more rigorous version of that grief, better by its own values and more capable of achieving its own goals. </p><p>I already know how some of you are going to respond. You&#8217;ll say that caring about a kid in Gaza because they passingly resemble my own kids is a misfire, a chance coincidence of emotional circuits. I should simply care about my own kids directly. But even caring about my own kids is a shaky alliance between my heart of hearts and dorsolateral prefrontal cortex. There are moments when I catch my kids smiling at me, and I know in my heart of hearts that I love them more than life itself and would do anything for them. There are also moments - usually when my son is throwing a tantrum - where I want to strangle him. Being a good parent involves this same process of deciding that a rational being shouldn&#8217;t be whirled back and forth by random emotions all the time - loving his kids one moment and strangling them the next. It&#8217;s transmuting transitory emotions into trustworthy principles like &#8220;I love my children all the time and want the best for them&#8221;.  I could not love you so, my dear, loved I not Honor more.</p><p>(also, real evolution fans don&#8217;t even love their own children - they donate to sperm banks and let other people invest resources in raising them. All human values disappear if you zoom out too far <em>or zoom in too far </em>- so what?  So don&#8217;t do that.)</p><p>So here is my response to all three of the people I said I owed responses to.</p><p><strong>To Thomas:</strong> consistency matters because it&#8217;s how morality forms in the first place. Everybody has some moral impulses. Those become principles only under the influence of a desire for consistency and for the dignity of a rational being. Hitler was a vegetarian, so he must have had some aversion to cruelty. That plus <s>a dollar will buy you a soda</s> a desire for consistency can prevent you from being history&#8217;s greatest villain.</p><p><strong>To Hen:</strong> absent a level of perfect angelic rationality that no one has, we will never complete the process of generalization. Part of us will remain undignified slaves to whatever we hear heart-wrenching media stories about, whatever reminds us of people we know, and <a href=\"https://slatestarcodex.com/2014/12/17/the-toxoplasma-of-rage/\">whatever sparks enough controversy to keep our attention</a>. I can be sad about 9-11 even if I forgot to condemn a terrorist attack in Ougadogou two weeks earlier; I can be sad about the Holocaust even if I've never cried equally hard reading a book about the Taiping Rebellion, I can see my own kids in Columbine victims even if I have failed to see them in children affected by hookworm in Uganda. I&#8217;m not even sure I want to become a perfectly rational angelic being who has generalized every principle to the maximum extent - it sounds scarily inhuman. But to the extent that I do generalize, I would like to at least consider generalizing in the direction of more empathy (this one kid tugs at my heart - maybe I should also care about the war in Sudan!) rather than always in the direction of callousness (I didn&#8217;t notice the war in Sudan when it was happening - perhaps I&#8217;m not allowed to care about this kid either).</p><p><strong>To the anonymous Redditor:</strong> no, I can&#8217;t actually feel emotions about everyone in Gaza, and I&#8217;m not sure anyone else can either. This doesn&#8217;t mean concern must be virtue signaling or luxury beliefs. It just means that it requires principle rather than raw emotion. One death is a tragedy, a million deaths is a statistic. But if you&#8217;re interested in having the dignity of a rational animal (a perfectly acceptable hobby! no worse than trying to get good at Fortnite or whatever!) then eventually you notice that a million is made out of a million ones and try to act accordingly.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/my-heart-of-hearts",
            "publishedAt": "2025-07-30",
            "source": "SlateStarCodex",
            "summary": "<p>I promised some people longer responses:</p><ul><li><p><a href=\"https://substack.com/@astralcodexten/note/c-124794836\">Thomas Cotter asks</a> why people think &#8220;consistency&#8221; is an important moral value. After all, he says, the Nazis and Soviets were &#8220;consistent&#8221; with their evil beliefs. I&#8217;m not so sure of his examples - the Soviets massacred workers striking for better conditions, and the Nazis were so bad at race science that they banned IQ tests after Jews outscored Aryans - but I&#8217;m sure if he looked harder he could find some evil person who was superficially consistent with themselves.</p></li><li><p><a href=\"https://x.com/HenMazzig\">Hen Mazzig on Twitter</a> is suspicious that lots of people oppose the massacres in Gaza without having objected equally strenuously to various other things. Again, he&#8217;s bad at examples - most of the things he names are less bad than the massacres in Gaza - but I&#8217;m sure if he looked harder he could find some thing which was worse than Gaza and which not quite as many people had protested. Therefore, people who object to the massacres in Gaza must be motivated by anti-Semitism.</p></li><li><p>An r/TrueUnpopularOpinion poster argues that <a href=\"https://www.reddit.com/r/TrueUnpopularOpinion/comments/1jea1p1/no_one_actually_cares_about_gaza_your_anger_is/\">No One Actually Cares About Gaza; Your Anger Is Performative</a>. They say that (almost) nobody can actually sustain strong emotions about the deaths of",
            "title": "My Heart Of Hearts"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3122/",
            "publishedAt": "2025-07-30",
            "source": "XKCD",
            "summary": "<img alt=\"During the most recent glacial maximum, it's believed that land bridges extended from the surfaces and connected several of the spheres together.\" src=\"https://imgs.xkcd.com/comics/bad_map_projection_interrupted_spheres.png\" title=\"During the most recent glacial maximum, it's believed that land bridges extended from the surfaces and connected several of the spheres together.\" />",
            "title": "Bad Map Projection: Interrupted Spheres"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-30"
}