{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>For the past week, I've been working off the <a href=\"https://www.minisforum.com/products/minisforum-um680-um760-um870-slim?variant=49516307939634\">Minisforum UM870</a>. A tiny mini PC with an 8-core/16-thread AMD 8745H CPU, which retails for <a href=\"https://www.amazon.com/MINISFORUM-Barebone-Computer-5-0GHz-Support/dp/B0DL5ZRQV3/\">$343</a> (or <a href=\"https://minisforumpc.eu/products/um680-760-870-slim-mini-pc?variant=51700059144558\">€379</a>) as a bare-bone unit, and stays below $550, even after adding <a href=\"https://www.amazon.com/Crucial-5600MT-5200MT-4800MT-CT48G56C46S5/dp/B0C79LKJK4/\">48GB of RAM</a> and <a href=\"https://www.amazon.com/WD_BLACK-SN850X-Internal-Gaming-Solid/dp/B0B7CKVCCV/\">1TB of storage</a>. I'm shocked to report that I really don't need more than this!</div><div><br />I mean, I knew that Apple's Mac Mini, which is equally petite to the Minisforum, had plenty of power for macOS. But somehow I thought Apple had some special sauce that made this possible, and that PCs were forever condemned to be bigger, louder, and slower. How 2020 of me.</div><div><br />The UM870 is a little beast. It runs our full HEY test suite in just 2m28s. In comparison, it takes a 14-core M4 Pro 2m49s, and such <a href=\"https://www.apple.com/shop/buy-mac/mac-mini/apple-m4-pro-chip-with-12-core-cpu-16-core-gpu-24gb-memory-512gb\">an Apple costs $2,199</a>, once you've given it 48GB of RAM and 1TB of storage.</div><div><br />Now, that M4 Mac Mini can probably do things with, say, 8K video editing that the UM870 can't touch. But on the other hand, the UM870 can <a href=\"https://www.youtube.com/watch?v=xKD2mU6shdo&amp;t=269s\">play the latest video games</a>. Everything from Fortnite to Cyberpunk 2077 to Forza Horizon. It won't trouble a modern, dedicated Nvidia card for max FPS, but it's perfectly playable at 1080p at medium settings in a ton of games.</div><div><br />In raw CPU power, the AMD 8745H will match a regular M4 in multi-core. They both clock in right around 13,000 points on Geekbench 6. Though the M4 is a fair bit quicker in single-core. The AMD is also far behind an M4 Pro in raw multi-core power (13K vs 22K), but at less than a quarter the cost, it's hard to complain.</div><div><br />But as with the example of video games, it's often deceiving just to compare the Geekbench numbers, because it all depends on what you're doing. If you're really into video games, it's no use to have extra grunt, if your favorite games won't run. The same is true if you're a developer working with Docker containers and a Linux toolchain. As quoted above, the UM870 handily defeats the M4 Pro in our all-cores-buzzing HEY test suite.<br /><br /></div><div>That's partly because we run databases and accessories, like MySQL, Redis, and ElasticSearch, in Docker containers. Even though we run the Ruby code natively on both platforms, the Docker dependencies put the Mac further behind than it otherwise would have been, because Linux runs Docker natively, and the Mac has to deal with the file-system tax and other drawbacks.</div><div><br />The irony is that it was partly Apple's volume with and investment in TSMC that got us these incredible AMD chips, as they're riding the same improvements in TSMC manufacturing prowess as Apple's M chips. The Zen 4 cores in the 8745H are all forged on the same 5nm process as the M2, so it's no surprise that the AMD cores are dead-on-the-money for Apple's in Geekbench single-core performance.<br /><br /></div><div>And Zen 4 is even the last generation! The insane new (and insanely named) AMD Ryzen AI Max 395+ chip that's used in the upcoming <a href=\"https://frame.work/desktop\">Framework Desktop</a> runs on Zen 5 cores. And with 16 of those, the 395+ is faster in Geekbench multi-core than an M4 Pro, and only ever so slightly behind the M4 Max. On my HEY test suite, it completes the run in an insane 1m21s — more than twice as fast as the 14-core M4 Pro!<br /><br /></div><div>But I digress. The 395+ chip isn't cheap, even if it's still a great deal. The Framework Desktop with 64GB/1TB, which is twice as fast as the M4 Pro with our HEY tests, is $1,744. That's still less than the $2,199 Mac Mini, which only has 48GB of RAM. But obviously way more than a $550 Minisforum! And while it's quite small, it's not tiny, like the UM870.</div><div><br />Regardless, this is what I love about technology. I love when our assumptions are tested: just how small and cheap can an awesome developer machine become? I love that open-source Linux is able to run laps around Apple in the workloads that many developers need (like working with Docker containers). I love that this tiny little silent $550 mini PC on my desk is capable of putting out computing power that only a decade ago would have been reserved to loud, honking metal in a data center.<br /><br /></div><div>Mini PCs have gotten really good. <a href=\"https://world.hey.com/dhh/amd-in-everything-0ec0cc6e\">AMD is on a roll</a>. <a href=\"https://world.hey.com/dhh/the-year-on-linux-7f30279e\">Linux is a blast</a>. These are my conclusions. Check out the <a href=\"https://store.minisforum.com/products/minisforum-um760-slim?variant=46040999624949\">Minisforum UM870</a> or the <a href=\"https://www.bee-link.com/products/beelink-ser8-8745hs\">Beelink SER8</a>. Anything with an AMD 7745H and up to an 8945HS should be a great deal. If you want to splurge (yet still get a bargain compared to the macs), you could have a look at the new HX370 in the <a href=\"https://www.bee-link.com/products/beelink-ser9-ai-9-hx-370\">Beelink SER9</a> or <a href=\"https://store.minisforum.com/products/minisforum-ai-x1?variant=46484114014453\">Minisforum X1</a>, but I'd save my money, buy a <a href=\"https://www.lofree.co/products/lofree-flow-the-smoothest-mechanical-keyboard\">Lofree Flow84</a> keyboard to go with the new mini rig, and put the rest of the money towards a <a href=\"https://world.hey.com/dhh/what-is-hifi-dddab2ae\">KEF LSX II savings fund</a>!</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/cheap-mini-pcs-have-gotten-really-good-c70ab40f",
            "publishedAt": "2025-05-18",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>For the past week, I've been working off the <a href=\"https://www.minisforum.com/products/minisforum-um680-um760-um870-slim?variant=49516307939634\">Minisforum UM870</a>. A tiny mini PC with an 8-core/16-thread AMD 8745H CPU, which retails for <a href=\"https://www.amazon.com/MINISFORUM-Barebone-Computer-5-0GHz-Support/dp/B0DL5ZRQV3/\">$343</a> (or <a href=\"https://minisforumpc.eu/products/um680-760-870-slim-mini-pc?variant=51700059144558\">€379</a>) as a bare-bone unit, and stays below $550, even after adding <a href=\"https://www.amazon.com/Crucial-5600MT-5200MT-4800MT-CT48G56C46S5/dp/B0C79LKJK4/\">48GB of RAM</a> and <a href=\"https://www.amazon.com/WD_BLACK-SN850X-Internal-Gaming-Solid/dp/B0B7CKVCCV/\">1TB of storage</a>. I'm shocked to report that I really don't need more than this!</div><div><br />I mean, I knew that Apple's Mac Mini, which is equally petite to the Minisforum, had plenty of power for macOS. But somehow I thought Apple had some special sauce that made this possible, and that PCs were forever condemned to be bigger, louder, and slower. How 2020 of me.</div><div><br />The UM870 is a little beast. It runs our full HEY test suite in just 2m28s. In comparison, it takes a 14-core M4 Pro 2m49s, and such <a href=\"https://www.apple.com/shop/buy-mac/mac-mini/apple-m4-pro-chip-with-12-core-cpu-16-core-gpu-24gb-memory-512gb\">an Apple costs $2,199</a>, once you've given it 48GB of RAM and 1TB of storage.</div><div><br />Now, that M4 Mac Mini can probably do things with, say, 8K video editing that the UM870 can't touch. But on the other hand, the UM870 can <a href=\"https://www.youtube.com/watch?v=xKD2mU6shdo&amp;t=269s\">play the latest video games</a>. Everything from Fortnite to Cyberpunk 2077 to Forza Horizon. It",
            "title": "Cheap mini PCs have gotten really good"
        },
        {
            "content": [],
            "link": "https://eugeneyan.com//writing/leadership/",
            "publishedAt": "2025-05-18",
            "source": "Eugene Yan",
            "summary": "What makes a good leader? What do good leaders do? And commando, soldier, and police leadership.",
            "title": "Exceptional Leadership: Some Qualities, Behaviors, and Styles"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-05-17_9b190df53409_mint-graduation-day/",
            "publishedAt": "2025-05-18",
            "source": "Harper Reed",
            "summary": "<p>Mint Graduation Day</p> <figure> <img alt=\"image_1.jpg\" height=\"1200\" src=\"https://harper.blog/notes/2025-05-17_9b190df53409_mint-graduation-day/image_1.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_2.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-05-17_9b190df53409_mint-graduation-day/image_2.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_3.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-05-17_9b190df53409_mint-graduation-day/image_3.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_4.jpg\" height=\"1614\" src=\"https://harper.blog/notes/2025-05-17_9b190df53409_mint-graduation-day/image_4.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_5.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-05-17_9b190df53409_mint-graduation-day/image_5.jpg\" width=\"1800\" /> </figure> <figure> <img alt=\"image_6.jpg\" height=\"1800\" src=\"https://harper.blog/notes/2025-05-17_9b190df53409_mint-graduation-day/image_6.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #246"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>I don’t think much about legacy. Yours, mine, anyone’s really.<br /><br />Do the best you can right now. For now. Not for later. If it’s useful later, great. But that’s only because it starts out useful now.<br /><br />Legacy isn’t an artist who was ignored all their life until they died. That’s just recognition and fame. Their work was already excellent then.<br /><br />Legacy? Who’s going to remember anyway?<br /><br />Do you remember the names of your great, great, great grandparents? What’s their legacy? You. You are the most important thing to you, and they’re essential to your existence. Yet you probably have no idea who they were. That’s just a few generations ago.<br /><br />You can’t remember your ancestors a few clicks back, and you think anyone’s going to remember your work a few clicks forward?<br /><br />Maybe, but only if it’s good today.<br /><br />Later forgets most of it. Eventually, all of it.<br /><br />What you do today, and how you do it, is what’s worth remembering.<br /><br />Legacy isn’t a monument, it’s just that moment on repeat.<br /><br />-Jason</div>\n</div>"
            ],
            "link": "https://world.hey.com/jason/on-legacy-a083673f",
            "publishedAt": "2025-05-18",
            "source": "Jason Fried",
            "summary": "<div class=\"trix-content\"> <div>I don’t think much about legacy. Yours, mine, anyone’s really.<br /><br />Do the best you can right now. For now. Not for later. If it’s useful later, great. But that’s only because it starts out useful now.<br /><br />Legacy isn’t an artist who was ignored all their life until they died. That’s just recognition and fame. Their work was already excellent then.<br /><br />Legacy? Who’s going to remember anyway?<br /><br />Do you remember the names of your great, great, great grandparents? What’s their legacy? You. You are the most important thing to you, and they’re essential to your existence. Yet you probably have no idea who they were. That’s just a few generations ago.<br /><br />You can’t remember your ancestors a few clicks back, and you think anyone’s going to remember your work a few clicks forward?<br /><br />Maybe, but only if it’s good today.<br /><br />Later forgets most of it. Eventually, all of it.<br /><br />What you do today, and how you do it, is what’s worth remembering.<br /><br />Legacy isn’t a monument, it’s just that moment on repeat.<br /><br />-Jason</div> </div>",
            "title": "On Legacy"
        },
        {
            "content": [
                "<p>Fill a plane with chimps, and most might be dead before it lands. A plane of humans, in contrast, usually lands without injury. How do we do that?</p><p>A general answer is that humans have remarkable abilities to coordinate to achieve peaceful equilibria, wherein we each have relatively specific and peaceful expectations re others&#8217; behavior, and yet we each also achieve many of our usual ends.</p><p>We economists typically assume game theory, wherein players coordinate via &#8220;equilibria&#8221;, which are commonly-known sets of mutual expectations and actions. But economists don&#8217;t talk much about how we actually achieve such equilibria. However, sociologists like Erving Goffman and Harvey Sacks have been working hard on this for at least a half century. Here is what I&#8217;ve figured out from reading such folk lately (including a book draft by Sam Berstler).</p><p>Humans have evolved a powerful cultural <a href=\"https://www.overcomingbias.com/p/hail-cecilia-heyes\">gadget</a> in the form of this meta-norm: <em>in each situation, expect and promote an as-specific-as-possible prosocial equilibrium.</em></p><p>This meta-norm suggests many more specific norms. For example, if someone starts to talk to a co-located group of people who engage him or her, then in the absence of contrary clues they all immediately assume they have common knowledge that each:</p><ul><li><p>A) clearly understands what they each say and do</p></li><li><p>B) has full confidence in each thing they say</p></li><li><p>C) intends the specific outcomes induced by their actions</p></li><li><p>D) believes what others tell them</p></li><li><p>E) pays full attention to this interaction</p></li><li><p>F) wants and tries to help and respect them all</p></li><li><p>G) tries to take more specific implication-rich &#8220;lines&#8221; re selves roles, &amp; situations</p></li><li><p>H) acts by, evaluates by, believes in, doesn&#8217;t discredit, &amp; supports these lines</p></li><li><p>I) if many interpretations are possible, picks usual, simplest, or unthreatening.</p></li><li><p>J) when norms violated, tries to repair the situation to minimize future breaks</p></li><li><p>K) does all this intuitively, smoothly, not awkwardly; explicit talk is more awkward</p></li><li><p>L) takes actions as needed to make it easier for all to follow these norms</p></li><li><p>M) values this interaction and following all these norms, all else equal</p></li></ul><p>In other kinds of interactions, we support as many of these norms as can be relevant. For example, we attend enough to channels by which others might try to initiate interactions with us, so we could accept their bids if we felt so inclined. When walking in a crowd, we telegraph our intended direction and speed of travel.</p><p>Not all aspects of situations are seen as relevant to particular lines. In fact, we can sometimes say things contrary to our faces via &#8220;covert&#8221; channels visible to all. Such as whispers, innuendo, pauses, jokes, etc. Covert channels help when norms require that we notice how lines differ from other reality.</p><p>Breaking such norms can be done at a cost, when other goals matter more. The cost may be minimal if others see you tried to break norms minimally.</p><p>Following these norms, especially G, tends to induce moves to more specific equilibria wherein players can infer more about the actions of others, and thus better coordinate. Often our line is that we never moved, but were always there. </p><p>Successfully following these norms together is a ritual that bonds people together.</p><p>For example, saying &#8220;please do X&#8221; takes the line that they may decline the request if not so inclined, even if they in fact can&#8217;t decline. When people stand in a queue, their shared line is that their time is equally valuable. The line of a nod in response to something said is agreement with it.</p><p>It is usually easier to follow these norms via &#8220;method acting&#8221;, and &#8220;really&#8221; believing our lines, at least to a big degree. Which is why supporting lines can feel &#8220;fake&#8221;, and a lie, if evidence could be offered to discredit those lines.</p><p>Note that an implication of this key cultural gadget is that we are prone to embrace common lines presented by authorities, such as teachers, doctors, police, etc., and to ignore personal contrary evidence. Such lines could thus long sit quite far from what personal evidence suggests, and even further from best collective evidence. Even if our personal evidence is that people who go to docs more don&#8217;t get better faster than those who go less, we might still embrace the doc line that they make you healthier.</p><p>Yes, people are sometimes inclined to take on lines of social rebels, who defy authorities. But they seem nearly as inclined toward such contrarian lines when personal and collective evidence supports authorities.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/key-gadget-pro-equilibria-norms",
            "publishedAt": "2025-05-18",
            "source": "Robin Hanson",
            "summary": "<p>Fill a plane with chimps, and most might be dead before it lands. A plane of humans, in contrast, usually lands without injury. How do we do that?</p><p>A general answer is that humans have remarkable abilities to coordinate to achieve peaceful equilibria, wherein we each have relatively specific and peaceful expectations re others&#8217; behavior, and yet we each also achieve many of our usual ends.</p><p>We economists typically assume game theory, wherein players coordinate via &#8220;equilibria&#8221;, which are commonly-known sets of mutual expectations and actions. But economists don&#8217;t talk much about how we actually achieve such equilibria. However, sociologists like Erving Goffman and Harvey Sacks have been working hard on this for at least a half century. Here is what I&#8217;ve figured out from reading such folk lately (including a book draft by Sam Berstler).</p><p>Humans have evolved a powerful cultural <a href=\"https://www.overcomingbias.com/p/hail-cecilia-heyes\">gadget</a> in the form of this meta-norm: <em>in each situation, expect and promote an as-specific-as-possible prosocial equilibrium.</em></p><p>This meta-norm suggests many more specific norms. For example, if someone starts to talk to a co-located group of people who engage him or her, then in the absence of contrary clues they all immediately assume they have common knowledge that each:</p><ul><li><p>A) clearly understands",
            "title": "Key Gadget: Pro-Equilibria Norms"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-18"
}