{
    "articles": [
        {
            "content": [
                "<p>I’ve read 54 books this year – a slight dip from last year, but still at least one book a week.\nI try not to set myself rigid targets, but I hope to reverse the downward trend in 2026.</p>\n\n<p>I’m a bit disappointed in the books I read this year; compared to previous years, there were only a few books that I feel compelled to recommend.\nI’m not sure if it was bad luck or sticking too close to familiar favouites – but I can’t help notice that all of this year’s favourites are from new authors.\nThat feels like a sign to look further afield in 2026.</p>\n\n<p>What saved the reading year was community and connection.\nMy <a href=\"https://aceandarolondon.org.uk/bookclub/\">a book club</a> just passed its third anniversary, and the discussions are always a highlight of my month.\nIn particularly enjoy the conversation if it’s a book we all liked – it’s more fun to celebrate what works than to tear a book to shreds.\nTwo of my top picks below come from the book club list.</p>\n\n<p>I also found some unexpected serendipity: Lizzie Huxley-Jones’s festive romance <em>Make You Mine This Christmas</em> has a meetcute in <a href=\"https://www.hatchards.co.uk/shop/stpancras\">a bookshop in St Pancras station</a>.\nI use the station regularly so I know the shop well, and it’s where my partner and I took our first photo together as a couple, at the beginning of our second date.</p>\n\n<p>I track the books I read at <a href=\"https://books.alexwlchan.net/\">books.alexwlchan.net</a>, and writing the annual round-up post has become a fun tradition.\nYou can see how my tastes have changed in <a href=\"https://alexwlchan.net/2024/2024-in-reading/\">2024</a>, <a href=\"https://alexwlchan.net/2023/2023-in-reading/\">2023</a>, <a href=\"https://alexwlchan.net/2022/2022-in-reading/\">2022</a>, and <a href=\"https://alexwlchan.net/2021/2021-in-reading/\">2021</a>.</p>\n\n<p>Here are my favourite books from 2025, in the order I read them.</p>\n\n<hr />\n\n<div class=\"book_review\">\n  \n\n<source type=\"image/avif\" /><source type=\"image/webp\" /><source type=\"image/jpeg\" /><img alt=\"The cover of “Service Model”. A white robotic hand holds a teacup, while a devastated landscape lit in dark blue and red is visible in the background.\" class=\"book_cover\" src=\"https://alexwlchan.net/images/2025/service-model_1x.jpg\" width=\"91\" />\n\n\n  <div class=\"book_info\">\n  <h2 class=\"book_title\">Service Model</h2>\n  <p class=\"book_attribution\">\n    by Adrian Tchaikovsky\n    \n    (2024)\n  </p>\n  <p class=\"book_meta\">\n    read <a href=\"https://books.alexwlchan.net/2025/service-model/\">8 January 2025</a>\n  </p>\n</div>\n</div>\n\n<p>What if the robot apocalypse happened, but nobody told the robots?</p>\n\n<p>We follow Charles, a robot butler who finds himself unexpectedly unemployed, and he travels through an apocalyptic wasteland to find a new purpose.\nIn a world mostly devoid of humans, he struggles to find another household to serve.\nIt’s a dark and absurd journey which I very much enjoyed, and the style reminds me of Douglas Adams.\nThis world isn’t tragic, but absurd.</p>\n\n<p>Beneath the lyrical and humorous style are messages about automation, class division, and our attitude towards work.\nThe world is full of robots who are doing things because that’s Their Purpose, with no thought for who the automation is serving or whether it’s still necessary.</p>\n\n<p>If you enjoy this, you should follow up by reading <em>Human Resources</em>, the prequel short story about a “human resources” department that only exists to fire all the humans.</p>\n\n<p>I’d also recommend <em>The Incomparable</em> podcast’s <a href=\"https://www.theincomparable.com/theincomparable/bookclub/\">Book Club episodes</a>; I read <em>Service Model</em> on the strength of Jason Snell’s recommendation.</p>\n\n<div class=\"book_review\">\n  \n\n<source type=\"image/avif\" /><source type=\"image/webp\" /><source type=\"image/jpeg\" /><img alt=\"The cover of “How You Get the Girl”. Two women are holding hands and walking towards a basketball hoop. One of them has long red hair and a turquoise jacket, while the other has short dark hair, a black jacket, and is spinning a basketball.\" class=\"book_cover\" src=\"https://alexwlchan.net/images/2025/how-you-get-the-girl_1x.jpg\" width=\"91\" />\n\n\n  <div class=\"book_info\">\n  <h2 class=\"book_title\">How You Get the Girl</h2>\n  <p class=\"book_attribution\">\n    by Anita Kelly\n    \n    (2024)\n  </p>\n  <p class=\"book_meta\">\n    read <a href=\"https://books.alexwlchan.net/2025/how-you-get-the-girl/\">24 June 2025</a>\n  </p>\n</div>\n</div>\n\n<p>A charming sapphic romance between a basketball teacher and a professional player.</p>\n\n<p>Elle is a famous basketball player who’s proud and confident about being queer, but she struggles to be a foster parent to her niece, Vanessa.\nJulie is a capable high school coach who bonds well with her team, but feels unsure and uncertain about her queer identity.\nThey both look up to the other, and are looked up to in return.</p>\n\n<p>It felt like a very balanced romance, and I enjoyed our discussion of it at Ace Book Club.\nIt hits all the classic sapphic tropes, and it has a feel-good ending.</p>\n\n<p>My particular reading was enhanced by the annotations – my partner read this book first, and she highlighted passages with comments like <em>“this seems familiar”</em> or <em>“remind you of anyone?”</em>.\nSadly that’s not a transferable experience, but I can tell you that <em>I</em> enjoyed it.</p>\n\n<p>Surprisingly, I didn’t enjoy Anita Kelly’s other books.\nThis book is the third in the trilogy, and I tried to read the other two – one of them was so-so, and the other I gave up on.</p>\n\n<div class=\"book_review\">\n  \n\n<source type=\"image/avif\" /><source type=\"image/webp\" /><source type=\"image/jpeg\" /><img alt=\"The cover of “The End Crowns All”. It's an abstract blue design mostly taken up by the title and author name, but at the base of the cover is a series of ships sailing away from a bright yellow sun.\" class=\"book_cover\" src=\"https://alexwlchan.net/images/2025/the-end-crowns-all_1x.jpg\" width=\"91\" />\n\n\n  <div class=\"book_info\">\n  <h2 class=\"book_title\">The End Crowns All</h2>\n  <p class=\"book_attribution\">\n    by Bea Fitzgerald\n    \n    (2024)\n  </p>\n  <p class=\"book_meta\">\n    read <a href=\"https://books.alexwlchan.net/2025/the-end-crowns-all/\">9 September 2025</a>\n  </p>\n</div>\n</div>\n\n<p>A sapphic retelling of the Trojan War, in which Cassandra’s curse is cast by a petty Apollo who just wants sex, and an enemies-to-lovers romance between Cassandra and Helen.</p>\n\n<p>I really enjoyed this.\nIt’s a well-written story and I enjoyed the first-person perspective of the two protagonists.\nIt builds well towards its conclusion – a lot of stuff that becomes relevant later is established early and builds towards the end.\nApollo’s curses on Cassandra, the gods forcing a narrative on Troy, how the story eventually deviates from the conventional myth.</p>\n\n<p>The book has modern sensibilities, but retrofits them in a thoughtful way.\nIt discusses consent, rape culture, and asexuality – in particular, Cassandra is implied to be ace – but never uses those words explicitly.\nThese themes fit into the narrative, and don’t stand out as twenty-first century terminology or ideas shoved into Greek myth.</p>\n\n<p>This was another book club pick, and I’m planning to read Bea Fitzgerald’s other books next year.</p>\n\n<div class=\"book_review\">\n  \n\n<source type=\"image/avif\" /><source type=\"image/webp\" /><source type=\"image/jpeg\" /><img alt=\"The cover of “Finding Hester”. A photograph of a young woman is placed on a brown file with a British government crest, with several red annotations drawn in pen.\" class=\"book_cover\" src=\"https://alexwlchan.net/images/2025/finding-hester_1x.jpg\" width=\"91\" />\n\n\n  <div class=\"book_info\">\n  <h2 class=\"book_title\">Finding Hester</h2>\n  <p class=\"book_attribution\">\n    by Erin Edwards, Greg Callus, Rose Crossgrove, and others\n    \n    (2025)\n  </p>\n  <p class=\"book_meta\">\n    read <a href=\"https://books.alexwlchan.net/2025/finding-hester/\">17 November 2025</a>\n  </p>\n</div>\n</div>\n\n<p>This is the true story of Hester Leggatt, a woman who wrote fake love letters for Operation Mincemeat during World War II, then became a character in a hit musical.</p>\n\n<p>Unlike the men in the story, almost nothing was known of Hester when SpitLip wrote the musical version of <em>Operation Mincemeat</em>, except that she wrote the fake love letters.\nHer character has the most emotional song in the show, but the fictional version had to be invented from scratch.</p>\n\n<p>A group of fans were dissatisfied with this gap in history, and tracked down the real Hester.\nThey traced the initial mistake to an interview that misspelt her name as Legg<em>e</em>tt instead of Legg<em>a</em>tt.\nOnce they knew the correct surname, they went through paper archives, old school records, even contacted MI5 – all to reconstruct her life story.</p>\n\n<p>The book weaves this discovered history into a narrative, which is organised it into a coherent and readable story of Hester’s life – her place of birth, her career before and after the war, her love life, and even coincidental similarities to her fictional depiction.</p>\n\n<p>I’m biased because several of those fans are dear friends, and I enjoyed watching their work from the sidelines – but I enjoyed reading the details even more so.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2025/2025-in-reading/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2025/2025-in-reading/?ref=rss",
            "publishedAt": "2025-12-31",
            "source": "Alex Chan",
            "summary": "<p>I’ve read 54 books this year – a slight dip from last year, but still at least one book a week. I try not to set myself rigid targets, but I hope to reverse the downward trend in 2026.</p> <p>I’m a bit disappointed in the books I read this year; compared to previous years, there were only a few books that I feel compelled to recommend. I’m not sure if it was bad luck or sticking too close to familiar favouites – but I can’t help notice that all of this year’s favourites are from new authors. That feels like a sign to look further afield in 2026.</p> <p>What saved the reading year was community and connection. My <a href=\"https://aceandarolondon.org.uk/bookclub/\">a book club</a> just passed its third anniversary, and the discussions are always a highlight of my month. In particularly enjoy the conversation if it’s a book we all liked – it’s more fun to celebrate what works than to tear a book to shreds. Two of my top picks below come from the book club list.</p> <p>I also found some unexpected serendipity: Lizzie Huxley-Jones’s festive romance <em>Make You Mine This Christmas</em> has a meetcute in <a href=\"https://www.hatchards.co.uk/shop/stpancras\">a bookshop in St",
            "title": "My favourite books from 2025"
        },
        {
            "content": [
                "<p>I thought about sending out a personalized \"Scour Wrapped\"... until I got the 7th Wrapped from some random service. So instead, I'll just say Happy New Year and thanks for your support in 2025! 🥂</p>\n<h2 id=\"2025-by-the-numbers\">2025 By the Numbers</h2><ul>\n<li>Scour scoured 9,940,460 posts from 15,608 feeds</li>\n<li>1,013 new users signed up (welcome!!)</li>\n<li>12,620 interests were added, with 6,688 of those from recommendations</li>\n<li>26,702 posts were read, 3,023 were liked, and 383 were loved</li>\n<li>55 suggestions on the <a href=\"https://feedback.scour.ing/\">feedback board</a> were completed</li>\n</ul>\n<hr />\n<h2 id=\"new-features-in-november-and-december\">New Features in November and December</h2><p>These were the new features added since the last update in October.</p>\n<h3 id=\"identifying-paywalled-content\">💵 Identifying Paywalled Content</h3><p>Scour now identifies articles that are paywalled and indicates them with a yellow dollar sign next to the domain.</p>\n<p>In your <a href=\"https://scour.ing/settings\">settings</a>, you can opt to hide paywalled content. If you do, you can also exempt specific domains where you have a subscription so you will see their content even if it is behind the paywall.</p>\n<p>Thank you to Johnny and Allen for requesting this feature!</p>\n<p>For anyone interested in the technical details, I wrote a blog post about a neat SQL trick I came across while building this: <a href=\"https://emschwartz.me/short-circuiting-correlated-subqueries-in-sqlite/\">Short-Circuiting Correlated Subqueries in SQLite</a>.</p>\n<h3 id=\"excluded-domains\">🚫 Excluded Domains</h3><p>You can also now block content from specific websites. The option to block a domain can be found by clicking the \"...\" button below each post. You can see and manage your excluded domains in your <a href=\"https://scour.ing/settings\">settings</a>.</p>\n<p>Thanks to Vahe for this suggestion!</p>\n<h3 id=\"feed-ui-and-recommendations\">🗞️ Feed UI and Recommendations</h3><p>If you subscribe to specific feeds (as opposed to scouring all of them), Scour will now recommend other sources for you to follow right in your personalized feed. These recommendations are based on Scour looking for content that matches your interests that you aren't currently getting. You can find more recommendations on your <a href=\"https://scour.ing/feeds\">Feeds page</a>.</p>\n<p>Each feed also now displays its three most recent posts below its description to make it easier to know what you'll get if you subscribe. You can click on the feed's title to see all of the posts from that feed.</p>\n<p>Thanks to Tiago for this suggestion!</p>\n<h3 id=\"preview-posts\">👁️ Preview Posts</h3><p>By default, clicking on a link to a post will bring you to the original website where it was published. However, if you prefer to read it on Scour, you can read the Preview, which can be found in the \"...\" menu under each post.</p>\n<p>Thanks to Linh for this suggestion!</p>\n<h3 id=\"filter-menu\">🎚️ Filter Menu</h3><p>The filter menu for your feed (accessible via the button next to where it says Your Top Finds) should be clearer and more mobile-friendly. You can filter by time range and toggle between seeing posts from feeds you’ve subscribed to or see posts from everyone’s feeds.</p>\n<p>Thanks Stefan for the feedback on this!</p>\n<h3 id=\"how-are-likes-used\">👍 How are Likes used?</h3><p>A number of people have told me that they are confused about how the love/like/dislike reactions are used on Scour. I'll work on making this clearer in the future but in the meantime, there's now a section in the <a href=\"https://scour.ing/about\">FAQs</a> about this. The answer is:</p>\n<blockquote>\n<p>Loves and likes are saved to your Likes page, so you can use them to bookmark interesting content.</p>\n<p>Unlike most content aggregators, Scour does not use reactions to change what shows up in your feed. Instead, reactions are used to generate Interest Recommendations for you. Scour only shows content related to topics you've explicitly chosen.</p>\n<p>You can also subscribe to other users' Likes as feeds. Everyone's reactions contribute to the <a href=\"https://scour.ing/browse/posts/popular\">Popular Posts</a> page.</p>\n</blockquote>\n<hr />\n<h2 id=\"some-of-my-favorite-posts\">🔖 Some of My Favorite Posts</h2><p>Here were some of <a href=\"https://scour.ing/@emschwartz/likes\">my favorite posts</a> I found on Scour in November and December:</p>\n<ul>\n<li><a href=\"https://scour.ing/@emschwartz/p/https://www.gleech.org/paper\">Paper AI Tigers</a></li>\n<li><a href=\"https://scour.ing/@emschwartz/p/https://sneak.berlin/20251224/build-buy-bot\">Build / Buy / Bot</a></li>\n<li><a href=\"https://scour.ing/@emschwartz/p/https://blog.konsti.xyz/more-databases-should-be-single-threaded\">More databases should be single-threaded</a></li>\n<li><a href=\"https://scour.ing/@emschwartz/p/https://blog.canoozie.net/disks-lie-building-a-wal-that-actually-survives\">Disks Lie: Building a WAL that actually survives</a></li>\n</ul>\n<hr />\n<h2 id=\"thanks-for-the-shout-outs\">Thanks for the Shout-Outs</h2><p>Thanks to everyone who wrote about Scour on their blog or website in 2025! This included:</p>\n<ul>\n<li>Minsuk Kang: <a href=\"https://kangminsuk.com/blog/two-feeds/\">Scour and minifeed are 100X better than Instagram and X</a> (January)</li>\n<li>Winther: <a href=\"https://winther.sysctl.dk/bookmarks/\">Blog Discovery</a> (June)</li>\n<li>Daniel Prindii: <a href=\"https://danielprindii.com/blog/my-read-it-later-and-discoverability-systems\">My Read it later and discoverability systems in 2025</a> (July)</li>\n<li>PPC Land: <a href=\"https://ppc.land/developer-revives-rss-with-ai-while-google-targets-syndication-infrastructure/\">Developer revives RSS with AI while Google targets syndication infrastructure</a> (August)</li>\n<li>Tomáš Burkert: <a href=\"https://blog.burkert.me/posts/rss_discovery_strategies/\">RSS feeds discovery strategies</a> (October)</li>\n<li>Alex White: <a href=\"https://thatalexguy.dev/posts/small-web-discovery/\">Discovering the Indie Web</a> (November)</li>\n<li>Matt Maldre: <a href=\"https://www.spudart.org/blog/search-engine-for-blogs/\">Search engine for blogs</a> (November)</li>\n<li>Andrew Doran: <a href=\"https://andrewdoran.uk/blog/2025/12/20/tools-for-discovering-the-indieweb/\">Tools for discovering the IndieWeb</a> (December)</li>\n</ul>\n<p>If you write about Scour in the future, or if you already did and I didn't include you, please let me know!</p>\n<h2 id=\"thanks-for-the-feedback\">Thanks for the Feedback</h2><p>Thank you to everyone who provided feedback on Scour this year!</p>\n<p>Specifically, thank you to Aaron, Alberto, Alex K, Alex W, Allen, Andrew D, Andrew M, Andy M, Andy P, Cairin, Cole, Daniel, Elyem, Hary, Imperfect, Jadi, Jeppe, Jesse, Johnny, Jon, Karit, Kilpatrj, Linh, Proudmuslim-dev, Ryan, Sarah, Stefan, Tiago, Tomáš, Tyler, and Vahe. And thank you to all of the anonymous feedback givers as well!</p>\n<hr />\n<h2 id=\"post-credits-surprise\">🎁 Post-Credits Surprise</h2><p>Because you made it to the end of the post, here's a little preview of an upcoming feature for you.</p>\n<p>Let's say you want to only see posts from small websites, like individuals' blogs. You can now try filtering your feed by how many posts each website or feed publishes per month. For example, you can use these links to see only posts from <a href=\"https://scour.ing/posts?max_domain_posts_per_month=3\">quieter domains</a> or <a href=\"https://scour.ing/posts?max_feed_posts_per_month=3\">quieter feeds</a>.</p>\n<p>Or, you can try this one to only see articles from <a href=\"https://scour.ing/posts?min_domain_posts_per_month=100\">larger websites</a>.</p>\n<p>Let me know what you think! UI for controlling these filters is coming soon!</p>\n<p>Happy New Year and happy Scouring!<br />\n- Evan</p>"
            ],
            "link": "https://emschwartz.me/scour-year-end-update-2025/",
            "publishedAt": "2025-12-31",
            "source": "Evan Schwartz",
            "summary": "<p>I thought about sending out a personalized \"Scour Wrapped\"... until I got the 7th Wrapped from some random service. So instead, I'll just say Happy New Year and thanks for your support in 2025! 🥂</p> <h2 id=\"2025-by-the-numbers\">2025 By the Numbers</h2><ul> <li>Scour scoured 9,940,460 posts from 15,608 feeds</li> <li>1,013 new users signed up (welcome!!)</li> <li>12,620 interests were added, with 6,688 of those from recommendations</li> <li>26,702 posts were read, 3,023 were liked, and 383 were loved</li> <li>55 suggestions on the <a href=\"https://feedback.scour.ing/\">feedback board</a> were completed</li> </ul> <hr /> <h2 id=\"new-features-in-november-and-december\">New Features in November and December</h2><p>These were the new features added since the last update in October.</p> <h3 id=\"identifying-paywalled-content\">💵 Identifying Paywalled Content</h3><p>Scour now identifies articles that are paywalled and indicates them with a yellow dollar sign next to the domain.</p> <p>In your <a href=\"https://scour.ing/settings\">settings</a>, you can opt to hide paywalled content. If you do, you can also exempt specific domains where you have a subscription so you will see their content even if it is behind the paywall.</p> <p>Thank you to Johnny and Allen for requesting this feature!</p> <p>For anyone interested in the technical details, I wrote a blog post about a neat SQL trick I came across while building this: <a href=\"https://emschwartz.me/short-circuiting-correlated-subqueries-in-sqlite/\">Short-Circuiting",
            "title": "Scour Year End Update 2025"
        },
        {
            "content": [],
            "link": "https://olano.dev/blog/2025",
            "publishedAt": "2025-12-31",
            "source": "Facundo Olano",
            "summary": "No suelo hacer retrospectivas pero un post de lobste.rs me hizo revisar el log y darme cuenta de que este fue un año más cargado de lo que me acordaba. Empecé el dos de Enero haciendo la fila en la embajada yanqui para que me otorgaran una visa, que usé en septiembre para un viaje de trabajo con detour a Nueva York, saldando así una cuenta pendiente con mi yo trotamundos de la década anterior. En febrero y marzo tuve un discreto lost weekend, viviendo solo tras 10 años de convivencia, aunque sin separarme. Las tratativas para mi vuelta a Almagro se precipitaron por un breve episodio de salud —de primera impresión grave pero en fin falsa alarma— y subsecuente internación, que describí brevemente en mi post sobre David Foster Wallace. Escribí también sobre David Lynch, Roberto Bolaño y Juan Forn, un repunte de mi producción en castellano que pretendo profundizar el año próximo. Fue en parte ese post sobre Lynch lo que reavivó mi interés por el cine; este año vi unas cuantas películas y volví a animarme a ir solo al cine—mis preferidas: la de Bob Dylan y Una batalla tras otra. Empecé muchos más libros de los",
            "title": "2025"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-12-31_88e66b284c9b_2026-is-wild-watch-out/",
            "publishedAt": "2025-12-31",
            "source": "Harper Reed",
            "summary": "<p>2026 is wild. Watch out!</p>\n\n                        \n                        <hr />\n                        <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #310"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Dec/31/the-year-in-llms/#atom-entries",
            "publishedAt": "2025-12-31",
            "source": "Simon Willison",
            "summary": "<p>This is the third in my annual series reviewing everything that happened in the LLM space over the past 12 months. For previous years see <a href=\"https://simonwillison.net/2023/Dec/31/ai-in-2023/\">Stuff we figured out about AI in 2023</a> and <a href=\"https://simonwillison.net/2024/Dec/31/llms-in-2024/\">Things we learned about LLMs in 2024</a>.</p> <p>It’s been a year filled with a <em>lot</em> of different trends.</p> <ul> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-reasoning-\">The year of \"reasoning\"</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-agents\">The year of agents</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-coding-agents-and-claude-code\">The year of coding agents and Claude Code</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-llms-on-the-command-line\">The year of LLMs on the command-line</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-yolo-and-the-normalization-of-deviance\">The year of YOLO and the Normalization of Deviance</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-200-month-subscriptions\">The year of $200/month subscriptions</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-top-ranked-chinese-open-weight-models\">The year of top-ranked Chinese open weight models</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-long-tasks\">The year of long tasks</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-prompt-driven-image-editing\">The year of prompt-driven image editing</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-models-won-gold-in-academic-competitions\">The year models won gold in academic competitions</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-that-llama-lost-its-way\">The year that Llama lost its way</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-that-openai-lost-their-lead\">The year that OpenAI lost their lead</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-gemini\">The year of Gemini</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-pelicans-riding-bicycles\">The year of pelicans riding bicycles</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-i-built-110-tools\">The year I built 110 tools</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-the-snitch-\">The year of the snitch!</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-vibe-coding\">The year of vibe coding</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-only-year-of-mcp\">The (only?) year of MCP</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-alarmingly-ai-enabled-browsers\">The year of alarmingly AI-enabled browsers</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-the-lethal-trifecta\">The year of the lethal trifecta</a></li> <li><a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-programming-on-my-phone\">The year of",
            "title": "2025: The year in LLMs"
        },
        {
            "content": [
                "<p><em>[Original post: <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted\">Vibecession - Much More Than You Wanted To Know</a>]</em></p><p><strong>Table of Contents</strong></p><p><strong>1:</strong> When was the vibecession?<br /><strong>2:</strong> Is the vibecession just sublimating cultural complaints?<br /><strong>3:</strong> Discourse downstream of the Mike Green $140K poverty line post<br /><strong>4:</strong> What about other countries?<br /><strong>5:</strong> Comments on rent/housing<br /><strong>6:</strong> Comments on inflation<br /><strong>7:</strong> Comments on vibes<br /><strong>8:</strong> Other good comments<br /><strong>9:</strong> The parable of Calvin&#8217;s grandparents<br /><strong>10: </strong>Updates / conclusions</p><p></p><h2>1: When Was The Vibecession?</h2><p>&#8230;</p><p><strong>Kyla Scanlon <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184276827\">writes</a>:</strong></p><blockquote><p>Hi! I&#8217;m the person who coined and first published this term. I&#8217;ve been studying this phenomenon for the past four years, so forgive the rather long comment! A quick factual clarification: the Vibecession began in 2022 as the sentiment&#8211;data divergence that opened up that summer is the real starting point. The decade before didn&#8217;t have the same shape of malaise, which you can see in the sentiment data you included. People who&#8217;ve also been working on this topic tend to focus on the same pressures you outlined like housing, education, measurement problems which are absolutely part of the story. Maybe this is what you meant by smoking gun, but the Vibecession has crossed into somewhat of a meaning-making crisis which shows up in collapsing trust and inconsistent reactions to the data. Every generation has one of these, but ours is flattened across all ages due to social media and those tighter economic constraints. Expectations around future stability collapsed at the same time institutions lost credibility, and that combination changes how people interpret even good data. Also the post-2020 political environment runs on performance and constant identity signaling, and economic sentiment gets lost in those dynamics, which is why the usual models don&#8217;t fully explain what&#8217;s going on. Finally, we really aren&#8217;t in one right now, as the economic data has deteriorated meaningfully and the negative sentiment is warranted at this point.</p></blockquote><p>I appreciate this guide to the original intent of the word, but I claim &#8216;death of the author&#8217; - it seems to me this is more than just a two-year problem. I remember people complaining about hellworld, the broken social contract, the Boomers tearing up the bridge behind them, vanishing opportunities for the young, the blackpill of modern life, etc, well before 2022. Memory can be faulty, but don&#8217;t we need something like this to explain the Trump campaign, the Sanders campaign, Chapo Trap House, Red Scare, 4chan, and all the other mid-2010s politicians and media telling us that things were worse than they&#8217;d ever been and outrage was the only acceptable response?</p><p>And I appreciate that the economic data have gotten worse so that some level of worry is now justified. But GDP growth last quarter was 4.3% (without AI it would still have been like 4%). And I still hear people they&#8217;ll never be able to have a family but it doesn&#8217;t matter because it would be immoral to bring children into a world where they could never have any chance of getting ahead or living a normal life. Even if we&#8217;re in a mild recession now, that doesn&#8217;t sound like mild recession talk!</p><p>Still, Kyla has spiritual copyright on vibecession, so maybe we need another phrase to discuss the longer-term hypothesis. I propose &#8220;The Great Vibepression&#8221;.</p><p><strong>TTAR <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184399006\">writes</a>:</strong></p><blockquote><p>I was a doomer when I graduated in 2014 because that&#8217;s what my parents and literally every single media outlet and professor were preaching to me, then I got a job right out of a college with a mediocre (3.6) GPA from a state school and went to work as an analyst at a midsized regional bank, got promoted internally a few times and lived very frugally with my wife (met at work), now I&#8217;m able to be a stay at home dad with our kid while she works from home. We live in Oklahoma; we bought new construction last year for $200k with some spare cash I had laying around in a brokerage account. So I am pretty fully cured of the doomerism, success is trivial. My bosses and coworkers constantly praised the fact that I approached my job with gratitude and focused on identifying the goals and achieving them efficiently and optimally from 9-5 every day. That&#8217;s it. No late hours, no connections or networking or anything else fancy.</p></blockquote><p>Good for TTAR, but I&#8217;m including this one here as confirmation that people graduating in 2014 felt like &#8220;my parents and literally every single media outlet and professor&#8221; were preaching doom at them.</p><p><strong>Moose <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184275877\">writes</a>:</strong></p><blockquote><p>Every explanation for the vibecession that does not attempt to explain why there is a huge drop in 2021 specifically and persistently lower vibes for the following years should be disregarded. I think the best explanation is just inflation: this is what is most different in 2021-2024 compared to previous time periods, but you can also blame the shift to remote work, or higher housing prices. Examples of bad explanations would be &#8220;phones bad&#8221;, &#8220;media bad&#8221;, or &#8220;inequality bad&#8221; without explaining why they became worse in 2021.</p></blockquote><p>I agree that if you follow the consumer confidence numbers and date it to 2021-2022, inflation is an easy culprit and we don&#8217;t need to look for anything more. My theory predicts that some kind of vibecession will continue even when inflation is far in the past.</p><p><strong>Zahmakibo writes:</strong></p><blockquote><p><em>&gt; &#8220;There is one anomaly, which is that I remember people complaining about the bad economy and the Boomers and hellworld since well before 2020 (consider the Trump and Sanders campaigns), but the official vibes didn&#8217;t crash until COVID. Is my memory faulty?&#8221;</em></p><p>my memory is the same, and I&#8217;m now asking the same question.</p><p>every chart in this post seems to support, or at least not contradict, the following story:</p><p>- <strong>2008:</strong> Subprime mortgage crisis. economy is bad. vibes are bad<br />- <strong>2009-2018:</strong> economy steadily improves. vibes steadily improve.<br />- <strong>by 2019</strong>, vibes are about as good as 1998.<br />- <strong>2020:</strong> Pandemic. economy is bad. vibes are bad.<br />- <strong>2021-present:</strong> economy is... complicated? stocks are good. wages briefly shot up, then slowly declined, and are now rising again. recent grad unemployment is rising. vibes are improving, but still bad in absolute sense.</p><p>are we just conflating two different trends?</p><p>- a mysterious meta-vibecession in the 2010s<br />- a real but explainable vibecession in the 2020s</p></blockquote><p>In 2008, a lot of people thought the Great Recession heralded the end of capitalism - either to be replaced with something better, or at least to degenerate into some obviously feudal dystopia that would end the charade and get everyone to finally agree that the system was rotten.</p><p>But actually, capitalism shrugged off the Great Recession just fine, and continued exactly as before. That must have been a bitter pill to a lot of budding socialists. I wonder if something about the situation broke people&#8217;s brains. </p><p><strong>Erica Rall <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184268553\">writes</a>:</strong></p><blockquote><p>For young adults in particular, I don&#8217;t think the bad vibes are at all new. My go-to illustration is the first verse of the theme song for Friends, which started airing in 1994:</p><p>&#8220;So no one told you life was gonna be this way / Your job&#8217;s a joke, you&#8217;re broke, your love life&#8217;s D.O.A., / It&#8217;s like you&#8217;re always stuck in second gear / When it hasn&#8217;t been your day, your week / Your month, or even your year&#8221;</p></blockquote><p>I&#8217;m younger than Erica, and have less pop culture literacy: can someone tell me whether the Friends theme song was meant to express a <em>zeitgeist </em>that would be immediately recognizable by and sympathetic to most viewers, or whether we were supposed to interpret it as referring to a few especially unlucky people?</p><p></p><h2>2: Is The Vibecession Just Sublimating Cultural Complaints?</h2><p></p><p><strong>Tanya Jarvik <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184246521\">writes</a></strong>:</p><blockquote><p>Maybe people are complaining about not having enough money these days because the amount of money it takes to produce a feeling of abundance is larger in the absence of community, sense of purpose, &#8220;my life matters&#8221; etc.</p></blockquote><p>The two most certain things in the world are that people will suspect every social complaint of being a proxy for economic problems, and that people will suspect every economic complaint of being a proxy for social problems.</p><p>The strongest argument against this position is that the vibecession started sometime between 2008 and 2023, and I don&#8217;t think this was an especially bad time for community and purpose compared to any other time since the 60s. I don&#8217;t think earlier periods of social dissolution were sublimated into economic complaints.</p><p><strong>Alex Zavoluk <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184600156\">comes down in favor</a></strong>:</p><blockquote><p><em>&#8220;Players are great at identifying problems but terrible at coming up with solutions.&#8221;</em> This is from Mark Rosewater, the head designer of Magic: the Gathering. His point is that when playing a game, it&#8217;s easy to tell that you aren&#8217;t having fun, but not always so easy to know exactly why or how to fix it. And in my experience, it&#8217;s very true--people will repeat platitudes they&#8217;ve heard from others about what makes a game fun or not fun, but the complaint manifestly does not apply to the situation they&#8217;re describing. Or there&#8217;s another situation which totally resolves the complaint but they&#8217;re still not having fun.</p><p>I think the same principle applies more generally. People are unhappy, and they can easily determine that. But that doesn&#8217;t mean they know what would change that fact. Money and material standard of living are easy to point to as things that would make life better, but my understanding of the research is that how much happier people think they will be after making more money is higher than how much happier they actually become. People in their 20s are now Gen Z, i.e. people who were raised after several generations of an increasing trend to shelter children and prevent them from having any independence, and who have been exposed to a constant stream of social media since middle school. One can debate whether these really are the problem, but I certainly wouldn&#8217;t <em>expect</em> zoomers to say, &#8220;oh yeah, obviously I&#8217;m unhappy because I was protected from challenge as a child, had to be driven everywhere, was never allowed to practice being independent until after college, community life has been severely hampered, and I&#8217;ve been exposed to brain-rotting forms of media since I was old enough to read, in total contrast to my parents and every previous generation&#8221; even if that&#8217;s true.</p></blockquote><p>Alex also mentions the political angle:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!YAm7!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe8e0184e-12e8-4066-9769-b5280224abba_1156x990.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"CDN media\" class=\"sizing-normal\" height=\"438.47750865051904\" src=\"https://substackcdn.com/image/fetch/$s_!YAm7!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe8e0184e-12e8-4066-9769-b5280224abba_1156x990.jpeg\" title=\"CDN media\" width=\"512\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>Obviously nothing real changes the exact second a new president is inaugurated, so people must be using questions about the economy to express their overall happiness about the state of the world. </p><p>Alex asks whether increasing political polarization could make this worse. Both parties&#8217; extreme factions share a tendency to treat the country as controlled by a hegemonic conspiracy of their enemies - the woke coastal elite Soros cosmopolitan establishment, or the neoliberal fat cat Koch Brothers tech oligarch blob. Does this mean everyone is getting some multiple of the &#8220;other party&#8217;s president is in power&#8221; effect all the time?</p><p></p><h2>3: Discourse Downstream Of The Mike Green $140K Poverty Line Post</h2><p>&#8230;</p><p><strong>Shovacklerod <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184282098\">writes</a></strong>:</p><blockquote><p>Scott have you read Mike Green&#8217;s viral post on this?</p><p>His main argument is that the poverty line is miscalculated, but in context of declining middle class sentiments&#8212;</p><p>The more interesting thesis is that there exists a &#8220;valley of death&#8221; where two parents in the workforce need a combined ~$140k salary otherwise the cumulative &#8220;participation costs&#8221; of a fast modern society (for example a phone plan or child care) make year-over-year capital accumulation near impossible.</p></blockquote><p>I haven&#8217;t, but other commenters suggest reading responses, including Noah Smith&#8217;s <a href=\"https://www.noahpinion.blog/p/the-140000-poverty-line-is-very-silly\">The $140,000 Poverty Line Is Very Silly</a>, Jeremy Horpedahl&#8217;s <a href=\"https://economistwritingeveryday.com/2025/11/26/the-poverty-line-is-not-140000/\">The Poverty Line Is Not $140,000</a>, and Tyler Cowen&#8217;s <a href=\"https://www.thefp.com/p/the-myth-of-the-140000-poverty-line?taid=692ccdbdc7c4790001ec0e10&amp;utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter\">The Myth Of The $140,000 Poverty Line</a>. </p><p>Most of these focus on Green&#8217;s explicit errors - for example, he gets most of his cost-of-living numbers from Essex, NJ, an especially rich county, then compares them to average earnings. Correct half a dozen things like this, and the real poverty line is probably somewhere between $35K - $60K. The percent of Americans below this line continues to decline every year, as it has for decades.  Green finally pseudo-apologized, lambasting the &#8220;mockery machine&#8221; of the &#8220;cognitive elite&#8221; but admitting that his post &#8220;was never intended to go viral and was written for my existing audience that tends to be pretty understanding that I don&#8217;t do this for a living, but rather as PART of my living&#8221;</p><p>Still, many people took Green&#8217;s article as a starting point to contribute to the Vibecession discourse, so let&#8217;s go over the ones that touch on our topic in more detail.</p><p><strong>Lincicome </strong>titles his response <a href=\"https://www.cato.org/commentary/140000-poverty-line-laughably-wrong-so-why-does-it-feel-right\">The $140,000 Poverty Line Is Wrong, So Why Does It Feel Right?</a>, and blames <a href=\"https://en.wikipedia.org/wiki/Baumol_effect\">Baumol&#8217;s cost disease</a>:</p><blockquote><p>As the <em>Financial Times&#8217;</em> John-Burns Murdoch just <a href=\"https://url.avanan.click/v2/r01/___https:/l.thedispatch.com/z/c/27175/262290ac0f1442a49467b12f3ab5a464/cdb7a30f643a488da1da63980386fe1a___.YXAzOmNhdG9pbnN0aXR1dGU6YTpvOmQxZGYwOWYwYTEwY2MyZDc2MWZmMjhiYWVmZGFlMzFmOjc6NmY4MjpiZmVmODY2ZGI3YTAzNzliOTk1MmEyN2ZlYTU1ZTI5ODQ2YjI3OTI1NTA4ZjJiMTMyOTNiMzI4OWI3YmRmNGY1Omg6VDpO\">detailed</a>, Americans&#8217; overall cost of living has improved over time, but certain highly visible and socially desirable services have become more expensive. That&#8217;s not a conspiracy against the middle class but instead just Baumol at work:</p><p><em>&#8220;[A]s countries develop economically, the same productivity growth that drives down the cost of tradeable goods causes the cost of in-person services to balloon. Wages in sectors like healthcare and education that require intensive face-to-face labour, and have slow (if any) productivity growth, are forced upwards in order to attract workers who would otherwise opt for high-paying work in more productive sectors. The result is that even if people keep consuming the exact same basket of goods and services, as living standards in their country increase they will find more and more of their spending is going on essential services.&#8221;</em></p><p>Sectors where productivity grows slowly and prices outpace inflation&#8212;health care, education, child care, personal services, housing (construction), etc.&#8212;happen to be the same ones that middle-class families notice most and that signal social status. As we&#8217;ve all gotten richer, moreover, these services have transitioned from luxuries to expectations. Throw in the hedonic treadmill and the fact that you can&#8217;t price-shop schools or hospitals the way you can TVs, and public alarm is all but inevitable.</p></blockquote><p>I&#8217;m suspicious of including &#8220;housing (construction)&#8221; on this list - couldn&#8217;t you use the same argument to reclassify any manufactured good as a service good? - but the rest of these are well-taken. </p><p>Still, did Baumol or the other economists who first discussed the effect in the 1960s predict it would make people feel like things were <em>outright</em> <em>worse</em>, as opposed to just getting better less than would be expected from raw productivity numbers? Seems strange.</p><p>Also, hasn&#8217;t the Baumol effect been basically constant since at least the Industrial Revolution? And isn&#8217;t the Vibecession only 5 - 20 years old?</p><p><strong>Matt Bruenig</strong> has his own response to Green, <a href=\"https://www.peoplespolicyproject.org/2025/12/05/why-do-people-feel-like-they-are-falling-behind/\">Why Do People Feel Like They&#8217;re Falling Behind?</a> He bases his argument around this graph:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!E2rN!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff94f8851-17f5-4a98-b1f8-349f568d23bb_1024x800.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"412.5\" src=\"https://substackcdn.com/image/fetch/$s_!E2rN!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff94f8851-17f5-4a98-b1f8-349f568d23bb_1024x800.png\" title=\"\" width=\"528\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>&#8230;which is just making the common-sense point that, as society shifts from one-income to two-income families, the husband&#8217;s share of family income drops from ~100% to ~50%.</p><p>So, Bruenig argues, if everyone is trying to keep up with the Joneses, and the Joneses are a dual-earner family, then this single working man has gone from making 100% of his comparison point, to making only 50%.</p><p>This is a cool potential cognitive bias, but is anyone really making this mistake? Vibecession complaints hardly seem limited to men in traditional one-earner households wondering why they&#8217;re not making as much as the neighbors whose wife is a fancy lawyer. My impression is that they include both two-earner families who <em>still</em> feel like they&#8217;re falling behind, and (most of all) young singles who are comparing themselves to their young single friends where this issue never comes up in the first place.</p><p><strong>Matt Yglesias</strong> uses a similar strategy in <a href=\"https://www.slowboring.com/p/you-can-afford-a-tradlife\">You Can Afford A Tradlife</a>.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!ljt5!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1b1176e8-f932-430a-b7e1-c699a5ecf15c_581x479.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"429.53356282271943\" src=\"https://substackcdn.com/image/fetch/$s_!ljt5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1b1176e8-f932-430a-b7e1-c699a5ecf15c_581x479.png\" width=\"521\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">This is what they took from you. They never should have passed the &#8216;Make It Illegal To Wear Hair Gel And Marry A White Woman Act' back in 1959!</figcaption></figure></div><p>He argues that the reason most wives work these days isn&#8217;t because we&#8217;re poorer (and they have to work to survive), but because we&#8217;re richer (and so wives can make so much money working outside the home that the opportunity cost is too high to pass up). </p><p>A single earner <em>could</em> still support a family on a 1950s lifestyle. It would just feel like a failure, because we don&#8217;t realize how much worse than 1950s lifestyle was compared to our current conditions. </p><p>The article&#8217;s paywalled, but you can get a pretty good sense of the argument from these paragraphs. After determining that the median man makes about $80,000/year, he writes:</p><blockquote><p>Let&#8217;s say our $80,000-a-year man is living in the Jacksonville area. The Department of Housing and Urban Development calculates what are called Fair Market Rents for each American metro &#8212; this means the 40th percentile rent for a home with any given set of characteristics. <a href=\"https://www.huduser.gov/portal/datasets/fmr/fmr2025/FY2025_FMR_Schedule.pdf\">They say</a> F.M.R. for a three-bedroom home in the Jacksonville area is $2,163. That comes out to about 30 percent of Mr. Median&#8217;s annual income.</p><p>Can you really get a place to live for that little? Here&#8217;s a <a href=\"https://www.trulia.com/home/12555-belmont-lakes-dr-jacksonville-fl-32225-58545533\">lovely three-bedroom home in the East Arlington neighborhood for $2,020 a month</a>, and it&#8217;s zoned for an elementary school with a 10-out-of-10 ranking from GreatSchools.</p><p>It&#8217;s true that 1,617 square feet is on the small side for, say, a family of five in the contemporary United States. But the <a href=\"https://www.newser.com/story/225645/average-size-of-us-homes-decade-by-decade.html\">average size of a new single family home was 1,289 square feet in 1960 and 1,500 square feet in 1970</a>. Two of your kids are going to need to share a bedroom, but that&#8217;s how people lived back in the day.</p><p>There&#8217;s more to life than housing, of course, but I started there because that&#8217;s the largest item in a household budget. Durable goods like furniture, cars, and appliances have all become better and more affordable since the mid-1960s. That&#8217;s partially offset by rising prices for things like college tuition, child care, and health care. But in the 1960s, most young people didn&#8217;t go to college. The way health insurance works, you only need one worker in your family to get a job-based health plan. And of course, with your wife serving as a full-time homemaker, you don&#8217;t need to worry about child care expenses.</p><p>The big thing is that, with a larger family, you literally have a bunch of mouths to feed. But the model here is to replicate <a href=\"https://ers.usda.gov/data-products/charts-of-note/chart-detail?chartId=100002\">how people actually lived in the mid-1960s</a>, which is that they <a href=\"https://ms32-23594.medium.com/the-cultural-revolution-of-eating-out-b3f5b03d6516\">dined out much less frequently</a> and also spent a much larger share of their total income on food.</p></blockquote><p>When I try to retrace this, it seems possible, but barely. I imagined doing this in Sacramento, to be near family. Suppose I make $80K pretax = $6.6K/month pretax = $5K per month posttax. A cheap 3-bedroom house on a nice-enough block is $2200 mortgage, assume $3K after property taxes etc. A cheap <em>new</em> car is $350/month. Food can be arbitrarily low if you&#8217;re willing to eat rice all the time, but let&#8217;s say $250/month. CoveredCalifornia offered my family of four healthcare for $600/month. So top four expenses take $4200/month of the $5000/month pretax income. I don&#8217;t know; seems tough. I would like to see a more thorough breakdown of an average 2026 vs. 1956 man&#8217;s likely budget. </p><p>There are also some areas where it&#8217;s harder to separate genuine declines from rising expectations. Most people in the 1950s didn&#8217;t have health insurance. Was that because they accepted lower levels of health, or because medical care was cheaper, and easy enough to afford out-of-pocket? Probably some very complicated combination of both. And it might be impossible to get certain kinds of 1950s medical care today, i.e. a bed in a cheap low-quality shared hospital room.</p><p>(some of the best discussion around this came from the response to Elizabeth Warren&#8217;s <em>The Two-Income Trap</em>, <a href=\"https://www.peoplespolicyproject.org/2019/05/06/the-two-income-trap-stuff-is-clearly-incorrect/\">see eg Matt Bruenig here</a>)</p><p>Still, I find this tangential to the main point. Yes, a few conservatives complain that it&#8217;s hard to have a single-income family. But most vibecession complaints come from singles or dual-earner households!</p><p></p><h2>4: What About Other Countries?</h2><p>&#8230;</p><p><strong>Dionysus <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184606939\">writes</a>:</strong></p><blockquote><p>Did you know that <a href=\"https://www.nytimes.com/2025/09/16/business/china-young-people-boom.html\">China also has a vibecession?</a></p><p>If even China can&#8217;t regulate social media heavily enough to prevent this phenomenon, how can any liberal society possibly hope to?</p></blockquote><p>The link goes to an NYT article, which includes quotes like:</p><blockquote><p>Using apps like RedNote and Douyin, people are reviving memories of the 2000s and the early 2010s with photos of daring outfits, upbeat songs and vintage TV commercials, all of which, in different ways, evoke a time in China that pulsed with optimism. &#8220;The music back then throbbed with exuberance, brimming with the sense that the future could only get brighter,&#8221; a middle-aged man said in a RedNote video. &#8220;Today&#8217;s lyrics begin with lines like, &#8216;We&#8217;re trying our best to survive.&#8217;&#8221;</p></blockquote><p>And</p><blockquote><p>The boom-time beauty meme is the latest expression of a Gen Z counterculture born of disillusionment, the recognition that they may be the first generation in half a century unlikely to surpass their parents&#8217; standard of living, no matter how hard they try. </p><p>Over the past five years, this quiet resistance has taken many forms. It began with &#8220;<a href=\"https://archive.is/o/UVYIz/https://www.nytimes.com/2021/07/03/world/asia/china-slackers-tangping.html\">lying flat</a>,&#8221; a refusal to join the rat race. Some chose to pursue the &#8220;<a href=\"https://archive.is/o/UVYIz/https://www.nytimes.com/2022/05/24/business/china-covid-zero.html\">run philosophy</a>,&#8221; or emigrating in search of freedom and brighter prospects. Others declared themselves the &#8220;last generation,&#8221; vowing not to have children. Still others embraced &#8220;let it rot,&#8221; giving up on difficult goals rather than battling for uncertain rewards. To show they could care less about career prospects, many took to wearing &#8220;<a href=\"https://archive.is/o/UVYIz/https://www.nytimes.com/2024/03/24/business/china-gross-outfits-at-work.html\">gross outfits</a>&#8221; at work.</p></blockquote><p>This is especially crazy in China, where GDP per capita is now <em>ten times </em>what it was back during the &#8220;Boom Years&#8221; that everyone reminisces about. This might be the smoking gun that people&#8217;s economic beliefs are totally unmoored from how rich they are. </p><p>The Chinese story has an obvious moral: people care about growth rate more than level. But even this doesn&#8217;t work for America - our Vibecession doesn&#8217;t correspond to a period of unusually low growth.</p><p><strong>machine_spirit <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184222379\">writes</a>:</strong></p><blockquote><p>It&#8217;s interesting to compare it to Europe as the control group. Unlike the US, whose economy muddled through just fine during the last decade, we are currently experiencing a massive economic decline that could soon turn into a full-blown collapse. And yet, outside of debates about immigration or foreign policy especially regarding Ukraine you don&#8217;t really hear the same level of rancour about &#8216;things being bad&#8217; in the local media.</p></blockquote><p>I&#8217;m surprised to hear this. I hear many economic complaints from Europeans, but I suppose this passes through my own American filter bubble which is incentivized to talk about economic hardship for its own American reasons.</p><p><strong>Golden Feather <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/188257579\">writes</a>:</strong></p><blockquote><p>I am an Italian currently living in the US. My main guesses would be:</p><ul><li><p>Right-wing parties control a supermajority of TV and print media. They have also been in the govt most of the time, which means they control the state TV and have an interest in presenting things as rosey. The much older population makes the internet less relevant for public sentiment. Even in the few years where they were at the opposition, they mostly focused on immigration and crime to rile up popular sentiment, I guess because the population is older, their voters even moreso, so they care more about that than about the economy</p></li></ul><ul><li><p>The absolutely massive and unsustainable intergenerational transfers keep everyone somehow sedated. Maybe your wage is terrible, especially after taxes, maybe you&#8217;re unemployed and it&#8217;s hard to find a job, but grandma will be happy to help out her only grandchild. Most don&#8217;t realize they&#8217;re just getting their money back. This is bound to collapse soon but see the point above, the media really don&#8217;t want you to think about it.</p></li></ul><ul><li><p>It&#8217;s a lot easier to feel like you&#8217;re providing opportunities for your kids. The stereotypical rich-kid private uni is, even as a proportion of median income, still <em>a lot</em> cheaper than an Ivy and probably even an unremarkable liberal arts school. Unless you want to study business or law, there just aren&#8217;t private unis (there is one for medicine but it&#8217;s universally considered bad). Public uni is cheap and usually open access. If there is some kind of selection (eg medicine or architecture), it&#8217;s a standardized test, so you don&#8217;t have to worry about optimizing your kid&#8217;s extracurriculars, you can just have them do what they like or what is important to you. You don&#8217;t have to worry about living in a good school district because anyone can enroll in any public HS, and with very few exceptions private HSs are worse. If you are more aware about the state of the country than most of your co-nationals, and want to send your kid to study abroad, any other EU country is bound by treaty to treat them exactly like their own citizens, you just have to make sure they speak decent (not excellent, decent) English. The anxiety Americans have about setting up their kids for success is assuaged, partly because Italians are less ambitious but mostly because it&#8217;s objectively much easier to do so.</p></li><li><p>Related to the above point, but the EU ensures that in the worst countries there is a lot of evaporative cooling. The most ambitious Italians are not doomscrolling about how terrible the tech job market is in Italy, they&#8217;re learning German or looking for a job in the Netherlands. And when they&#8217;re there they complain even less than the locals because well, nobody likes an ungrateful guest, they don&#8217;t want to feel they uprooted their life for nothing, and it&#8217;s still much better than Italy - the usual reasons immigrants are much more appreciative than natives everywhere.</p></li></ul><p>The last point obviously does not apply to the richest countries themselves (hence why populism in the Nordics, Germany and the Netherlands looks more like MAGA than the rest of the European right), but the first three do, <em>mutatis mutandis</em>. The second and the third one even moreso, opportunities are as equal as they can realistically be and the safety net really robust. Nobody is afraid they will end up destitute, and opportunities are as equalized as they can realistically be across the bottom 95% (maybe even 99%) of the kids. Once you take away those two sources of anxiety, people tend to be a lot more relaxed.</p></blockquote><p><strong>Citizen Penrose <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184294564\">writes</a>:</strong></p><blockquote><p>On the Brooklyn theory. If media sentiment was the main factor wouldn&#8217;t you expect it to vary in English speaking vs non-English speaking countries? Whereas, you get the same phenomena in all the developed countries as far as I know.</p></blockquote><p>I don&#8217;t know which direction this pushes. I think the UK is having the same problem with London that we have with Brooklyn, and China has their Tier 1 cities. I don&#8217;t know what the situation is in France or Germany, but I&#8217;m also not sure the Vibecession is happening in those places.</p><p><strong>JBB23 <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184388008\">writes</a>:</strong></p><blockquote><p>To the extent you believe the large consumer confidence surveys (Conference Board and UMich) accurately measure sentiment, there are dozens of subindices which shed light on the actual reasons people feel bad.</p><p>A few things to note - there&#8217;s no obvious differentiation by either age or income, so any hypothesis relying on things being especially bad for young/poor/middle class is not showing up in this data. The subindices on labor markets, income, and the stock market are strong (as they should be). The subindices that are weak are related to inflation, buying conditions for durables (inflation again), buying conditions for homes, and vibier questions like expectations for retirement, expectations for future income, etc.</p><p>The OECD also produces consumer confidence surveys and the US is pretty middle of the pack compared to other advanced countries for the last three years - US, Australia, western europe, UK, japan, are all in the -1 to -1.5 z score range historically. China is the worst, around -2 z scores. Interestingly, Mexico is one of the few places with high consumer confidence right now.</p><p>So for me, the synthesis should be any explanation is pretty global and pretty widespread across demographic groups. That suggests inflation and media negativity.</p></blockquote><p></p><h2>5: Comments On Rent And Housing</h2><p>&#8230;</p><p><strong>Fred</strong> <strong><a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184231733\">writes</a></strong>:</p><blockquote><p>I don&#8217;t actually buy that city rents haven&#8217;t gone crazy. We were renting in the inner-inner not-quite-suburbs of Boston for $1700 in 2021. When we checked back in 2024, it was at $2800. Pretty sure that&#8217;s roughly in line with overall Boston rental price movement. Is NYC maybe not the best to look at because of all that rent control I always hear about? (This sounds so simplistic that it has to be wrong, and I know nothing about NYC, but I have to throw it out there).</p></blockquote><p>Good point. The chart I gave to show relatively-stable rents in NYC was 2010 - 2023. <a href=\"https://www.jefftk.com/p/boston-rents-over-time-ii\">Jeff Kaufman</a> has 2013 - 2023 for Boston. Here is the inflation-adjustion version:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!OCCC!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3e713c70-5b19-4a17-854a-118075f9c047_550x333.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"333\" src=\"https://substackcdn.com/image/fetch/$s_!OCCC!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3e713c70-5b19-4a17-854a-118075f9c047_550x333.png\" title=\"\" width=\"550\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>Basically no change during that time, weird. But <strong>Demost <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184274161\">writes</a>:</strong></p><blockquote><p>It may not just be rent-controlled apartments.</p><p>If you look into the rents in Germany and Switzerland (the ones I know about), there are two very different measures of rents, even after adjusting for flat sizes etc:</p><p>1) The median rent of a person who lives in the city.</p><p>2) The median rent of a person who moves to the city.</p><p>I believe that the second one has absolutely skyrocketed in the last 20 years in all major German and Swiss cities, while the first one has only moderately increased. The reason is that rents are sticky. People who have lived in the same flat for 20 years have seen limited increase of their rents, whereas rates for new tenants have increased dramatically.</p><p>If you look into official statistics, as Scott did, they will probably measure 1), and see a moderate increase. But for young people, 2) is much more relevant.</p><p>I don&#8217;t know whether it is the same for large US cities. The housing markets are different, for example in Germany (and Switzerland?) there are much fewer home owners than in the US. But on this side of the Atlantic, I think this is a very major factor for why many young people are struggling with their rents.</p></blockquote><p>I&#8217;d like to know more about what factors hold rents down for long-time residents. Without rent control laws, wouldn&#8217;t landlords raise rents on existing renters each year to keep them equal to the market price?</p><p><strong>David Levey <a href=\"https://substack.com/@davidhlevey/note/c-188878432\">writes</a>:</strong></p><blockquote><p>Has Kevin Erdmann decisively figured out why we seem to be in a perpetual &#8220;vibecession,&#8221; where people feel much worse off economically than the usual numbers &#8212; real wages, household incomes and consumption, etc. &#8212; would justify? A situation with major political implications, in that every administration successively finds itself disappointing its supporters who believed promises of falling costs of living and rising prosperity.</p><p>He argues, in a new paper for the Mercatus Center, <a href=\"https://kevinerdmann.substack.com/p/we-are-not-as-wealthy-as-we-thought\">&#8220;We Are Not as Wealthy as We Thought We Were,&#8221;</a> that a large portion of the wealth of U.S. households, which is found in the value of their homes, is, in fact, not real wealth, but a result of being trapped in rising cost accommodations in a housing-poor society. Here is the abstract:</p></blockquote><p>This is interesting, but I don&#8217;t think it affects most of our measures of vibecession, which aren&#8217;t looking at real estate wealth. The income of people today should be comparable to the income of people X years ago before the housing increase happened, with the exception of how much they spend on housing/rent, which we&#8217;ve already priced in.</p><p><strong>Aristides <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184228881\">writes</a>:</strong></p><blockquote><p>I will be honest and my vibes are low entirely because of the mortgage increase. I had everything ready to buy a house in 2021, and the housing prices rose so much I can&#8217;t afford one. I&#8217;ve been living in rentals for 4 more years than I expected. Sure, my rent only increased by 10%, but now I have a 3 year old who wants to play outside in a yard that I own, and instead we are in a tiny apartment with no yard. I&#8217;ll probably figure out how to buy a house by 2027, but 6 extra years of rentals makes this a bad decade for me even if my income increased by 50% over this time.</p></blockquote><p>Question for Aristides and others: why is renting so associated with apartments (eg your child can&#8217;t have a yard), and buying so associated with houses? I&#8217;m not denying this is true, I just can&#8217;t fully trace the economic logic that causes it.</p><p><strong>Ransom Cozzillio <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184282516\">writes</a>:</strong></p><blockquote><p>It&#8217;s obviously still possible, as you note, that housing cost increases, which are a very real issue, are carrying a disproportionate burden of &#8220;the vibes&#8221;. However, I think it&#8217;s worth noting that ~70% of Americans are homeowners. So those rising prices actually make the majority of people wealthier. Also, the homeownership rate for Millennials isn&#8217;t tracking much behind that for the Boomer at the same ages (a couple percentage points). Yes, the younger generation is paying more, inflation adjusted, for those houses. That&#8217;s not ideal. But also it can&#8217;t really be said they are getting negative vibes from being locked out of homeownership or something.</p></blockquote><p></p><h2>6: Comments On Inflation</h2><p>&#8230;</p><p><strong>Citizen Penrose <a href=\"https://chatgpt.com/share/6931e385-c8b8-800f-922f-cf2202485000\">writes</a>:</strong></p><blockquote><p>&#8220;I think inflation calculations are pretty good.&#8221;</p><p>I wouldn&#8217;t be so quick to dismiss the argument that inflation figures are wrong. Like you said, if inflation has historically actually been much higher it provides a very parsimonious explanation for all the other data.</p><p>CPI might do a good job measuring short term changes in inflation, say year to year, but it&#8217;s very unclear that it can be used to make long term comparisons between different decades, as all figures in this post implicitly do.</p><p>I liked this post a lot about ways CPI figures can be systemically wrong stretched over time:</p><p><a href=\"https://devinhelton.com/economics/gdp-and-cpi-are-broken\">https://devinhelton.com/economics/gdp-and-cpi-are-broken</a></p><p>The metric which that post suggests as a more realistic measure of real incomes is how many hours of median wages are required for a 30 year old man to provide: A running car. A house. 2k calories of food daily.</p><p>I asked chat gpt&#8217;s deep research to calculate an index for that basket of goods and the index has been on a secular decline since around 1970, and in 2025 was only about half the 1970 value (i.e. it takes twice as many working hours to provide those goods now.) <a href=\"https://chatgpt.com/share/6931e385-c8b8-800f-922f-cf2202485000\">https://chatgpt.com/share/6931e385-c8b8-800f-922f-cf2202485000</a></p><p>Also even if the CPI figures are right, the composition might still matter. Broadly, essential goods are more expensive now than in 1970 and consumer goods are much cheaper. Even if that looks like a wash in CPI figure it could still mean a loss in wellbeing for several reasons:</p><p>1.) Maybe consumer goods are more likely to be affected by hedonic adaptation or have negative externalities. By normal CPI measures a smartphone might be worth a million dollars in 1970, but what is the actual hedonic effect of smartphones? (maybe negative?) Having a &#8220;one million dollar&#8221; smartphone isn&#8217;t going to make up for not having a &#163;300k house.</p><p>2.) Maybe consumer goods have steeper diminishing marginal utility. The same way having three right shoes isn&#8217;t better than one right and one left shoe, being able to afford twenty 50&#8221; tvs isn&#8217;t as good as being able to afford one tv + a house to put it in.</p></blockquote><p>I appreciate your work, but when I try to check ChatGPT&#8217;s work, I find that its &#8220;basket of goods&#8221; assumes the median person buys one house per year. This means the basket massively overweights the price of housing compared to everything else, and - since the price of housing has increased the most - it massively overestimates inflation.</p><p><strong>WoolyAI writes:</strong></p><blockquote><p>For the first time, this is less than I wanted to know, very specifically regarding inflation measurements and how we adjust for it in wages.</p><p>Specifically, I can remember around 2013 when there was a proposal that Social Security COLA adjustments (annual cost of living increases) be tied to Chained CPI, rather than CPI. And the AARP seemed very, very convinced that minor changes to how inflation was calculated would dramatically impact real people&#8217;s Social Security checks (1). I&#8217;ve seen calculations that chained CPI is 0.25-0.3% (5) lower than CPI. Which is small overall but large relative to overall inflation, roughly 2%, and compounding.</p><p>I don&#8217;t want to argue here that the goldbugs are right and the purchasing power of the US dollar has dropped by 80%. But it does seem plausible that different inflation measures, even if both equally valid, could dramatically alter the real median wage over this period.</p><p>For example, from FRED&#8217;s &#8220;Real Median Household Income&#8221; series (2), from 2000-2024, income grew from $71,790 to $83,730. That&#8217;s about a 16.6% increase over 24 years. That&#8217;s roughly a 0.6% annual growth rate. If the difference between Chained CPI and CPI is roughly 0.3%/year and real median income growth is ~0.6%/year, then how we measure inflation has a pretty significant impact on how we calculate real income, as well as every inflation adjusted measure we looked at.</p><p>And I&#8217;m pretty confident that chained CPI is valid, because in the &#8220;Real Median Household Income&#8221; data from FRED, under notes, it says &#8220;Income in 2024 C-CPI-U (2000-2024) and R-CPI-U-RS (pre-2000) adjusted dollars.&#8221; Which looks like the pre-2000 numbers are calculated using traditional CPI and the post-2000 numbers are calculated using chained CPI. This is buttressed by the fact that FRED&#8217;s chained CPI data only goes back to 2000 (3)</p><p>So, briefly, I don&#8217;t like the &#8220;Miscalculation Of Inflation&#8221; section and I wish it dove into more detail because:</p><p>#1 There are multiple valid inflation metrics. I have nothing against CPI, it&#8217;s a solid metric and we have the data going back to the 60&#8217;s, and I have nothing against chained CPI, which is the current standard FRED uses and also makes more sense (4). However, there are more inflation metrics beyond Chained CPI; Penn State lists 5 here alone (6)</p><p>#2 The impact of different inflation metrics is large enough to significantly alter the increase in real median wages, say up or down 50%.</p><p>#3 I don&#8217;t understand how the decision to use different inflation measures affects all our other inflation adjusted metrics. To make this specific, I don&#8217;t know what the real median household income would be for 2019 if we calculated it with CPI (the way we did in 1999) vs with chained CPI.</p><p>#4 The response from economists here feels&#8230;dismissive. Which would be fine if there really was a single consistent inflation metric everyone was confident in, and maybe there is, but there seems to be a lot more complexity and value judgment to inflation metrics than &#8220;just CPI&#8221;. Especially when there&#8217;s such a gap between consumer sentiment/vibes and official statistics which would be significantly impacted by different inflation measures.</p><p>#5 Which is worse, because&#8230;I cannot help but note that the kind of guys who post things like the &#8220;US Wages in Gold&#8221; or &#8220;The Fiat Crisis&#8221; (7) are disproportionately multimillionaire crypto bros who&#8230;On the one hand they all sounds like salesmen at best and scammers at worst and constantly predict a US fiscal and monetary collapse but&#8230;they did go act on those beliefs and built the entire crypto ecosystem worth at least half a trillion. Anyone who&#8217;s financial/economic philosophy directly leads to them inventing their own ridiculously lucrative alternative financial system deserves to be taken at least somewhat seriously.</p><p>To clarify, I don&#8217;t think the impacts of different inflation measures are large enough for a decline narrative but they could be for a stagnation narrative.</p><p>Real Income growth of 16% from 2000-2024 sounds like slow, solid but uninteresting growth. 6-7% total growth over that same period &#8220;feels&#8221; like stagnation.</p><p>Inflation-adjusted rents going up 40% vs 30%.</p><p>An average mortgage payment of $3.3k vs $3k compared to an average mortgage payment of $2k in 2000.</p><p>I would appreciate any insight anyone else has, as this is a subject I know worse than nothing about, I know a little. And I wish I knew more.</p><p>(1) <a href=\"https://states.aarp.org/what-is-the-chained-cpi\">https://states.aarp.org/what-is-the-chained-cpi</a></p><p>(2) <a href=\"https://fred.stlouisfed.org/series/MEHOINUSA672N\">https://fred.stlouisfed.org/series/MEHOINUSA672N</a></p><p>(3) <a href=\"https://fred.stlouisfed.org/series/SUUR0000SA0\">https://fred.stlouisfed.org/series/SUUR0000SA0</a></p><p>(4) As far as I can tell, chained CPI just attempts to adjust the basket of goods by how consumers vary their purchases as prices change. Pretend I buy 4 pounds of beef a week. The price of beef doubles. I stop buying beef and start buying chicken. CPI measures as if I still buy 4 pounds of beef. Chained CPI tries to capture my change to chicken, which is hard.</p><p>(5) <a href=\"https://www.cbo.gov/publication/44088\">https://www.cbo.gov/publication/44088</a></p><p>(6) <a href=\"https://sites.psu.edu/inflation/\">https://sites.psu.edu/inflation/</a></p><p>(7) <a href=\"https://balajis.com/p/fiat\">Balaji on the Fiat Crisis</a></p></blockquote><p>Okay, <em>this</em> one I&#8217;ll leave to the economists.</p><p></p><h2>7: Comments On Vibes</h2><p>&#8230;</p><p><strong>Fluorescent Kneepads</strong> <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184266294\">brings up</a> an <a href=\"https://www.empower.com/the-currency/money/secret-success-research\">article</a> asking each generation their definition of financial success, key point this graph:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!QK9u!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F78cc97a3-7ee5-4499-a1d3-74d55bf7230a_844x802.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"345.8862559241706\" src=\"https://substackcdn.com/image/fetch/$s_!QK9u!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F78cc97a3-7ee5-4499-a1d3-74d55bf7230a_844x802.png\" title=\"\" width=\"364\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>By Zoomers&#8217; metric, about 1.5% of Americans are &#8220;financially successful&#8221;. Could their high standard for success be related to why they feel like they are unsuccessful, and from there why they think the economy&#8217;s bad?</p><p>But an alternate interpretation of this chart is that every generation believes success is ~$500,000/year, inflation-adjusted to the value of the dollar when they were in their early 20s and forming beliefs about success. This is a bit of a stretch - surely Boomers have had plenty of time to update on the value of a dollar since their 20s, especially since many of them are still working and collecting salaries. But the math works out.</p><p><strong>Victor Thorne, </strong>responding to a demand that Zoomers to justify themselves, <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184431676\">wrote:</a></p><blockquote><p>I&#8217;m on the older side of Gen Z (22) and it&#8217;s not really about that. I do think I&#8217;d need to make a ton of money to be comfortable, not because I actually need to spend anywhere near that much money, but because that&#8217;s how much cushion I would need to have to feel like I wasn&#8217;t on the edge of a crisis. I mean, to shop at a nice grocery store without worrying too much about prices you should probably be making at least 200k; that&#8217;s a big part of my definition of financial success (in part because better food is one of the main &#8216;rich people things&#8217; I am actually interested in).</p></blockquote><p>Cue commenters yelling at him for feeling like he &#8220;needs&#8221; to shop at a nice grocery store, and him very reasonably responding that the question asked about &#8220;feeling financially successful&#8221;, not about what he &#8220;needs&#8221;. So one interpretation of this question is that companies have done a better job making Zoomers feel like expensive products are part of the good life (e.g. shopping at Walmart vs. Whole Foods). I endorse this: I&#8217;m in the same social class as my parents, but I remember them shopping at the same grocery store as the poor people in their hometown, whereas I mostly shop at upscale hippiesh places.</p><p><strong>Theodidactus <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184224326\">writes</a>:</strong></p><blockquote><p>I&#8217;m surprised you didn&#8217;t address one thing...but I guess it&#8217;s just a different way of saying &#8220;vibes&#8221;, still I think this connects to a lot of econ discourse and...frankly...I don&#8217;t have a good solution and it honestly scares me a little:</p><p>So, when prices go up really fast, that&#8217;s &#8220;the economy.&#8221; It&#8217;s a force external to me, and I&#8217;m mad that it&#8217;s happening, cuz I sure as hell didn&#8217;t do it.</p><p>When *my salary* goes up really fast, that&#8217;s...just me, obviously, I deserve that. I&#8217;m happy it&#8217;s happening, and I SURE AS HELL caused it.</p><p>In short: it&#8217;s an outrage if eggs cost $10, and that&#8217;s true even if I make $500,000 a year and made $250,000 the year before. That massive jump in my income was the result of my blood, sweat, and toil. I didn&#8217;t do the egg thing.</p><p>My own read on the vibes of a lot of people my age (esp. who voted for trump) is that they actually expect *the real sticker price of commodities* to go down as the result of...some unspecified economic corrective policy...and if not, well, things will be bad for whoever is in charge, and this will be true no matter how much anyone makes.</p><p>Obviously, if you know economics, you know the cost of things going down would be bad, and that your own salary going up is due as much to economic forces as anything, but you can&#8217;t fix sentiment errors like this by sitting the whole country down and having an economics lesson (indeed, I&#8217;d argue biden tried that).</p></blockquote><p><strong>Ivan Fyodorovich </strong><a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184219969\">writes</a>:</p><blockquote><p>A key part of the &#8220;Brooklyn Theory&#8221; is that the media industry really is a total nightmare of endless layoffs, unpaid internships, city newspapers shutting down etc as Google et al. eat all the advertising revenue. They have been in an awful recession for decades and since they have the megaphones, they can spread their misery to everyone else.</p></blockquote><p>I was going to ask if the media is really this powerful, but <strong>DocTam</strong> <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184274208\">writes</a>:</p><blockquote><p>After seeing how much media opinions on big tech changed overnight in 2016 I learned how much the opinions of journalists in NYC really changes the zeitgeist of discussion. The journalism industry is so miserable with people still looking to get college degrees in a field that pays terribly. Even the alternative media economy is primarily driven by wretched journalism majors.</p></blockquote><p>This was a formative experience for many people in Silicon Valley: there was a sudden turn from the early 2000s world where everyone loved technology and thought that the information superhighway was the utopian world of the cyber-future, to the late 2000s world where everyone hated techno-fascist tech-bro techno-oligarchs using The Algorithm to addict our children. Although there was some shift in the underlying terrain, the sheer speed of the change in opinion made a lot of people point to journalists realizing that tech was bad for their business and making an united decision to cover it negatively. Could the same thing happen to an entire economy? Should we subsidize journalists, on the theory that if they&#8217;re in a good mood, everyone else will be in a good mood too? Is this Chris Best&#8217;s secret plan for Substack?</p><p class=\"button-wrapper\"><a class=\"button primary button-wrapper\" href=\"https://www.astralcodexten.com/subscribe\"><span>Subscribe now</span></a></p><p></p><h2>8: Other Good Comments</h2><p>&#8230;</p><p><strong>Golden Feather <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/188231073\">writes</a>:</strong></p><blockquote><p>I think a very important piece of evidence you missed is all the surveys where people answer that <em>their own</em> situation is fine, but <em>the economy</em> is bad. See eg this one <a href=\"https://www.axios.com/2023/08/18/americans-economy-bad-personal-finances-good\">https://www.axios.com/2023/08/18/americans-economy-bad-personal-finances-good</a></p><p>Even if we assume people rate their own situation independently of the media (very strong claim), the media must be responsible at the very least for the dissonance between their own experience and their assessment of the economy, no?</p></blockquote><p><strong>Cremieux (on X) </strong><a href=\"https://x.com/cremieuxrecueil/status/1880000221570359666\">objects to the chart showing each generation doing better than the last</a>.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!cVMz!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8ba3ce7e-508c-409c-a0c9-462b04e2a2cc_360x460.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Image\" class=\"sizing-normal\" height=\"296.44444444444446\" src=\"https://substackcdn.com/image/fetch/$s_!cVMz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8ba3ce7e-508c-409c-a0c9-462b04e2a2cc_360x460.png\" title=\"Image\" width=\"232\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>He writes that they &#8220;divided by the square root of household size&#8221;, but that &#8220;this is problematic because it means Gen Z incomes are being inflated to the extent they live with their parents.&#8221; I&#8217;m not entirely sure what he means by this - if Zoomers were being counted as living in a large household, wouldn&#8217;t that deflate their income (by dividing by an artificially high denominator)? Maybe he means <em>Boomers</em> are getting deflated because their adult kids are counted as part of their household? But this wouldn&#8217;t affect the 20-year-old band where we&#8217;re doing most of the comparison.</p><p>In any case, he includes a &#8220;couple sharing unit&#8221; graph that avoids this problem:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!OUc-!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F24700b0e-5018-4213-9fea-08a4e504364e_1853x796.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Image\" class=\"sizing-normal\" height=\"273.86675824175825\" src=\"https://substackcdn.com/image/fetch/$s_!OUc-!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F24700b0e-5018-4213-9fea-08a4e504364e_1853x796.jpeg\" title=\"Image\" width=\"638\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>&#8230;and it still shows every generation doing better than the last, albeit by a smaller amount.</p><p><strong>Joel Long <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184284222\">writes</a>:</strong></p><blockquote><p>I have not been able to find data to assess this, but my pet theory is that the basket of consumption middle class people are chasing as &#8220;normal&#8221; has changed.</p><p>Anecdotally, I see this on:</p><p>1) expected square footage per person in housing (e.g. kids sharing bedrooms seems much less universal than it used to be)</p><p>2) vehicle space per household member. Meaning both size and number of vehicles. My perception is also that &#8220;cars as status goods&#8221; has made its way further down the socioeconomic ladder than it used to be but that&#8217;s wild speculation.</p><p>3) frequency, duration, and distance of vacations: I blame this one, perhaps unfairly, on the prevalence of travel vloggers. Here there is some data: <a href=\"https://ourworldindata.org/tourism\">https://ourworldindata.org/tourism</a></p><p>Basically: while people have gotten wealthier over time, the standard of living they&#8217;re pursuing has increased even more, which can come out as feeling poorer on net.</p></blockquote><p><strong>Mika <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184226503\">writes</a>:</strong></p><blockquote><p>I think the low friction of applications is a big driver of this (both in jobs, college, dating etc). I am in my final year of an Electrical Engineering degree and applied to ~500 full time jobs this fall. I am a reasonably economically minded person, I try to avoid pessimism know the stats on how everything has gotten better over time, pro capitalism etc. But even I was having trouble mentally reconciling what I knew about the numbers with my feeling from the inside of like being rejected over and over again while being in a pretty in demand field. Additionally my algorithms started to pick up on this and fed me content about how the sky was falling no one was getting hired etc. Things got pretty dark for me mentally for about a month. I&#8217;m mostly on the other side of it now, I got some offers (ones I probably won&#8217;t take and because they are in the wrong EE field) , and a lot of interviews scheduled etc. But I just don&#8217;t think humans are built to mentally understand &#8220; You will have to be rejected multiple hundreds of times over a month or two to get a job&#8221;. Even if it&#8217;s relatively guaranteed if you put in that effort.</p></blockquote><p>I hadn&#8217;t considered the bad experience &#8594; complain online &#8594; algorithm shows you pessimistic content <a href=\"https://www.astralcodexten.com/p/trapped-priors-as-a-basic-problem\">trapped prior loop</a>.</p><p></p><h2>9: The Parable Of Calvin&#8217;s Grandparents</h2><p>&#8230;</p><p><strong>Calvin Blick </strong><a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184217181\">writes</a><strong>:</strong></p><blockquote><p>Imagine having to get up at 4 am every morning, drive an hour to work, and then run a meat shop singlehandedly--dealing with customers, slicing cuts of meat, dealing with all the behind the scenes stuff like rent and suppliers. You get home at 7 or 8 pm every night. You only rarely get to see your kids. You have a small house in a not-great neighborhood.</p><p>Your wife has to deal with five kids singlehandedly. Money is tight. Meat is a luxury. Your husband beats you on occasion, and no one cares.</p><p>That was the reality for my grandparents. Yes, my grandfather owned the business, but it was a really hard life by modern standards. Obviously living standards were rising rapidly which is not the case today, but none of the people complaining about how hard things are now would trade places to take on that life.</p></blockquote><p>I like this comment for putting the &#8220;your life really is different from and better than past generations&#8217; in ways that are invisible to you&#8221; argument in stark relief. But&#8230;</p><p><strong>Liface </strong><a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184221637\">answers</a><strong>:</strong></p><blockquote><p>You have kids, in fact, FIVE of them, the wonderful bundles of joy! You own your own business. You get to work in-person, providing value to real people. Your neighbors talk to each other. Neighborhood kids play in the street. Civic society is strong: you are members of a church, the Elks club, you volunteer at local events, etc. You live near extended family. With no internet, you only compare your situation to your immediate neighbors. The economy appears to be growing and prospects for the future look good.</p></blockquote><p>&#8230;I also like this one for how it turns Calvin&#8217;s comment on its head and makes me more sympathetic to the cultural proxy argument. But&#8230;</p><p><strong>Calvin </strong><a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184225787\">answers</a>:</p><blockquote><p>You are definitely taking an extreme \"paint a rosy picture\" view here. My grandfather rarely saw his kids. He never made it to a single baseball game or activity. I have worked enough customer service jobs to know how utterly draining they are, and I've known enough people who owned their own business to know how brutal that can be. My grandfather was a member of a church (which played a big part in his life; kids went to Catholic school, etc), but he definitely didn't have the time or money for the Elks club or volunteering.</p></blockquote><p>&#8230;I really like this one because it helps show how dubious and contingent the cultural proxy argument is. </p><p>Aella <a href=\"https://www.thendobetter.com/arts/2021/11/14/aella-escort-work-home-school-rationalism-circling-working-in-a-factory-losing-faith-polls-and-endless-questions-podcast\">talks a lot</a> about how she used to have a manufacturing job, hated hated <em>hated</em> it, and decided to switch to sex work so she never had to do anything like that ever again; this seems like a pretty common opinion among people who have legit worked in factories (cf. how many of them are motivated by the dream of giving their child a better life where they <em>won&#8217;t</em> have to work a factory job). And <a href=\"https://www.astralcodexten.com/p/book-review-selfish-reasons-to-have\">we&#8217;ve already talked about</a> how the average parent now spends far more time with their children these days than they used to.</p><p>If it were as easy to quantify the intangibles as it is to quantify GDP, would we find that we&#8217;re in a cultural vibecession, where the intangible parts of life are also getting better and we&#8217;re just ignoring it out of the same pessimistic bias which is confusing our view of the economy? </p><p><strong>J Nicholas </strong><a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184241506\">adds</a>:</p><blockquote><p>The thing is, there is nothing stopping most people from living a lifestyle just like Calvin&#8217;s grandfather. You can totally get a job running a small business in a very rural area with all those things you describe. </p><p>There is a butcher in a village near me who asks me, every time I see him, whether I have any interest in taking over his business when he retires. He hasn&#8217;t shown me his books (although I&#8217;m sure he would if I asked), but he clearly makes well over $100,000/year. I have no relevant experience, so I&#8217;m sure if he asks me he is asking lots of other people. Nobody has taken him up on it (except the Amish, but he doesn&#8217;t like them and doesn&#8217;t want to sell to them).</p><p>Would young people today be happier if they chose that lifestyle? Very possible. But they don&#8217;t want to, even if they can.</p></blockquote><p>If you disagree and think this sounds like a great offer, you can <a href=\"https://substack.com/@akrasiac\">message J Nicholas here</a> and see if he&#8217;ll put you in touch with the butcher! Be sure to email me too, so I can check up later on how it went.</p><p>And J has written more about what he calls <a href=\"https://akrasiac.substack.com/p/the-myth-of-a-us-cost-of-living-crisis\">&#8220;the myth of the cost of living crisis&#8221;</a> on his own blog.</p><h2>10: Updates / Conclusions</h2><p>My strongest update is on the stories about vibecession-like sentiments in China, where incomes clearly, obviously, grew by a factor of 5-10x in the past generation. This demonstrates that vibes can be totally divorced from the real economic situation, and makes me less neurotic about searching for some way that the US vibes could be correct. </p><p>My second strongest update comes from Alex&#8217;s chart showing wild swings in partisan ratings of economic health when a president from a different party gets elected, which again show vibes totally divorced from reality.</p><p>The strongest counterargument is that the housing (not rent) situation has genuinely been awful since about 2020. If you want to argue that the bad vibes began then, and are entirely about not-yet-homeowners despairing at their chances of ever owning a home, then those bad vibes would be fully justified.</p><p>I&#8217;m also more open to taking the consumer confidence charts seriously, limiting the vibecession proper to ~2022 - 2024, and saying it was mostly about inflation, plus a side of high housing prices. All of the pessimism before 2022 was something else, mostly coming from a few disenfranchised or chronically pessimistic groups and not having as much to do with the economy in particular.</p><p>I would like to see someone seriously investigate an average 1955 couple&#8217;s budget vs. an average modern couple&#8217;s budget, discuss how far each one would go, and do a more careful analysis of who was getting the better deal, and by how much.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/highlights-from-the-comments-on-vibecession",
            "publishedAt": "2025-12-31",
            "source": "SlateStarCodex",
            "summary": "<p><em>[Original post: <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted\">Vibecession - Much More Than You Wanted To Know</a>]</em></p><p><strong>Table of Contents</strong></p><p><strong>1:</strong> When was the vibecession?<br /><strong>2:</strong> Is the vibecession just sublimating cultural complaints?<br /><strong>3:</strong> Discourse downstream of the Mike Green $140K poverty line post<br /><strong>4:</strong> What about other countries?<br /><strong>5:</strong> Comments on rent/housing<br /><strong>6:</strong> Comments on inflation<br /><strong>7:</strong> Comments on vibes<br /><strong>8:</strong> Other good comments<br /><strong>9:</strong> The parable of Calvin&#8217;s grandparents<br /><strong>10: </strong>Updates / conclusions</p><p></p><h2>1: When Was The Vibecession?</h2><p>&#8230;</p><p><strong>Kyla Scanlon <a href=\"https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184276827\">writes</a>:</strong></p><blockquote><p>Hi! I&#8217;m the person who coined and first published this term. I&#8217;ve been studying this phenomenon for the past four years, so forgive the rather long comment! A quick factual clarification: the Vibecession began in 2022 as the sentiment&#8211;data divergence that opened up that summer is the real starting point. The decade before didn&#8217;t have the same shape of malaise, which you can see in the sentiment data you included. People who&#8217;ve also been working on this topic tend to focus on the same pressures you outlined like housing, education, measurement problems which are absolutely part of the story. Maybe this is what you meant by smoking gun, but the Vibecession has crossed into somewhat of a meaning-making crisis which shows up in collapsing trust and",
            "title": "Highlights From The Comments On Vibecession"
        },
        {
            "content": [
                "<p>It’s that time. It’s been a hell of a year.</p>\n<p>At the start we barely had reasoning models. Now we have Claude Code and Opus 4.5.</p>\n<p>I don’t code. Yet now I cause code to exist whenever something about a website annoys me, or when I get that programmer’s realization that there’s something I am planning on doing at least three times. Because why not?</p>\n<p>The progress has simultaneously been mind bogglingly impressive and fast. But a lot of people don’t see it that way, because progress has been incremental, and because we were reasonably expecting to often get even more than this.</p>\n<div>\n\n\n<span id=\"more-24996\"></span>\n\n\n</div>\n<p>The public conversation and debate, even more than before, was full of false narratives and active attempts to make the situation worse. The same goes for attempts to shape Federal policy towards AI, and OpenAI’s conversion into a for-profit.</p>\n<p>It’s been, as they say, one battle after another, with many wins, many setbacks and a lot of things in between.</p>\n<p>This includes the key developments in AI, and also other blog posts from the year that I consider memorable looking back.</p>\n<p>This is only our corner of the world’s Year in Review, not one in general, thus things like Liberation Day are happening in the background and go undiscussed.</p>\n\n\n<h4 class=\"wp-block-heading\">January</h4>\n\n\n<p>The confusions started in January, as we prepared for Trump to take office.</p>\n<p>OpenAI had just given us o1-preview, the first reasoning model.</p>\n<p>At the tail end of 2024, DeepSeek released v3, or <a href=\"https://thezvi.substack.com/p/deekseek-v3-the-six-million-dollar?r=67wny\"><strong>The Six Million Dollar Model</strong></a>. This was a big advancement in open source and Chinese model capabilities, and showed that they were not as far behind as we thought they were, and also that damn good models could be trained on the cheap. Not as cheap as the headline number, since the six million was only direct costs of the final run, but still pretty cheap.</p>\n<p>Then a few weeks later, <a href=\"https://thezvi.substack.com/p/on-deepseeks-r1?r=67wny\"><strong>DeepSeek gave us r1</strong></a>, a reasoning model based on v3. They wrapped this up into a nice clean free app experience, which included the first time most people could see a reasoning model’s chain of thought &#8211; Gemini Flash Thinking offered this too but almost no one knew about that or cared. This showed that the ‘secret sauce’ of building a reasoning model was not so difficult to copy, and the marginal costs of doing so were low.</p>\n<p><a href=\"https://thezvi.substack.com/p/deepseek-panic-at-the-app-store?r=67wny\"><strong>DeepSeek shot to the top of the App store</strong></a>, and the world completely lost its mind. <a href=\"https://thezvi.substack.com/p/deepseek-lemon-its-wednesday?r=67wny\"><strong>The stock market mini-crashed</strong></a>. People talked about how China had ‘caught up’ to America, or this meant inference would be so cheap no one would need Nvidia chips (as consumers rushed out to buy Nvidia chips to run DeepSeek r1), or how it would destroy margins and drive American AI out of business. I had to warn people, many times, <a href=\"https://thezvi.substack.com/p/deepseek-dont-panic?r=67wny\"><strong>with the classic advice: Don’t Panic</strong></a>, and <a href=\"https://podcasts.apple.com/us/podcast/the-ai-model-that-tanked-the-stock-market/id1056200096?i=1000686145901\">I went on Odd Lots to discuss it all</a>.</p>\n<p>Collectively this was called The DeepSeek Moment.</p>\n<p>White House rhetoric talked about how this meant we were in a ‘race’ with China, so of course any other considerations than ‘winning’ must be thrown out the window.</p>\n<p>With time, those paying attention realized all of that was overblown. DeepSeek was impressive as a lab, and v3 and r1 were excellent models, but still on the order of eight months behind OpenAI, Anthropic and Google. We had been comparing the relatively best features of r1 on their own, and then using that to project into the future, which flat out did not happen. This happened at a crucial inflection point, right when reasoning models had started, which was when a tiny amount of compute could go a maximally long way.</p>\n<p>Later on, <a href=\"https://thezvi.substack.com/p/deepseek-r1-0528-did-not-have-a-moment?r=67wny\"><strong>r1-0528 did not have a moment</strong></a>, <a href=\"https://thezvi.substack.com/p/deepseek-v31-is-not-having-a-moment?r=67wny\"><strong>nor did DeepSeek 3.1</strong></a> or <a href=\"https://thezvi.substack.com/p/deepseek-v32-is-okay-and-cheap-but?r=67wny\"><strong>DeepSeek 3.2</strong></a>.</p>\n\n\n<h4 class=\"wp-block-heading\">February</h4>\n\n\n<p>Google started out the month <a href=\"https://thezvi.substack.com/p/were-in-deep-research?r=67wny\"><strong>introducing us to Deep Research</strong></a>, a new product form that would be copied by OpenAI, allowing the AI to take time to prepare a report. At the time, this was super impressive. It definitely has its uses, even if the timing is awkward and you have to push past the tendency to pad reports with a lot of slop.</p>\n<p>A <a href=\"https://thezvi.substack.com/p/the-risk-of-gradual-disempowerment?r=67wny\"><strong>new paper on The Risk of Gradual Disempowerment From AI</strong></a> improved the debate by highlighting a central way that humans end up not being in charge. There doesn’t need to be some ‘AI coup’ or battle, the AIs will by default end up with more and more resources and power unless something stops this from happening. One day we wake up and realize we are not in control. Another day after that we don’t wake up.</p>\n<p>OpenAI declared that its primary alignment strategy <a href=\"https://thezvi.substack.com/p/on-deliberative-alignment?r=67wny\"><strong>would be Deliberative Alignment</strong></a>, so I analyzed that approach. I think it is helpful, but not a central solution.</p>\n<p>The Administration made its AI feelings clear at <a href=\"https://thezvi.substack.com/p/the-paris-ai-anti-safety-summit\"><strong>The Paris AI Anti-Safety Summit</strong></a>. Previous summits had been efforts to lay foundation for international cooperation, with serious discussions of existential risks, in particular with <a href=\"https://thezvi.substack.com/i/138524690/the-bletchley-declaration\">The Bletchley Declaration</a>. That was clearly over, transformed into a disdain for the idea that sufficiently advanced AI could be existentially dangerous, and Vance giving a speech demanding suicidal accelerationism and warning against attempts to not die.</p>\n<p>The year would play out in similar fashion. We had some modest success in California and New York, but the White House would, under the influence of David Sacks, become an active force for interference with efforts to not die, and later even to beat China. They would do some pro-America things along the way, but also things that actively interfered with our competitiveness.</p>\n<p>I introduced a key new concept handle which I call <a href=\"https://thezvi.substack.com/p/levels-of-friction?r=67wny\"><strong>Levels of Friction</strong></a>. Different actions are variously harder or easier, from both practical and legal perspectives, to do. They range from Level 0 (defaults or requirements), to Level 1 (legal and ubiquitous and easy), Level 2 (safe but annoying), Level 3 (actively tricky or risky), Level 4 (actually seriously illegal) up to Level 5 (we really care about stopping you). Instead of thinking of a boolean of legal-illegal or possible-impossible, it is often more enlightening to consider moving between levels.</p>\n<p>AI is going to move a lot of things to lower levels of friction. That is by default bad, but frictions can be load bearing, such as with job applications or limiting antisocial behaviors. It protects the commons. We will have to adjust quite a lot of things once key frictions are removed from the system.</p>\n<p>February was the peak of <a href=\"https://thezvi.substack.com/p/grok-grok?r=67wny\"><strong>‘could Grok be a thing?</strong></a>’ It turned out not to be a thing. In other model news we got <a href=\"https://thezvi.substack.com/p/time-to-welcome-claude-37?r=67wny\"><strong>Claude 3.7</strong></a>.</p>\n<p>We also got our first introduction to <a href=\"https://thezvi.substack.com/p/on-emergent-misalignment?r=67wny\"><strong>Emergent Misalignment</strong></a>, the idea that training the AI to do bad things associated with evil could lead it to generalize into thinking of itself as trope-style evil and doing a wide range of trope-style evil things.</p>\n\n\n<h4 class=\"wp-block-heading\">March</h4>\n\n\n<p>A non-AI highlight was my piece on elementary education, <a href=\"https://thezvi.substack.com/p/childhood-and-education-9-school?r=67wny\"><strong>School Is Hell</strong></a>.</p>\n<p><a href=\"https://thezvi.substack.com/p/on-gpt-45?r=67wny\"><strong>GPT-4.5</strong></a> was OpenAI’s attempt to give us a large and slow model. It did some cool things, and there are people that really liked it, but mostly it wasn’t worthwhile.</p>\n<p>A big part of AI coverage is getting confident in dismissing hype. A great example of this was my coverage of <a href=\"https://thezvi.substack.com/p/the-manus-marketing-madness?r=67wny\"><strong>The Manus Marketing Madness</strong></a>. Now that they’ve unceremoniously sold out to Meta, it’s easy to forget that a lot of people were hyping Manus as The Next Big Thing, as well as the next reason we would Lose To China.</p>\n<p>I warned against using <a href=\"https://thezvi.substack.com/p/the-most-forbidden-technique?r=67wny\"><strong>The Most Forbidden Technique</strong></a>, which is where you use interpretability to train on intermediate outputs, to teach it to think the thoughts you want it to think, thus teaching the AI to, like humans before it, hide its thinking.</p>\n<p>Image generation had its first big moment, when the <a href=\"https://thezvi.substack.com/p/fun-with-gpt-4o-image-generation?r=67wny\"><strong>4o image generator came online</strong></a> and everyone went Studio Ghibli crazy, taking advantage of both the advancement in quality and willingness to mimic styles.</p>\n<p><a href=\"https://thezvi.substack.com/p/gemini-25-is-the-new-sota?r=67wny\"><strong>Gemini 2.5 Pro came out</strong></a>, which I called the new state of the art. I think this was correct at the time, but later versions of Gemini 2.5 Pro were actively worse, and soon OpenAI would be back out ahead.</p>\n\n\n<h4 class=\"wp-block-heading\">April</h4>\n\n\n<p><a href=\"https://ai-2027.com/\">AI 2027</a> provided an illustrative scenario that presented a best guess as to what was likely to happen, with an alternative scenario option where things turn out well because a bold decision is made to slow down at a key moment. <a href=\"https://thezvi.substack.com/p/ai-2027-dwarkeshs-podcast-with-daniel?r=67wny\"><strong>Scott Alexander and Daniel Kokotajlo explained the details</strong></a> on the Dwarkesh podcast, and <a href=\"https://thezvi.substack.com/p/ai-2027-responses?r=67wny\"><strong>I covered various responses</strong></a>.</p>\n<p><a href=\"https://thezvi.substack.com/p/llama-does-not-look-good-4-anything?r=67wny\"><strong>Llama 4 was released</strong></a>, and turned out to be a total dud. Meta has been silent since in terms of topline AI products, while spending hundreds of millions on individual pay packages to try and gather the talent to get back in the game. It is a good thing Meta is struggling, given <a href=\"https://thezvi.substack.com/p/zuckerbergs-dystopian-ai-vision?r=67wny\"><strong>its bizarrely dystopian AI vision</strong></a> it is willing to give in public.</p>\n<p><a href=\"https://thezvi.substack.com/p/o3-will-use-its-tools-for-you?r=67wny\"><strong>o3 put OpenAI firmly back out in front</strong></a> in reasoning, with excellent tool use, but was <a href=\"https://thezvi.substack.com/p/o3-is-a-lying-liar?r=67wny\"><strong>rapidly exposed as a Lying Liar</strong></a> that lies a lot.</p>\n<p>OpenAI had other problems with GPT-4o. It was always an absurd sycophant that could get some of its users into trouble, but updates made around this time <a href=\"https://thezvi.substack.com/p/gpt-4o-is-an-absurd-sycophant?r=67wny\"><strong>made it even more of an absurd sycophant</strong></a>, forcing a <a href=\"https://thezvi.substack.com/p/gpt-4o-responds-to-negative-feedback?r=67wny\"><strong>reversion to a previous build</strong></a>. I would later <a href=\"https://thezvi.substack.com/p/gpt-4o-sycophancy-post-mortem?r=67wny\"><strong>offer a postmortem</strong></a>.</p>\n\n\n<h4 class=\"wp-block-heading\">May</h4>\n\n\n<p><a href=\"https://thezvi.substack.com/p/openai-claims-nonprofit-will-retain?r=67wny\"><strong>OpenAI claimed that their conversion to a for-profit</strong></a><strong>, </strong>which as announced then would clearly have been one the biggest thefts in human history, would leave the non-profit in control.</p>\n<p>The White House had from the beginning made a huge deal out of how Just Awful the Biden diffusion rules were, just like it talks about everything Biden did, but it initially acted generally wisely on chip diffusion and export controls, including on the H20.</p>\n<p>Alas, over time David Sacks got more control over their narrative and increasingly started spouting <a href=\"https://thezvi.substack.com/p/fighting-obvious-nonsense-about-ai?r=67wny\"><strong>Obvious Nonsense About AI Diffusion</strong></a>, literally claiming that ‘beating China’ means maximizing Nvidia’s share of chip sales, and warning that China would step in with non-existent and otherwise greatly inferior AI chips to build its own ‘AI tech stack’ if we didn’t sell massive compute to partners with questionable loyalties. Initially this rhetoric and action <a href=\"https://thezvi.substack.com/p/america-makes-ai-chip-diffusion-deal?r=67wny\"><strong>was confined to sales to parties like UAE and KSA</strong></a>, where a case can be made if the deals and safeguards are good, and details matter. Later this would extend to trying to sell chips to China directly.</p>\n<p><a href=\"https://thezvi.substack.com/p/the-codex-of-ultimate-vibing\"><strong>OpenAI released Codex to compete with Claude Code</strong></a>. Claude Code was such a stealth release, initially a side project of one employee, that it took a while to notice something was happening, and even longer for me to finally give it a try. Nowadays Claude Code might be most of my AI token usage.</p>\n<p><a href=\"https://thezvi.substack.com/p/claude-4-you-the-quest-for-mundane?r=67wny\"><strong>Claude 4 put Anthropic back in the game</strong></a>.</p>\n<p><a href=\"https://thezvi.substack.com/p/cheaters-gonna-cheat-cheat-cheat\"><strong>I offered thoughts on those who use AI to cheat, especially in education</strong></a>.</p>\n<p><a href=\"https://thezvi.substack.com/p/fun-with-veo-3-and-media-generation?r=67wny\"><strong>Veo 3 gave Google the lead in video generation</strong></a>.</p>\n<p>I wrote my first ‘<a href=\"https://thezvi.substack.com/p/letting-kids-be-kids\"><strong>Letting Kids Be Kids</strong></a>,’ I would <a href=\"https://thezvi.substack.com/p/childhood-and-education-16-letting?r=67wny\"><strong>later write another in December</strong></a>.</p>\n\n\n<h4 class=\"wp-block-heading\">June</h4>\n\n\n<p><a href=\"https://thezvi.substack.com/p/dating-roundup-6?r=67wny\"><strong>Dating Roundup #6 proved popular</strong></a><strong>, </strong>and <a href=\"https://thezvi.substack.com/p/dating-roundup-7-back-to-basics?r=67wny\"><strong>#7 did solidly too</strong></a>. I just put out<a href=\"https://thezvi.substack.com/p/dating-roundup-8-tactics?r=67wny\"> <strong>#8</strong></a> and <a href=\"https://thezvi.substack.com/p/dating-roundup-9-signals-and-selection?r=67wny\"><strong>#9</strong></a>.</p>\n<p><a href=\"https://thezvi.substack.com/p/rtfb-the-raise-act?r=67wny\"><strong>I did an analysis of New York’s proposed RAISE Act</strong></a>, by <a href=\"https://www.alexbores.nyc/\">Alex Bores who is now running for Congress</a>. I concluded it was an excellent bill. It would later pass, although in somewhat weakened form because of Governor Hochul’s changes.</p>\n<p>OpenAI and in particular Sam Altman continued to try and sell us on the <a href=\"https://thezvi.substack.com/p/the-dream-of-a-gentle-singularity\"><strong>concept of a Gentle Singularity</strong></a>, that AIs would become superintelligent and your life wouldn’t much change. This is of course Obvious Nonsense. Your life might become great, or it might end, or it might get into High Weirdness, but it won’t stay the same.</p>\n<p><a href=\"https://thezvi.substack.com/p/o3-turns-pro?r=67wny\"><strong>o3 Pro came out</strong></a>, and was very strong and not the lying liar that normal o3 was.</p>\n<p><a href=\"https://thezvi.substack.com/p/substack-and-other-blog-recommendations?r=67wny\"><strong>I came out with my (hopefully annual from here on in) blog recommendations.</strong></a></p>\n\n\n<h4 class=\"wp-block-heading\">July</h4>\n\n\n<p>The first attempt to pass a federal moratorium on AI regulation, as in tell the states they aren’t allowed to regulate AI because that should be federal while also not regulating AI at the federal level, came dangerously close to passing as part of the BBB. <a href=\"https://thezvi.substack.com/p/ai-moratorium-stripped-from-bbb?r=67wny\"><strong>It was ultimately stripped out 99-1 once the tide had turned</strong></a>.</p>\n<p>Congress had one of its finer hearings, <a href=\"https://thezvi.substack.com/p/congress-asks-better-questions?r=67wny\"><strong>where they asked good questions about AI</strong></a>.</p>\n<p>Grok ran into trouble. <a href=\"https://thezvi.substack.com/p/no-grok-no?r=67wny\"><strong>No, Grok, No</strong></a>. <a href=\"https://thezvi.substack.com/p/worse-than-mechahitler?r=67wny\"><strong>Do not call yourself MechaHitler</strong></a>. Or worse.</p>\n<p><a href=\"https://thezvi.substack.com/p/kimi-k2?r=67wny\"><strong>Kimi K2 was an unusually impressive new open Chinese model.</strong></a> We would later get <a href=\"https://thezvi.substack.com/p/kimi-k2-thinking?r=67wny\"><strong>Kimi K2 Thinking in November</strong></a>.</p>\n<p><a href=\"https://thezvi.substack.com/p/google-and-openai-get-2025-imo-gold?r=67wny\"><strong>Google and OpenAI got IMO Gold.</strong></a></p>\n<p><a href=\"https://thezvi.substack.com/p/ai-companion-piece?r=67wny\"><strong>AI companions were getting a lot of attention</strong></a>, which has since died down. This will be a big thing at some point, and for some it is a very real thing, but for now it isn’t good enough to hold most people’s interest. <a href=\"https://thezvi.substack.com/p/ai-companion-conditions?r=67wny\"><strong>I followed up again in August</strong></a>.</p>\n\n\n<h4 class=\"wp-block-heading\">August</h4>\n\n\n<p>The big hyped release of the year was of course GPT-5. This would be their big moment to unify all their crazy model variations and names, and create one model to rule them all, with a router to think longer if and only if that was worthwhile. There were approaching death stars and we saw a variety of assertive valueposting. It was the big version number jump, and people expected a lot.</p>\n<p>GPT-5 was a good model, I found it to be a clear upgrade, but it very much did not live up to the hype. Many even strongly wanted to keep GPT-4o for its far friendlier and more empathic attitude, or some would say its sycophancy &#8211; the very features that make GPT-4o not a great thing for many users are alas the reasons users often like it so much. I covered the <a href=\"https://thezvi.substack.com/p/gpt-5s-are-alive-basic-facts-benchmarks?r=67wny\"><strong>basic facts and model card</strong></a>, <a href=\"https://thezvi.substack.com/p/gpt-5s-are-alive-outside-reactions?r=67wny\"><strong>then outside reactions</strong></a> and <a href=\"https://thezvi.substack.com/p/gpt-5s-are-alive-synthesis?r=67wny\"><strong>finally created a synthesis</strong></a>.</p>\n<p>Unfortunately, the model OpenAI chose to call GPT-5 being a disappointing release gave so many people, up to and including David Sacks and Sriram Krishnan at the White House, the wrong idea. There is a constant demand for data points that say AI won’t advance much, that scaling is dead, that it will all be a normal technology and you don’t have to worry about AGI. Washington seems to have come away from the GPT-5 release with this message, and it plausibly did great harm in numerous ways, including to our export controls.</p>\n<p><a href=\"https://thezvi.substack.com/p/reports-of-ai-not-progressing-or?r=67wny\"><strong>I tried to push directly back against this,</strong></a> pointing out that AI was continuing to make rapid progress, both around GPT-5 and various other misleading data points, especially the no-good, very-bad ‘MIT study.’ I followed up by pointing out that <a href=\"https://thezvi.substack.com/p/yes-ai-continues-to-make-rapid-progress?r=67wny\"><strong>Yes, AI Continues To Make Rapid Progress, Including Towards AGI</strong></a>.</p>\n<p>I noticed <a href=\"https://thezvi.substack.com/p/arguments-about-ai-consciousness?r=67wny\"><strong>I was deeply confused about AI consciousness</strong></a>, along with everyone else. I still am, except now I’m more confused at a better, more advanced level. These questions are coming up more and more now, and I expect that to continue.</p>\n<p>It’s so funny to have half of people debating AI consciousness, while the other half thinks AI is not making any progress.</p>\n<p><a href=\"https://thezvi.substack.com/p/spending-too-much-time-at-airports\"><strong>I offered my advice around flying.</strong></a></p>\n<p><a href=\"https://thezvi.substack.com/p/are-they-starting-to-take-our-jobs?r=67wny\"><strong>Are the AIs starting to take our jobs</strong></a>? Not in general, but for entry level jobs? Kinda.</p>\n\n\n<h4 class=\"wp-block-heading\">September</h4>\n\n\n<p><a href=\"https://thezvi.substack.com/p/book-review-if-anyone-builds-it-everyone?r=67wnyhttps://thezvi.substack.com/p/book-review-if-anyone-builds-it-everyone?r=67wny\"><strong>I reviewed <em>If Anyone Builds It, Everyone Dies</em></strong></a><strong><em>. </em></strong>There were a few weeks <a href=\"https://thezvi.substack.com/p/reactions-to-if-anyone-builds-it?r=67wny\"><strong>where this inspired a lot of discussion</strong></a>, <a href=\"https://thezvi.substack.com/p/more-reactions-to-if-anyone-builds?r=67wny\"><strong>much of it</strong></a> remarkably good.</p>\n<p>The month ended with Anthropic reclaiming its role as my daily driver <a href=\"https://thezvi.substack.com/p/claude-sonnet-45-is-a-very-good-model?r=67wny\"><strong>thanks to Claude Sonnet 4.5</strong></a>.</p>\n<p>There was <a href=\"https://thezvi.substack.com/p/ai-craziness-notes?r=67wny\"><strong>more on AI craziness</strong></a>, then later in November we would see additional <a href=\"https://thezvi.substack.com/p/ai-craziness-additional-suicide-lawsuits?r=67wny\"><strong>lawsuits against OpenAI related to suicides</strong></a>.</p>\n\n\n<h4 class=\"wp-block-heading\">October</h4>\n\n\n<p>OpenAI meanwhile decided to release <a href=\"https://thezvi.substack.com/p/sora-and-the-big-bright-screen-slop?r=67wny\"><strong>Sora and The Big Bright Screen Slop Machine</strong></a>, attempting to turn its good short video generator into a dystopian social network. I said the comparables were Google+ and Clubhouse. Call looks good.</p>\n<p><a href=\"https://thezvi.substack.com/p/bending-the-curve?r=67wny\"><strong>I got to go to The Curve,</strong></a> which was an excellent conference.</p>\n<p>One of the consequences of the GPT-5 release was more people talked about AI as <a href=\"https://thezvi.substack.com/p/bubble-bubble-toil-and-trouble?r=67wny\"><strong>potentially being in a bubble</strong></a>. I do not agree, other than in the nominal ‘number might go down’ sense. Number might go down, if not number needs to go up.</p>\n<p>OpenAI completed its trio of <a href=\"https://thezvi.substack.com/p/cloud-compute-atlas-the-openai-browser?r=67wny\"><strong>overhyped releases with the Atlas browser</strong></a>. This jaded people sufficiently that when GPT-5.1 and GPT-5.2 later came out, people gave them remarkably little focus.</p>\n<p><a href=\"https://thezvi.substack.com/p/on-dwarkesh-patels-podcast-with-andrej?r=67wny\"><strong>Andrej Karpathy went on Dwarkesh Patel</strong></a> and cautioned us not to get overexcited.</p>\n<p>The biggest advantage America has over China is its access to vastly more compute. This is thanks in large part to our export controls. Alas, David Sacks it the AI Czar, acts like a de facto Nvidia lobbyist, and is trying to make us give that edge away.</p>\n<p>Emboldened by prior success in getting authorization for H20 sales, Nvidia and David Sacks made their move, and came (based on what I know) remarkably close to getting America to commit quite a lot of civilizational suicide and <a href=\"https://thezvi.substack.com/p/please-do-not-sell-b30a-chips-to?r=67wny\"><strong>sell B30A chips to China</strong></a>, essentially giving them close to chip parity. This would have been a completely insane move, and we should be thankful a combination of key people stepped up and prevented this from happening.</p>\n<p>Unfortunately, although far less unfortunately than if we’d sold B30As, they then regrouped and in December would successfully push, despite it being obviously unwise and unpopular, <a href=\"https://thezvi.substack.com/p/selling-h200s-to-china-is-unwise?r=67wny\"><strong>for us to sell H200s to China</strong></a>. The Chinese are making a show of not wanting them so much, but it’s a show, and our edge has been substantially eroded. The logic behind this seems to have been nominally based in part on a prediction that Huawei can scale chip production far faster than credible predictions say, as in being off by an order of magnitude or more.</p>\n<p><a href=\"https://thezvi.substack.com/p/openai-moves-to-complete-potentially?r=67wny\"><strong>OpenAI finished its conversion to a for-profit</strong></a>, completing what I believe is arguably the second largest theft in human history behind the Russian oligarchs of the 1990s. The final terms came as the result of negotiations with the District Attorneys of Delaware and California, and they did extract a lot of highly meaningful concessions, both in terms of compensation and also in helping retain meaningful control and oversight over OpenAI. This could have gone so much worse. But as I said, that’s like a mugger demanded your money, and they got talked down to only taking half your money, then they claim they ‘recapitalized you.’ You’re still out half of your money.</p>\n\n\n<h4 class=\"wp-block-heading\">November</h4>\n\n\n<p><a href=\"https://thezvi.substack.com/p/openai-the-battle-of-the-board-ilyas\"><strong>We got what may be the final key revelations</strong></a> of what I call OpenAI’s Battle of the Board where the board attempted to fire Sam Altman, as we got Ilya Sustkever’s testimony about what happened. We now know that this was driven by Ilya Sutskever and Mira Murati, and was motivated by ordinary business concerns, centrally Sam Altman’s lying and mistreatment of employees.</p>\n<p>I offered <a href=\"https://thezvi.substack.com/p/the-big-nonprofits-post-2025?r=67wny\"><strong>my 2025 edition of The Big Nonprofits Post</strong></a>, for those looking to donate, and would later <a href=\"https://thezvi.substack.com/p/keeping-up-against-the-joneses-balsas?r=67wny\"><strong>share an update from my nonprofit, Balsa Research</strong></a>.</p>\n<p>The year would finish with a flurry of new model releases.</p>\n<p><a href=\"https://thezvi.substack.com/p/gpt-51-follows-custom-instructions?r=67wny\"><strong>OpenAI started us off with GPT-5.1</strong></a>, a modest upgrade that follows custom instructions well and often glazes the user, and then followed it up with <a href=\"https://thezvi.substack.com/p/chatgpt-51-codex-max?r=67wny\"><strong>GPT-5.1-Codex-Max</strong></a>, which was a substantial boost in coding power in particular.</p>\n<p><a href=\"https://thezvi.substack.com/p/gemini-3-model-card-and-safety-framework?r=67wny\"><strong>Google gave us</strong></a> Gemini 3 Pro, <a href=\"https://thezvi.substack.com/p/gemini-3-pro-is-a-vast-intelligence?r=67wny\"><strong>a vast intelligence with no spine</strong></a> and also severe alignment issues and mental problems. It’s a great model, and was clearly now the best at a variety of uses, especially raw intelligence, or a teacher or whom you had questions with known answers that you would ask an autist.</p>\n<p>Anthropic then gave us the big one, <a href=\"https://thezvi.substack.com/p/claude-opus-45-model-card-alignment?r=67wny\"><strong>Claude Opus 4.5</strong></a>, <a href=\"https://thezvi.substack.com/p/claude-opus-45-is-the-best-model?r=67wny\"><strong>which is for now the clear best model available</strong></a>, and remains my daily driver, both for chat and also in Claude Code.</p>\n<p>Claude Opus 4.5 felt like a large practical leap, some like Dean Ball going so far as to call it AGI. I don’t agree but I understand where they are coming from.</p>\n\n\n<h4 class=\"wp-block-heading\">December</h4>\n\n\n<p>I went to San Francisco for the Solstice, and wrote <a href=\"https://thezvi.substack.com/p/little-echo?r=67wny\"><strong>Little Echo</strong></a>.</p>\n<p><a href=\"https://thezvi.substack.com/p/zvis-2025-in-movies?r=67wny\"><strong>I did the annual movie review</strong></a>.</p>\n<p>We learned <a href=\"https://thezvi.substack.com/p/reward-mismatches-in-rl-cause-emergent?r=67wny\"><strong>even more reasons to beware reward mismatches in RL</strong></a>.</p>\n<p>OpenAI upgraded again to GPT-5.2, <a href=\"https://thezvi.substack.com/p/gpt-52-is-frontier-only-for-the-frontier?r=67wny\"><strong>which I evaluated as Frontier Only For The Frontier</strong></a>. Its impressive benchmarks do not reflect its capabilities, and people reacted with fatigue after too many disappointing OpenAI model releases. It’s not an especially ‘fun’ model to interact with, nor is it especially fast, and it currently occupies a sweet spot only for tasks where you need a lot of raw thinking capability and are looking for ‘just the facts’ and cold analysis, and potentially for coding where everyone serious should try various models to see what works best for their tasks.</p>\n<p>I offered a sequence of posts on why median wages are up, economists keep saying times are solid, yet young people keep saying things suck. <a href=\"https://thezvi.substack.com/p/the-140000-question?r=67wny\"><strong>Those complaining often say false things</strong></a> and use statistics wrong, but if so many people think things suck, then you know there’s a problem. <a href=\"https://thezvi.substack.com/p/the-140k-question-cost-changes-over?r=67wny\"><strong>I looked into cost changes over time</strong></a>, and <a href=\"https://thezvi.substack.com/p/when-were-things-the-best?r=67wny\"><strong>when were various things the best</strong></a>. Finally, I presented my thesis, which was that this was due to the <a href=\"https://thezvi.substack.com/p/the-revolution-of-rising-expectations?r=67wny\"><strong>Revolution of Rising Expectations</strong></a> and the Revolution of Rising Requirements. Our expectations and comparison points are supremely high, as are the things we legally require of those looking to raise families.</p>\n\n\n<h4 class=\"wp-block-heading\">Questions For Next Season</h4>\n\n\n<p>AI is going gangbusters. The news about it is accelerating, not slowing down. It’s going to increasingly impact our lives and be the topic of conversation. The model releases will come fast and furious. The agents will make big leaps in 2026, and not only for coding. It will likely be a major topic in the midterm elections. I don’t expect full High Weirdness in 2026, but you can’t fully rule it out.</p>\n<p>Blog growth, in terms of views, stagnated this year. That’s disappointing, as previously I had experienced strong growth, and I likely need to explore additional ways to get the word out. But ‘number go up’ was never the ultimate goal and I am confident that I am directly reaching quite a lot of the people I care about reaching. I do intend to send out a user survey some time in the near future.</p>\n<p>One big personal goal for 2026 is to do more coding and evergreen posting, going deeper into questions that matter or that I get curious about, and being better about organizing my thoughts, and to focus less on ephemeral items and news, and to finally get a handle on organizing what I do have to better create longer term resources. I am fully aware that almost all views happen within a few days of posting, but that doesn’t need to dictate anything, and there are some basic things where I could build permanent resources much better than I’ve been doing.</p>\n<p>The other big goal is to focus on what matters, including the fights and debates that matter, making sure to do that in a way that adds to permanent resources and not let important things end up buried. I have to do better triage, especially in letting relatively unimportant matters drop. I intend to publish fewer words on the blog in 2026, and with that to become more willing to skip days. I know the amount of content can be overwhelming.</p>\n<p>One thing that got lost in the shuffle this year, and illustrates the problem, was my planned review of Open Socrates. It’s a book warning you not to live your life 15 minutes at a time, and I didn’t finish my response because life kept throwing too much stuff at me. Well, that’s kind of the worst possible excuse not to finish that, isn’t it? Even if because of the delay I ultimately have to reread a lot of the book.</p>\n<p>I also have a bunch of projects I’d love to try. We’ll see how that goes. But also movies to watch, and games to play, and people to see, and fun to be had. Life beckons.</p>\n<p>And you know what? Life is pretty awesome. Other people sing Ald Lang Syne. <a href=\"https://www.youtube.com/playlist?list=OLAK5uy_nRiiScZK3sfpxx9Kwk5ZGUXW95sbnNqKU\">I go to</a> <a href=\"https://www.youtube.com/watch?v=pfotEo7pVqc\">the Secular Solstice</a>. My personal tradition, at year’s end, is something else entirely.</p>\n<p>Happy New Year, everyone.</p>\n<div>\n<div>\n<div>\n<div>Double click to interact with video</div>\n</div>\n</div>\n</div>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/31/2025-year-in-review/",
            "publishedAt": "2025-12-31",
            "source": "TheZvi",
            "summary": "It’s that time. It’s been a hell of a year. At the start we barely had reasoning models. Now we have Claude Code and Opus 4.5. I don’t code. Yet now I cause code to exist whenever something about a &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/31/2025-year-in-review/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "2025 Year in Review"
        },
        {
            "content": [],
            "link": "https://lethain.com/agents-subagents/",
            "publishedAt": "2025-12-31",
            "source": "Will Larson",
            "summary": "<p>Most of the extensions to our internal agent have been the direct result of running into a problem that I couldn&rsquo;t elegantly solve within our current framework. Evals, compaction, large-file handling all fit into that category. Subagents, allowing an agent to initiate other agents, are in a different category: I&rsquo;ve frequently thought that we needed subagents, and then always found an alternative that felt more natural.</p> <p>Eventually, I decided to implement them anyway, because it seemed like an interesting problem to reason through. Eventually I would need them&hellip; right? (Aside: I did, indeed, eventually use subagents to support <a href=\"https://lethain.com/agents-coordinators/\">code-driven workflows</a> invoking LLMs.)</p> <p><em>This is part of the <a href=\"https://lethain.com/agents-series/\">Building an internal agent</a> series.</em></p> <h2 id=\"why-subagents-matter\">Why subagents matter</h2> <p>&ldquo;Subagents&rdquo; is the name for allowing your agents to invoke other agents, which have their own system prompt, available tools, and context windows. Some of the reasons you&rsquo;re likely to consider subagents:</p> <ol> <li>Provide an effective strategy for context window management. You could provide them access to uploaded files, and then ask them to extract specific data from those files, without polluting your primary agent&rsquo;s context window with the files&rsquo; content</li> <li>You could use subagents to support concurrent work. For example, you",
            "title": "Building an internal agent: Subagent support"
        },
        {
            "content": [],
            "link": "https://lethain.com/agents-coordinators/",
            "publishedAt": "2025-12-31",
            "source": "Will Larson",
            "summary": "<p>When I started this project, I knew deep in my heart that we could get an LLM plus tool-usage to solve arbitrarily complex workflows. I still believe this is possible, but I&rsquo;m no longer convinced this is actually a good solution. Some problems are just vastly simpler, cheaper, and faster to solve with software. This post talks about our approach to supporting both code and LLM-driven workflows, and why we decided it was necessary.</p> <p><em>This is part of the <a href=\"https://lethain.com/agents-series/\">Building an internal agent</a> series.</em></p> <h2 id=\"why-determinism-matters\">Why determinism matters</h2> <p>When I joined Imprint, we already had a channel where folks would share pull requests for review. It wasn&rsquo;t <em>required</em> to add pull requests to that channel, but it was often the fastest way to get someone to review it, particularly for cross-team pull requests.</p> <p>I often start my day by skimming for pull requests that need a review in that channel, and quickly realized that often a pull request would get reviewed and merged without someone adding the <code>:merged:</code> reacji onto the chat. This felt inefficient, but also extraordinarily minor, and not the kind of thing I want to complain about. Instead, I pondered how I could solve it without",
            "title": "Building an internal agent: Code-driven vs LLM-driven workflows"
        },
        {
            "content": [],
            "link": "https://lethain.com/agents-logging/",
            "publishedAt": "2025-12-31",
            "source": "Will Larson",
            "summary": "<p>Agents are extremely impressive, but they also introduce a lot of non-determinism, and non-determinism means sometimes weird things happen. To combat that, we&rsquo;ve needed to instrument our workflows to make it possible to debug why things are going wrong.</p> <p><em>This is part of the <a href=\"https://lethain.com/agents-series/\">Building an internal agent</a> series.</em></p> <h2 id=\"why-logging-matters\">Why logging matters</h2> <p>Whenever an agent does something sub-optimal, folks flag it as a bug. Often, the &ldquo;bug&rdquo; is ambiguity in the prompt that led to sub-optimal tool usage. That makes <em>me</em> feel better, but it doesn&rsquo;t make the folks relying on these tools feel any better: they just expect the tools to work.</p> <p>This means that debugging unexpected behavior is a significant part of rolling out agents internally, and it&rsquo;s important to make it easy enough to do it frequently. If it takes too much time, effort or too many permissions, then your agents simply won&rsquo;t get used.</p> <h2 id=\"how-we-implemented-logging\">How we implemented logging</h2> <p>Our agents run in an AWS Lambda, so the very first pass at logging was simply printing to standard out to be captured in the Lambda&rsquo;s logs. This worked OK for the very first steps, but also meant that I had to log into AWS",
            "title": "Building an internal agent: Logging and debugability"
        },
        {
            "content": [],
            "link": "https://lethain.com/agents-evals/",
            "publishedAt": "2025-12-31",
            "source": "Will Larson",
            "summary": "<p>Whenever a new pull request is submitted to our agent&rsquo;s GitHub repository, we run a bunch of CI/CD operations on it. We run an opinionated linter, we run typechecking, and we run a bunch of unittests. All of these work well, but none of them test entire workflows end-to-end. For that end-to-end testing, we introduced an <a href=\"https://platform.openai.com/docs/guides/evals\">eval</a> pipeline.</p> <p><em>This is part of the <a href=\"https://lethain.com/agents-series/\">Building an internal agent</a> series.</em></p> <h2 id=\"why-evals-matter\">Why evals matter</h2> <p>The harnesses that run agents have a lot of interesting nuance, but they&rsquo;re generally pretty simple: some virtual file management, some tool invocation, and some context window management. However, it&rsquo;s very easy to create prompts that don&rsquo;t work well, despite the correctness of all the underlying pieces. Evals are one tool to solve that, exercising your prompts and tools together and grading the results.</p> <h2 id=\"how-we-implemented-it\">How we implemented it</h2> <p>I had the good fortune to lead Imprint&rsquo;s implementation of <a href=\"https://sierra.ai/\">Sierra</a> for chat and voice support, and I want to acknowledge that their approach has deeply informed my view of what does and doesn&rsquo;t work well here.</p> <p>The key components of Sierra&rsquo;s approach are:</p> <ol> <li>Sierra implements agents as a mix of React-inspired code that provide",
            "title": "Building an internal agent: Evals to validate workflows"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3188/",
            "publishedAt": "2025-12-31",
            "source": "XKCD",
            "summary": "<img alt=\"Anyone else watching this Youtube video in 1954? If so, my last trip definitely messed with the timeline.\" src=\"https://imgs.xkcd.com/comics/anyone_else_here.png\" title=\"Anyone else watching this Youtube video in 1954? If so, my last trip definitely messed with the timeline.\" />",
            "title": "Anyone Else Here"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-31"
}