{
    "articles": [
        {
            "content": [
                "<header>\n  <h1>On Async Mutexes</h1>\n  <time class=\"meta\" datetime=\"2025-11-04\">Nov 4, 2025</time>\n</header>\n<p>A short note on contradiction or confusion in my language design beliefs I noticed today.</p>\n<p>One of the touted benefits of concurrent programming multiplexed over a single thread is that\nmutexes become unnecessary. With only one function executing at any given moment in time data races\nare impossible.</p>\n<p>The standard counter to this argument is that mutual exclusion is a property of the logic itself,\nnot of the runtime. If a certain snippet of code must be executed atomically with respect to\neverything else that is concurrent, then it must be annotated as such in the source code. You can\nstill introduce logical races by accidentally adding an <code>.await</code> in the middle of the code that\nshould be atomic. And, while programming, you are adding new <code>.await</code>s all the time!</p>\n<p>This argument makes sense to me, as well its as logical conclusion. Given that you want to annotate\natomic segments of code anyway, it makes sense to go all the way to Kotlin-style explicit async\nimplicit await.</p>\n<p>The contradiction I realized today is that for the past few years I’ve been working on a system\nbuilt around implicit exclusion provided by a single thread — TigerBeetle! Consider compaction, a\ncode that is responsible for rewriting data on disk to make it smaller without changing its logical\ncontents. During compaction, TigerBeetle schedules <em>a lot</em> of concurrent disk reads, disk writes,\nand CPU-side merges. Here’s an average callback:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> read_value_block_callback</span>(</span>\n<span class=\"line\">    grid_read: <span class=\"hl-operator\">*</span>Grid.Read,</span>\n<span class=\"line\">    value_block: BlockPtrConst,</span>\n<span class=\"line\">) <span class=\"hl-type\">void</span> {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">const</span> read: <span class=\"hl-operator\">*</span>ResourcePool.BlockRead =</span>\n<span class=\"line\">        <span class=\"hl-built_in\">@fieldParentPtr</span>(<span class=\"hl-string\">&quot;grid_read&quot;</span>, grid_read);</span>\n<span class=\"line\">    <span class=\"hl-keyword\">const</span> compaction: <span class=\"hl-operator\">*</span>Compaction = read.parent(Compaction);</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">const</span> block = read.block;</span>\n<span class=\"line\">    compaction.pool.?.reads.release(read);</span>\n<span class=\"line\"></span>\n<span class=\"line\">    assert(block.stage <span class=\"hl-operator\">==</span> .read_value_block);</span>\n<span class=\"line\">    stdx.copy_disjoint(.exact, <span class=\"hl-type\">u8</span>, block.ptr, value_block);</span>\n<span class=\"line\">    block.stage = .read_value_block_done;</span>\n<span class=\"line\">    compaction.counters.in <span class=\"hl-operator\">+=</span></span>\n<span class=\"line\">        Table.value_block_values_used(block.ptr).len;</span>\n<span class=\"line\">    compaction.compaction_dispatch();</span>\n<span class=\"line\">}</span></code></pre>\n\n</figure>\n<p>This is the code\n(<a href=\"https://github.com/tigerbeetle/tigerbeetle/blob/0.16.63/src/lsm/compaction.zig#L1857-L1870\">source</a>)\nthat runs when a disk read finishes, and it mutates <code>*Compaction</code> — shared state across all\noutstanding IO. It’s imperative that no other IO completion mutates compaction concurrently,\nespecially inside that <code>compaction_dispatch</code>\n<a href=\"https://github.com/tigerbeetle/tigerbeetle/blob/0.16.63/src/lsm/compaction.zig#L1015-L1269\">monster of a function</a>.</p>\n<p>Applying “make exclusion explicit” rule to the code would mean that the entire <code>Compaction</code> needs to\nbe wrapped in a mutex, and every callback needs to start with lock/unlock pair. And there’s much\nmore to TigerBeetle than just compaction! While <em>some</em> pairs of callbacks probably can execute\nconcurrently relatively to each other, this changes over time. For example, once we start\noverlapping compaction and execution, those will be using our GridCache (buffer manager) at the same\ntime. So explicit locking probably gravitates towards having just a single global lock around the\nentire state, which is acquired for the duration of any callback. At which point, it makes sense to\npush lock acquisition up to the event loop, and we are back to the implicit locking API!</p>\n<section id=\"Observations\">\n\n<h2><a href=\"https://matklad.github.io/2025/11/04/on-async-mutexes.html#Observations\">Observations</a></h2>\n<p>This seems to be another case of\n<a href=\"https://matklad.github.io/2021/04/26/concurrent-expression-problem.html\">two paradigms for structuring concurrent programs</a>.\nThe async/await discussion usually presupposes CSP programming style, where you define a set of\nconcurrent threads of execution, and the threads are mostly independent, sharing a little of data.\nTigerBeetle is written in a state machine/actor style, where the focal point is the large amount of\nshared state, which is evolving in discrete steps in reaction to IO events (there’s only one “actor”\nin TigerBeetle). Additionally, TigerBeetle uses manual callbacks instead of async/await syntax, so\ninserting an <code>.await</code> in the middle of critical section doesn’t really happen. Any new concurrency\nrequires introducing an explicit named continuation function, and each continuation (callback)\ngenerally starts with a bunch of assertions to pin down the current state and make sure that the\nground hasn’t shifted too far since the IO was originally scheduled. Or, as is the case with\n<code>compaction_dispatch</code>, sometimes the callback doesn’t assume anything at all about the state of the\nworld and instead carries out an exhaustive case analysis from scratch.</p>\n</section>"
            ],
            "link": "https://matklad.github.io/2025/11/04/on-async-mutexes.html",
            "publishedAt": "2025-11-04",
            "source": "Alex Kladov",
            "summary": "<header> <h1>On Async Mutexes</h1> <time class=\"meta\" datetime=\"2025-11-04\">Nov 4, 2025</time> </header> <p>A short note on contradiction or confusion in my language design beliefs I noticed today.</p> <p>One of the touted benefits of concurrent programming multiplexed over a single thread is that mutexes become unnecessary. With only one function executing at any given moment in time data races are impossible.</p> <p>The standard counter to this argument is that mutual exclusion is a property of the logic itself, not of the runtime. If a certain snippet of code must be executed atomically with respect to everything else that is concurrent, then it must be annotated as such in the source code. You can still introduce logical races by accidentally adding an <code>.await</code> in the middle of the code that should be atomic. And, while programming, you are adding new <code>.await</code>s all the time!</p> <p>This argument makes sense to me, as well its as logical conclusion. Given that you want to annotate atomic segments of code anyway, it makes sense to go all the way to Kotlin-style explicit async implicit await.</p> <p>The contradiction I realized today is that for the past few years I’ve been working on a system built around implicit exclusion provided",
            "title": "On Async Mutexes"
        },
        {
            "content": [
                "<p>I am of the opinion that when you start a new role, not a new job, a new role that you have not done before, it requires a minimum of three years to become good or competent at that role.</p>\n<p>This window of acclimation grows with the complexity of the role. I&#8217;d suggest that while you&#8217;ll be a good manager in around three years, it&#8217;s going to take more like five years to become a competent Director.<sup id=\"fnref-5387-1\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5387-1\" title=\"Read footnote.\">1</a></sup></p>\n<p>I&#8217;m fond of reducing very complex topics down to a single thought. My primary rule for becoming a good manager is &#8220;Delegate until it hurts.&#8221;.  It&#8217;s a counterintuitive strategy of giving the task of work you love to those on your team. It&#8217;s not about letting go; it&#8217;s about building scale into your team by building those you work with into you. Except it&#8217;s them. Read that again. I&#8217;m changing your professional life right now.</p>\n<p>A Director or Vice-President is an entirely different role. Having mastered delegation skills by the time you reach here, or you&#8217;re at a start-up where they are giving the VP title to anyone, in which case you have an entirely different set of issues, which starts with the question, &#8220;Are you a good manager?&#8221; Big question. Different article.</p>\n<p>I wrote <a href=\"https://randsinrepose.com/archives/act-last-read-the-room-and-taste-the-soup/\">this piece</a> towards the end of my time at Slack as the Vice-President of Engineering. I was an OK senior leader after doing the gig for five years. I said OK, I didn&#8217;t say great. I suspect great remains years off.</p>\n<p>Acting last to let others be heard, reading the room to understand the essential sub-currents of a situation, and thoughtfully asking informed questions to get the best sense of the soup sitting in front of you. I like these three habits, three tactics, but while they are good actions, they don&#8217;t have the poetic weight of &#8220;Delegate until it hurts.&#8221;</p>\n<p>Are you a good Director? Vice-President? I don&#8217;t know, but I have recently figured out my boiled-down pithy advice for the role: &#8220;Become the Consequence.&#8221;</p>\n<h2>A Lack of Experiential Reference Points</h2>\n<p>Back at the start-up, we were accumulating quality debt. I&#8217;d successfully convinced engineering, quality, and customer service to use a single source of truth for issue reporting. Still, now that everyone was filing issues in one spot, no one was fixing them.</p>\n<p>Everyone was swamped. It was a start-up. Little had been defined in terms of battle-tested process, so everyone was helpfully attempting to do everything. It worked when we were 50, so why wouldn&#8217;t it work at 500?</p>\n<p>You have a gut feeling in your head about why it&#8217;s hard. More people, more decisions, more tasks, more differing motivations. Your mental model isn&#8217;t remotely close to why this is hard. It&#8217;s akin to trying to visualize the difference between one million and one billion. Yes, one is bigger than the other, but in your head… they&#8217;re kind&#8217;a the same? At a distance? They aren&#8217;t. A billion is one thousand times more than a million. We lack experiential reference points for both numbers because we&#8217;ve never seen one million or one billion anything in one place. You can&#8217;t see the new, rapidly evolving, mind-boggling complexity; you just see stuff starting to break.</p>\n<p>Back to my quality issue. How do we get a larger group of engaged humans to change their daily process to care about the quality of the product? Everyone nodded and agreed, fixing bugs was a swell idea when we successfully moved to a single tool for issue tracking, so why is the pile just growing weekly?</p>\n<p>The issue: the number of aspects of change required to make 500 humans care about quality (or anything) is unfathomable. I can tell you what a handful of people need to prioritize, but I can&#8217;t predict every single change that needs to occur. No one can. It&#8217;s a distributed process across dozens of leaders who must imagine what they need to change to support this strategy, vet it with their team, update their strategy, and then deploy. And that is just one team trying for the first time. There are twelve teams with different leaders and micro-cultures, and what they need to deploy is slightly different from the first team.</p>\n<p>Welcome to Senior Leadership! You made it! There&#8217;s no delegating this task, but it&#8217;s not a task. It&#8217;s a strategy, and you don&#8217;t delegate strategy; you explain it loudly, repeatedly, and then you become The Consequence.</p>\n<h2>Ominous, Right?</h2>\n<p>Becoming the Consequence. Feels like impending doom? Heavy. This is why I like this colorful phrase. It makes you feel something, which means you&#8217;ll remember it.</p>\n<p>Becoming the Consequence could be read as a threat, but this is not the approach or tone I&#8217;d recommend. My version of becoming the Consequence reads:</p>\n<ul>\n<li>Hi, we, this large group of humans, have a challenge ahead of us.</li>\n<li>We, this company, have values and goals, and this challenge is not aligned with our values and goals.</li>\n<li>I, the leader of this group, believe that if we don&#8217;t address this challenge, the following undesirable outcomes will occur. Here is the data, graphs, and anecdotes/experiences that prove this belief.</li>\n<li>Addressing this challenge will require a fundamental shift in how we work.</li>\n<li>I am asking the team to do X; if we don&#8217;t, I&#8217;ll do Y.</li>\n</ul>\n<p>You will note that I did not say a thing regarding achieving this goal. This is because I do not currently know. All I know is Y, and Y is the Consequence. That&#8217;s me.</p>\n<p>Too abstract, yeah, yeah, I get it. Let&#8217;s go back to the quality issue.</p>\n<ul>\n<li>Hi, we have an emerging issue regarding quality. The quality of our service is measurably decreasing month over month. See this graph if you don&#8217;t believe me.</li>\n<li>Our customers&#8217; impression of our quality is our reputation. They count on us to do their work, and if they can&#8217;t do their work, we&#8217;re not doing our job.</li>\n<li>If we don&#8217;t get a handle on quality, we&#8217;re going to see a decrease in revenue per customer, and a lack of growth in that key metric is a long-term threat to our business. Yes, we are a start-up and enjoy focusing on the bright and shiny parts of delivering new features, but the features we shipped got us to where we are today, and they are getting crufty and unreliable. </li>\n<li>The team should spend 25% of their time each month focused not on new features, but on the quality of current features. I&#8217;m going to review each team&#8217;s proposal for doing this work at my staff meeting in two weeks.</li>\n</ul>\n<p>Great! Did I fix it?</p>\n<p>Not even close. You will note, again, I didn&#8217;t say how we were going to do this. I set a goal, not a strategy.</p>\n<p>The first Consequence was &#8220;bring your strategy to staff and we&#8217;ll review it.&#8221;  Six directors brought six different proposals. My recollection of the impressions of these six proposals:</p>\n<ul>\n<li>One was credible, actionable. </li>\n<li>Three seemed not to understand what I meant by improving quality.</li>\n<li>Two were made up on the spot because they forgot to do the assignment.</li>\n<li>One declined to participate with the justification that the team was too busy.</li>\n</ul>\n<p>We talked about the first four proposals. We discussed what I liked about the first one, debated my definition of quality for the next three, and borrowed ideas from the first proposal. We ran out of time for the last two, but the next Consequence of their lack of engagement was the first topic of conversation in our next 1:1.</p>\n<p>Was I frustrated about the non-compliance of the last three? A bit, but I also remained curious. Did I not explain the challenge? Did I not justify its existence? Did I not structure my argument sensibly? Did I not convey urgency? The assumption that an argument that makes sense in your head will make sense when spoken aloud is bad because you have all those delightful tidbits of unspoken justification, motivation, and backstory tucked away. Chances are, I forgot to share part of that initially, hence the various forms of non-compliance.</p>\n<p>Did I fix it? Still, no. Not even close.</p>\n<p>The non-compliant directors heard the message loud and clear and brought their team-vetted proposals to the next meeting. From the seven different proposals, we found common themes, we found new questions, and we discovered not everyone was aligned with the core quality thesis, so we litigated that thesis.</p>\n<p>See, I did not know how to fix the quality problem at the start-up. I could tell you the various successes and failures I had at other companies, but the idea that precisely the same approach would work at this start-up is flawed. This unique combination of humans, working on this particular project, on this particular date, requires a unique approach in framing the problem, designing a strategy, and deploying that strategy.</p>\n<p>Three meetings on this topic now, and the seven directors are mostly aligned on how they are going to spend 25% time. I could tell that at least two of the directors were relieved; the vibes were &#8220;Whew. Done with that. Now we can get back to the real work.&#8221;</p>\n<p>At this point of the process, you can lump your leaders into one of three buckets: Believers, Wait-and-See-ers, and Non-Believers.</p>\n<ul>\n<li>Believers: I am on board with this plan and will do everything I can to support.</li>\n<li>Wait-and-See-ers: I understand the plan and will do what is reasonable to support, but I&#8217;m not going to drive — let the Believers drive this.</li>\n<li>Non-Believers: I understand what my manager is asking, but I am not on board. This is yet another leadership boondoggle asking us to do more with less. I am not going to say this, but my lack of forward progress will demonstrate this lack of belief. </li>\n</ul>\n<p>Their bucket allegiance might already be evident to you, or it might show up later, but never have you made Believers out of the entire team early on when it comes to significant shifts in strategy. Humans fear change. They like their things… just so. As long as I&#8217;ve got close to 50% in the Believer bucket, I am going to charge forward.</p>\n<h2>The Consequence</h2>\n<p>From the litigation process, I discovered how I can become the Consequence. In the case of the start-up, it was a complex JIRA query that demonstrated how many issues we had in one of three critical states. The size of each of these sets of JIRAs demonstrated how much work we&#8217;d done in terms of understanding our backlog and sizing the remaining work.</p>\n<p>The Consequence was this: each week, on a Wednesday, there is a meeting with me. Each team had a goal, which was a total of X number of issues in the bucket. These numbers were set <strong>by the team</strong>. If the team did not hit the number they set, the director and manager review the buckets with me. If you hit your numbers, no meeting for anyone except the Director.</p>\n<p>As a new manager, I viewed this type of meeting as punishment: you failed to accomplish the task, so here&#8217;s your punishment: a meeting with senior leadership where we review a list of JIRAs. Feels like micromanagement, right?</p>\n<p>Yeah, it does.</p>\n<p>Let&#8217;s refresh ourselves on why this meeting exists:</p>\n<ol>\n<li>We have a fundamental and well-communicated problem with how we are working.</li>\n<li>We, the leaders, have (mostly) agreed this is a problem and have proposed a strategy.</li>\n<li>Our strategy has measurable goals.</li>\n<li>Given where we are in the process, our measures should have accomplished X by this date.</li>\n<li>Let&#8217;s make sure that&#8217;s happening. Together.</li>\n</ol>\n<p>A manager or individual who has a problem with my meeting has an issue somewhere in this list of reasons. They might be fine with the measures, but disagree with the strategy, or even if there is a fundamental problem. There might be a fundamental flaw in the strategy. There literally might not be enough time in the week to complete the work, given other priorities.</p>\n<p>Doesn&#8217;t matter. Every week. This meeting happens. <a href=\"https://randsinrepose.com/archives/the-metronome/\">Tick Tock</a></p>\n<p>For those of you still with me who are grinding your teeth because of past micromanagement scenarios that feel exactly like this. I feel you. Those are bad managers. Those are micro-managers. Those are managers who have their specific process stuck in their head, and they believe that changing their process is an admission that they are wrong, which means they will be trusted less, and everyone will discover that they are just making it up like everyone else.</p>\n<p>A micromanager is a manager who is unwilling to listen to the collective wisdom of their team. It&#8217;s usually not because they don&#8217;t care or aren&#8217;t smart enough; it&#8217;s because somewhere along the line, someone taught them that demonstrating weakness was a character flaw.</p>\n<p>First, listening to your team is required. Second, understanding what they are saying is essential. Third, when you change your strategy because of their feedback, you need to acknowledge it loudly.</p>\n<p>Micromanagers might listen, but they don&#8217;t understand because they don&#8217;t change strategy. There are even worse variants who listen, understand, and change strategy, but claim it was their idea in the first place. It is your historical experience with these failing, flailing, and flawed managers that makes you hesitant to be the Consequence.</p>\n<h2>I&#8217;m the Consequence</h2>\n<p><strong>Fact</strong>: You learn more from those who disagree with you.</p>\n<p><strong>Fact</strong>: The skills you develop listening to those you disagree with are more important than the ones developed by agreeing with them.</p>\n<p><strong>Fact</strong>: The consequence of being a senior leader is that you will not always have a concrete plan. You have a direction informed by goals and values, but your plan is built with your team. When they see you do this, you strengthen the team.</p>\n<p>Becoming the Consequence does not mean you become a fixed point in time and space; it means that you demonstrate to the team that you understand what is essential to the health of the team, product, or process. It means you consistently and visibly reinforce this understanding. It means that when they tell you what&#8217;s wrong, you listen hard for the wisdom. It means when you find the wisdom, you adapt your plans. You do this over and over until what was a change in strategy becomes <i>this is how we do this</i>.</p>\n<p>A year and a half. It took a year and a half of quality meetings for us to make our quality strategy a habit. The meeting changed drastically over the course of the months. I remember the last meeting vividly. It was the third meeting, just Directors, where we didn&#8217;t do anything except look at charts and say, &#8220;Yeah, well, the team is on it&#8221; over and over again. The work was being done habitually by the team because we all eventually agreed on how much we consistently invested in quality.</p>\n<p>I looked around the table, nodded, and said, &#8220;Okay, we&#8217;re done here.&#8221;</p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-5387-1\">\nI&#8217;m 2/3rds done with a book on this topic. Stay tuned.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5387-1\" title=\"Return to main content.\">&#8617;</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://randsinrepose.com/archives/become-the-consequence/",
            "publishedAt": "2025-11-04",
            "source": "Rands in Repose",
            "summary": "I am of the opinion that when you start a new role, not a new job, a new role that you have not done before, it requires a minimum of three years to become good or competent at that role. This window of acclimation grows with the complexity of the role. I&#8217;d suggest that while&#8230; <a class=\"excerpt-more\" href=\"https://randsinrepose.com/archives/become-the-consequence/\">more</a>",
            "title": "Become the Consequence"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Nov/4/datasette-10a20/#atom-entries",
            "publishedAt": "2025-11-04",
            "source": "Simon Willison",
            "summary": "<p><a href=\"https://docs.datasette.io/en/latest/changelog.html#a20-2025-11-03\">Datasette 1.0a20 is out</a> with the biggest breaking API change on the road to 1.0, improving how Datasette's permissions system works by migrating permission logic to SQL running in SQLite. This release involved <a href=\"https://github.com/simonw/datasette/compare/1.0a19...1.0a20\">163 commits</a>, with 10,660 additions and 1,825 deletions, most of which was written with the help of Claude Code.</p> <ul> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#understanding-the-permissions-system\">Understanding the permissions system</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#permissions-systems-need-to-be-able-to-efficiently-list-things\">Permissions systems need to be able to efficiently list things</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#the-new-permission-resources-sql-plugin-hook\">The new permission_resources_sql() plugin hook</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#hierarchies-plugins-vetoes-and-restrictions\">Hierarchies, plugins, vetoes, and restrictions</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#new-debugging-tools\">New debugging tools</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#the-missing-feature-list-actors-who-can-act-on-this-resource\">The missing feature: list actors who can act on this resource</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#upgrading-plugins-for-datasette-1-0a20\">Upgrading plugins for Datasette 1.0a20</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#using-claude-code-to-implement-this-change\">Using Claude Code to implement this change</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#starting-with-a-proof-of-concept\">Starting with a proof-of-concept</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#miscellaneous-tips-i-picked-up-along-the-way\">Miscellaneous tips I picked up along the way</a></li> <li><a href=\"https://simonwillison.net/2025/Nov/4/datasette-10a20/#what-s-next-\">What's next?</a></li> </ul> <h4 id=\"understanding-the-permissions-system\">Understanding the permissions system</h4> <p>Datasette's <a href=\"https://docs.datasette.io/en/latest/authentication.html\">permissions system</a> exists to answer the following question:</p> <blockquote> <p>Is this <strong>actor</strong> allowed to perform this <strong>action</strong>, optionally against this particular <strong>resource</strong>?</p> </blockquote> <p>An <strong>actor</strong> is usually a user, but might also be an automation operating via the Datasette API.</p> <p>An <strong>action</strong> is a thing they need to do - things like view-table, execute-sql, insert-row.</p> <p>A <strong>resource</strong> is the subject of the",
            "title": "A new SQL-powered permissions system in Datasette 1.0a20"
        },
        {
            "content": [
                "<h4 class=\"wp-block-heading\">New Things Have Come To Light</h4>\n<a href=\"https://www.theinformation.com/articles/openai-founder-discusses-anthropic-merger-talks-internal-beefs-deposition?utm_campaign=Editorial&amp;utm_content=Article&amp;utm_medium=organic_social&amp;utm_source=bluesky%2Cfacebook%2Clinkedin%2Cthreads%2Ctwitter\">The Information offers us new information about what happened</a> when the board if AI unsuccessfully tried to fire Sam Altman, which I call <a href=\"https://thezvi.substack.com/p/openai-the-battle-of-the-board\"><strong>The Battle of the Board</strong></a>.\n<blockquote>The Information: OpenAI co-founder Ilya Sutskever shared new details on the internal conflicts that led to Sam Altman’s initial firing, including a memo alleging Altman exhibited a “consistent pattern of lying.”\n\n<a href=\"https://x.com/livgorton/status/1984827467232866322\">Liv</a>: Lots of people dismiss Sam’s behaviour as typical for a CEO but I really think we can and should demand better of the guy who thinks he’s building the machine god.\n\n<a href=\"https://x.com/distributionat/status/1984924017628000296\">Toucan</a>: From Ilya’s deposition—\n\n• Ilya plotted over a year with Mira to remove Sam\n<div> <span id=\"more-24832\"></span> </div>\n• Dario wanted Greg fired and himself in charge of all research\n\n• Mira told Ilya that Sam pitted her against Daniela\n\n• Ilya wrote a 52 page memo to get Sam fired and a separate doc on Greg</blockquote>\n\n<h4 class=\"wp-block-heading\">This Really Was Primarily A Lying And Management Problem</h4>\n\n<blockquote><a href=\"https://x.com/daniel_271828/status/1985094639863710200\">Daniel Eth</a>: A lot of the OpenAI boardroom drama has been blamed on EA &#8211; but looks like it really was overwhelmingly an Ilya &amp; Mira led effort, with EA playing a minor role and somehow winding up as a scapegoat\n\n<a href=\"https://x.com/peterwildeford/status/1985101719231996242\">Peter Wildeford</a>: It seems troubling that the man doing trillions of dollars of infrastructure spending in order to transform the entire fabric of society also has a huge lying problem.\n\nI think this is like on an extra bad level even for typical leaders.\n\nCharles: I haven’t seen many people jumping to defend Altman with claims like “he doesn’t have a huge lying problem” either, it’s mostly claims that map to “I don’t care, he gets shit done”.\n\n<a href=\"https://x.com/jachiam0/status/1985466138445431046\">Joshua Achiam</a> (OpenAI Head of Mission Alignment): There is plenty to critique about Sam in the same way there is plenty to critique about any significant leader. But it kills me to see what kind of tawdry, extreme stuff people are willing to believe about him.\n\nWhen we look back years from now with the benefit of hindsight, it’s my honest belief that the record will show he was no more flawed than anyone, more virtuous than most, and did his best to make the world a better place. I also expect the record will show that he succeeded.</blockquote>\nJoshua Achiam spoke out recently about some of OpenAI’s unethical legal tactics, and this is about as full throated a defense as I’ve seen of Altman’s behaviors. As with anyone important, no matter how awful they are, some people are going to believe they’re even worse, or worse in particular false ways. And in many ways, as I have consistently said, I find Altman to be well ‘above replacement’ as someone to run OpenAI, and I would not want to swap him out for a generic replacement executive.\n\nI do still think he has a rather severe (even for his peer group) lying and manipulation problem, and a power problem, and that ‘no more flawed than anyone’ or ‘more virtuous than most’ seems clearly inaccurate, as is reinforced by the testimony here.\n\nAs I said at the time, The Battle of the Board, as in the attempt to fire Altman, was mostly not a fight over AI safety and not motivated by safety. It was about ordinary business issues.\n\n\n<h4 class=\"wp-block-heading\">Ilya Tells Us How It Went Down And Why He Tried To Do It</h4>\nIlya had been looking to replace Altman for a year, the Witness here is Ilya, <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.433688/gov.uscourts.cand.433688.340.1.pdf\">here’s the transcript</a> link. If you are interested in the details, consider reading the whole thing.\n\nHere are some select quotes:\n<blockquote>Q. So for — for how long had you been planning to propose removal of Sam?\nA. For some time. I mean, “planning” is the wrong word because it didn’t seem feasible.\nQ. It didn’t seem feasible?\nA. It was not feasible prior; so I was not planning.\nQ. How — how long had you been considering it?\nA. At least a year.</blockquote>\nThe other departures from the board, Ilya reports, made the math work where it didn’t before. Until then, the majority of the board had been friendly with Altman, which basically made moving against him a non-starter. So that’s why he tried when he did. Note that all the independent directors agreed on the firing.\n<blockquote>…\n\n[As Read] Sam exhibits a consistent pattern of lying, undermining his execs, and pitting his execs against one another. That was clearly your view at the time?\n\nA: Correct.\n\n…\n\nQ. This is the section entitled “Pitting People Against Each Other.”\nA. Yes.\nQ. And turning on the next page, you see an example that’s offered is “Daniela versus Mira”?\nA. Yes.\nQ. Is “Daniela” Daniela Amodei?\nA. Yes.\nQ. Who told you that Sam pitted Daniela against Mira?\nA. Mira.\n\n…\n\nQ. In the section below that where it says “Dario versus Greg, Ilya”—\nA. Yes.\nQ. — you see that?\nA. Yes.\nQ. The complaint — it says — you say here that:\n[As Read] Sam was not taking a firm position in respect of Dario wanting to run all of research at OpenAI to have Greg fired — and to have Greg fired? Do you see that?\nA. I do see that.\nQ. And “Dario” is Dario Amodei?\nA. Yes.\nQ. Why were you faulting Sam for Dario’s efforts?\nTHE WITNESS: So my recollection of what I wrote here is that I was faulting Sam for not accepting or rejecting Dario’s conditions.</blockquote>\nAnd for fun:\n<blockquote>ATTORNEY MOLO: That’s all you’ve done the entire deposition is object.\n\nATTORNEY AGNOLUCCI: That’s my job. So &#8212;\n\nATTORNEY MOLO: Actually, it’s not.\n\n…\n\nATTORNEY MOLO: Yeah, don’t raise your voice.\n\nATTORNEY AGNOLUCCI: I’m tired of being 24 told that I’m talking too much.\n\nATTORNEY MOLO: Well, you are.</blockquote>\n\n<h4 class=\"wp-block-heading\">If You Come At The King</h4>\nBest not miss.\n\nWhat did Sutskever and Murati think firing Altman meant? Vibes, paper, essays?\n\nWhat happened here was, it seems, that Ilya Sutskever and Mira Murati came at the king for very good reasons one might come at a king, combined with Altman’s attempt to use lying to oust Helen Toner from the board.\n\nBut those involved (including the rest of the board) didn’t execute well because of various fears, during the fight both Murati and Sutskever refused to explain to the employees or world what they were upset about, lost their nerve and folded. The combination of that plus the board’s refusal to explain, and especially Murati’s refusal to back them up after setting things in motion, was fatal.\n\nDo they regret coming at the king and missing? Yes they do, and did within a few days. That doesn’t mean they’d be regretting it if it had worked. And I continue to think if they’d been forthcoming about the reasons from the start, and otherwise executed well, it would have worked, and Mira Murati could have been OpenAI CEO.\n\nNow, of course, it’s too late, and it would take a ten times worse set of behaviors for Altman to get into this level of trouble again.\n\n\n<h4 class=\"wp-block-heading\">Enter The Scapegoats</h4>\nIt really was a brilliant response, to scapegoat Effective Altruism and the broader AI safety movement as the driving force and motivation for the change, thus with this one move burying Altman’s various misdeeds, remaking the board, purging the company and justifying the potentially greatest theft in human history while removing anyone who would oppose the path of commercialization. Well played.\n\nThis scapegoating continues to this day. For the record, <a href=\"https://x.com/hlntnr/status/1985535076352901365\">Helen Toner (I believe highly credibly) clarifies that Ilya’s version of the events related to the extremely brief consideration of a potential merger was untrue</a>, and unrelated to the rest of events.\n\n\n<h4 class=\"wp-block-heading\">And In Summary</h4>\nThe below is terrible writing, presumably from an AI, but yeah this sums it all up:\n<blockquote>Pogino (presumably an AI generated Twitter reply): “This reframes the OpenAI power struggle as a clash of personalities and philosophies, not a proxy war for EA ideology.\n\nIlya’s scientific purism and Mira’s governance assertiveness collided with Altman’s entrepreneurial pragmatism — a tension intrinsic to mission-driven startups scaling into institutions. EA may have provided the vocabulary, but the conflict’s grammar was human: trust, ambition, and control.”</blockquote>"
            ],
            "link": "https://thezvi.wordpress.com/2025/11/04/openai-the-battle-of-the-board-ilyas-testimony/",
            "publishedAt": "2025-11-04",
            "source": "TheZvi",
            "summary": "New Things Have Come To Light The Information offers us new information about what happened when the board if AI unsuccessfully tried to fire Sam Altman, which I call The Battle of the Board. The Information: OpenAI co-founder Ilya Sutskever &#8230; <a href=\"https://thezvi.wordpress.com/2025/11/04/openai-the-battle-of-the-board-ilyas-testimony/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "OpenAI: The Battle of the Board: Ilya’s Testimony"
        },
        {
            "content": [
                ""
            ],
            "link": "https://www.tigrisdata.com/blog/bucket-forking-deep-dive/",
            "publishedAt": "2025-11-04",
            "source": "Xe Iaso",
            "summary": "",
            "title": "Immutable by Design: The Deep Tech Behind Tigris Bucket Forking"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-11-04"
}