{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>It takes ten years for the culture of a great company to fall apart once the CEO seat is given to someone without an engineering or product background. That's been the story of Boeing, Intel, and now Apple. Legendary American companies that all got lost when a bean counter, marketing man, or logistics hand took over.<br /><br /></div><div>Boeing's troubles started when they were taken over by McDonnell Douglas in 1997, but really accelerated after 2005 when they installed their first CEO with no aerospace background. The result, after ten years of cost-cutting and outsourcing, was the 737 MAX MCAS tragedies, and an organization gutted of ambition and engineering pride.<br /><br /></div><div>Intel did the same thing, and almost at the same time. In 2005, they too installed their first CEO without an engineering background. Ten years later, they were stumbling with delayed nodes, stalled progress, and no answers on mobile. Now the entire business is teetering.<br /><br /></div><div>Finally, Apple. Steve Jobs handed the reins to Tim Cook in 2011, but such was the strength of the product pipeline and culture that Jobs left behind, that it initially looked like Cook could break the spell. Show that it was possible for a logistics man to steer one of the great ships of American ingenuity and tech supremacy.&nbsp;<br /><br /></div><div>But now the ten-year curse is hitting Apple with an eerily familiar thud. They wasted a decade chasing a self-driving dream without direction, and ended up with <a href=\"https://world.hey.com/dhh/apple-has-no-one-left-who-can-say-no-1a542329\">the worst possible car interface</a> to show for it. They completely <a href=\"https://world.hey.com/dhh/apple-does-ai-as-microsoft-did-mobile-df2c98ca\">missed the boat on AI</a>, and embarrassed themselves with Genmoji and <a href=\"https://x.com/iupdate/status/1898102090846925068\">vaporware ads</a>. And the Vision pro has been an expensive tech demo that <a href=\"https://www.reddit.com/r/apple/comments/1fr3syw/apple_vision_pro_owners_how_many_of_you_still/\">nobody actually wanted to wear</a> three months after they bought it.&nbsp;<br /><br />The profits still gush from glories past, and the tollbooth operation on the App Store, but the soul has left the machine.&nbsp;<br /><br /></div><div>While these three stories are different, they're drawn from the same archetype: Great companies need bold, hands-on leaders who live and breathe the stuff they make or they'll eventually hollow out.&nbsp;<br /><br /></div><div>It's tempting for boards of public companies to think that all care and competence around product can be delegated down the org chart. That someone who can hit the numbers is all you need at the top. But it's not.<br /><br /></div><div>You need an Andy Grove, Phil Condit, or Scott Forstall. You need someone so professionally invested in the work and the culture that they'll refuse to let the search for surface-level efficiencies drain the foundation of its strength. You need an engineer or a product person as CEO.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/the-great-falls-of-boeing-intel-and-apple-4c18ca39",
            "publishedAt": "2025-09-22",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>It takes ten years for the culture of a great company to fall apart once the CEO seat is given to someone without an engineering or product background. That's been the story of Boeing, Intel, and now Apple. Legendary American companies that all got lost when a bean counter, marketing man, or logistics hand took over.<br /><br /></div><div>Boeing's troubles started when they were taken over by McDonnell Douglas in 1997, but really accelerated after 2005 when they installed their first CEO with no aerospace background. The result, after ten years of cost-cutting and outsourcing, was the 737 MAX MCAS tragedies, and an organization gutted of ambition and engineering pride.<br /><br /></div><div>Intel did the same thing, and almost at the same time. In 2005, they too installed their first CEO without an engineering background. Ten years later, they were stumbling with delayed nodes, stalled progress, and no answers on mobile. Now the entire business is teetering.<br /><br /></div><div>Finally, Apple. Steve Jobs handed the reins to Tim Cook in 2011, but such was the strength of the product pipeline and culture that Jobs left behind, that it initially looked like Cook could break the spell. Show that it was possible",
            "title": "The great falls of Boeing, Intel, and Apple"
        },
        {
            "content": [
                "<p>Hello and welcome! The lab is positively buzzing with energy this month. First, lab director Peter van Hardenberg will announce a major new initiative — this one has been a long time coming. Next, you’ll hear about two researchers who have recently joined our staff. Finally, we’ve got a collection of lab notes about Programmable Ink, to scratch your hardcore engineering itch. So without further ado, here’s Peter!</p>\n<h2 id=\"ink-and-switch-supporting-the-aria-safeguarded-ai-programme\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#ink-and-switch-supporting-the-aria-safeguarded-ai-programme\">Ink &amp; Switch supporting the ARIA Safeguarded AI Programme</a></h2>\n<p>I’m pleased to share that Ink &amp; Switch has joined the <a href=\"https://www.aria.org.uk/opportunity-spaces/mathematics-for-safe-ai/safeguarded-ai/\">ARIA Safeguarded AI Programme</a>. It’s an ambitious research programme dedicated to making it possible to employ AI systems in large-scale safety critical applications, such as optimizing national power grid allocation or developing biomedical supply chains. The programme is funded by the UK Government’s Advanced Research + Innovation Agency.</p>\n<p>This might seem far afield from our usual area of work, primarily focused on “tools for thought”, but in fact that’s precisely what we’re offering to the programme. We’ll be working with our fellow Creators in the programme to develop the interfaces that help people and AI agents collaborate on building accurate models of interesting real-world systems.</p>\n<p>While it’s still early days for our collaboration, and we don’t want to presume what the best approach for this project will be, our work on <a href=\"https://www.inkandswitch.com/project/patchwork/\">Patchwork</a> is what brought us into the programme, and is a starting point for further exploration.</p>\n<p>The SGAI programme is significant, including too many teams to name across many disciplines, but we are joined in our little sub-group by our friends at <a href=\"https://hash.ai\">HASH</a> (who some of you might recognize from the <a href=\"https://blockprotocol.org\">Block Protocol</a>), the <a href=\"https://www.notion.so/Future-of-Programming-Lab-241d162461a04064ae1fd9ae32bf4cb1\">Future of Programming lab</a> building <a href=\"https://hazel.org\">Hazel</a> under Cyrus Omar’s direction at the University of Michigan, and the <a href=\"https://topos.institute\">Topos Institute</a> who are working on <a href=\"https://github.com/ToposInstitute/CatColab\">CatColab</a>.</p>\n<figure>\n<img src=\"https://www.inkandswitch.com/patchwork_catcolab.png\" />\n<figcaption>\n<p>A sneak peek at CatColab running inside Patchwork.</p>\n</figcaption>\n</figure>\n<p>Throughout the next two-and-a-half years, we’ll be spending lots of time in the UK working closely with the research group and with the many people and institutions who might need these tools. We held our first UK-based meetup recently at the <a href=\"https://tldraw.dev\">tldraw</a> offices (thanks to Lu and Steve for hosting us), which featured demos of Patchwork, Hazel, Tonk, <a href=\"https://dxos.org\">DXOS</a>, and Cursor for Canvas.</p>\n<p>I’m excited and honored to be a part of an ambitious project like this, and I’m grateful to David Dalrymple and the ARIA team for bringing us on board. We are just one small part of a huge team, but we are delighted at the chance to continue to develop tools for thought in a new context of serious use.</p>\n<p>As always, if your organization could use our help, you can always <a href=\"https://www.inkandswitch.com/connect\">reach out</a>. We’re available both informally and in partnership.</p>\n<p><em>Oh, one more thing: one of the requirements of the programme is the open-sourcing of all code participating in the project, so we’ll be releasing Patchwork in some form soon. It needs a little more time to bake in the oven before we turn you loose on it but… watch this space.</em></p>\n<h2 id=\"two-new-faces-joining-the-lab\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#two-new-faces-joining-the-lab\">Two new faces joining the lab</a></h2>\n<p>We’re pleased to welcome a pair of new researchers to our team. They’re joining, in part, to lend a hand with our work on the ARIA Safeguarded AI Programme, each bringing a particular area of expertise.</p>\n<p>You may remember <a href=\"https://github.com/jtfmumm\">John Mumm</a> (he/him) from his work on <a href=\"https://www.inkandswitch.com/keyhive/notebook/\">Keyhive</a>. After a brief stint away, he’s rejoined the lab to help implement a version of Keyhive suitable for Patchwork, and will also be contributing to Automerge. John also has a knack for cooking up surprising little local-first demos, so don’t be surprised if some of those make an appearance in future Dispatches.</p>\n<p>We also have <a href=\"https://chee.party\">chee rabbits</a> (they/them or just chee), who joined just weeks ago and has already rebuilt the core of Patchwork in a much more modular form. While Patchwork started as a research prototype, we’re now using it for much of our collaboration within the lab, and it’ll be up to chee to steadily increase its dependability and malleability.</p>\n<h2 id=\"exploring-ink-deformation\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#exploring-ink-deformation\">Exploring ink deformation</a></h2>\n<p>Several of our projects — <a href=\"https://www.inkandswitch.com/keyhive/notebook/\">Keyhive</a> and <a href=\"https://www.inkandswitch.com/patchwork/notebook/\">Patchwork</a>, for instance — have “notebooks” chronicling their evolution. For Programmable Ink, however, we’re doing something different.</p>\n<p>The ink work is fluid, and has been advancing in surges over the life of the lab. In that time we’ve amassed a sizable collection of lab notes internally, but they aren’t organized in any sort of coherent sequence or structure. Lately, we’ve been collecting some of these existing notes, and writing new ones, to grow a <em>wiki</em> (of a sort) tying these notes together.</p>\n<p>It’s not meant to be the sort of thing you sit down and read front-to-back, or follow along with as each new entry is added (though if you’d like to, subscribe to our <a href=\"https://www.inkandswitch.com/index.xml\">RSS feed</a>). Rather, we’ll occasionally point you to something new—a good starting point—and let you explore from there. Follow your curiosity.</p>\n<figure>\n<img src=\"https://www.inkandswitch.com/neatness_dynamism.png\" />\n<figcaption>\n<p>The search for handmade drawings imbued with computational power continues!</p>\n</figcaption>\n</figure>\n<p>This month, we’re sharing an exposition of <em>ink deformation</em>. In short, it’s our goal to imbue the ink and paper of your digital notebook with a sense of <em>material physics</em>, behaviour informed by but diverging from their real world analogs. This includes systemic behaviours like undo/redo—naturally—but also more specialized behaviour. In the case of ink, we’re looking for ways to make it bend, stretch, and mold. For instance, if you draw an arrow, you should be able to grab the arrow and point it at something else — yet it should still look like it was drawn by your hand.</p>\n<p>To that end, here is <a href=\"https://www.inkandswitch.com/ink/notes/ink-deformation-review/\">Ink Deformation — A Review</a>, and if you’d like to explore deeper, see this growing collection of <a href=\"https://www.inkandswitch.com/ink/notes/deformation/\">all our ink deformation notes</a>.</p>\n<h2 id=\"whats-another-open-tab\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#whats-another-open-tab\">What’s another open tab?</a></h2>\n<ul>\n<li>Join us <em>this Wednesday</em> for the <a href=\"https://luma.com/70fuozje\">September Automerge Community Call</a>, featuring updates about the core libraries, a couple demos, and time for Q&amp;A. These community calls are a new monthly opportunity for the Automerge community to share their projects and hear the latest news from the core team. Sign up for the <a href=\"https://luma.com/automerge\">calendar</a>, and simply RSVP if you’d like to attend.</li>\n<li>Fans of the Local-first Conf, take note of <a href=\"https://syncconf.dev\">Sync Conf</a> happening on November 12th in San Francisco, brought to you by the same organizing team (and with substantial interest overlap).</li>\n</ul>\n<p>That’s all for this month. As ever, we’d love to hear your feedback and ideas. Simply reply to this email, or use one of the many other ways to <a href=\"https://www.inkandswitch.com/connect/\">connect with us</a>. See you next time!</p>"
            ],
            "link": "https://www.inkandswitch.com/newsletter/dispatch-013/",
            "publishedAt": "2025-09-22",
            "source": "Ink & Switch",
            "summary": "Peter, our lab director, will announce a major new initiative. You’ll hear about two researchers who have recently joined our staff. Finally, we’ve got a collection of lab notes about Programmable Ink.",
            "title": "Dispatch 013: ARIA Safeguarded AI Programme, new faces, and a splattering of ink lab notes"
        },
        {
            "content": [
                "<p>An idea just comes to me. I&#8217;ve been writing for a long time, so the ideas come partially formed. Not written but formed into the beginnings of a familiar shape. It is critical in the next hour that I write this idea down somewhere accessible because it&#8217;s just an idea, and failure to capture it means it will disappear as simply as it appeared.</p>\n<p>Whether this idea becomes an actual piece is defined by the next 72 hours. If I succeed in sitting down and expanding the idea, the probability of a completed piece increases significantly. This first attempt is an hour of my time, perhaps more if the window aligns with a weekend, so call this first investment ninety minutes on average.</p>\n<p>In this session, I am taking the wisp of an idea and giving it shape. What was a three-to-five-word reminder is now five to ten paragraphs. If I&#8217;m lucky, I can see the beginning and part of the middle. If I&#8217;m really lucky, section titles are starting to show up. These section titles are similar to the initial inspiration in that they, to me, elegantly encapsulate part of the idea. If I can&#8217;t find a section title but know I&#8217;ve moved from beginning to middle, I write a dummy title, usually <strong>Something</strong>.</p>\n<h2>Something</h2>\n<p>If I make it to the middle of a piece, the publishing probability has again increased significantly. Still, as I&#8217;ve matured and relaxed about my writing, the number of abandoned articles has increased significantly. If this reads like bad news, I understand, but I&#8217;ve learned two important facts that affect this moment of writing.</p>\n<ol>\n<li>There is always more writing. Every piece doesn&#8217;t need to be finished.</li>\n<li>The remaining work to publish this on the blog is significantly more than I expected. If this piece is for a book, it is twice as much.</li>\n</ol>\n<p>In the back of my head, sitting and staring at this half-formed piece, I&#8217;m quietly asking, &#8220;Is this worth finishing?&#8221; What pushes me over is the idea remains stuck in my head. There is still something to discover, to say, that I am curious to find.</p>\n<p>I&#8217;m wildly guessing that 30% of the work is done now. 30% might be too high because what happens now is much more of a slog. I like writing. No, I love writing, but middle to end means I must continue to ignite what inspired me initially, but now it needs to make sense to you. This isn&#8217;t a journal entry; this is an artifact that I am placing into the world for judgment, so I must:</p>\n<ul>\n<li>Finishing the middle. The end of the middle is the end of the most challenging part of the writing. A good ending is a work, but it&#8217;s usually a clever and synthesized arrangement of your beginning and middle. There&#8217;s a chance I&#8217;ve already found it, but if I haven&#8217;t, I&#8217;m not worried. I&#8217;ll slap something together.</li>\n<li>First pass edit. I print out the piece, and I edited it somewhere that isn&#8217;t near a keyboard. This change of perspective is a coherency pass <em>Does this make sense?</em> Just about anything can happen during this editing. So much so, I have a well-defined system of notation that tells me exactly what I need to do the piece because my regular scribbles are often indecipherable.</li>\n<li>First pass edit changes landed. Taking my written notes, I graft them onto the piece. We&#8217;re somewhere between five and ten hours of work now. We&#8217;re somewhere between one day and three months from when I started. Pieces languish. Life gets complicated. The half-life of an idea is extended by the amount of work invested, but sometimes&#8230; it just fades.</li>\n</ul>\n<p>But not this one. This piece will be published, and I know the precise moment: I can see the entire shape of the piece in my head. It&#8217;s not a geometric shape; it&#8217;s a feeling shape where I understand the beginning, middle, and end. Chances are significant chunks of the piece are not written or edited, but if I can see the end, the publishing probability reaches 90%.</p>\n<p>I know the ending of this piece.</p>\n<p>I know it because I knew the title was the ending when the idea arrived. This has allowed me not to put a section header where the ending became obvious, which is right here, incidentally. No, I need to finish describing the amount of work because this piece, confusingly, <strong>is not about writing</strong>.</p>\n<p>With the final shape in mind, I finish the writing. Call this another two hours of work. I do a Grammarly pass (30 minutes) and a technical pass – links and images (another 10). The piece is dropped into Visual Code, where I zap gremlins, I produce the featured image, I push the piece to WordPress, do another read (30 minutes), and then hit publish.</p>\n<p>I estimate I&#8217;ve devoted ten to fifteen hours of my life to your average blog article. The question is: what makes it&#8230;</p>\n<h2>Worth it?</h2>\n<p>One compliment. Just one.</p>\n<p>When I hit publish, I broadcast to Mastodon, Threads, BlueSky, and the Rands Leadership Slack, and I&#8217;m looking for straightforward feedback on having devoted ten to fifteen hours of my life. A compliment.</p>\n<p>Now, this can not be from someone I know because while I trust these folks, they are biased, lovely, and biased. This is a thoughtful compliment from a stranger who I do not know and does not know me, and wants to say something interesting about the piece briefly. When this occurs, I release a deep breath I have held since I hit publish.</p>\n<p>Compliments work.</p>\n<p>As you climb the leadership ladder, you&#8217;ll have the idea of performance management in all its forms beaten into you. Your interpretation of what success looks like is often, &#8220;I need to give them feedback to improve effectively.&#8221; Advice, constructive advice. Sometimes critical. This is a reasonable interpretation, but half a strategy. Explaining where they need to focus is as important as clearly acknowledging when they have.</p>\n<p>But there is another compliment out there. It&#8217;s a random selfless acknowledgement. To the stranger. <em>I love those kicks.</em> At work, to the person you&#8217;ve never met, interrupting <em>This Keynote template is&#8230; stunning.</em> To the human you&#8217;ve known forever, <em>I don&#8217;t say it enough, but I am glad we are friends.</em></p>\n<p>The rule is: people want to be seen.</p>\n<p>You have no idea how much work goes into a human&#8217;s chosen passion. When they become adept at their work, the simplicity or approachability of their &#8216;product&#8217; might give you the erroneous impression that because it&#8217;s clever, approachable, or just straight up fun, the work involved was simple, obvious, or&#8230; fun.</p>\n<p>People want to be seen. Writing as an introvert, I can confirm the last thing I want is public recognition. I would prefer it if you slid a folded note under the desk where I am hiding. Make no eye contact. People are a lot of work for me. The reason I spend so much time writing it down is that I don’t want to explain it to you face-to-face.</p>\n<p>But.</p>\n<p>I am <strong>deeply</strong> interested in your folded note. Just tuck it under my foot.</p>"
            ],
            "link": "https://randsinrepose.com/archives/one-compliment/",
            "publishedAt": "2025-09-22",
            "source": "Rands in Repose",
            "summary": "An idea just comes to me. I&#8217;ve been writing for a long time, so the ideas come partially formed. Not written but formed into the beginnings of a familiar shape. It is critical in the next hour that I write this idea down somewhere accessible because it&#8217;s just an idea, and failure to capture it&#8230; <a class=\"excerpt-more\" href=\"https://randsinrepose.com/archives/one-compliment/\">more</a>",
            "title": "One Compliment"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Meetups this week include Albany, Amsterdam, Belgrade, Boston, Brooklyn, Budapest, Chicago, Christchurch, Helsinki, Las Vegas, Mexico City, Mumbai, Rochester, Seoul, Shanghai, St. Paul, Tallinn, Vienna, and others; see <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-2025-times-and\">the meetup post</a> for more information. And Zagreb has been added to the list for October.</p><p><strong>2: </strong>Post frequency might decrease for the next few weeks as I finish ACX Grants. I still hope to alert awardees at the beginning of October, and I&#8217;ll announce results on the blog sometime in early- to mid-October.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-400",
            "publishedAt": "2025-09-22",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Meetups this week include Albany, Amsterdam, Belgrade, Boston, Brooklyn, Budapest, Chicago, Christchurch, Helsinki, Las Vegas, Mexico City, Mumbai, Rochester, Seoul, Shanghai, St. Paul, Tallinn, Vienna, and others; see <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-2025-times-and\">the meetup post</a> for more information. And Zagreb has been added to the list for October.</p><p><strong>2: </strong>Post frequency might decrease for the next few weeks as I finish ACX Grants. I still hope to alert awardees at the beginning of October, and I&#8217;ll announce results on the blog sometime in early- to mid-October.</p>",
            "title": "Open Thread 400"
        },
        {
            "content": [
                "<p>The Trump Administration is attempting to put a $100k fee on future H1-B applications, including those that are exempt from the lottery and cap, unless of course they choose to waive it for you. I say attempting because Trump’s legal ability to do this appears dubious.</p>\n<p>This post mostly covers the question of whether this is a reasonable policy poorly implemented, or a terrible policy poorly implemented.</p>\n<p>Details offered have been contradictory, with many very confused about what is happening, including those inside the administration. The wording of the Executive Order alarmingly suggested that any H1-B visa holders outside the country even one day later would be subject to the fee, causing mad scrambles until this was ‘clarified.’ There was chaos.</p>\n<div>\n\n\n<span id=\"more-24736\"></span>\n\n\n</div>\n<p>Those so-called ‘clarifications’ citing ‘facts’ gaslit the public, changing key aspects of the policy, and I still do not remain confident on what the Trump administration will actually do here, exactly.</p>\n\n\n<h4 class=\"wp-block-heading\">How Does Any Of This Work?</h4>\n\n\n<p><a href=\"https://x.com/ReichlinMelnick/status/1969121638558859533\">Trump announced he is going to charge a $100,000 fee for H-1B visas</a>, <a href=\"https://x.com/rohanspatel/status/1969727085032710566\">echoing his suspension of such visas back in 2020</a> (<a href=\"https://www.cato.org/blog/trump-shouldnt-impose-100000-fee-h-1b-visas\">although a court overruled him on this</a>, and is likely to overrule the new fee as well). It remains remarkable that some, such as those <a href=\"https://x.com/rohanspatel/status/1969727085032710566\">like Jason and the All-In Podcast</a>, believed or claimed to believe that Trump would be a changed man on this.</p>\n<p>But what did this announcement actually mean? Annual or one-time? Existing ones or only new ones? Lottery only or also others? On each re-entry to the country? What the hell is actually happening?</p>\n<p>I put it that way because, in addition to the constant threat that Trump will alter the deal and the suggestion that you pray he does not alter it any further, there was a period where no one could even be confident what the announced policy was, and <a href=\"https://www.financialexpress.com/business/investing-abroad/100000-h-1b-visa-fees-executive-order-read-full-text-here/3983526/\">the written text of the executive order</a> did not line up with what administration officials were saying. It is entirely plausible that they themselves did not know which policy they were implementing, or different people in the administration had different ideas about what it was.</p>\n<p>It would indeed be wise to not trust the exact text of the Executive Order, on its own, to be reflective of future policy in such a spot. Nor would it be wise to trust other statements that contradict the order. It is chaos, and causes expensive chaos.</p>\n\n\n<h4 class=\"wp-block-heading\">RTFEO (Read the Executive Order)</h4>\n\n\n<p>The exact text is full of paranoid zero-sum logic. It treats it as a problem that we have 2.5 million foreign STEM workers in America, rather than the obvious blessing that it is. It actively complains that the unemployment rate in ‘computer occupations’ has risen from 1.98% to (gasp!) 3.02%. Even if we think that has zero to do with AI, or the business cycle or interest rates, isn’t that pretty low? Instead, ‘a company hired H1-B workers and also laid off other workers’ is considered evidence of widespread abuse of the system, when there is no reason to presume these actions are related, or that these firms reduced the number of American jobs.</p>\n<p>As I read the document, in 1a it says entry for such workers is restricted ‘except for those aliens whose petitions are accompanied or supplemented by a payment of $100k,’ which certainly sounds like it applies to existing H1-Bs. Then in section 3 it clarifies that this restriction applies after the date of this proclamation &#8211; so actual zero days of warning &#8211; and declines another clear opportunity to clarify that this does not apply to existing H1-B visas.</p>\n<p>I don’t know why anyone reading this document would believe that this would not apply to existing H1-B visa holders attempting re entry. <a href=\"https://chatgpt.com/share/68d02ec6-9fa0-8002-9433-0f6fbf455843\">GPT-5 Pro agrees</a> with this and my other interpretations (that I made on my own first).</p>\n<p>Distinctly, 1b then says they won’t consider applications that don’t come with a payment, also note that the payment looks to be due on application not on acceptance. Imagine paying $100k and then getting your application refused.</p>\n<p>There is then the ability in 1c for the Secretary of Homeland Security to waive the fee, setting up an obvious opportunity for playing favorites and for outright corruption, the government picking winners and losers. Why pay $100k to the government when you can instead pay $50k to someone else? <a href=\"https://x.com/scottlincicome/status/1969404504555540501\">What happens when this decision is then used as widespread leverage</a>?</p>\n<blockquote><p>Justin Wolfers: Critical part of the President&#8217;s new $100,000 charge for H1-B visas: The Administration can also offer a $100,000 discount to any person, company, or industry that it wants. Replacing rules with arbitrary discretion.</p>\n<p>Want visas? You know who to call and who to flatter.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">People Notice They Are Confused</h4>\n\n\n<p>Here’s some people being understandably very confused.</p>\n<blockquote><p><a href=\"https://x.com/pitdesi/status/1969114239420748218\">Sheel Mohnot</a> (7.6m views): <a href=\"https://archive.is/2025.09.19-183026/https://www.bloomberg.com/news/articles/2025-09-19/trump-to-add-new-100-000-fee-for-h-1b-visas-in-latest-crackdown\">$100k fee for H-1B’s is reasonable imo</a> [link goes to Bloomberg story that said it was per application].</p>\n<p>Generates revenue &amp; reduces abuse for the H-1B program and talented folks can still come via other programs.</p>\n<p><a href=\"https://x.com/pitdesi/status/1969186070249066592\">Sheel Mohnot</a> (8.1m views): I initially thought the H-1B reform was reasonable but it’s $100k per year, not per visa.</p>\n<p>That is too much, will definitely have a negative effect on innovation in the US. It’s basically only for people who make &gt;$400k now.</p>\n<p>Luba Lesiva: It’s per grant and per renewal &#8211; but are renewals actually annual? I thought it was every 3 years</p>\n<p><a href=\"https://x.com/pitdesi/status/1969186070249066592\">Sheel Mohnot</a>: Lutnick says per year but the text says per grant and wouldn’t apply to renewals.</p>\n<p><a href=\"https://x.com/GarettJones/status/1969514936104559087\">Garrett Jones</a>: They keep Lutnick out of the loop.</p>\n<p><a href=\"https://x.com/growing_daniel/status/1969519520772735272\">Daniel</a>: It’s fun that this executive order was so poorly written that members of the administration are publicly disagreeing about what it means.</p>\n<p>Trump EOs are like koans. Meditate on them and you will suddenly achieve enlightenment.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">People React Sensibly, By Which I Mean They Panic</h4>\n\n\n<p>Here’s some people acting highly sensibly in response to what was happening, even if they had closely read the Executive Order:</p>\n<blockquote><p>Gabbar Singh: A flight from US to India. People boarded the flight. Found out about the H1B news. Immediately disembarked fearing they won’t be allowed re-entry.</p>\n<p>Quoted Text Message: Experiencing immediate effect of the H1B rukes. Boarded Emirates flight to Dubai/ Mumbai. Flight departure time <strong>5.05 pm</strong>. Was held up because a passenger or family disembarked and they had to remove checked in luggage. Then looked ready to leave and another passenger disembarks. Another 20 minutes and saw about 10–15 passengers disembarking. Worried about reentry. Flight still on ground after 2 hours. Announcement from cabin crew saying if you wish to disembark please do so now. Cabin is like an indian train. Crazy.</p>\n<p>Rohan Paul: From Microsoft to Facebook, all tech majors ask H-1B visa holders to return back to the US in less than 24 hours.</p>\n<p>Starting tomorrow (Sunday), H1B holders can’t reenter the US without paying $100K.</p>\n<p>The number of last-minute flight bookings to the US have seen massive spike.</p>\n<p>4chan users are blocking India–US flights by holding tickets at checkout so Indian H1B holders can’t book before the deadline. <img alt=\"😯\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f62f.png\" style=\"height: 1em;\" /></p>\n<p><a href=\"https://x.com/typedfemale/status/1969462198822125908\">Typed Female</a>: the people on here deriving joy from these type of posts are very sick</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!AV99!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1aa33265-93b0-412f-9463-afcdce47d465_1199x466.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/JBlunt1018/status/1969421612551164390\">James Blunt</a>: Very sad.</p>\n<p>Giving these travelers even a grace period until October 1st would have been the human thing to do.</p>\n<p>Instead, people are disembarking from flights out of fear they won’t be let back into the country they’ve lived, worked, and paid taxes in for years.</p>\n<p>Cruelty isn’t policy, it’s just cruelty.</p></blockquote>\n<p>Any remotely competent drafter of the Executive Order, or anyone with access to a good LLM to ask obvious questions about likely response, would have known the chaos and harm this would cause. One can only assume they knew and did it anyway.</p>\n\n\n<h4 class=\"wp-block-heading\">Clarification And Gaslighting Are Offered</h4>\n\n\n<p>The White House later attempted to clear this up as a one-time fee on new visas only.</p>\n<blockquote><p><a href=\"https://x.com/ReichlinMelnick/status/1969487228813324326\">Aaron Reichlin-Melnick</a>: Oh my GOD. This is the first official confirmation that the new H-1B entry ban does not apply to people with current visas, (despite the text not containing ANY exception for people with current visas), and it’s not even something on an official website, it’s a tweet!</p>\n<p><a href=\"https://x.com/ReichlinMelnick/status/1969541453383614804\">Incredible level of incompetence</a> to write a proclamation THIS unclear and then not release official guidance until 24 hours later!</p></blockquote>\n<p>It is not only incompetence, it is very clearly gaslighting everyone involved, saying that the clarifications were unnecessary when not only are they needed they contract the language in the original document.</p>\n<blockquote><p>Rapid Response 47 (2.1m views, an official Twitter account, September 20, 2:58pm): Corporate lawyers and others with agendas are creating a lot of FAKE NEWS around President Trump&#8217;s H-1B Proclamation, but these are FACTS:</p>\n<ol>\n<li>The Proclamation does not apply to anyone who has a current visa.</li>\n<li>The Proclamation only applies to future applicants in the February lottery who are currently outside the U.S. It does not apply to anyone who participated in the 2025 lottery.</li>\n<li>The Proclamation does not impact the ability of any current visa holder to travel to/from the U.S.</li>\n</ol>\n</blockquote>\n<p>That post has the following highly accurate community note:</p>\n<blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!IJ3Y!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3a7e279b-0904-4190-b8a2-d3756d96d537_1008x282.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Karoline Leavitt (White House Press Secretary, via Twitter, September 20, 5:11pm):</p>\n<p>To be clear:</p>\n<ol>\n<li>This is NOT an annual fee. It’s a one-time fee that applies only to the petition.</li>\n<li>Those who already hold H-1B visas and are currently outside of the country right now will NOT be charged $100,000 to re-enter. H-1B visa holders can leave and re-enter the country to the same extent as they normally would; whatever ability they have to do that is not impacted by yesterday’s proclamation.</li>\n<li>This applies only to new visas, not renewals, and not current visa holders. It will first apply in the next upcoming lottery cycle.</li>\n</ol>\n<p><a href=\"https://x.com/CBP/status/1969512486627095007\">CBP</a> (Official Account, on Twitter, 5:22pm): Let’s set the record straight: President Trump’s updated H-1B visa requirement applies only to new, prospective petitions that have not yet been filed. Petitions submitted prior to September 21, 2025 are not affected. Any reports claiming otherwise are flat-out wrong and should be ignored.</p>\n<p><a href=\"https://x.com/USCIS/status/1969515779251953876\">[Mirrored by USCIS at 5:35pm]</a></p></blockquote>\n<p>None of these three seem, to me, to have been described in the Executive Order. Nor would I trust Leavitt’s statements here to hold true, where they contradict the order.</p>\n<blockquote><p><a href=\"https://x.com/ShakeelHashim/status/1969509795464937831\">Shakeel Hashim</a>: Even if this is true, the fact they did not think to clarify this at the time of the announcement is a nice demonstration of this administration’s <a href=\"https://x.com/ReichlinMelnick/status/1969487228813324326\">incompetence</a>.</p></blockquote>\n<p>There’s also the issue that this is <a href=\"https://x.com/JeremyLNeufeld/status/1969615039465218165\">unlikely to stand up in court when challenged</a>.</p>\n<p>Meanwhile, here’s the biggest voice of support, which the next day on the 21st believed that this was a yearly tax. Even the cofounder of Netflix is deeply confused.</p>\n<blockquote><p>Reed Hastings (CEO Powder, Co-Founder Netflix): I&#8217;ve worked on H1-B politics for 30 years. Trump&#8217;s $100k per year tax is a great solution. It will mean H1-B is used just for very high value jobs, which will mean no lottery needed, and more certainty for those jobs.</p></blockquote>\n<p><a href=\"https://www.whitehouse.gov/articles/2025/09/h-1b-faq/\">The issued FAQ came out on the 21st</a>, two days after some questions had indeed been highly frequently asked. Is this FAQ binding? Should we believe it? Unclear.</p>\n<p>Here’s what it says:</p>\n<ol>\n<li>$100k is a one-time new application payment.</li>\n<li>This does not apply to already filed petitions.</li>\n<li>This does apply to cap-exempt applications, including national labs, nonprofit research organizations and research universities, and there is no mention here of an exemption for hospitals.</li>\n<li>In the future the prevailing wage level will be raised.</li>\n<li>In the future there will be a rule to prioritize high-skilled, high-paid aliens in the H1-B lottery over those at lower wage levels (!).</li>\n<li>This does not do anything else, such as constrain movement.</li>\n</ol>\n<p>If we are going to ‘prioritize high-skilled, high-paid aliens’ in the lottery, that’s great, lose the lottery entirely and pick by salary even, or replace the cap with a minimum salary and see what happens. But then why do we need the fee?</p>\n<p>If they had put out this FAQ as the first thing, and it matched the language in the Executive Order, a lot of tsouris could have been avoided, and we could have a reasonable debate on whether the new policy makes sense, although it still is missing key clarifications, especially whether it applies to shifts out of J-1 or L visas.</p>\n<p>Instead, the Executive Order was worded to cause panic, in ways that were either highly incompetent, malicious and intentional, or both. Implementation is already, at best, a giant unforced clusterfuck. If this was not going to apply to previously submitted petitions, there was absolutely zero reason to have this take effect with zero notice.</p>\n<p>There is no reason to issue an order saying one (quite terrible) set of things only to ‘clarify’ into a different set of things a day later, in a way that still leaves everyone paranoid at best. There is now once again a permanent increase in uncertainty and resulting costs and frictions, especially since we have no reason to presume they won’t simply start enforcing illegal actions.</p>\n<p>If this drives down the number of H1-B visas a lot, that would be quite bad, including to the deficit because <a href=\"https://x.com/cojobrien/status/1969170378753769652\">the average H1-B visa holder contributes ~$40k more in taxes than they use in benefits</a>, and creates a lot of economic value beyond that.</p>\n\n\n<h4 class=\"wp-block-heading\">How To Clear The Market</h4>\n\n\n<p>Could this still be a good idea, or close enough to become a good idea, if done well?</p>\n<p>Maybe. If it was actually done well and everyone had certainty. At least, it could be better than the previous situation. The Reed Hastings theory isn’t crazy, and our tax revenue has to come from somewhere.</p>\n<blockquote><p><a href=\"https://x.com/calebwatney/status/1969602836766900297\">Caleb Watney</a> (IFP): Quick H1-B takes:</p>\n<p>Current effort is (probably) not legally viable without Congress.</p>\n<p>There&#8217;s a WORLD of difference between applying a fee to applicants who are stuck in the lottery (capped employers) and to those who aren&#8217;t (research nonprofits and universities). If we apply this rule to the latter, we will dramatically reduce the number of international scientists working in the U.S.</p>\n<p>In theory, a fee just on *capped* employers can help differentiate between high-value and low-value applications, but 100k seems too high (especially if it&#8217;s per year).</p>\n<p>A major downside of a fee vs a compensation rank is that it creates a distortion for skilled talent choosing between the US and other countries. If you have the choice between a 300k offer in London vs a 200k offer in New York&#8230;</p></blockquote>\n<p>I would be willing to bite the bullet and say that every non-fraudulent H1-B visa issued under the old policy was a good H1-B visa worth issuing, and we should have raised or eliminated the cap, but one can have a more measured view and the system wasn’t working as designed or intended.</p>\n<blockquote><p><a href=\"https://x.com/JeremyLNeufeld/status/1969615039465218165\">Jeremy Neufeld</a>: The H-1B has huge problems and high-skilled immigration supporters shouldn’t pretend it doesn’t.</p>\n<p>It’s been used far too much for middling talent, wage arbitrage, and downright fraud.</p></blockquote>\n<p>Use for middling talent and wage arbitrage (at least below some reasonable minimum that still counts as middling here) is not something I would have a problem with if we could issue unlimited visas, but I understand that others do have a problem with it, and also that there is no willingness to issue unlimited visas.</p>\n<p>The bigger problem was the crowding out via the lottery. Given the cap in slots, every mediocre talent was taking up a slot that could have gone to better talent.</p>\n<p>This meant that the best talent would often get turned down. It also meant that no one could rely or plan upon an H-1B. If I need to fill a position, why would I choose someone with a greater than 70% chance of being turned down?</p>\n<p>Whereas if you impose a price per visa, you can clear the market, and ensure we use it for the highest value cases.</p>\n\n\n<h4 class=\"wp-block-heading\">Talking Price</h4>\n\n\n<p>If the price and implementation were chosen wisely, this would be good on the margin. Not a first best solution, because there should not be a limit on the number of H-1B visas, but a second or third best solution. This would have three big advantages:</p>\n<ol>\n<li>The H1-B visas go where they are most valuable.</li>\n<li>The government will want to issue more visas to make more money, or at least a lot of the pressure against the H1-B would go away.</li>\n<li>This provides a costly signal that no, you couldn’t simply hire an American, and if you’re not earning well over $100k you can feel very safe.</li>\n</ol>\n<p>The central argument against the H1-B is that you’re taking a job away from an American to save money. A willingness to pay $100k is strong evidence that there really was a problem finding a qualified domestic applicant for the job.</p>\n<p>You still have to choose the right price. When I asked GPT-5 Pro, it estimated that the market clearing rate was only about $30k one time fee per visa, and thus a $100k fee even one time would collapse demand to below supply.</p>\n<p>I press X to doubt that. Half of that is covered purely by savings on search costs, and there is a lot of talk that annual salaries for such workers are often $30k or more lower than American workers already.</p>\n<p>I think we could, if implemented well, charge $100k one time, raise $2 billion or so per year, and still clear the market. Don’t underestimate search and uncertainty costs. <a href=\"https://manifold.markets/GustavoMafra/h1b-demand-persists-despite-100k-fe\">There is a market at Manifold</a>, as well as <a href=\"https://manifold.markets/BenM/100k-fee-imposed-on-h1b-visas\">another on whether the $100k will actually get charged</a>, <a href=\"https://manifold.markets/EvanDaniel/revenue-from-h1b-visa-fees-2026\">and this market on net fees collected</a> (although it includes a bunch of Can’t Happen options, so ignore the headline number).</p>\n<p>I say second or third best because another solution is to award H1-Bs by salary.</p>\n<blockquote><p><a href=\"https://x.com/MTabarrok/status/1969570561761427706\">Ege Erdil</a>: some people struggle to understand the nuanced position of</p>\n<p>&#8211; trump&#8217;s H-1B order is illegal &amp; will be struck down</p>\n<p>&#8211; but broadly trump&#8217;s attempts to reform the program are good</p>\n<p>&#8211; a policy with $100k/yr fees is probably bad, a policy with $100k one-time fee would probably be good.</p>\n<p>Maxwell Tabarrok: A massive tax on skilled foreign labor would not be good even if it corrects somewhat for the original sin of setting H1-B up as a lottery.</p>\n<p><a href=\"https://ifp.org/h1b/\">Just allocate the visas based on the wage offered to applicants</a>.</p></blockquote>\n<p>Awarding by salary solves a lot of problems. It mostly allocates to the highest value positions. It invalidates the ‘put in tons of applications’ strategy big companies use. It invalidates the ‘bring them in to undercut American workers’ argument. It takes away the uncertainty in the lottery. IFP estimates this would raise the value of the H1-B program by 48% versus baseline.</p>\n<p>Indeed, the Trump Administration appears to be intent on implementing this change, and prioritizing high skilled and highly paid applications in the lottery. Which is great, but again it makes the fee unnecessary.</p>\n\n\n<h4 class=\"wp-block-heading\">Is The Value Crazy High?</h4>\n\n\n<p>There is a study that claims that winning the H1-B lottery is amazingly great for startups, so amazingly great it seems impossible.</p>\n<blockquote><p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/09/the-united-states-is-starved-for-talent-re-upped.html\">Alex Tabarrok</a>: The US offers a limited number of H1-B visas annually, these are temporary 3-6 year visas that allow firms to hire high-skill workers. In many years, the demand exceeds the supply which is capped at 85,000 and in these years <a href=\"https://www.uscis.gov/news/alerts/uscis-completes-h-1b-cap-random-selection-process-fy-2019\">USCIS randomly selects</a> which visas to approve. The random selection is key to a new NBER paper by <a href=\"https://www.nber.org/papers/w26392\">Dimmock, Huang and Weisbenner</a> (published <a href=\"https://pubsonline.informs.org/doi/10.1287/mnsc.2021.4152\">here</a>). What’s the effect on a firm of getting lucky and wining the lottery?</p>\n<p>The Paper: We find that a firm’s win rate in the H-1B visa lottery is strongly related to the firm’s outcomes over the following three years. Relative to ex ante similar firms that also applied for H-1B visas, firms with higher win rates in the lottery are more likely to receive additional external funding and have an IPO or be acquired.</p>\n<p>Firms with higher win rates also become more likely to secure funding from high-reputation VCs, and receive more patents and more patent citations. Overall, the results show that access to skilled foreign workers has a strong positive effect on firm-level measures of success.</p>\n<p>Alex Tabarrok: Overall, getting (approximately) one extra high-skilled worker causes a 23% increase in the probability of a successful IPO within five years (a 1.5 percentage point increase in the baseline probability of 6.6%). That’s a huge effect.</p>\n<p>Remember, these startups have access to a labor pool of 160 million workers. For most firms, the next best worker can’t be appreciably different than the first-best worker. But for the 2000 or so tech-startups the authors examine, the difference between the world’s best and the US best is huge. Put differently on some margins <em>t</em><a href=\"https://marginalrevolution.com/marginalrevolution/2023/01/the-extreme-shortage-of-high-iq-workers.html\"><em>he US is starved for talent</em></a>.</p>\n<p><a href=\"https://x.com/AlecStapp/status/1969495170153329146\">Roon</a>: this seems hard to believe &#8211; how does one employee measurably improve the odds of IPO? but then this randomization is basically the highest standard of evidence.</p>\n<p>Alec Stapp: had the same thought, but the paper points out that this would include direct effects and indirect effects, like increasing the likelihood of obtaining VC funding. Also noteworthy that they find a similar effect on successful exits.</p>\n<p>Max Del Blanco: Sounds like it would be worth 100k!</p>\n<p><a href=\"https://x.com/CharlesD353/status/1969804347476197575\">Charles</a>: There&#8217;s just no way this effect size is real tbh. When I see an effect this size I assume there&#8217;s a confounder I&#8217;m unaware of.</p></blockquote>\n<p>This is a double digit percentage increase in firm value, worth vastly more than $100k for almost any startup that is hiring. It should be easy to reclaim the $100k via fundraising more money on better terms, including in advance since VCs can be forward looking, even for relatively low-value startups, and recruitment will be vastly easier without a lottery in the way. For any companies in the AI space, valuations even at seed are now often eight or nine figures, so it is disingenuous to say this is not affordable.</p>\n<p>If we assume the lottery is fully random, suppose the effect size were somehow real. How would we explain it?</p>\n<p>My guess is that this would be because a startup, having to move quickly, would mostly only try to use the H1-B lottery when given access to exceptional talent, or for a role they flat out cannot otherwise fill. Roles at startups are not fungible and things are moving quickly, so the marginal difference is very high.</p>\n<p>This would in turn suggest that the change is, if priced and implemented correctly, very good policy for the most important startups, and yes they would find a way to pay the $100k. However, like many others I doubt the study’s findings because the effect size seems too big.</p>\n\n\n<h4 class=\"wp-block-heading\">The Fee Might Be Too Damn High</h4>\n\n\n<p>A $100k annual fee, if that somehow happened and survived contact with the courts? Yeah, that would probably have done it, and would clearly have been intentional.</p>\n<blockquote><p><a href=\"https://apnews.com/article/h1b-visa-trump-immigration-8d39699d0b2de3d90936f8076357254e?utm_source=chatgpt.com\">AP</a> (at the time Lutnick thought the fee was annual): Lutnick said the change will likely result in far fewer H-1B visas than the 85,000 annual cap allows because “it’s just not economic anymore.”</p></blockquote>\n<p>Even then, I would have taken the over on the number of visas that get issued, versus others expectations or those of GPT-5. Yes, $100k per year is quite a lot, but getting the right employee can be extremely valuable.</p>\n<p>In many cases you really can’t find an American to do the job at a price you can socially pay, and there are a lot of high value positions where given the current lottery you wouldn’t bother trying for an H1-B at all.</p>\n<p>Consider radiologists, where open positions have often moved into the high six figures, and there are many qualified applicants overseas that can’t otherwise get paid anything like that.</p>\n<p>Consider AI as well. A traditional ‘scrappy’ startup can’t pay $100k per year, but when seed rounds are going for tens or hundreds of millions, and good engineers are getting paid hundreds of thousands on the regular, then suddenly yes, yes you can pay.</p>\n<p>I think the argument ‘all startups are scrappy and can’t afford such fees’ simply flies in the face of current valuations in the AI industry, where even seed stage raises often have valuations in the tens to hundreds of millions.</p>\n<p>The ‘socially pay’ thing matters a lot. You can easily get into a pickle, where the ‘standard’ pay for something is let’s say $100k, but price to get a new hire is $200k.</p>\n<p>If you paid the new hire $200k and anyone finds out then your existing $100k employees will go apocalyptic unless you bump them up to $200k. Relative pay has to largely match social status within the firm.</p>\n<p>Whereas in this case, you’d be able to (for example) pay $100k in salary to an immigrant happy to take it, and a $100k visa annual fee, without destroying the social order. It also gives you leverage over the employee.</p>\n\n\n<h4 class=\"wp-block-heading\">The One Time Fee Is Still Rather High</h4>\n\n\n<p>If you change to a one-time fee, the employer doesn’t get to amortize it that much, but it is a lot less onerous. Is the fee too high even at a one time payment?</p>\n<p>One objection here and elsewhere is ‘this is illegal and won’t survive in court’ but for now let’s do the thought experiment where it survives, perhaps by act of Congress.</p>\n<blockquote><p><a href=\"https://x.com/JeremyLNeufeld/status/1969615039465218165\">Jeremy Neufeld</a>: That doesn’t make the $100k fee a good solution.</p>\n<ol>\n<li>Outsourcers can just avoid the fee by bringing their people in on L visas and <em>then</em> enter them in the lottery.</li>\n<li>US companies face a competitive disadvantage in recruiting real talent from abroad since they’ll have to lower their compensation offers to cover the $100k.</li>\n<li>Research universities will recruit fewer foreign-trained scientists.</li>\n<li>It’s likely to get overturned in court so the long term effect is just signaling uncertainty and unpredictability to talent.</li>\n</ol>\n</blockquote>\n<p>Another issue is that they are applying the fee to cap-exempt organizations, which seems obviously foolish.</p>\n<blockquote><p><a href=\"https://x.com/JeremyLNeufeld/status/1969816431639375968\">This new FAQ from the White House</a> <a href=\"https://t.co/YK2shIAbud\">makes it clear the $100k fee does apply to cap-exempt organizations</a>.</p>\n<p>That includes national labs and other government R&amp;D, nonprofit research orgs, and research universities.</p>\n<p>Big threat to US scientific leadership.</p>\n<p><a href=\"https://x.com/JeremyLNeufeld/status/1970114937516065222\">Nothing wrong in principle</a> with tacking on a large fee to cap-subject H-1Bs to prioritize top talent but it needs a broader base (no big loophole for L to H-1B changes) and a lower rate.</p>\n<p>(Although for better or for worse, Congress needs to do it.)</p>\n<p>But the fee on cap-exempt H-1Bs is just stupid.</p></blockquote>\n<p>Presumably they won’t allow the L visa loophole or other forms of ‘already in the country,’ and would refuse to issue related visas without fees. Padme asks, they’re not so literally foolish as to issue such visas but stop the workers at the border anyway, and certainly not letting them take up lottery slots, are they? Are they?</p>\n<p>On compensation, yes presumably they will offer somewhat lower compensation than they would have otherwise, but also they can offer a much higher chance of a visa. It’s not obvious where this turns into a net win, and note that it costs a lot more than $100k to pay an employee $100k in salary, and the social dynamics discussed above. I’m not convinced the hit here will be all that big.</p>\n<p>I certainly would bet against hyperbolic claims like this one from David Bier at Cato, who predicts that this will ‘effectively end’ the H-1B visa category.</p>\n<blockquote><p><a href=\"https://www.cato.org/blog/trump-shouldnt-impose-100000-fee-h-1b-visas\">David Bier</a>: This fee would effectively end the H‑1B visa category by making it prohibitive for most businesses to hire H‑1B workers. This would force leading technology companies <a href=\"https://www.nber.org/papers/w27538\"><strong>out of the United States</strong></a>, <a href=\"https://www.journals.uchicago.edu/doi/abs/10.1086/679061\"><strong>reduce demand for US workers</strong></a>, reduce <a href=\"https://www.nber.org/system/files/working_papers/w15768/w15768.pdf\"><strong>innovation</strong></a>, have severe <a href=\"https://c/Users/anowrasteh/Downloads/google.com/search%3fq=h-1b+worth+their+weight+in&amp;rlz=1C1GCEA_enUS1050US1050&amp;oq=h-1b+worth+their+weight+in&amp;gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIGCAEQRRg8MgYIAhBFGD0yBggDEEUYPdIBCDQ0NjZqMGo0qAIAsAIB&amp;sourceid=chrome&amp;ie=UTF-8\"><strong>second-order</strong></a> economic effects, and lower the supply of goods and services in everything <a href=\"https://ssti.org/blog/useful-stats-look-h-1b-visa-program-industry-employer-and-state#:~:text=Since%202009%2C%20the%20industry%20with,approvals%20each%20year%20on%20average.\"><strong>from IT and education to manufacturing and medicine</strong></a>.</p></blockquote>\n<p>Research universities will recruit a lot fewer foreign-trained scientists if and only if both of the following are true:</p>\n<ol>\n<li>The administration does not issue waivers for research scientists, despite this being clearly in the public interest.</li>\n<li>The perceived marginal value of the research scientist is not that high, such that universities decline to pay the application fee.</li>\n</ol>\n<p>That does seem likely to happen often. It also seems like a likely point of administration leverage, as they are constantly looking for leverage over universities.</p>\n\n\n<h4 class=\"wp-block-heading\">Need a Doctor, No Cap</h4>\n\n\n<p>American intentionally caps the number of doctors we train. The last thing we want to do is make our intentionally created doctor shortage even worse. A lot of people warned that this will go very badly, and it looks like <a href=\"https://x.com/SpencerHakimian/status/1970138142251565310\">Trump is likely to waive the fee for doctors</a>.</p>\n<p>Note that according to GPT-5-Pro, residencies mostly don’t currently use H-1B, rather they mostly use J-1. The real change would be if they cut off shifting to H1-B, which would prevent us from retaining those residents once they finish. Which would still be a very bad outcome, if the rules were sustained for that long. That would in the long term be far worse than having our medical schools expand. This is one of the places where yes, Americans very much want these jobs and could become qualified for them.</p>\n<p>Of course the right answer here was always to open more slots and train more doctors.</p>\n\n\n<h4 class=\"wp-block-heading\">Our Price Cheap</h4>\n\n\n<p>Our loss may partly be the UK’s gain.</p>\n<blockquote><p><a href=\"https://x.com/AlecStapp/status/1969499529717121210\">Alec Stapp</a>: My feed is full of smart people in the UK pouncing on the opportunity to poach more global talent for their own country.</p>\n<p>We are making ourselves weaker and poorer by turning away scientists, engineers, and technologists who want to contribute to the US.</p>\n<p><a href=\"https://x.com/alexocheema/status/1969437877198077958\">Alex Cheema</a>: If you’re a talented engineer affected by the H-1B changes, come build with us in London @exolabs</p>\n<p>&#8211; SF-level comp (270K-360K base + equity)</p>\n<p>&#8211; Best talent from Europe</p>\n<p>&#8211; Hardcore build culture</p>\n<p>&#8211; Build something important with massive distribution</p>\n<p>Email jobs at exolabs dot net</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!0UdD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb9cd3f1d-8e18-4cb1-a997-ecd2ad5dc842_1178x1482.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/09/22/h1-b-and-the-100k-fee/",
            "publishedAt": "2025-09-22",
            "source": "TheZvi",
            "summary": "The Trump Administration is attempting to put a $100k fee on future H1-B applications, including those that are exempt from the lottery and cap, unless of course they choose to waive it for you. I say attempting because Trump’s legal &#8230; <a href=\"https://thezvi.wordpress.com/2025/09/22/h1-b-and-the-100k-fee/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "H1-B And The $100k Fee"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3145/",
            "publishedAt": "2025-09-22",
            "source": "XKCD",
            "summary": "<img alt=\"Some lava around the piercing site is normal, but keep an eye out for spreading earthquakes and eruptive activity that might indicate rifting.\" src=\"https://imgs.xkcd.com/comics/piercing.png\" title=\"Some lava around the piercing site is normal, but keep an eye out for spreading earthquakes and eruptive activity that might indicate rifting.\" />",
            "title": "Piercing"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-09-22"
}