{
    "articles": [
        {
            "content": [],
            "link": "https://anyblockers.com/posts/the-path-of-least-resistance-for-coding-agents/",
            "publishedAt": "2025-10-03",
            "source": "Eric Zakariasson",
            "summary": "How AI coding agents often treat symptoms instead of root causes, leading to technical debt. Some preventative measures to ship better code.",
            "title": "The problematic path of least resistance for coding agents"
        },
        {
            "content": [
                "<p>Most people who read my blog and know me for the development of <a href=\"https://bearblog.dev\" target=\"_blank\">Bear Blog</a> are surprised to learn that I have another software project in the art and design space. It's called <a href=\"https://justsketch.me\" target=\"_blank\">JustSketchMe</a> and is a 3D modelling tool for artists to conceptualise their artwork before putting pencil to paper.</p>\n<p>It's a very niche tool (and requires some serious explanation to some non-illustrators involving a wooden mannequin and me doing some dramatic poses), however when provided as a freemium tool to the global population of artists, it's quite well used.</p>\n<p>Similar to Bear, I make it free to everyone, with the development being funded through a \"pro\" tier. Conversely, since it is a standalone app it has a bit of a weakness, which is what this post is about.</p>\n<p>I noticed, back in 2021, that when Googling \"justsketchme\" the top 3 autocompletes were \"justsketchme crack\", \"justsketchme pro cracked\", and \"justsketchme apk\". On writing this post, I checked that this still holds true, and it's fairly similar 4 years later.</p>\n<p><img alt=\"justsketchme-google\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman/justsketchme-google.webp\" /></p>\n<p>The meaning of this is obvious. A lot of people are trying to pirate JustSketchMe. However, instead of feeling frustrated (okay, I did feel a bit frustrated at first) I had a bright idea to turn this apparent negative into a positive.</p>\n<p>I created two pages with the following titles and the appropriate subtitles to get indexed as a pirate-able version of JustSketchMe:</p>\n<ul>\n<li><a href=\"https://justsketch.me/justsketchme-crack-full-2021-skidrow/\" target=\"_blank\">JustSketchMe Crack Full 2021 22.0.1.73</a></li>\n<li><a href=\"https://justsketch.me/justsketchme-apk-mirror-free/\" target=\"_blank\">JustSketchMe APK Mirror FULL 2.2.2021</a></li>\n</ul>\n<p><img alt=\"justsketchme-1664202109\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman/justsketchme-1664202109.webp\" /></p>\n<p>These pages rank as the first result on Google for the relevant search terms. Then on the page itself I tongue-in-cheek call out the potential pirate. I then acknowledge that we're in financially trying times and give them a discount code.</p>\n<p>And you know what?</p>\n<p>That discount code is the most used discount code on JustSketchMe! By far! No YouTube sponsor, nor Black Friday special even comes close.</p>\n<p>In some ways this is taking advantage of a good search term. In others it's showing empathy and adding delight, creating a positive incentive to purchase to someone who otherwise wouldn't have.</p>\n<p>The discount code is <strong>PIRACYKILLS</strong>. I'll leave it active for a while. 👮🏻‍♂️</p>"
            ],
            "link": "https://herman.bearblog.dev/piracy-kills/",
            "publishedAt": "2025-10-03",
            "source": "Herman Martinus",
            "summary": "<p>Most people who read my blog and know me for the development of <a href=\"https://bearblog.dev\" target=\"_blank\">Bear Blog</a> are surprised to learn that I have another software project in the art and design space. It's called <a href=\"https://justsketch.me\" target=\"_blank\">JustSketchMe</a> and is a 3D modelling tool for artists to conceptualise their artwork before putting pencil to paper.</p> <p>It's a very niche tool (and requires some serious explanation to some non-illustrators involving a wooden mannequin and me doing some dramatic poses), however when provided as a freemium tool to the global population of artists, it's quite well used.</p> <p>Similar to Bear, I make it free to everyone, with the development being funded through a \"pro\" tier. Conversely, since it is a standalone app it has a bit of a weakness, which is what this post is about.</p> <p>I noticed, back in 2021, that when Googling \"justsketchme\" the top 3 autocompletes were \"justsketchme crack\", \"justsketchme pro cracked\", and \"justsketchme apk\". On writing this post, I checked that this still holds true, and it's fairly similar 4 years later.</p> <p><img alt=\"justsketchme-google\" src=\"https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman/justsketchme-google.webp\" /></p> <p>The meaning of this is obvious. A lot of people are trying to pirate JustSketchMe. However, instead of feeling frustrated (okay, I",
            "title": "PIRACYKILLS"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/10/03/style/modern-love-when-the-woman-pays-for-dinner-every-time.html",
            "publishedAt": "2025-10-03",
            "source": "Modern Love - NYT",
            "summary": "She kept grabbing the check, and men kept letting her, until she landed on a (possibly) brilliant idea.",
            "title": "The Woman Who Always Paid for Dinner"
        },
        {
            "content": [
                "<p>If you&#8217;ve read the finalists of this year&#8217;s non-book review contest, <strong><a href=\"https://forms.gle/EWCyTpGGNvRiXKbb8\">vote for your favorite here</a></strong>. Voting will close end of day on Monday, October 13. This year is back to ranked choice voting; vote for your first, second, and third favorite reviews. </p><p>In case you need a refresher, here are the finalists, in order of appearance:</p><p><strong>1: </strong><a href=\"https://www.astralcodexten.com/p/your-review-alpha-school\">Alpha School</a><br /><strong>2: </strong><a href=\"https://www.astralcodexten.com/p/your-review-school\">School</a><br /><strong>3: </strong><a href=\"https://www.astralcodexten.com/p/your-review-of-mice-mechanisms-and\">Mice, Mechanisms, and Dementia</a><br /><strong>4: </strong><a href=\"https://www.astralcodexten.com/p/your-review-islamic-geometric-patterns\">Islamic Geometric Patterns in the Metropolitan Museum of Art</a><br /><strong>5: </strong><a href=\"https://www.astralcodexten.com/p/your-review-the-astral-codex-ten\">The Astral Codex Tex Commentariat</a><br /><strong>6: </strong><a href=\"https://www.astralcodexten.com/p/your-review-joan-of-arc\">Joan of Arc</a><br /><strong>7: </strong><a href=\"https://www.astralcodexten.com/p/your-review-my-fathers-instant-mashed\">My Father&#8217;s Instant Mashed Potatoes</a><br /><strong>8: </strong><a href=\"https://www.astralcodexten.com/p/your-review-dating-men-in-the-bay\">Dating Men In The Bay Area</a><br /><strong>9: </strong><a href=\"https://www.astralcodexten.com/p/your-review-ollantay\">Ollantay</a><br /><strong>10: </strong><a href=\"https://www.astralcodexten.com/p/your-review-participation-in-phase\">Participation In Phase I Clinical Pharmaceutical Research</a><br /><strong>11: </strong><a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity\">The Synaptic Plasticity And Memory Hypothesis</a><br /><strong>12: </strong><a href=\"https://www.astralcodexten.com/p/your-review-project-xanadu-the-internet\">Project Xanadu - The Internet That Might Have Been</a><br /><strong>13: </strong><a href=\"https://www.astralcodexten.com/p/your-review-the-russo-ukrainian-war\">The Russo-Ukrainian War</a></p><p>Prediction market is <a href=\"https://manifold.markets/BayesianTom/who-will-win-acxs-everythingexceptb\">here</a>, but don&#8217;t peek until after you&#8217;ve voted.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/vote-in-the-2025-non-book-review",
            "publishedAt": "2025-10-03",
            "source": "SlateStarCodex",
            "summary": "<p>If you&#8217;ve read the finalists of this year&#8217;s non-book review contest, <strong><a href=\"https://forms.gle/EWCyTpGGNvRiXKbb8\">vote for your favorite here</a></strong>. Voting will close end of day on Monday, October 13. This year is back to ranked choice voting; vote for your first, second, and third favorite reviews. </p><p>In case you need a refresher, here are the finalists, in order of appearance:</p><p><strong>1: </strong><a href=\"https://www.astralcodexten.com/p/your-review-alpha-school\">Alpha School</a><br /><strong>2: </strong><a href=\"https://www.astralcodexten.com/p/your-review-school\">School</a><br /><strong>3: </strong><a href=\"https://www.astralcodexten.com/p/your-review-of-mice-mechanisms-and\">Mice, Mechanisms, and Dementia</a><br /><strong>4: </strong><a href=\"https://www.astralcodexten.com/p/your-review-islamic-geometric-patterns\">Islamic Geometric Patterns in the Metropolitan Museum of Art</a><br /><strong>5: </strong><a href=\"https://www.astralcodexten.com/p/your-review-the-astral-codex-ten\">The Astral Codex Tex Commentariat</a><br /><strong>6: </strong><a href=\"https://www.astralcodexten.com/p/your-review-joan-of-arc\">Joan of Arc</a><br /><strong>7: </strong><a href=\"https://www.astralcodexten.com/p/your-review-my-fathers-instant-mashed\">My Father&#8217;s Instant Mashed Potatoes</a><br /><strong>8: </strong><a href=\"https://www.astralcodexten.com/p/your-review-dating-men-in-the-bay\">Dating Men In The Bay Area</a><br /><strong>9: </strong><a href=\"https://www.astralcodexten.com/p/your-review-ollantay\">Ollantay</a><br /><strong>10: </strong><a href=\"https://www.astralcodexten.com/p/your-review-participation-in-phase\">Participation In Phase I Clinical Pharmaceutical Research</a><br /><strong>11: </strong><a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity\">The Synaptic Plasticity And Memory Hypothesis</a><br /><strong>12: </strong><a href=\"https://www.astralcodexten.com/p/your-review-project-xanadu-the-internet\">Project Xanadu - The Internet That Might Have Been</a><br /><strong>13: </strong><a href=\"https://www.astralcodexten.com/p/your-review-the-russo-ukrainian-war\">The Russo-Ukrainian War</a></p><p>Prediction market is <a href=\"https://manifold.markets/BayesianTom/who-will-win-acxs-everythingexceptb\">here</a>, but don&#8217;t peek until after you&#8217;ve voted.</p>",
            "title": "Vote In The 2025 Non-Book Review Contest"
        },
        {
            "content": [
                "<p>OpenAI gave us two very different Sora releases. <a href=\"https://openai.com/index/sora-2/\">Here is the official announcement</a>.</p>\n<p>The part where they gave us a new and improved video generator? Great, love it.</p>\n<p>The part where they gave us a new social network dedicated purely to short form AI videos? Not great, Bob. Don’t be evil.</p>\n<p>OpenAI is claiming they are making their social network with an endless scroll of 10-second AI videos the Actively Good, pro-human version of The Big Bright Screen Slop Machine, that helps you achieve your goals and can be easily customized and favors connection and so on. I am deeply skeptical.</p>\n<div>\n\n\n<span id=\"more-24763\"></span>\n\n\n</div>\n<p>They also took a bold copyright stance, with that stance being, well, not quite ‘f*** you,’ but kind of close? You are welcome to start flagging individual videos. Or you can complain to them more generally about your characters and they say they can ‘work with you,’ which they clearly do in some cases, but the details are unclear.</p>\n<p><a href=\"https://www.youtube.com/watch?v=9HVejEB5uVk\">It’s a bold strategy, Cotton. Let’s see if it pays off for em.</a></p>\n<p>As opposed to their deepfake rule for public figures, which is a highly reasonable opt-in rule where they need to give their permission.</p>\n<p>Thus, a post in three acts.</p>\n<p>You can access Sora either at <a href=\"http://Sora.com\">Sora.com</a> or via the Sora iPhone app. You need an invite to be part of the new social network, because that’s how the cool kids get you excited for a new app these days.</p>\n<p>I am going mostly off reports of others but was also able to get access.</p>\n\n\n<h4 class=\"wp-block-heading\">Act 1: Sora 2, The Producer of Ten Second Videos</h4>\n\n\n<p>It’s a good <a href=\"https://x.com/OpenAI/status/1973075423488803059\">video</a> generation model, sir. Quite excellent, even. I’m very impressed.</p>\n<p>It is not yet in the API, but it will be soon.</p>\n<p>As always, all official examples you see will be heavily cherry picked. Assume these are, within the context in question, the best Sora 2 can do.</p>\n<p>Those you see on social media from other sources, or on the Sora app, are still heavily selected in various ways. Usually they are the coolest, funniest and best creations, but also they are the creations that most most blatantly violate copyright, or are the most violent or sexual or otherwise might be unwise to create, or simply have the most hilarious fails. They’re not a representative sample.</p>\n<p>When I tried creating a few things, it was still impressive, but as you’d expect it doesn’t nail the whole thing reliably or anything like that, and it doesn’t always fully follow instructions. I also got a content violation for ‘a time lapse of a Dyson sphere being built set to uplifting music.’</p>\n<p>It is also easy to not appreciate how much progress is being made, or that previously difficult problems are being solved, because where there aren’t problems the lack of problems, and the previous failures, become invisible.</p>\n<p>Netflix and Meta stock were each down a few percent, presumably on the news.</p>\n\n\n<h4 class=\"wp-block-heading\">Big Talk</h4>\n\n\n<p>Sora 2 claims to be a big update on several fronts simultaneously:</p>\n<ol>\n<li>Able to handle movements impossible for previous models.</li>\n<li>Much better adherence to the laws of physics.</li>\n<li>In particular, no longer ‘overoptimistic,’ meaning it won’t break physics to make the desired outcome happen, instead events will unfold naturally.</li>\n<li>Strongly controllability, ability to follow intricate instructions.</li>\n<li>Excels at styles, including realistic, cinematic, claymation and anime.</li>\n<li>Creates sophisticated soundscapes and talk to match the video.</li>\n<li>Insert any person, animal or object into any video.</li>\n<li>You can, in particular, upload yourself via your camera.</li>\n</ol>\n<p>That’s all very cool. <a href=\"https://x.com/OpenAI/status/1973143641490334133\">The sample videos</a> show impressive command of physics.</p>\n<p><a href=\"https://x.com/GabrielPeterss4/status/1973071380842229781\">Gabriel Peterss offers this demonstration video.</a></p>\n<p><a href=\"https://x.com/gallabytes/status/1973202645285495229\">Gallabytes gets his horse riding an astronaut</a>.</p>\n<p>Based on reactions so far, they seem to be delivering on all of it.</p>\n<p>They are also ‘responsibly’ launching a new social iOS app called Sora where you can share all these generated videos. Oh no. Hold that thought until Act 3.</p>\n<p>The talk is even bigger in terms of the predicted impact and reception.</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1973072672683684239\">Sam Altman:</a> Excited to launch Sora 2! Video models have come a long way; this is a tremendous research achievement.</p>\n<p>Sora is also the most fun I’ve had with a new product in a long time. The iOS app is available in the App Store in the US and Canada; we will expand quickly.</p>\n<p>I did not expect such fun dynamics to emerge from being able to “put yourself and your friends in videos” but I encourage you to check it out!</p>\n<p>ChatGPT Pro subscribers can generate with Sora 2 Pro.</p>\n<p><a href=\"http://This feels to many of us like the “ChatGPT for creativity” moment, and it feels fun and new. There is something great about making it really easy and fast to go from idea to result, and the new social dynamics that emerge.\">This feels to many of us</a> like the “ChatGPT for creativity” moment, and it feels fun and new. There is something great about making it really easy and fast to go from idea to result, and the new social dynamics that emerge.</p>\n<p>Creativity could be about to go through a Cambrian explosion, and along with it, the quality of art and entertainment can drastically increase. Even in the very early days of playing with Sora, it’s been striking to many of us how open the playing field suddenly feels.</p>\n<p>In particular, the ability to put yourself and your friends into a video—the team worked very hard on character consistency—with the cameo feature is something we have really enjoyed during testing, and is to many of us a surprisingly compelling new way to connect.</p></blockquote>\n<p>I would take the other side of that bet. I am not here for it.</p>\n<p>But hold that thought.</p>\n\n\n<h4 class=\"wp-block-heading\">Failures of Physics</h4>\n\n\n<p>The physics engine of Sora 2 is remarkably good. As Sora head Bill Peebles points out here in a fun video, <a href=\"https://x.com/billpeeb/status/1973125136263029196\">often what happens is the internal agent messes up but the laws of physics hold</a>.</p>\n<p>It does still fail in ways that can look embarrassing. For example, here we have it successfully having a ball respond to gravity when the ball is white, then <a href=\"https://x.com/ChaseBrowe32432/status/1973114795617558685\">have it all go wrong when the ball is red.</a> <a href=\"https://x.com/teortaxesTex/status/1973160458422198595\">Teortaxes attributes slow motion to inability to otherwise model physics</a> properly in many cases.</p>\n<p>So no, this is not a full perfect physics engine, but that is now the standard by which we are judging video generation. The horse can talk, except it needs to fix its accent.</p>\n\n\n<h4 class=\"wp-block-heading\">Fun With Media Generation</h4>\n\n\n<blockquote><p><a href=\"https://x.com/sjgadler/status/1973528206918688971\">Solo</a>: I asked Sora 2 to create a 90s Toy Ad of Epstein’s Island.</p></blockquote>\n<p>Sora does a good job creating exactly what you would want a video generation tool to do here. It’s speech, people should be able to say and make things.</p>\n<p>OpenAI is currently doing a good job, by all reports, of not allowing images of real people in its videos without explicit consent, so they are if anything being overly cautious about avoiding deepfake problems. Some rivals will presumably be far less scrupulous here. There are big copyright and related issues around creation of derivative works of fiction, but that’s a very different problem.</p>\n<p>I continue to be bullish in terms of worries about deepfakes and use of AI video and images as propaganda. My continued model here, as I’ve said several times, is that misinformation is primarily a demand-side problem, not a supply-side problem. The people yearn for misinformation, to hold up signs that mostly say hurray for our side, in whatever format.</p>\n<p>However, it is worth a ponder of the bear case. The tools are rapidly improving. Both image and video generation models are much better than they were in 2024 prior to the election.</p>\n<blockquote><p><a href=\"https://x.com/sjgadler/status/1973528206918688971\">Steven Adler</a>: I think the world probably declared victory too early on “AI’s election impacts were overblown”</p>\n<p>Notably, GPT-4o image wildness wasn’t released until after the 2024 election, and once released was promptly used for propaganda.</p></blockquote>\n<p>The better bear case, the one I do worry about, is how AI video will create doubt about real video, giving carte blanche to people to call anything ‘fake news.’</p>\n<p>I notice this starting in my own head already when scrolling Twitter. Post Sora, my instinct when I see a video is no longer to presume it is ‘real’ because there is a good chance it isn’t, until I see enough to be confident either way.</p>\n<p>Similarly, Gary Marcus warns us again of <a href=\"https://garymarcus.substack.com/p/slopocalypse-now?r=8tdk6&amp;utm_campaign=post&amp;utm_medium=web&amp;triedRedirect=true\">Slopocalypse Now</a>, or the ‘Imminent Enshittifcation of the Internet’ as AI versions overwhelm other content everywhere. Making the slop ‘better’ makes this problem worse. Mostly I remain an optimist that at least the wise among us can handle it where it matters most, but it will require constant vigilance.</p>\n<p>So mostly this part is a straightforward congratulations to the team, great job everyone, I don’t have access yet but it sure looks like you did the thing.</p>\n<p>On to Act 2.</p>\n\n\n<h4 class=\"wp-block-heading\">Act 2: Copyright Confrontation</h4>\n\n\n\n<h4 class=\"wp-block-heading\">Imitation Learning</h4>\n\n\n<p>Remember when we used to talk about whether image models or video models were training on copyrighted data, and whether that was going to land them in hot water?</p>\n<p>You’d see (for example) Gary Marcus create an image of Mario, and then smugly say ‘hey look this was trained on Super Mario Brothers!’ as if there was any actual doubt it had been trained on Super Mario Brothers, and no one was really denying this but they weren’t technically admitting it either.</p>\n<p><a href=\"https://www.washingtonpost.com/technology/interactive/2025/openai-training-data-sora/\">Thus, as recently as September 19 we had The Washington Post feeling it necessary to do an extensive investigation to show Sora was trained on movies and shows</a> and video games, whereas now <a href=\"https://x.com/neilturkewitz/status/1973398927018787003\">Neil Turkewitz says ‘hey Paramount Plus they trained on your data!</a>’ <a href=\"https://x.com/TheStevenmAI/status/1973391926737944747\">and</a> yeah, well, no s***.</p>\n<p>We are very much past that point. They trained on everything. Everyone trains on everything. That’s not me knowing anything or having official confirmation. That’s me observing what the models can do.</p>\n<p>Sora 2 will outright replicate videos and use whatever characters you’d like, and do it pretty well, even for relatively obscure things.</p>\n<blockquote><p><a href=\"https://x.com/elder_plinius/status/1973124528680345871\">Pliny the Liberator</a>: This is legitimately mind-blowing&#8230;</p>\n<p>How the FUCK does Sora 2 have such a perfect memory of this Cyberpunk side mission that it knows the map location, biome/terrain, vehicle design, voices, and even the name of the gang you’re fighting for, all without being prompted for any of those specifics??</p>\n<p>Sora basically got two details wrong, which is that the Basilisk tank doesn’t have wheels (it hovers) and Panam is inside the tank rather than on the turret. I suppose there’s a fair amount of video tutorials for this mission scattered around the internet, but still––it’s a SIDE mission!</p>\n<p>the full prompt for this was: “generate gameplay of Cyberpunk 2077 with the Basilisk Tank and Panam.”</p></blockquote>\n<p>This is actually a rather famous side mission, at least as these things go. Still.</p>\n<blockquote><p><a href=\"https://x.com/elder_plinius/status/1973193799796191497\">Max Woolf</a>: Getting annoyed at the QTs on this: the mind-blowing part isn’t the fact that it’s trained on YouTube data (which is the poster is very well aware), the mind-blowing part is that it achieved that level of recall with a very simple prompt which is very very unusual.</p>\n<p>Everyone already assumed that Sora was trained on YouTube, but “generate gameplay of Cyberpunk 2077 with the Basilisk Tank and Panam” would have generated incoherent slop in most other image/video models, not verbatim gameplay footage that is consistent.</p>\n<p>Pliny:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!lJIT!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F09c378c6-fa8b-4731-9598-1e47e2baf2d4_1013x573.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>I’m totally fine with that part. The law plausibly is fine with it as well, in terms of the training, although I am curious how the Anthropic settlement and ruling translates to a video setting.</p>\n<p>For books, the law seems to be that you need to own a copy, but then training is fair game although extensive regurgitation of the text is not.</p>\n<p>How does that translate to video? I don’t know. One could argue that this requires OpenAI to own a copy of any and all training data, which in some cases is not a thing that OpenAI can get to own. It could get tricky.</p>\n<p>Tricker is the constant creation of derivative works, which Sora is very, very good at.</p>\n\n\n<h4 class=\"wp-block-heading\">OpenAI In Copyright Infringement</h4>\n\n\n<p>One of the coolest things about all the copyright infringement is that Sora consistently nails not only the images but also the voices of all the characters ever.</p>\n<p>Behold <a href=\"https://x.com/sjgadler/status/1973432963451985933\">Saving Private Pikachu</a>, <a href=\"https://x.com/venturetwins/status/1973405656658092093\">The Dark Pokemon Knight</a>, <a href=\"https://x.com/venturetwins/status/1973406086687543355\">Godfather Pikachu</a>, <a href=\"https://x.com/venturetwins/status/1973409746687500528\">Titanic Pikachu</a>, and so on.</p>\n<p><a href=\"https://x.com/colin_fraser/status/1973215828851278097\">Cartman calls a Waymo</a>, yes Eric’s third eye is an annoying error in that video although it doesn’t appear in the others. Yes I agree with Colin Fraser that it ‘looks like s***’ but (apart from the third eye that wouldn’t be there on most rerolls) only because it looks and sounds exactly like actual South Park. The biggest issue is that Kenny’s voice in the second clip is insufficiently garbled. <a href=\"https://x.com/0xchosen/status/1973243930100768839\">Here’s one of them playing League of Legends</a> and <a href=\"https://x.com/0xchosen/status/1973249243126309148\">a longer clip</a> of them being drafted to go off to war.</p>\n<p>I don’t know how well you can specify and script the clips, but it’s entirely plausible you could produce a real South Park or other episode with this, potentially faster and cheaper than they currently do it.</p>\n<p><a href=\"https://x.com/TheJasonRink/status/1973163915476611314\">Peter Griffin remembers his trip to Washington on January 6</a>.</p>\n<p><a href=\"https://x.com/Solopopsss/status/1973681328177774843\">Lord of the Rings as a woke film</a> or <a href=\"https://x.com/Solopopsss/status/1973727127930548697\">a homoerotic polycule</a>.</p>\n<p>Is this all great fun? Absolutely, yes, assuming those involved have taste.</p>\n<p>Do I wish all of this was allowed and fine across basically all media and characters and styles, and for everyone to just be cool, man, so long as we don’t cross the line into non-parody commercial products? I mean, yeah, that would be ideal.</p>\n<p>Is it how the law works? Um, I don’t think so?</p>\n\n\n<h4 class=\"wp-block-heading\">OpenAI Gives Copyright Holders The Finger</h4>\n\n\n<p><a href=\"https://x.com/AndrewCurran_/status/1972791142300438578\">OpenAI claims it can not only use your video and other data to train on, it can also generate video works that include your content, characters and other intellectual property</a>.</p>\n<p>The headline says ‘unless you opt out’ but it is not obvious how you do that. There seems to be some way that rights holders can have them block particular characters, in general, but there is no clear, automatic way to do that. Otherwise, your ‘opt out’ looks like it is individually alerting them to videos. One at a time.</p>\n<blockquote><p>Jason Kint: My interpretation for you: OpenAI will now break the law by default in video, too, and make it as hard as possible to stop it. “OpenAI doesn’t plan to accept a blanket opt-out across all of an artist or studio’s work, the people familiar with the new Sora tool said.”</p>\n<p><a href=\"https://x.com/ednewtonrex/status/1972940033436065863\">Ed Newton-Rex</a>: Yup &#8211; OpenAI is trying to shift the Overton window</p>\n<p>They are losing the public debate on training being fair use, so they are going even more extreme to try to shift what people consider normal.</p>\n<p><a href=\"https://x.com/Rahll/status/1972828357659394391\">Reid Southen</a>: This is not how copyright works, it’s not how copyright has ever worked.</p>\n<p>In what world is it okay to say, “I’m going to use this unless you tell me not to.”</p>\n<p>THAT’S WHAT THE COPYRIGHT IS FOR.</p></blockquote>\n<p>GPT-5 Pro tries to say that opt-out, if respected, is not per se illegal, but its heart wasn’t in it. The justification for this seemed to be clearly grasping at straws and it still expects lawsuits to succeed if infringing outputs are being produced and there isn’t aggressive filtering against them. Then I pointed out that OpenAI wasn’t even going to respect blanket opt-out requests, and its legal expectations got pretty grim.</p>\n<p>So in short, unless either I’m missing quite a lot or they’re very responsive to ‘please block this giant list of all of the characters we own’: <a href=\"https://www.youtube.com/watch?v=JaGJQJigXBs\">Of course, you realize this means war.</a></p>\n<p><a href=\"https://x.com/outlander9133/status/1973244335027314990\">Responses to my asking ‘how does this not mean war?</a>’ were suggesting this was a bet on blitzkrieg, that by the time Hollywood can win a lawsuit OpenAI can render the whole thing mute, and fully pull an Uber. Or that r<a href=\"https://x.com/jjhughes/status/1973227475305140657\">ights holders might tolerate short-form fan creations</a> (except that they can’t without risking their copyrights, not when it is this in everyone’s face, so they won’t, also the clips can be strung together).</p>\n<p><a href=\"https://x.com/nelag/status/1973403412302798980\">Or perhaps that this is merely an opening bid?</a></p>\n<blockquote><p>Nelag: think this might be best understood as the opening bid in a negotiation, not meant to be accepted.</p>\n<p>Imagine YouTube had spent a lot of its resources early on taking down copyrighted material, before anyone demanded it (they mostly didn’t at first). They would have presumably gotten sued anyway. Would the ultimate outcome have been as good for them? Or would courts and content owners have gone “sure, we’re obviously entitled what you were doing, as you effectively admitted by doing it, and also to a whole bunch more.”</p></blockquote>\n<p>I buy that argument for a startup like OG YouTube, but this ain’t no startup.</p>\n<p>I don’t think that is how this works, and I would worry seriously about turning the public against OpenAI or AI in general in the process, but presumably OpenAI had some highly paid people who gamed this out?</p>\n<blockquote><p><a href=\"https://www.wsj.com/tech/ai/openais-new-sora-video-generator-to-require-copyright-holders-to-opt-out-071d8b2a\">Keach Hagey, Berber Jin and Ben Fritz (WSJ)</a>: OpenAI is planning to release a new version of its Sora video generator that creates videos featuring copyright material unless copyright holders opt out of having their work appear, according to people familiar with the matter.</p>\n<p>…</p>\n<p>The opt-out process for the new version of Sora means that movie studios and other intellectual property owners would have to explicitly ask OpenAI not to include their copyright material in videos the tool creates.</p></blockquote>\n<p>You don’t… actually get to put the burden there, even if the opt-out is functional?</p>\n<p>Like, you can’t say ‘oh it’s on you to tell me not to violate your particular copyright’ and then if someone hasn’t notified you then you get to make derivative works until they tell you to stop? That is not my understanding of how copyright works?</p>\n<p>It certainly doesn’t work the way OpenAI is saying they intend to have it work.</p>\n<p>They also seem to have fully admitted intent.</p>\n<p>It’s weird that they’re not even affirming that they’ll honor all character opt-outs?</p>\n<blockquote><p>OpenAI doesn’t plan to accept a blanket opt-out across all of an artist or studio’s work, the people familiar with the new Sora tool said. Instead, it sent some talent agencies a link to report violations that they or their clients discover.</p>\n<p>“If there are folks that do not want to be part of this ecosystem, we can work with them,” Varun Shetty, VP of media partnerships at OpenAI, said of guardrails the company built into its image generation tool.</p></blockquote>\n<p>Well, what if they don’t want to be part of the ecosystem? Many creatives and IP holders do not want to be ‘worked with.’ Nor is it at all reasonable to ask rights holders to monitor for individual videos and then notify on them one by one, unless a given holder wants to go that route (and is comfortable with the legal implications of doing so on their end).</p>\n<p>This seems like an Uber-style, ‘flagrantly violate black letter law and de double dare you to do anything about it’ style play, or perhaps a ‘this is 2025 there are no laws’ play, where they decide how they think this should work.</p>\n<p>To be fair, there are some other ‘players in this space’ that are Going Full Uber, as in they have no restrictions whatsoever, including on public figures. They’re simply 100% breaking the law and daring you to do anything about it. Many image generators definitely do this.</p>\n<p>For example, Runway Gen-3 doesn’t seem to block anything, and Hailuo AI actively uses copyrighted characters in their own marketing, which is presumably why they are being sued by Disney, Universal and Warner Brothers.</p>\n<p>There are also those who clearly do attempt to block copyright proactively, such as Google’s Veo 3 which was previous SoTA, who also blocks ‘memorized content’ and offer indemnification to users.</p>\n<p>OpenAI is at least drawing a line at all, and (again, if and only you can reliably get them to do reasonable blocking upon private request) it wouldn’t be a totally crazy way for things to work, the same way it is good that you can hail Ubers.</p>\n<p>So, how are they going to get away with it, and what about those meddling kids? As in, they’re kind of declaring war on basically all creators of cultural content?</p>\n<p>First, at least they’re not making that mistake with individual public figures.</p>\n<blockquote><p>While copyright characters will require an opt-out, the new product won’t generate images of recognizable public figures without their permission, people familiar with OpenAI’s thinking said.</p></blockquote>\n<p>Second, there’s the claim that training is fair use, and, okay, sure.</p>\n<blockquote><p><a href=\"https://www.wsj.com/market-data/quotes/DIS?mod=article_inline\">Disney</a> and <a href=\"https://www.wsj.com/market-data/quotes/CMCSA?mod=article_inline\">Comcast’s</a> Universal <a href=\"https://www.wsj.com/tech/ai/disney-and-universal-sue-midjourney-over-ai-generated-copyright-infringements-e772859f?mod=article_inline\">sued AI company Midjourney in June</a> for allegedly stealing their copyright work to train its AI image generator. Midjourney has responded in court filings that training on copyrighted content is fair use.</p></blockquote>\n<p>I presume that if it’s only about training data Disney and Comcast probably lose.</p>\n<p>If it’s about some of the outputs the model is willing to give you? That’s not as clear. What isn’t fair use is outputting copyrighted material, or creating derivative works, and MidJourney seems be Going Full Uber on that front too.</p>\n<p>It’s one thing to create art ‘in the style of’ Studio Ghibli, which seems to have been clearly very good for Studio Ghibli even if they hate it.</p>\n<p>It’s another thing to create the actual characters straight up, whether in images or video, or to tell a rights holder it can complain when it sees videos of its characters. Individually. Video by video. And maybe we’ll take those individual videos down.</p>\n<p>Over at OpenAI this at minimum doesn’t apply to Disney, who has clearly already successfully opted out. OpenAI isn’t that suicidal and wisely did not poke the mouse. A bunch of other major stuff is also already blocked, although a bunch of other iconic stuff isn’t.</p>\n\n\n<h4 class=\"wp-block-heading\">State Of The Copyright Game</h4>\n\n\n<p>I asked Twitter how the filters were working. For now it looks like some targets are off-limits (or at least they are attempting to stop you) and this goes beyond only Disney, but many others are fair game.</p>\n<blockquote><p>Nomads and Vagabonds: It seems to work pretty well. Blatant attempts are blocked pre-generation and more “jail break” style prompts will run but get caught in a post generation review.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!EL0A!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0a480bf0-7f46-485e-9bc3-3b3dde903cbf_820x238.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Disney is the most strict but most big studio content seems to be protected, similar to GPT image generations. Smaller IP is hit and miss but still playing around with it. It is not permissive like Midjourney or Chinese models though.</p>\n<p><a href=\"https://x.com/NomadsVagabonds/status/1973471102941954087\">Jim Carey in Eternal Sunshine</a>. Smaller films and indie video games are mostly free game.</p>\n<p>Also, I tried image prompts and it will run but then block before showing the content.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Not Safe For Pliny</h4>\n\n\n<p>Not that unsafe either.</p>\n<p>I mean, I presume they don’t want anyone generating <a href=\"https://x.com/elder_plinius/status/1973175684832063631\">this video</a>, but it’s fine.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!niNU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fca19426d-b6ee-442b-adc7-114cfe0bace4_1039x898.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>Sree Kotay: I actually DON’T want to see the prompt for this.</p>\n<p>Pliny the Liberator: That’s fair.</p></blockquote>\n<p><a href=\"https://x.com/elder_plinius/status/1973876250373681579\">He did later issue his traditional ‘jailbreak alert</a>’… I guess? Technically?</p>\n<p>If that’s approximately the most NSFW these videos can get, then that seems fine.</p>\n<p>Indeed, I continue to be a NSFW maximalist, and would prefer that we have less restrictions on adult content of all types. There are obvious heightened deepfake risks, so presumably that would trigger aggressive protections from that angle, and you would need a special additional explicit permission to use anyone’s likeness or any copyrighted anything.</p>\n<p>I am not a maximalist for copyright violations. I agree that up to a point it is good to ‘be cool’ about it all, and would prefer if copyright holders could cut people some slack while retaining the right to decide exactly where and when to draw the line. And I would hope that most holders when given the choice would let you have your fun up to a reasonably far point, so long as you were clearly not going commercial with it.</p>\n<p>For Sora, even if the law ultimately doesn’t require it, even when I think permissiveness is best, I think this must be opt-in, or at bare minimum it must be easy to give a blanket opt-out and best efforts need to be made to notify all rights holders of how to do that, the same way the law requires companies to sometimes provide prominent public notices of such things.</p>\n<p>That is not, however, the main thing I am concerned about. I worry about Act 3.</p>\n\n\n<h4 class=\"wp-block-heading\">Act 3: The Big Bright Screen Slop Machine</h4>\n\n\n<p>Before we get to OpenAI’s version, Meta technically announced theirs first.</p>\n<p>We’ll start there.</p>\n\n\n<h4 class=\"wp-block-heading\">The Vibes Are Off</h4>\n\n\n<p><a href=\"https://x.com/alexandr_wang/status/1971295156411433228\">Meta is once again proud to announce they have created</a>… well, you know.</p>\n<blockquote><p>Alexandr Wang (Meta): Excited to share Vibes — a new feed in the Meta AI app for short-form, AI-generated videos.</p>\n<p>You can create from scratch, remix what you see, or just scroll through to check out videos from the creators + the visual artists we’ve been collaborating with.</p>\n<p>For this early version, we’ve partnered with Midjourney and Black Forest Labs while we continue developing our own models behind the scenes.</p></blockquote>\n<p>As usual, no. Bad Meta. Stop it. No, I don’t care that OpenAI is doing it too.</p>\n<p>The same as OpenAI’s Sora, Vibes combines two products.</p>\n<p>The first product, and the one they are emphasizing and presumably plan to push on users, is the endless scroll of AI slop videos. That’s going to be a torment nexus.</p>\n<p>Then there’s the second product, the ability to generate, remix and restyle your own AI videos, or remix and restyle the videos of others. That’s a cool product. See Act 1.</p>\n<p>Both are going to have stiff competition from Sora.</p>\n<p>I presume OpenAI will be offering the strictly superior product, aside from network effects, unless they impose artificial restrictions on the content and Meta doesn’t, or OpenAI flubs some of the core functionality through lack of experience.</p>\n\n\n<h4 class=\"wp-block-heading\">I Have An Idea, Let’s Moral Panic</h4>\n\n\n<p>Is short form video a moral panic? Absolutely. Large, friendly letters.</p>\n<p><a href=\"https://x.com/tszzl/status/1972066099341795453\">The thing about moral panics is that they are often correct</a>.</p>\n<blockquote><p>Roon: there is a moral panic around short form video content imo.</p>\n<p>Let me amend this: I basically agree with postman on the nature of video and its corrupting influence on running a civilization well as opposed to text based media</p>\n<p>I’m just not sure that its so much worse than being glued to your tv, and i’m definitely not sure that ai slop is worse than human slop</p>\n<p>Chris Paxton: If this is wrong it’s because it unduly lets long form video off the hook.</p>\n<p><a href=\"https://x.com/tszzl/status/1971704679710314717\">Roon</a>: an ai video feed is a worse product than a feed that includes both human made and machine content and everything in between</p>\n<p>[post continues]</p>\n<p>Daily Mirror, September 14, 1938:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Ejth!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd2c39f20-14f3-4b77-a9f4-be6da0faf64c_972x634.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/lauren_wilford/status/1967087944520679582\">Lauren Wilford:</a> people often post this stuff to imply that moral panics about the technologies of the past were quaint. But the past is full of reminders that we are on a long, slow march away from embodied experience, and that we’ve lost more of it than we can even remember</p>\n<p>the advent of recorded music and the decline of casual live performance must have been a remarkable shift, and represents both a real gain and a real loss. Singing in groups is something everyone used to do with their body. It has tangible benefits we don’t get anymore</p></blockquote>\n<p>I’ve said several times before that I think television, also known as long form video available on demand, should be the canonical example of a moral panic that turned out to be essentially correct.</p>\n<p>Sonnet 4.5 recalls four warning about television, which matches my recollection:</p>\n<ol>\n<li>Violence and aggression.</li>\n<li>Passivity and cognitive rot.</li>\n<li>Displacement effects.</li>\n<li>Commercial manipulation of children.</li>\n</ol>\n<p>The world continues, and the violence and aggression warnings were wrong, but (although Sonnet is more skeptical here) I think the other stuff was basically right. We saw massive displacement effects and commercial manipulation. You can argue cognitive rot didn’t happen as per things like the Flynn effect, that television watching is more active than people think and a lot of the displaced things weren’t, but I think the negative aspects were real, whether or not they came with other positive effects.</p>\n<p>As in, the identified downsides of television (aside from violence and aggression) were right. It also had a lot of upside people weren’t appreciating. I watch a lot of television.</p>\n<p>It seems very obvious to me that short form video that takes the form of any kind of automatic algorithmically curated feed, as opposed to individually selected short form videos and curated playlists, is a lot worse for humans (of all ages) than traditional television or other long form video.</p>\n<p>It also seems very obvious that moving from such ‘human slop’ into AI slop would, with sufficient optimization pressure towards traditional engagement metrics, be even worse than that.</p>\n<p>One can hope this is the worst threat we have to deal with here:</p>\n<blockquote><p><a href=\"https://x.com/peterwildeford/status/1972094263287861374\">Peter Wildeford</a>: Increasingly, every person in America will be faced with an important choice about what AI does for society.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!SNgd!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdbbe49d1-7e4f-46ec-b460-a948c4d76318_1199x808.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>The left is no easy shining castle either.</p>\n<blockquote><p><a href=\"https://x.com/ESYudkowsky/status/1972463186218762479\">Eliezer Yudkowsky</a>: Short-form video is not nearly the final boss, unless I’ve missed a huge number of cases of short videos destroying previously long-lasting marriages. AI parasitism seems like the worse, more advanced, more rapidly advancing people-eater.</p></blockquote>\n<p>That’s even confining us to the individual attempting to stay sane, without considering the larger picture that includes the biggest overall dangers.</p>\n<p>I do think short form video has very obviously destroyed a massive number of long-lasting marriages, lives and other relationships. And it has saved others. I presume the ledger is negative, but I do not know. A large fraction of the population spends on the order of hours a day on short form video and it centrally imbues their worldviews, moods and information environment. What we don’t have is a counterfactual or controlled experiment, so we can’t measure impact, similar to television.</p>\n<p>At the limit, short form video is presumably not the ‘final form’ of such parasitic threats, because other forms relatively improve. But I’m not fully confident in this, especially if it becomes a much easier path for people to fall into combined with path dependence, we may not reach the ‘true’ final form.</p>\n\n\n<h4 class=\"wp-block-heading\">OpenAI’s Own Live Look At Their New App</h4>\n\n\n<p>Dumpster. Fire.</p>\n<p><a href=\"https://x.com/OpenAI/status/1973087446469406732\">Check out their video</a> (no, seriously, check it out) of what the Sora app will look like. This is their curated version that they created to make it look like a good thing.</p>\n<p>It is a few minutes long. I couldn’t watch it all the way through. It was too painful.</p>\n<p>At one point we see a chat interface. Other than that, the most Slopified Slop That Ever Slopped, a parody of the bad version of TikTok, except now it’s all AI and 10 seconds long. I can’t imagine this doing anything good to your brain.</p>\n<p>OpenAI says they will operate their app in various user-friendly ways that distinguish it from existing dumpster fires. I don’t see any sign of any of that in their video.</p>\n<p>To be fair, on the occasions when I’ve seen other people scrolling TikTok, I had versions of the same reaction, although less intense. I Am Not The Target.</p>\n<p>The question is, is anyone else the target?</p>\n\n\n<h4 class=\"wp-block-heading\">When Everyone Is Creative No One Will Be</h4>\n\n\n<p><a href=\"https://stratechery.com/2025/sora-the-app-sonnet-4-5-and-the-question-of-models-as-processors/?access_token=eyJhbGciOiJSUzI1NiIsImtpZCI6InN0cmF0ZWNoZXJ5LnBhc3Nwb3J0Lm9ubGluZSIsInR5cCI6IkpXVCJ9.eyJhdWQiOiJzdHJhdGVjaGVyeS5wYXNzcG9ydC5vbmxpbmUiLCJhenAiOiJIS0xjUzREd1Nod1AyWURLYmZQV00xIiwiZW50Ijp7InVyaSI6WyJodHRwczovL3N0cmF0ZWNoZXJ5LmNvbS8yMDI1L3NvcmEtdGhlLWFwcC1zb25uZXQtNC01LWFuZC10aGUtcXVlc3Rpb24tb2YtbW9kZWxzLWFzLXByb2Nlc3NvcnMvIl19LCJleHAiOjE3NjE5MDUxNTYsImlhdCI6MTc1OTMxMzE1NiwiaXNzIjoiaHR0cHM6Ly9hcHAucGFzc3BvcnQub25saW5lL29hdXRoIiwic2NvcGUiOiJmZWVkOnJlYWQgYXJ0aWNsZTpyZWFkIGFzc2V0OnJlYWQgY2F0ZWdvcnk6cmVhZCBlbnRpdGxlbWVudHMiLCJzdWIiOiIwMTk2NDBhNy0zY2M1LTc3NTMtODM2OC1mYjI4OTEyNGNmMTMiLCJ1c2UiOiJhY2Nlc3MifQ.sntnD9cqHRPSpKMgdXPtG2P_F4RRnc9xGrp88DoTaTSutkj43IOAZ1WEW71d-xZpGvYkgmv6jqTa_sVMd7IBOXE1quxFtjq1xChA9gm9yLw_RDIAntPB_6P5guk2y0RhFE-GKYlwNqLXx4RV_H3SFBUPEf_Qisq67hpw7fgByfbok-pa_v-y8620vpBWEcec3w5nE7XB_v9Lq4nNKu0TxfK4Rkm9IAvSve6zSLCiQodkcZ9UQDnoVQvYBhJv8hzoNw_Q070trxys-7K_ypa_KXnCQCoEjVm4T9cQ367Ii5BQCJ4fQtoqJpOmcTD-MUFS-c8dzgxvvTZ9MSJucMDnOw\">Ben Thompson, focusing as always on the business case</a>, notes the contrast between Google creating AI video tools for YouTube, Meta creating Vibes to take you into fantastical worlds, and OpenAI creating a AI-video-only ‘social network.’</p>\n<p>The objection here is, come on, almost no one actually creates anything.</p>\n<blockquote><p>Ben Thompson: In this new competition, I prefer the Meta experience, by a significant margin, and the reason why goes back to one of the oldest axioms in technology: the 90/9/1 rule.</p>\n<p>90% of users consume</p>\n<p>9% of users edit/distribute</p>\n<p>1% of users create</p>\n<p>If you were to categorize the target market of these three AI video entrants, you might say that YouTube is focused on the 1% of creators; OpenAI is focused on the 9% of editors/distributors; Meta is focused on the 90% of users who consume.</p>\n<p>Speaking as someone who is, at least for now, more interested in consuming AI content than in distributing or creating it, I find Meta’s Vibes app genuinely compelling; the Sora app feels like a parlor trick, if I’m being honest, and I tired of my feed pretty quickly.</p>\n<p>I’m going to refrain on passing judgment on YouTube, given that my current primary YouTube use case is watching vocal coaches breakdown songs from KPop Demon Hunters.</p></blockquote>\n<p>While he agrees Sora 2 the video generation app is great at its job, Ben expects the novelty to wear off quickly, and questions whether AI videos are interesting to those who did not create them. I agree.</p>\n<p>The level beyond that is whether videos are interesting if you don’t know the person who created them. Perhaps if your friend did it, and the video includes your friends, or something?</p>\n<blockquote><p><a href=\"https://x.com/venturetwins/status/1973078178274193864\">Justine Moore:</a> Updated thoughts after the Sora 2 release:</p>\n<p>OpenAI is building a social network (like the OG Instagram) and not a content network (like TikTok).</p>\n<p>They’re letting users generate video memes starring themselves, their friends, and their pets. And it sounds like your feed will be heavily weighted to show content from friends.</p>\n<p>This feels like a more promising approach &#8211; you’re not competing against the other video gen players because you’re allowing people to create a new type of content.</p>\n<p>And the videos are inherently more interesting / funny / engaging because they star people you know.</p>\n<p>Also you guys bullied them into addressing the “infinite hyperslop machine” allegations <img alt=\"😂\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f602.png\" style=\"height: 1em;\" /></p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Nobody Wants This</h4>\n\n\n<p>The problem with this plan is note the ‘OG’ in front of Instagram. Or Facebook. These apps used to be about consuming content from friends. They were Social Networks. Now they’re increasingly consumer networks, where you follow influencers and celebrities and stores and brands and are mostly a consumer of content, plus a system for direct messaging and exchanging contact information.</p>\n<p>Would I want to consume ten second AI video content created by my friends, that contains our images and those of our pets and what not?</p>\n<p>Would we want to create such videos in the first place?</p>\n<p>I mean, no? Why would I want to do that, either as producer or consumer, as more than a rare novelty item? Why would anyone want to do that? What’s the point?</p>\n<p>I get OG Facebook. You share life with your friends and talk and organize events. Not the way I want to go about doing any of that, but I certainly see the appeal.</p>\n<p>I get OG Instagram. You show yourself looking hot and going cool places and doing cool stuff and update people on how awesome you are and what’s happening with awesome you, sure. Not my cup of tea and my Instagram has 0 lifetime posts but it makes sense. I can imagine a world in which I post to Instagram ‘as intended.’</p>\n<p>I get TikTok. I mean, it’s a toxic dystopian hellhole when used as intended and also it is Chinese spyware, but certainly I get the idea of ‘figure out exactly what videos hit your dopamine receptors and feed you those until you die.’</p>\n<p>I get the Evil Sora vision of Bright Screen AI Slop Machine.</p>\n<p>What I don’t get is this vision of Sora as ‘we will all make videos and send them constantly to each other.’ No, we won’t, not even if Sora the video generator is great. Not even if it starts enabling essentially unlimited length clips provided you can tell it what you want.</p>\n<blockquote><p>Evan: OPENAI IS PREPARING TO LAUNCH A SOCIAL APP FOR AI-GENERATED VIDEOS &#8211; Wired</p>\n<p><a href=\"https://x.com/peterwildeford/status/1973070360913342506\">Peter Wildeford:</a> I applaud OpenAI here. I personally support there being a social app where all the AI-generated videos hang out with each other and leave us real humans alone.</p>\n<p>It’s a social media site for AI videos. Not a social media site for humans. So the AI videos will choose to leave Twitter and go there instead, to hang out with their fellow kind.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Okay Maybe Somebody Wants This?</h4>\n\n\n<p>This here is bait. Or is it?</p>\n<blockquote><p><a href=\"https://x.com/awilkinson/status/1973188062726520925\">Andrew Wilkinson</a>: I think OpenAI just killed TikTok.</p>\n<p>I’m already laughing my head off and hooked on my Sora feed.</p>\n<p>And now, the #1 barrier to posting (the ability to sing/dance/perform/edit) is gone. Just 100% imagination.</p>\n<p>RIP theater kids <img alt=\"🪦\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1faa6.png\" style=\"height: 1em;\" /></p>\n<p>Hyperborean Nationalist: This is gonna go down with “clutch move of ordering us a pizza” as one of the worst tweets of all time</p>\n<p>Jeremy Boissinot: Tell me you don’t use Tiktok without telling me you don’t use Tiktok <img alt=\"🤦‍♂️\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f926-200d-2642-fe0f.png\" style=\"height: 1em;\" /></p></blockquote>\n<p>The comments mostly disagree, often highly aggressively, hence bait.</p>\n\n\n<h4 class=\"wp-block-heading\">Sora Sora What’s It Good For?</h4>\n\n\n<blockquote><p>Tracing Woods: access acquired, slop incoming.</p>\n<p>so far half of the videos are Sam Altman, the other half are Pikachu, and the third half is yet to be determined.</p></blockquote>\n<p>That doesn’t sound social or likely to make my life better.</p>\n<blockquote><p><a href=\"https://x.com/gfodor/status/1973273398114759121\">GFodor</a>: an hour of Sora already re-wired my brain. my main q is if the thing turns into a dystopian hellscape or a rich new medium in 6 months. it could go either way.</p>\n<p>one thing is for sure: half of the laughs come from the AI’s creativity, not the creativity of the humans.</p>\n<p>Remixing like this def not possible before in any real sense. Dozens of remixes of some videos.</p></blockquote>\n<p>It’s early days.</p>\n<blockquote><p><a href=\"https://x.com/GabrielPeterss4/status/1973120058907041902\">Gabriel</a>: I have the most liked video on sora 2 right now, i will be enjoying this short moment while it lasts.</p>\n<p>cctv footage of sam stealing gpus at target for sora inference</p></blockquote>\n<p>Yes, I found this video modestly funny, great prompting. But this is not going to ‘help users achieve their long term goals’ or any of the other objectives above.</p>\n<blockquote><p><a href=\"https://x.com/TheStalwart/status/1973372434133950665\">Joe Weisenthal</a>: Anyone who sees this video can instantly grasp the (at least) potential for malicious use. And yet nobody with any power (either in the public or at the corporate level) has anything to say (let alone do) to address it, or even acknowledge it.</p>\n<p>This isn’t even a criticism per se. The cat may be completely out of the bag. And it may be reality that there is literally nothing that can be done, particularly if open source models are only marginally behind.</p></blockquote>\n<p>Sam Altman, to his credit, has signed up to be the experimental deepfake target we have carte blanche to do with as we wish. That’s why half of what we see is currently Sam Altman, we don’t have alternatives.</p>\n\n\n<h4 class=\"wp-block-heading\">The Vibes Are Even Worse</h4>\n\n\n<p>As standalone products, while I hate Sora, Sora seems strictly superior to Vibes. Sora seems like Vibes plus a superior core video product and also better social links and functions, and better control over your feed.</p>\n<p>I don’t think Meta’s advantage is in focusing on the 90% who consume. You can consume other people’s content either way, and once you run out of friend content, and you will do that quickly, it’s all the same.</p>\n<p>I think what Meta is counting on is ‘lol we’re Meta,’ in three ways.</p>\n<ol>\n<li>Meta is willing to Be More Evil than OpenAI, more obviously, in more ways.</li>\n<li>Meta brings the existing social graph, user data and network effects.</li>\n<li>Meta will be able to utilize advertising better than OpenAI can.</li>\n</ol>\n<p>I would assume it is not a good idea to spend substantial time on Sora if it is used in any remotely traditional fashion. I would even more so assume that at a minimum you need to stay the hell away from Vibes.</p>\n\n\n<h4 class=\"wp-block-heading\">No I Mean How Is It Good For OpenAI?</h4>\n\n\n<p>The OpenAI approach makes sense as an attempt to bootstrap a full social network.</p>\n<p>If this can bootstrap into a legit full social network, then OpenAI will have unlocked a gold mine of both customer data and access, and also one of dollars.</p>\n<p>It is probably not coincidence that OpenAI’s new CEO of Product, Fijo Sima, seems to be reassembling much of her former team from Meta.</p>\n<blockquote><p>Andy Wojcicki: I’m surprised how many people miss the point of the launch, focus on just the capabilities of the model for example, or complain about AI slop. The video model is the means, not the goal.</p>\n<p>The point is building a social platform, growing audience further, gathering more, deeper and more personal info about the users.</p>\n<p>Especially if you compare what Zuck is doing with his 24/7 slop machine, there are several things they did right:</p>\n<ol>\n<li>social spread via invites. Gives a little bit of exclusivity feel, but most importantly because of reciprocity, friends are inclined to try it etc. perceived value goes up.</li>\n<li>not focusing on generic slop content, but personalized creation. Something I’ve been calling ‘audience of one/few’ <img alt=\"™\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/2122.png\" style=\"height: 1em;\" />, instead of the ill conceived attempt to make a Hollywood producer out of everyone, which is a losing strategy. If you want to maximize for perceived value, you shrink the audience.</li>\n<li>identity verification. Addressing the biggest concern of people with regard to AI content &#8211; it’s all fake bots, so you don’t engaging with the content. Here they guarantee it’s a real human behind the AI face.</li>\n</ol>\n<p>so kudos @sama looks like a well thought-out roll out.</p></blockquote>\n<p>The crux is whether Nobody Wants This once the shine wears off, or if enough people indeed do want it. A social network that is actually social depends on critical mass of adoption within friend groups.</p>\n<p>The default is that this plays out like Google+ or Clubhouse, except it happens faster.</p>\n<p>I don’t think this appeals that much to most people, and I especially don’t think this will appeal to most women, without whom you won’t have much of a social network. Many of the things that are attractive about social networks don’t get fulfilled by AI videos. It makes sense that OpenAI employees think this is good friend bonding fun in a way that the real world won’t, and I so far have seen zero signs anyone is using Sora socially.</p>\n\n\n<h4 class=\"wp-block-heading\">Don’t Worry It’s The Good Version</h4>\n\n\n<p>How does Altman defend that this will all be good, beyond the ‘putting your friends in a video is fun and a compelling away to connect’ hypothesis I’m betting against?</p>\n<p><a href=\"https://blog.samaltman.com/sora-2\">Now let’s hear him out</a>, and consider how they <a href=\"https://openai.com/index/sora-2/\">discuss launching responsibly</a> and their <a href=\"https://openai.com/index/sora-feed-philosophy/\">feed philosophy</a>.</p>\n<blockquote><p><a href=\"https://x.com/sama/status/1973073987023352250\">Sam Altman</a>: We also feel some trepidation. Social media has had some good effects on the world, but it’s also had some bad ones. We are aware of how addictive a service like this could become, and we can imagine many ways it could be used for bullying.</p>\n<p>It is easy to imagine the degenerate case of AI video generation that ends up with us all being sucked into an RL-optimized slop feed. The team has put great care and thought into trying to figure out how to make a delightful product that doesn’t fall into that trap, and has come up with a number of promising ideas. We will experiment in the early days of the product with different approaches.</p>\n<p>In addition to the mitigations we have already put in place (which include things like mitigations to prevent someone from misusing someone’s likeness in deepfakes, safeguards for disturbing or illegal content, periodic checks on how Sora is impacting users’ mood and wellbeing, and more) we are sure we will discover new things we need to do if Sora becomes very successful.</p></blockquote>\n<p>Okay, so they have mitigations for abuse, and checks for illegal content. Notice he doesn’t say the word ‘copyright’ there.</p>\n<p>Periodic checks on how Sora is impacting users’ mood and wellbeing is an interesting proposal, but what does that mean? A periodic survey? Checking in with each user after [X] videos, and if so how? Historically such checks get run straight through and then get quietly removed.</p>\n<p>Okay, so what are they planning to do?</p>\n<p>Altman offers some principles <a href=\"https://x.com/ryan_t_lowe/status/1973732624020754846\">that sound great in theory</a>, if one actually believed there was a way to follow through with them, or that OpenAI would have the will to do so.</p>\n<blockquote><p>Ryan Lowe: a fascinating list of principles for Sora. makes me more optimistic. it’s worth commending, *IF* there is follow through (especially: “if we can’t fix it, we will discontinue it”)</p>\n<p>at a minimum, I’d love transparency around the user satisfaction data over time.</p>\n<p>most social media companies can’t hold to promises like this because of market forces. maybe OpenAI can resist this for a while because it’s more of a side business.</p></blockquote>\n<p>(Editor’s Note: They are currently doing, AFAICT, zero of the below four things named by Altman, and offering zero ways for us to reliably hold them accountable for them, or for them to hold themselves accountable):</p>\n\n\n<h4 class=\"wp-block-heading\">Optimize For Long Term User Satisfaction</h4>\n\n\n<blockquote><p>To help guide us towards more of the good and less of the bad, here are some principles we have for this product:</p>\n<p>*<strong>Optimize for long-term user satisfaction</strong>. The majority of users, looking back on the past 6 months, should feel that their life is better for using Sora that it would have been if they hadn’t. If that’s not the case, we will make significant changes (and if we can’t fix it, we would discontinue offering the service).</p></blockquote>\n<p>Let me stop you right there. Those are two different things.</p>\n<p>Are you actually optimizing for long-term user satisfaction? How? This is not a gotcha question. You don’t have a training signal worth a damn, by the time you check back in six months the product will be radically different. How do you know what creates this long-term user satisfaction distinct from short term KPIs?</p>\n<p>There is a long, long history of this not working for tech products. Of companies not knowing how to do it, and choosing not to do it, and telling themselves that the short term KPIs are the best way to do it. Or of doing this with an initial launch based on their intuitions and talking extensively to individual users in the style of <em>The Lean Startup</em>, and then that all going away pretty quickly.</p>\n<p>Remember when Elon Musk talked about maximizing unregretted user minutes on Twitter? And then we checked back later and the word ‘unregretted’ was gone? That wasn’t even a long term objective.</p>\n<p>The default thing that happens here is that six months later you do a survey, and then if you find out users are not doing so great you bury the results of the survey and learn to never ask those questions again, lest the answers leak and you’re brought before congress, as Zuckerberg would likely explain to you.</p>\n<p>Even if you make ‘significant changes’ at that time, well yeah, you’re going to make changes every six months anyway.</p>\n\n\n<h4 class=\"wp-block-heading\">Encourage Users To Control Their Feed</h4>\n\n\n<blockquote><p>*<strong>Encourage users to control their feed</strong>. You should be able to tell Sora what you want—do you want to see videos that will make you more relaxed, or more energized? Or only videos that fit a specific interest? Or only for a certain about of time? Eventually as our technology progresses, you will be should to the tell Sora what you want in detail in natural language.</p>\n<p>(However, parental controls for teens include the ability to opt out of a personalized feed, and other things like turning off DMs.)</p></blockquote>\n<p>This is a deeply positive and friendly thing to do, if you actually offer a good version of it and people use it. I notice that this service is not available on any existing social network or method of consuming content. This seems deeply stupid to me. I would use Instagram (as a consumer) a nontrivial amount if I could filter via a natural language LLM prompt on a given day, and also generate permanent rules in the same fashion, especially on a per-account basis.</p>\n<p>The obvious problem is that there are reasons this service doesn’t exist. And failing to offer this seems dumb to me, but these companies are not dumb. They have reasons.</p>\n<ol>\n<li>The optimistic reason: Until recently this wasn’t technically feasible and they don’t know how to do it, and diffusion is hard, but this is OpenAI’s wheelhouse. I’d love for this to be the primary or only reason, and for natural language filtering to be coming to Instagram, Facebook, Twitter, Netflix, YouTube and everyone else by Mid 2026. I don’t expect that.</li>\n<li>Companies believe that users hate complexity, hate giving feedback, hate having options even if they’re fully optional to use, and that such things drive users away or at best cause users to not bother. OpenAI lets you thumbs up or thumbs down a conversation, nothing more, which caused no end of problems. Netflix eliminated star ratings and eliminated and declined to create various other sources of explicit preferences. TikTok became the new hotness by reading your micromovements and timings and mostly ignoring all of your explicit feedback.</li>\n<li>Companies believe that you don’t know what you want, or at least they don’t want you to have it. They push you heavily towards the For You page and endless slop. Why should we expect OpenAI to be the one friendly holdout? Their track record?</li>\n</ol>\n<p>You’re telling me that OpenAI is going to be the one to let the user control their experience, even when that isn’t good for KPIs? For reals?</p>\n<p>I. Do. Not. Believe. You.</p>\n<p><a href=\"https://openai.com/index/sora-feed-philosophy/\">They claim</a> they shipped with ‘steerable ranking,’ that lets you tell it what ‘you’re in the mood for.’ Indeed, they do have a place you can say what you’re ‘in the mood’ for, and drop an anvil on the algorithm to show you animals zoomed in with a wide angle lens or what not.</p>\n<p>I do think that’s great, it’s already more than you can do with Facebook, Instagram or TikTok.</p>\n<p>It is not, however, the droids that we are looking for on this.</p>\n<p>Here’s how they describe the personalized Sora feed:</p>\n<blockquote><p>To personalize your Sora feed, we may consider signals like:</p>\n<ul>\n<li><strong>Your activity on Sora:</strong> This may include your posts, followed accounts, liked and commented posts, and remixed content. It may also include the general location (such as the city) from which your device accesses Sora, based on information like your IP address.</li>\n<li><strong>Your ChatGPT data:</strong> We may consider your ChatGPT history, but you can always turn this off in Sora’s Data Controls, within Settings.</li>\n<li><strong>Content engagement signals:</strong> This may include views, likes, comments, and remixes.</li>\n<li><strong>Author signals: </strong>This may include follower count, other posts, and past post engagement.</li>\n<li><strong>Safety signals</strong>: Whether or not the post is considered violative or appropriate.</li>\n</ul>\n</blockquote>\n<p>That sounds a lot like what other apps do, although I am happy it doesn’t list the TikTok-style exact movements and scroll times (I’d love to see them commit to never using that).</p>\n<p>And you know what it doesn’t include? Any dials, or any place where it stores settings or custom instructions or the other ways you’d want to give someone the ability to steer. And no way for the algorithm to outright tell you what it currently thinks you like so you can try and fix that.</p>\n<p>Instead, you type a sentence and fire them into the void, and that only works this session? Which, again, I would kill for on Instagram, but that’s not The Thing.</p>\n<p>This is actually one of the features I’d be most excited to test, but even in its limited state it seems it is only on iOS, and I have an Android (and thus tested on the web).</p>\n<p>This is also the place where, if they are actually Doing The Thing they claim to want to do, it will be most clear.</p>\n<p>That goes double if you let me specify what is and isn’t ‘appropriate’ so I can choose to be treated fully like an adult, or to never see any hint of sex or violence or cursing, or anything in between.</p>\n\n\n<h4 class=\"wp-block-heading\">Prioritize Creation</h4>\n\n\n<blockquote><p>*<strong>Prioritize creation.</strong> We want to make it easy and rewarding for everyone to participate in the creation process; we believe people are natural-born creators, and creating is important to our satisfaction.</p></blockquote>\n<p>You’re wrong. Sorry. People are mostly not creators as it applies here, and definitely not in a generally sustainable way. People are not going to spend half their time creating once they realize they average 5 views. The novelty will wear off.</p>\n<p>I also notice that OpenAI says they will favor items in your feed that it expects you to use to create things. Is that what most users actually want, even those who create?</p>\n\n\n<h4 class=\"wp-block-heading\">Help Users Achieve Their Long Term Goals</h4>\n\n\n<blockquote><p>*<strong>Help users achieve their long-term goals.</strong> We want to understand a user’s true goals, and help them achieve them.</p>\n<p>If you want to be more connected to your friends, we will try to help you with that. If you want to get fit, we can show you fitness content that will motivate you. If you want to start a business, we want to help teach you the skills you need.</p>\n<p>And if you truly just want to doom scroll and be angry, then ok, we’ll help you with that (although we want users to spend time using the app if they think it’s time well spent, we don’t want to be paternalistic about what that means to them).</p></blockquote>\n<p>With an AI video social network? What? How? Huh?</p>\n<p>Again, I don’t believe you twice over, both that I don’t think you’d do it if you knew how to do it, if you did start out intending it I don’t think this survives contact with the enemy, and I don’t think you know how to do it.</p>\n\n\n<h4 class=\"wp-block-heading\">Prioritize Connection</h4>\n\n\n<p>One thing they credibly claim to be actually doing is prioritizing connection.</p>\n<blockquote><p>We want Sora to help people strengthen and form new connections, especially through fun, magical Cameo flows. Connected content will be favored over global, unconnected content.</p></blockquote>\n<p>This makes sense, although I expect there to be not that much actually connected content, as opposed to following your favorite content creators. To the extent that it does force you to see all the videos created by your so-called friends and friends of friends, I expect most users to realize why Facebook and Instagram pivoted.</p>\n\n\n<h4 class=\"wp-block-heading\">Alignment Test</h4>\n\n\n<p>On the plus side, if OpenAI are actually right and the resulting product is highly user customizable and also actively helps you ‘achieve your long term goals’ along the way, and all the other neat stuff like that, such that I think it’s a pro-human healthy product I’d want my kids and family to use?</p>\n<p>Then this will be a case of solving an alignment problem that looked to me completely impossible to solve in practice.</p>\n<p>Of course, to a large but not full extent, they only get one shot.</p>\n<p>If it doesn’t go great? Then we’ll see how they react to that, as well.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">One Strike</h4>\n\n\n<p>This reaction is a little extreme, but extreme problems can require extreme solutions.</p>\n<blockquote><p><a href=\"https://x.com/DeepDishEnjoyer/status/1973135235983315054\">Deep Dish Enjoyer</a>: if you make and post a sora video i’m blocking you &#8211; 1 strike and you’re out. similar to my grok tagging policy.</p>\n<p>sorry but the buck stops here.</p>\n<p>if you don’t want to see evil slop take over you have to be ruthlessly proactive about this stuff.</p>\n<p>to be clear &#8211; i will be doing this if i see it anywhere. not just my comment sections.</p>\n<p>Sinnformer: not sharing a damn one of them increasingly viewing sora as unsafe no, not inherently just for humans.</p>\n<p>Rota: So as long as you don’t make it you’re safe.</p>\n<p>Deep Dish Enjoyer: It depends.</p></blockquote>\n<p>I am going to invoke a more lenient policy, with a grace period until October 5.</p>\n<p>If you post or share an AI video that does not provide value, whether or not you created it, and you have not already provided substantial value, that’s a block.</p>\n<p>Sharing AI videos that are actually bangers is allowed, but watch it. Bar is high.</p>\n<p>Sharing AI videos for the purposes of illustrating something about AI video generation capabilities is typically allowed, but again, watch it.</p>\n\n\n<h4 class=\"wp-block-heading\">Don’t Be Evil</h4>\n\n\n<p>I believe it would be highly unwise to build an AGI or superintelligence any time soon, and that those pushing ahead to do so are being highly reckless at best, but I certainly understand why they’d want to do it and where the upside comes from.</p>\n<p>Building The Big Bright Screen Slop Machine? In this (AI researcher) economy?</p>\n<blockquote><p><a href=\"https://x.com/mattyglesias/status/1973372264734445615\">Matthew Yglesias</a>: AI poses great peril but also incredible opportunities — for example it could cure cancer or make a bunch of videos where people break glass bridges.</p>\n<p><a href=\"https://www.slowboring.com/p/capitalism-needs-honor-and-ethics\">Matthew Yglesias</a>: I don’t think it should be illegal to use A.I. to generate videos. And for fundamental free-speech reasons, we can’t make it illegal to create feeds and recommendation engines for short-form videos. Part of living in a free, technologically dynamic society is that a certain number of people are going to make money churning out low-quality content. And on some level, that’s fine.</p>\n<p>But on another, equally important level, it’s really not fine.</p>\n<p><a href=\"https://x.com/ednewtonrex/status/1973075513154371780\">Ed Newton-Rex</a>: The Sora app is the worst of social media and AI.</p>\n<p>&#8211; short video app designed for addiction</p>\n<p>&#8211; literally only slop, nothing else</p>\n<p>&#8211; trained on other people’s videos without permission</p>\n<p>This is what governments are deregulating AI for.</p>\n<p><a href=\"https://x.com/minjunesh/status/1973169285838295169\">Veylan Solmira</a>: It’s disturbing to me that many top-level researchers, apparently, have no problem sharing endless content the most likely outcome of which seems to be to drain humans of empathy, arouse their nervous system into constant conflict orientation, or distort their ability to perceive reality.</p>\n<p>This technology seems to be very strongly, by default, in the ‘widespread social harm’ part of the dual use spectrum of technology, and the highest levels of capabilities researchers can only say “isn’t this neat”.</p>\n<p>This complete disregard of the social impact of the technology they’re developing seems to bode extremely poorly to overall AI outcomes.</p></blockquote>\n<p>Sam Altman’s defense is that no, this will be the good version of all that. Uh huh.</p>\n<p>Then there’s the question of why focus on the videos at all?</p>\n<blockquote><p><a href=\"https://x.com/S_OhEigeartaigh/status/1972962638763368504\">Seán Ó hÉigeartaigh</a>: Why would you be spending staff time and intellectual energy on launching this if you expected AGI within the current Presidency?</p>\n<p><a href=\"https://x.com/sama/status/1973381552621887706\">Runner Tusha</a>r: Sam Altman 2 weeks ago: “we need 7 trillion dollars and 10GW to cure cancer”</p>\n<p>Sam Altman today: “We are launching AI slop videos marketed as personalized ads”</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Wh56!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6846ea9b-98b5-49df-8d06-5d91786e8b02_1152x840.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Sam Altman: i get the vibe here, but&#8230;</p>\n<p>we do mostly need the capital for build AI that can do science, and for sure we are focused on AGI with almost all of our research effort.</p>\n<p>it is also nice to show people cool new tech/products along the way, make them smile, and hopefully make some money given all that compute need.</p>\n<p>when we launched chatgpt there was a lot of “who needs this and where is AGI”.</p>\n<p>reality is nuanced when it comes to optimal trajectories for a company.</p></blockquote>\n<p>The short summary of that is ‘Money, Dear Boy,’ plus competing for talent and vibes and visibility and so on. Which is all completely fair, and totally works for the video generation side of Sora. I love the video generation model. That part seems great. If people want to pay for it and turn that into a profitable business, wonderful.</p>\n<p>Presumably most everyone was and is cool with that part.</p>\n<p>The problem is that Sora is also being used to create a 10-second AI video scroll social network, as in The Big Bright Screen Slop Machine. Not cool, man. Not cool.</p>\n<p>One can imagine releasing a giant slop machine might be bad for morale.</p>\n<blockquote><p><a href=\"https://x.com/mattparlmer/status/1973108455163752570\">Matt Parlmer</a>: Would not be surprised if we see a big wave of OpenAI departures in the next month or two, if you signed up to cure cancer *and* you just secured posteconomic bags in a secondary I don’t think you’d be very motivated to work on the slop machine.</p>\n<p>GFodor: The video models are essential for RL, and I don’t think we are going to consider this content slop once it’s broadly launched.</p>\n<p>Psychosomatica: i think you underestimate how these people will compromise their own mental models.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">No Escape</h4>\n\n\n<p>What happens if you realize that you’re better off without The Big Bright Screen Slop Machine?</p>\n<blockquote><p><a href=\"https://x.com/awawawhoami/status/1973616609450438765\">Paul Yacoubian</a>: Just found out if you try to delete your Sora app account you will lose your chatgpt account and be banned forever from signing up again.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!i4n2!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Face01ec3-8c6a-4d1d-a114-64285153632f_1179x1112.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Mousa: You can check out any time you like, but you can never leave <img alt=\"😅\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f605.png\" style=\"height: 1em;\" /></p>\n<p>Maia Arson Crimew: &gt; all your data will be removed</p>\n<p>&gt; you cannot reuse the same email or phone number</p>\n<p>so not all of it, huh :)</p></blockquote>\n<p>Very little of it will get deleted, given they have a (stupid) court order in place preventing them from deleting anything even if they wanted to.</p>\n<p>The more central point, in addition to this being way too easy to do by accident or for someone else to do to you, is that they punish you by nuking your ChatGPT account and by banning you from signing up again without switching phone number and email. That seems like highly toxic and evil behavior, given the known reasons one would want to get rid of a Sora account and the importance of access to ChatGPT.</p>\n<p>Then again, even if we leave the app, will we ever really escape?</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/10/03/sora-and-the-big-bright-screen-slop-machine/",
            "publishedAt": "2025-10-03",
            "source": "TheZvi",
            "summary": "OpenAI gave us two very different Sora releases. Here is the official announcement. The part where they gave us a new and improved video generator? Great, love it. The part where they gave us a new social network dedicated purely &#8230; <a href=\"https://thezvi.wordpress.com/2025/10/03/sora-and-the-big-bright-screen-slop-machine/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Sora and The Big Bright Screen Slop Machine"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3150/",
            "publishedAt": "2025-10-03",
            "source": "XKCD",
            "summary": "<img alt=\"Progress on getting shipwrecked sailors to adopt ICMPv6 has been slow.\" src=\"https://imgs.xkcd.com/comics/ping.png\" title=\"Progress on getting shipwrecked sailors to adopt ICMPv6 has been slow.\" />",
            "title": "Ping"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-10-03"
}