{
    "articles": [
        {
            "content": [
                "<p>The first cohort of ACX Grants was announced in <a href=\"https://www.astralcodexten.com/p/acx-grants-results\">late 2021</a>, the second in <a href=\"https://www.astralcodexten.com/p/acx-grants-results-2024\">early 2024</a>. In 2022, I posted <a href=\"https://www.astralcodexten.com/p/acx-grants-project-updates\">one-year updates</a> for the first cohort. Now, as I start thinking about a third round, I&#8217;ve collected one-year updates on the second and three-year updates on the first.</p><p>Many people said my request for updates went to their spam folder; relatedly, many people have not yet sent in their updates. If you&#8217;re a grantee who didn&#8217;t see my original email, but you do see this post, please fill in the update form <a href=\"https://forms.gle/41Vd18iFMu5R6c3Z7\">here</a>.</p><p>All quote blocks are the grantees&#8217; own words; text outside of quote blocks is my commentary.</p><h2><strong>First Cohort: Three Year Updates</strong></h2><p><strong>1: Discover Molecular Targets Of Antibiotics</strong></p><p>No update received this year, but see the 2022 update <a href=\"https://www.astralcodexten.com/p/acx-grants-project-updates\">here</a>.</p><p><strong>2: Ballot Proposition For Approval Voting In Seattle</strong></p><blockquote><p>We proposed an initiative to adopt \"approval voting\" for Seattle primaries. After the initiative qualified for the Nov 2022 ballot, the City Council added an alternative proposing \"instant-runoff voting\" (https://www.seattletimes.com/seattle-news/politics/competing-voting-reform-measures-make-seattles-november-ballot-after-city-council-oks-alternative/). While voting to do so, 3 councilmembers said that they hoped neither passed; one could see it as a way to prevent any election reform. Surprisingly, something did barely pass - the Council alternative (https://www.seattletimes.com/seattle-news/politics/will-seattle-move-to-ranked-choice-voting-margin-narrows-friday/). It will be used in 2027. Seattle uses \"nonpartisan blanket primaries,\" where all candidates appear on 1 ballot and 2 winners advance to the general (to run for 1 seat). For that situation, it's hard to guess whether this is better or worse than the status quo, or even which objective metrics to monitor. One metric might be the November 2027 Seattle general elections: unusually close general election results might indicate that the primary advanced 2 competitive candidates (who had to work for marginal votes), and less-close general elections - a blowout - might indicate the opposite.</p></blockquote><p>This one is confusing to evaluate; the specific proposal failed, it encouraged its opponents to create a distraction proposal to sabotage it, and the distraction proposal unexpectedly passed, meaning that Seattle did get a more interesting voting method after all (although unclear whether it&#8217;s good). Is this a &#8220;success&#8221; of our grant? </p><p><strong>3: Software To Validate New FDA Drug Trial Designs</strong></p><blockquote><p>Our plan was to build an auto-verifier for clinical trial designs, hoping to speed up part of the FDA review process for complex trials. Our small team got funding from the FTX Future Fund, and we formed a PBC. We improved our method's computational efficiency by ~7 orders of magnitude, bringing it into the range of plausible usefulness. We wrote open-source software and <a href=\"https://arxiv.org/abs/2212.10042\">a paper</a> and showed it to teams at FDA / EMA. They encouraged us to start off using it as a supplementary analysis in submissions ... </p><p>Then GPT-4 came out and shook up our AI timelines, and we hard-pivoted to AI safety and interpretability research. We rebranded as <a href=\"https://confirmlabs.org/\">Confirm Labs</a>, and did work on adversarial attacks and interpretability including <a href=\"https://arxiv.org/pdf/2407.17447\">here</a>, <a href=\"https://www.lesswrong.com/posts/NAYyHimM3FaDYLvEH/breaking-circuit-breakers\">here</a>, <a href=\"https://arxiv.org/abs/2402.01702\">here</a>, and <a href=\"https://confirmlabs.org/posts/TDC2023\">here</a>. Then Ben and I worked at Anthropic on <a href=\"https://transformer-circuits.pub/2025/attribution-graphs/methods.html\">the transformer circuits paper</a>. As of a few weeks ago, I have returned to open research</p></blockquote><p>ACX Grants (almost) always approves of pivoting to AI safety research, but I still wonder what might have been with the original project. Michael says that &#8220;The types of software projects in clinical trials that we were initially intending to do seem on track to fall to AI by 2030. We DID succeed at deriving new math techniques, and AI does not yet have a clear path to solving that kind of creative research-level math.&#8221;</p><p><strong>4: Alice Evans&#8217; Research On &#8220;The Great Gender Divergence&#8221;</strong></p><blockquote><p>Since 2022, Alice has undertaken qualitative research in nine world regions: Mexico, Costa Rica, Brazil, Morocco, Italy, Spain, Britain, US, Poland, Turkey, India, Uzbekistan, South Korea and Hong Kong. Through this globally comparative analysis, she analyses the drivers and obstacles to gender equality. Gender interventions will be more impactful if they target locally binding constraints - in the Middle East, North Africa and South Asia, this is \"the honour-income trade-off\" (whereby male honour depends on female seclusion, and women tend to remain at home. Meanwhile, Latin America and the Caribbean face a different obstacle: pervasive violence elevates femicides. Over the past few years, she's held visiting appointments at Stanford, Chicago, and Yale, while providing policy advice to the World Bank, and sharing insights with a public audience via Substack (www.ggd.world). In April 2025, she gave a TedTalk on romantic love as an under-rated driver of gender equality.</p></blockquote><p><strong>5: Develop Safer Immunosuppressants</strong></p><p>Trevor pivoted to trying to market the drugs in cats (who also get the relevant diseases) as proof-of-concept and a way to make enough money to be able to scale up to humans. He reports:</p><blockquote><p>We have two repurposed drugs that are clinical stage. The drug that's furthest along is boosted rapamycin, which we're using for chronic kidney disease in cats. We will have safety, stability, and pharmacokinetic data by July. Combined with the recent conditional approval of generic rapamycin for feline hypertrophic cardiomyopathy, this should put us in a good place to find a strategic partner. </p><p>That is, except for the tariffs and [disruption at the FDA], including firing almost everyone in the director's office of the Center for Veterinary Medicine. This pervasive uncertainty and handicapping of the FDA has made everything in animal and human medicine way more of a tossup than it normally is. And it's normally a serious tossup.</p><p>Nevertheless, we soldier on.</p></blockquote><p>In a later update, Trevor said that some of the regulatory issues have been resolved and he is feeling more optimistic.</p><p><strong>6: Promote Economically Literate Climate Policy In US States</strong></p><blockquote><p>It's been a rough few years for climate action in general, and for carbon pricing in particular, and state-level efforts have faced major headwinds. </p><p>The project did <a href=\"https://www.thecgo.org/research/carbon-taxes-without-tears/\">successfully identify potential opportunities</a> for pocketbook-friendly small-government climate action in a variety of states across the political spectrum. Those opportunities still exist but need more champions, e.g., in Utah (where I help lead <a href=\"http://DarnAir.org\">Clean The Darn Air</a>) we fell short of getting the signatures we needed to put a measure on the 2024 ballot to replace the state sales tax on grocery store food with a carbon tax. </p><p>But we are laying the groundwork for a 2028 effort, both in the ways one might expect and in one rather unexpected way: I put my background in stand-up comedy to work by writing a play (!). It's a romantic comedy set in the context of a carbon tax ballot measure effort in Utah, it premiered in July 2024 with six sold-out shows at the Great Salt Lake Fringe Festival (videos, scripts, and more at Yoram-Com.com), and I'm continuing to work hard on improving the script, with the goal/dream of bringing the show to colleges around Utah to promote the 2028 campaign. I also adapted it into a movie script and entered a climate screenplay competition funded by NRDC. I didn't win (congrats to <a href=\"https://www.nrdc.org/press-releases/nrdc-black-list-redford-center-nbcuniversal-and-caa-foundation-announce-recipients\">the folks who did</a>) but I will try again next year and have entered other competitions &#8230; that's a pretty good metaphor for all the work that I and others have done on carbon pricing: lots of initial promise, followed by setbacks, and we'll see what happens next!</p></blockquote><p>I don&#8217;t know which is weirder - that he wrote a romantic comedy about climate change activism, or that there are apparently enough people who do this that there&#8217;s a whole &#8220;climate screenplay competition&#8221; to find the best ones.</p><p>(note that no funder money was used to produce this play - it was a labor of love pursued separately)</p><p>When someone I was talking to at the recent ACX meetup mentioned that they were a climate activist, I brought up this funny story about how I knew a climate activist who wrote a screenplay about it. My interlocutor nodded as if this were the most normal thing in the world, and said that he himself had written a <a href=\"https://maxwyvernband.bandcamp.com/album/planet-and-sky\">climate activism rock opera</a>. </p><p>I think climate activism without an associated musical theater component is an underexplored cause area, and would be interested in helping incubate this field.</p><p><strong>7: Repository / Search Engine For Forecasting Questions</strong></p><blockquote><p>metaforecast.org is still online and occasionally mantained. We added dashboards at metaforecast.org/dashboards, but they didn't take off. However, mantaining it for the last couple of years has been costly. It's api is at &lt;https://metaforecast.org/api/graphql&gt; but these days perhaps &lt;https://docs.adj.news/&gt; is a better alternative, since the mantainer behind it has more energy (but that might change).</p></blockquote><p><strong>8: Help [Anonymous] Interview For A Professorship</strong></p><p>[Anonymous] got their professorship and is now leading AI safety research at a good university.</p><p><strong>9: Mobile Slaughterhouses To Prevent African Swine Fever</strong></p><p>No update received this year, but see the 2022 update <a href=\"https://www.astralcodexten.com/p/acx-grants-project-updates\">here</a>.</p><p><strong>10: Hazard Labeling For Endocrine Disruptors</strong></p><blockquote><p>The project is going reasonably well, if slowly. We are in the balloting process (peer review) for publication of IEEE standard IEEE 3173, and hope to publish later in 2025. This has taken a few years, but that's not an unusually lengthy period, given the time it takes to prepare standards.</p></blockquote><p><strong>11: Develop Oxfendazole As A New Deworming Medication</strong></p><blockquote><p>Drug development is a highly regulated process; it is not glitzy. But this necessary path to bring a new medicine to deworming efforts world-wide is no the less important because of having to follow a prescribed pathway. To this end and because of the largesse of donors, we have completed several nonclinical studies on oxfendazole itself, on its physical chemical properties, and on its potential for toxicity in a rodent and a non-rodent species. </p><p>These studies support our clinical work, following successful completion of two Phase I studies. We are presently collaborators on three Phase II efficacy studies taking place in Peru on three different parasitic diseases, an approach to ascertain the range (in terms of disease and dose) of oxfendazole&#8217;s efficacy. </p><p><em>Trichuris trichiura </em>- Funded by NIH and conducted in the Peruvian Amazon by the Peruvian nonprofit Asociaci&#243;n Ben&#233;fica PRISMA, this field trial is the first clinical study of oxfendazole&#8217;s efficacy in human patients. This clinical trial has been live since the fall of 2024. ODG is a collaborator in this study and will have full access to the study results to support the development of oxfendazole. (NCT04713787) </p><p><em>Fasciola hepatica </em>- With ODG co-founder Hugo Garcia, MD PhD as PI, this outpatient trial in patients with Fasciola hepatica is funded extramurally by NIH. ODG is supporting several aspects of this study including by serving as the US Agent for interactions with the US FDA for the study and will have access to the results to support the advancement of oxfendazole (NCT06367361). </p><p><em>Neurocysticercosis </em>- With ODG co-founder Hugo Garcia, MD PhD as PI, this multicenter clinical trial on patients hospitalized with neurocysticercosis is funded extramurally by NIH. ODG is supporting several aspects of this study, including by serving as the US Agent for interactions with the US FDA for the study and will have access to the results to support the advancement of oxfendazole. (NCT06565507)</p><p>Although clinical trials are ongoing, new funding is needed for nonclinical work, especially reproductive and development toxicology studies, best conducted concurrently with Phase II clinical studies.</p></blockquote><p><strong>12: Biosecurity And Existential Safety Lobbying In Australia</strong></p><p>This is one of my favorite projects - a veteran Australian lobbyist was a prolific ACX commenter, and we gave them an exploratory grant to start an organization there. After some trial and tribulations, this turned into <a href=\"https://www.goodancestors.org.au/\">Good Ancestors</a>. More updates on what they&#8217;ve been doing lately in the 2024 grants section.</p><p><strong>13: A Gel That Can Heal The Brain After Strokes</strong></p><p>No update received this year. Their <a href=\"https://seguralab.duke.edu/our-publications/\">website</a> and <a href=\"https://x.com/seguralab?lang=en\">Twitter account</a> list many recent publications and accomplishment, but it&#8217;s hard to assess what they all mean on the pathway from academia to clinical use. I found <a href=\"https://chatgpt.com/share/6846c857-4d00-8001-b32c-86ba947785ff\">o3&#8217;s summary of their progress</a> helpful; it suggests that they continue to refine the material and are a couple of years away from an IND application and a couple more years after that from human use. This is a pretty average pace for a medical device of this complexity.</p><p><strong>14: Survey To Understand Public Attitudes Around Human Challenge Trials</strong></p><blockquote><p>This project has now concluded with the publication of a paper in PLOS ONE titled &#8220;<a href=\"https://pubmed.ncbi.nlm.nih.gov/39436878/\">Ethical Acceptability of Human Challenge Trials: Consultation with the US Public and with Research Personnel</a>.&#8221; The authors conducted an online survey to assess overall support or opposition to HCTs, as well as the key factors influencing perceptions of their ethical acceptability. The findings suggest broad support among both the US public and research personnel for the use of HCTs in developing vaccines, treatments, and advancing scientific knowledge. The two most influential factors in determining ethical acceptability were the level of risk to participants and their understanding of that risk.</p></blockquote><p>This is great and the paper is great, but is also a microcosm of what I find frustrating about grantmaking. Will this paper change anyone&#8217;s mind? Will it lead to human challenge trials being more likely to happen? I assume yes, because 1DaySooner have proven to be generally smart people who know what they&#8217;re doing, but it&#8217;s hard to measure effects even now when we know exactly what the end product was.</p><p><strong>15: Rapid Replications Of New Psychology Papers</strong></p><blockquote><p>At Transparent Replications (<a href=\"https://replications.clearerthinking.org\">https://replications.clearerthinking.org</a>), a project of <a href=\"http://ClearerThinking.org\">ClearerThinking.org</a>, we conduct careful replications of new papers in top psychology journals with the goals of improving the reliability of academic psychology and helping the field produce more value for the world. Additionally, we completed a survey of 100 academic psychologists to understand their views on the field, what they believe has improved, what still needs to improve, and what actions would improve it. By conducting this work, we've developed new ideas that we believe are important for improving the field, and that apply in other scientific disciplines as well. In particular: </p><p>(1) Importance Hacking We believe that \"Importance Hacking\" is the next frontier for improving social science. This is a term we coined to describe something we observed again and again in our replications, whereby studies with little to no value get published in top journals due to the use of strategies that lead reviewers to misinterpret the work. More precisely, Importance Hacking occurs when a researcher gets a result that is actually not interesting, not important, and not valuable, but writes about it in such a way that reviewers are convinced it is interesting, important, and/or valuable so that it gets published. Despite it not having a name until we coined one for it (though it's related to some more general terms like \"hype\"), in our survey of academic psychologists, they rated Importance Hacking as a problem that is at as important as p-hacking (which is widely regarded as the cause of the replication crises) by one measure, and even MORE important than p-hacking by a second measure. In our replication work, we also have found that Importance Hacking is a bigger problem now than p-hacking (whereas we believe that 15 years ago we would have found p-hacking to be far more common than we're finding now). For more about Importance Hacking, see: <a href=\"https://www.clearerthinking.org/post/importance-hacking-a-major-yet-rarely-discussed-problem-in-science\">https://www.clearerthinking.org/post/importance-hacking-a-major-yet-rarely-discussed-problem-in-science </a></p><p>(2) Simplest Valid Analysis Through our replication work, we've come to realize that top journals often publish papers that only do complex analyses when much simpler analyses could have been done, which would have been a valid way to analyze the results. When this happens during our replications, we do the analysis both ways, and we've found that doing so is a fruitful way to uncover serious problems in research that reviewers missed. Therefore, our general guidance is that reviewers should require that the Simplest Valid Analysis be reported in papers, even when a more complex analysis is conducted. And our survey of academic psychologists shows that most of them agree with us on this recommendation, despite this not being standard practice. For more about the Simplest Valid Analysis, see: <a href=\"https://replications.clearerthinking.org/simplest-valid-analysis/\">https://replications.clearerthinking.org/simplest-valid-analysis/</a></p></blockquote><p>I feel bad about this one - even though I funded it and try to follow Spencer, I somehow missed that they&#8217;ve been up and running for years, <a href=\"https://archive.is/frXLH\">got a Vox article about them</a>, and completed replication attempts on eleven important psychology papers. Nine of the eleven replicated successfully. In my defense, Spencer does way too many things and there&#8217;s no way for a normal human to keep track of all of them.</p><p>Among the most interesting are <a href=\"https://replications.clearerthinking.org/replication-2023nature618/\">a replication of The Illusion Of Moral Decline</a> (I wrote a post criticizing the original study <a href=\"https://www.astralcodexten.com/p/is-there-an-illusion-of-moral-decline\">here</a>, but on purely conceptual grounds - I never doubted that the actual work was done honestly and correctly) and of <a href=\"https://replications.clearerthinking.org/replication-2022psci33-12/\">the shared visual Mandela Effect</a>, where everyone seems to collectively believe the same false things about visual signs like corporate logos (eg that there was a cornucopia in the Fruit of the Loom symbol). Both replicated fine.</p><p>I&#8217;d be interested in hearing from research psychologists about whether this project is well-known in your field, and how effective it actually is about keeping you guys honest.</p><p><strong>16: Research Neural Representation Of Precision Weighting</strong></p><p>The researcher discovered that this was harder than expected, and would require more work than we could realistically fund, so he pivoted to something else and returned the money. I appreciate his honesty.</p><p><strong>17: Crowdfight - A Platform To Create Scientific Collaborations</strong></p><blockquote><p><a href=\"https://crowdfight.org/\">Crowdfight </a>is a platform to facilitate scientific collaborations, especially high-value collaborations that would not emerge naturally. We aim to transform the way scientists see collaboration, from the current mutually beneficial view where both collaborators must be interested in the project to a more altruistic one, where one scientists helps in the project of another scientist. These collaborations are relatively to establish and very productive, typically costing very little to the scientist who helps, and adding a lot of value to the project. We operate by receiving requests from scientists who look for help in their project, and finding suitable matches with the adequate expertise. The ACX grant covers our operating costs, allowing us to offer this service for free to the scientific community.</p></blockquote><p><strong>18: David Bahry Re-Orienting And Doing Further Research Before A PhD</strong></p><p>No response this time, but <a href=\"https://www.astralcodexten.com/p/acx-grants-project-updates\">last update</a> David discussed some of the research he completed, and <a href=\"https://www.linkedin.com/in/david-bahry-8208568a/\">his LinkedIn</a> suggests that he&#8217;s started a PhD program in the biology of aging at the University of Buffalo. Congratulations (or condolences), David!</p><p><strong>19: A Wiki On Forecasting</strong></p><p>No response. <a href=\"https://forecasting.wiki/wiki/Main_Page\">The Wiki</a> continues to exist, but is not very active.</p><p><strong>20: Microbes From Beetles That Can Digest Plastics</strong></p><blockquote><p>We raised Tenebtio molitor larvae &#8220;mealworms&#8221; on wheat bran diets mixed with polyethylene (PE) or polystyrene (PS) for three generations, then harvested the gut bacteria living inside the insects. After growing those microbes in the lab, we tested whether the bacteria could oxidize microscopic plastic beads by watching for a color change in 96 well plates containing redox dye. We were able to isolate twenty bacteria capable of oxidizing plastic and fourteen of these (14) were from the PE-fed mealworms. We also profiled the entire gut community using 16s gene sequencing. Firmicutes was the most abundant phylum in each treatment (parental: 83%, control: 88%, PE: 97%, PS: 89%) with Bacilli being the most prevalent class (parental: 84%, control: 76%, PE: 93%, PS: 64%). Plastic addition seems to favor strains capable of biodegradation. The full pre-print is available here: <a href=\"https://www.biorxiv.org/content/10.1101/2024.10.16.618709v1\">https://www.biorxiv.org/content/10.1101/2024.10.16.618709v1</a>. The manuscript is currently in revision. It was submitted to PLoS ONE, however the reviewers requested more wet lab work, specifically gravimetric mass loss and/or Fourier Transform Infrared spectroscopy. We cannot complete these assays within the time frame allotted for revisions. We plan to use the publication fees to carry out the requested wet lab work for a future publication. We will add some life history and immunology data we collected to the current manuscript and resubmit to another journal.</p></blockquote><p>Professor. K adds: </p><blockquote><p>If you know any microbiology specialists, please connect me. One of our problems is the microbial isolations. We culture the bacteria in a broth media where plastic is the primary carbon source, but have to isolate the morphological species on soy agar. I think the bacteria lose genes related to plastic metabolism during this process. However, our efforts to create a sterile agar with plastic as the only source of carbon haven't been successful because of different melting temperatures and volatility of plastic solvents.</p></blockquote><p>If that&#8217;s you, email me at scott@slatestarcodex.com and I&#8217;ll put you in touch.</p><p><strong>21: Support For ALLFED&#8217;s Disaster Modeling</strong></p><p>No response. More information about ALLFED as a whole and their progress <a href=\"https://forum.effectivealtruism.org/posts/8gKkHPKbiPHq7tpTb/allfed-s-2024-highlights-1\">here</a>.</p><p><strong>22: Creating Intelligent Tutoring Systems</strong></p><blockquote><p>The original plan was to build a system that would take in a student answer as free-text and automatically apply the right feedback from a list of known feedbacks, with UI support for human review and extension. The idea is that doing so would hit a sweet spot missed by previous generations of intelligent tutoring systems, bypassing the \"200 hours of development for 1 hour of material\" curse that had kept the field from delivering the educational revolution to more than a small subset of students in a small subset of subjects [&#8230;]</p><p>Now we're 2.5 years into the Age of AI, and the original idea seems very quaint. But not all was lost. Pieces of the UI code were used to create the <a href=\"http://hoare-logic-tutor.mirdin.com\">Hoare Logic Tutor</a>. As we continued to discuss using this general-purpose educational AI to grow from our niche we found an exciting opportunity in specialized educational AI: codebase learning. So in a way, this grant was directly causal of the founding of <a href=\"https://up-to-speed.ai/\">UpToSpeed</a>, a venture-backed startup helping the world learn codebases 4x faster, starting with blockchain security auditors. Read more about what we've been working on at <a href=\"https://x.com/0xjimmyk/status/1873357324229984677\">https://x.com/0xjimmyk/status/1873357324229984677</a></p></blockquote><p><strong>23: Start A Biosecurity Center At Stanford</strong></p><p>This group thinks their project went well, but asks to keep details private.</p><p><strong>24: In Vitro Gametogenesis Startup</strong></p><blockquote><p><a href=\"https://www.ivynatal.com/science.html\">Our project</a> has made significant progress in inducing meiosis in arbitrary cell types, a critical step in gametogenesis. We've successfully identified and validated key transcription factors (STRA8, etc.) that drive meiotic gene expression in human cells, with our experiments demonstrating consistent activation of downstream meiotic genes including SYCP3, SYCP2, PRDM9 and SMC1B. Using nucleofection techniques and small molecule treatments, we've optimized protocols that enhance meiotic gene expression up to 800-fold in iPSCs and primary cells. Our RNA-seq analysis has identified specific induction conditions that most effectively initiate the meiotic program, and we're currently refining our protocols to achieve complete meiotic progression to full completion to generate recombinant haploids.</p></blockquote><p>The only grant evaluator who I trust to know what this means recently started a competing company, so I will just have to hope that all of this is good. </p><p>According to their website, they seem to be pivoting to polygenic selection for cows, saying that &#8220;our technology will increase breeding rates by 10-100x, [making cows orders of magnitude more productive] in a couple of years.&#8221; This is a clever strategy I haven&#8217;t seen anyone try yet.</p><p><strong>25: Sue Factory Farms That Are Illegally Abusing Chickens</strong></p><blockquote><p>Legal Impact for Chickens (LIC) is so grateful to ACX for launching us, and to all the ACX readers who have supported us! Thus far, LIC has filed four lawsuits: (1) Smith v. Vachris, the shareholder derivative case against Costco&#8217;s executives for chicken neglect, which was mentioned in The Washington Post, Fox Business, CNN Business, Meatingplace, and a viral TikTok. (2) LIC v. Case Farms, a cruelty suit against a major KFC supplier, which is currently pending before the North Carolina Court of Appeals. (3) Animal Outlook v. Harvey&#8217;s Market, which successfully stopped a DC butcher shop from selling foie gras. And (4) LIC v. Alexandre, a cruelty suit against an abusive dairy, which is currently pending before a California court. LIC has also sponsored an undercover investigation of poultry-giant Foster Farms, leading to a currently ongoing sheriff&#8217;s-office investigation. LIC got a California caterer to drop foie gras with a simple cease-and-desist letter. And LIC established a new potential avenue to create consequences for animal abuse: through an amicus brief at sentencing for the violation of another law. LIC also received a recommendation from Animal Charity Evaluators!</p></blockquote><p>I always ask if there&#8217;s any other way I can help these charities. Legal Impact For Chickens wants me to advertise that if any of you are in the poultry industry and want to turn whistleblower, you should <a href=\"https://www.legalimpactforchickens.org/\">get in touch with them</a>.</p><p><strong>26: M&#8217;s CRISPR Spellchecking Project</strong></p><p>Still waiting to see whether I&#8217;m allowed to share anything about this publicly.</p><p><strong>27: Open Source Vaccines</strong></p><p>No update. RaDVaC&#8217;s <a href=\"https://radvac.org/\">site</a> doesn&#8217;t mention anything from after 2022. There is no public news suggesting that they still exist.</p><p>They do have a Discord, where they claim to still be working on things including a &#8220;vaccine factory in a tube&#8221;, but I am bearish on mystery projects coordinated via small private Discords. Several of them have <a href=\"https://mindfirst.foundation/\">pivoted to AI safety</a>.</p><p>I get the impression that they made a cool COVID vaccine, didn&#8217;t overcome the regulatory/ethical/practical challenges to deployment, mostly fizzled out after COVID became less exciting, and are now a collection of small passion projects. In retrospect, I think I should have been able to predict this before the original grant, and my theory of change was overly optimistic.</p><p><strong>28: Platform For Psychiatric Drug Screening</strong></p><p>No update received. I did hear from this team last year, when they said they'd succeeded in making something exciting and were going to spin it off into a startup, but they didn't respond to followup questions and I can't find the startup.</p><p><strong>29: Citizen Surveillance Of Pathogens In Drinking Water</strong></p><blockquote><p>Our research team created, filmed, and publicized an <a href=\"http://www.uswaterstudy.org/collect/\">in-depth citizen science sampling protocol</a> for opportunistic pathogens in engineered drinking water systems. </p><p>We then responded to home investigation requests in 2022 for two residents: a) one hospitalized with COVID-19 and later diagnosed with Legionnaires' disease (a type of pneumonia and leading cause of waterborne disease and deaths in the US) in Harrisonburg, VA, and b) another with Acanthamoeba keratitis (a rare eye infection) in a South Carolina town. Specifically, we packed and shipped sampling kits, probes, and instruction booklets/videos, and remotely assisted residents with measuring relevant water quality parameters, taking accurate water and biofilm swab samples, and shipping those back to our laboratory. Our team used quantitative and digital droplet PCR (qPCR/ddPCR) to test for Legionella pneumophila and Acanthamoeba bacteria. We did not find these pathogens at meaningful levels, although in at least the Harrisonburg case, the resident had followed CDC Legionella prevention guidance after a prior positive Legionella detection by increasing their water heater temperature, which could have contributed to successful remediation. The results were <a href=\"https://doi.org/10.1021/acsestwater.4c00090\">published in the scientific journal ACS ES&amp;T Water</a>. ACX funding provided partial support for the lead PhD student, supplies, analysis, and shipping costs. </p><p>Testing for opportunistic pathogens in drinking water plumbing remains expensive, complex, and out of reach for many Americans. This project generated test protocols and lessons learned for researchers and laboratories to build capacity and increase public access to testing for (relatively) rare pathogens in treated drinking water in the United States and globally.</p></blockquote><p><strong>30: Writing Forecasting Questions For EA Organizations</strong></p><p>No update this time, but from last cycle: &#8220;Nathan Young has since gotten much larger grants to do much more exciting forecasting work, particularly a platform for generating forecasting questions. With my approval, he&#8217;s put my grant on the back burner while he works on other things, but he still hopes to get some questions up on Manifold or Metaculus sometime.&#8221;</p><p><strong>31: Mass Appraisal Models To Promote A Georgist Land Value Tax</strong></p><p>Wires got crossed in asking for an update here, but luckily they&#8217;ve succeeded enough to leave a public trail: this project became the land valuation company <a href=\"https://www.valuebase.co/\">Valuebase</a>, worth <a href=\"https://creti.org/funding/valuebase-closes-6-3-million-seed-round-led-by-narya-capital\">$14 million</a> with investments from <a href=\"https://creti.org/funding/valuebase-closes-6-3-million-seed-round-led-by-narya-capital\">Sam Altman</a>, <a href=\"https://creti.org/funding/valuebase-closes-6-3-million-seed-round-led-by-narya-capital\">Nat Friedman, and others</a>. Co-founder Lars Doucet left to work on the political advocacy side (see 2024 section), while other co-founder Will Jarvis remains at the company as CEO; you can read a recent interview with him <a href=\"https://www.urbanproxima.com/p/interview-will-jarvis-ceo-at-valuebase\">here</a> explaining why he thinks his work matters.</p><p><strong>32: A Robotic System For Automating Cell Culture Media Testing</strong></p><blockquote><p>When I was originally awarded the ACX Grant, I wanted to develop a system that would autonomously design and test cell culture media. A lot has happened since then. I met my co-founder, Gabe Warshauer-Baker, who switched from working on self-driving cars at Waymo to working on self-driving labs at our new startup, Dragonase (<a href=\"https://dragonase.com\">https://dragonase.com</a>). We believe that some of the most important challenges in anti-aging research are essentially culture media design problems, which we think we can solve. We have a couple of employees, and we now operate a small cell biology lab in Minneapolis and a small AI lab in Palo Alto. We've built an operational self-driving cell culture robot, and, although it's just a prototype, we're using it for stem cell expansion and rejuvenation experiments. All of this was seeded by the ACX Grant. Biology labs and GPUs are expensive, though, so additional support would help us a lot! Please contact us at contact@dragonase.com if you're interested.</p></blockquote><p><strong>33: SD&#8217;s Neutrino Research</strong></p><p>No update received.</p><p><strong>34: User-Created Prediction Markets</strong></p><blockquote><p><a href=\"https://manifold.markets/\">Manifold</a> is the largest social prediction market platform with over 150k user&#8209;created markets and more than 30&#8239;million trades.  Our markets have been featured here on ACX, in the NYT, Nate Silver&#8217;s latest book, and countless Substacks, podcasts, and tweets.  Forecasters, journalists, researchers, and casual users alike use Manifold to get accurate real-time odds on everything from elections to AI timelines to personal drama. </p></blockquote><p>Most of you already know this one! If not, Manifold is not only a great site and one of our biggest success stories, but its founders have gone on to create other spinoffs and projects like:</p><ul><li><p><a href=\"https://manifest.is/\">Manifest</a>, a beloved Bay Area conference on prediction markets and everything else.</p></li><li><p><a href=\"https://manifund.org/\">Manifund</a>, an experimental charity platform which now co-runs ACX Grants, an impact certificate platform, and various innovations in regranting.</p></li><li><p><a href=\"https://poly.love/\">Manifold.Love</a>, originally an attempt to make a prediction-market-based dating site. I am told this somehow actually worked in a tiny handful of cases and there are some real people who owe their relationships to people betting on a prediction market that they would be compatible. But this didn&#8217;t work at scale and it&#8217;s now being spun off as a separate dating site focusing on polyamorous people. </p></li><li><p><a href=\"https://www.youtube.com/watch?v=mEF0S1qOsFI\">Bet On Love</a>, a very weird gameshow/musical to advertise some of the above.</p></li><li><p><a href=\"https://moxsf.com/\">Mox</a>, an SF coworking space for innovative startups, charities, and artists.</p></li><li><p><a href=\"https://jamesgrugett.com/p/taking-on-the-giants-an-ai-coding\">Codebuff</a>, an AI coding startup</p></li></ul><p>I probably can&#8217;t take full credit for all of this just from giving them $20K in seed funding, but I continue to appreciate everything they do for this community and the world.</p><p><strong>35: Further S&#8217;s Political Career</strong></p><p>This person didn&#8217;t win their election, but has since pivoted to AI safety and works in a well-regarded AI policy think tank.</p><p><strong>36: Seeds Of Science, A Journal Of Non-Traditional Research</strong></p><p>No update received, but this was a public journal and it is easy to follow their work, see their <a href=\"https://www.theseedsofscience.org/\">website</a> and <a href=\"https://www.theseedsofscience.pub/\">Substack</a>. They published two dozen articles of widely varying quality through 2023 and 2024, then closed in 2025. A remnant of the original vision <a href=\"https://www.theseedsofscience.pub/archive?sort=new\">survives</a> as a science blogging aggregator.</p><p>This was about my median expectation for this grant, but it was very inexpensive and I decided to take a chance on it anyway.</p><p><strong>37: Good Science Project, Working To Improve Federal Science Funding</strong></p><p>No update received, but they have <a href=\"https://goodscience.substack.com/p/new-in-metascience-and-good-government\">a public Substack</a> discussing their progress. Their proposals for NIH reform have influenced Congress and made government agencies pay more attention to scientific integrity.  </p><p><strong>38: Advising Developing Countries On How To Grow Their Economies</strong></p><blockquote><p>With our initial ACX grant, we piloted the Growth Teams model <a href=\"https://www.growth-teams.org/blog/rwanda-gbs\">in Rwanda</a>, helping the government jumpstart the export-oriented call center (BPO) industry. Since 2022, that effort has contributed to the creation of 2,000 formal jobs and the emergence of some of the country&#8217;s largest private employers. We&#8217;ve since expanded to Tanzania, Malawi, and the Indian states of Goa and Meghalaya. To refocus the global development discourse on broad-based economic growth, we co-organized the <a href=\"https://www.cgdev.org/event/growth-summit-recentering-economic-growth-development\">Growth Summit</a> with the Center for Global Development and the Charter Cities Institute, and have published articles in leading outlets including <a href=\"https://ssir.org/articles/entry/when_it_comes_to_promoting_prosperity_production_beats_consumption\">Stanford Social Innovation Review</a>, <a href=\"https://www.promarket.org/2024/04/04/industrial-policy-is-a-verb/\">ProMarket</a>, and the <a href=\"https://www.thegpi.org/p/gray-matter-migration-the-cerebral\">Global Prosperity Institute</a>. Our work has attracted support from Open Philanthropy, Schmidt Futures, and Mulago Foundation, and our advisors now include economists Lant Pritchett, Stefan Dercon, and Kunal Sen. </p></blockquote><p><strong>39: Help Luca De Leo Get Started In AI Safety Research</strong></p><p>No update received, but Luca now runs the AI safety group at the University of Buenos Aires, Argentina.</p><p><strong>40: Typist For Saharon Shelah</strong></p><p>This was another ACXG+ Grant, funded by an anonymous outside funder and not listed in the original announcement.<a href=\"https://en.wikipedia.org/wiki/Saharon_Shelah\"> Saharon</a> is a prolific and influential Israeli mathematician, but many of his discoveries are hand-written in an unpublishable format. This grant funded a typist to help make his results suitable for publication. According to<a href=\"https://shelah.logic.at/thanks/acx/\"> this page</a>, they have made over fifty new papers and preprints available.</p><h2>Second Cohort: One Year Updates</h2><p><strong>41: Lead-Acid Battery Recycling In Nigeria</strong></p><blockquote><p>The Nigeria field research was a major success. We spent most of September doing field research in multiple major cities in Nigeria, and got a good sense of the used lead-acid battery supply chain. This field research served as the foundation for expanding our project, and has been very impactful in shaping our ongoing research. We published our findings from Nigeria, which were shared with Nigerian government regulators and global NGOs working on lead poisoning. The grant also gave us the on-the-ground experience we needed to both fully understand and credibly engage with groups, both in Nigeria and globally, on the ULAB issue. In the meantime, beyond continued research, we&#8217;ve also launched a dashboard (trade.leadbatteries.org) for analyzing global lead trade data. Right now, we&#8217;re: Launching two studies (one RCT, one environmental analysis) in Nigeria in collaboration with local universities to develop a more rigorous understanding of lead pollution due to low-standard ULAB recycling in Nigeria Collaborating with a non-profit incubator to launch an NGO focused on demand-side solutions Beginning a partnership with a West African environmental regulator to scale cheap air monitoring technology to quickly identify and reduce lead pollution from low-standard smelting If any of this sounds interesting to you, please sign up for our Substack (l<a href=\"http://eadbatteries.substack.com\">eadbatteries.substack.com</a>) or send us an email at hugosmith@uchicago.edu!</p></blockquote><p><strong>42: Compensation For Kidney Donors</strong></p><blockquote><p>The End Kidney Deaths Act (H.R. 2687 / EKDA) is a groundbreaking ten-year pilot program designed to save lives and reduce healthcare costs. It provides a refundable tax credit of $10,000 per year for five years, a total of $50,000, to living kidney donors who donate to a stranger, helping those who&#8217;ve waited the longest on the transplant list. Between 2010 and 2021, 100,000 Americans died while qualified and waiting for a kidney. The EKDA aims to change that trajectory. Within ten years of its passage, up to 100,000 Americans could receive a life-saving living donor kidney which typically lasts twice as long as a deceased donor kidney. This would not only save lives but also save taxpayers up to $37 billion. The legislation has been reintroduced in the House, and we have a committed Republican Senate lead. Now, we need a Democratic Senator to co-lead and help move this bipartisan effort forward. Time is short, and we are racing to pass the bill this Congressional session. 36 organizations already support the EKDA. Join the movement and help end preventable kidney deaths. Visit EndKidneyDeaths.org to help us get to the finish line.</p></blockquote><p>Elaine and her org have been working extremely hard on this; you can read a Vox article on their campaign <a href=\"https://www.vox.com/future-perfect/372412/end-kidney-deaths-act-kidney-donor-tax-credit\">here</a>. If you want to sign up for her email list and get updates any time there is a representative you can contact or meeting you can join in, go <a href=\"https://www.endkidneydeathsact.org/join-our-team\">here</a>.</p><p><strong>43: Genetic Hack To Prevent Suffering</strong></p><blockquote><p>In the estimate of multiple team members, the ACX grant was &#8220;worth it&#8221; - it likely had a counterfactual net positive impact, even though we had to pivot from our initial fast-track plans for developing the precision anti-suffering therapy. We identify three primary streams of value: a) reducing uncertainty in the emerging field through early exploratory research, helping with the identification of dead ends and promising R&amp;D trajectories; b) a wide range of downstream effects (beyond the &#8220;raising awareness&#8221; clich&#233;), including talent mobilization and rekindled interest in suffering abolitionism as a distinct cause area; and c) certain developments that cannot yet be publicly disclosed. In December 2024, Marcin Kowrygo (Acting CEO &amp; volunteering contributor), David Pearce (Director of Bioethics), Aatu Koskensilta (President), and a few other team members decided to leave The Far Out Initiative. They look forward to collaborating and applying their experience to advance the suffering abolitionist lineage in the spirit of open science, public good, and thoughtfully decentralized governance. Feel free to reach out to us at suffab at protonmail dot com to discuss collaboration opportunities!</p></blockquote><p>I wrote <a href=\"https://www.astralcodexten.com/p/profile-the-far-out-initiative\">a post profiling the Far Out Initiative here</a>. Unfortunately there were some internal disagreements, and the people ACX Grants was closest to left the organization. I plan to continue to monitor whatever they do next.</p><p><strong>44: Advocate For Pandemic Response Team At FDA</strong></p><p>This team prefers has asked me not to discuss their progress publicly, but you can probably guess what their lives are like right now, and your guess would be correct.</p><p><strong>45: Anti-Mosquito Drones</strong></p><blockquote><p>We developed a cheap sonar that is able to detect, track and classify the ultrasonic echoes of mosquito wings at more than three meters. I believe it&#8217;s a world first! We also have control algorithms that take the sonar data and output control commands that both ram into mosquitoes and avoid the walls of a simulated environment. Our current work is on integrating both components on a real drone, and we expect to be able to kill mosquitoes by June. We&#8217;ve also made an internal impact study (napkin-sized) that shows we&#8217;ll be more cost-effective than ITNs in urban to periurban environments. So, we&#8217;re super excited with what comes next and can&#8217;t wait to share the videos of our first interceptions! More information [in the video below] and on our website, <a href=\"https://tornyol.com\">https://tornyol.com</a></p></blockquote><div class=\"youtube-wrap\" id=\"youtube2-6ScCG3qTOuc\"><div class=\"youtube-inner\"></div></div><p><strong>46: Tarbell Fellowship For AI Journalism</strong></p><p>No update received, but they have <a href=\"https://www.tarbellfellowship.org/\">a public website</a>. I can&#8217;t find the Voices program in particular, but the overall fellowship completed their first class of seven fellows and is working on their second.  </p><p><strong>47: Germicidal UV Lamp Study</strong></p><blockquote><p>The research has successfully demonstrated the ability of off the shelf ozone scrubbers to mitigate the ozone production of far-UVC lamps, is now available as a preprint (<a href=\"https://chemrxiv.org/engage/chemrxiv/article-details/67e4cde76dde43c9084d88b7\">https://chemrxiv.org/engage/chemrxiv/article-details/67e4cde76dde43c9084d88b7</a>). The paper has been submitted for publication and is currently undergoing peer review.</p><p>Any ideas you have for potential funders we can approach to help execute our six-year plan to accelerate far-UVC would be appreciated <a href=\"https://blueprintbiosecurity.org/introducing-project-air/\">https://blueprintbiosecurity.org/introducing-project-air/</a></p></blockquote><p><strong>48: Technological Solutions To Animal Welfare Challenges</strong></p><blockquote><p>Directly because of Innovate Animal Ag's work, the first U.S. egg producer publicly announced in the New York Times their adoption of in-ovo sexing technology, eliminating the need to cull day-old male chicks. The initial in-ovo sexing machine began operating in the U.S. at the end of 2024, with the first eggs from these hens expected on shelves in mid-2025. External evaluations estimate our work accelerated U.S. adoption of this technology by over seven years, meaning that once fully implemented, more than 2 billion chicks will have been spared. In addition to continuing to support the rollout of in-ovo sexing in the US and globally, we're now exploring other technologies and paths to impact. Current promising projects include developing humane slaughter methods for fish and advocating for USDA approval of a poultry vaccine against bird flu.</p></blockquote><p>They add:</p><blockquote><p>If you ever meet folks that are interested animal welfare and are partial to more technocratic and practical solutions, please continue to pass them <a href=\"https://innovateanimalag.org/\">our way</a>, or <a href=\"mailto:careers@innovateanimalag.org\">connect them directly to me</a>.</p></blockquote><p><strong>49: Assurance Contract Website</strong></p><blockquote><p><a href=\"http://www.Spartacus.app\">www.Spartacus.app</a> is an ACX grantee that created a platform to help solve coordination and collective action problems. It enables the creation of campaigns that build critical mass through conditional commitments, which only activate when a sufficient number of people join, converting risk and uncertainty into a higher probability of successful outcomes. They are currently facilitating several projects that leverage conditional commitments, including a dominant assurance contract interface for fashion pop-ups, accelerating a community business association's membership drive, and helping an AI safety organization organize petitions and events, among others. They have pivoted from an emphasis on high-stakes coordination problems requiring anonymity (because they occur too infrequently) to a broader range of more common use cases and have successfully run small-scale campaigns, but are still working toward product-market fit. Despite resource constraints and split time commitments that have impeded faster progress, they remain dedicated to the project's growth and success. You can follow its progress on <a href=\"https://x.com/AppSpartacus\">X</a> or <a href=\"https://spartacusapp.substack.com/\">Substack</a>, or email Jordan directly <a href=\"mailto:Jordan@spartacus.app\">here</a>.</p></blockquote><p><strong>50: Cause Prioritization @ Center For Exploratory Altruism Research</strong></p><blockquote><p>Moderately good progress on a salt reduction policy advocacy project we funded; informal commitments have been made by the Ministry of Health, and we're awaiting the publication of a formal administrative order.</p></blockquote><p>The official description sounds maximally generic, but this is an EA charity with a broad mandate whose current thesis is that dietary guidelines in developing countries can have outsized effects in saving lives. They&#8217;re making some progress on a salt reduction campaign in a developing country they prefer not to name publicly. </p><p><strong>51: Mark Webb Studying Land Reform</strong></p><blockquote><p>The purpose of this project was to identify specific farmland that could be acquired and transferred to the farmers already working the land. This has been difficult to achieve. I have been able to connect with other charities and landless farmers, and was able to interview a number of people about what their situation looks like, as well as what it would look like to them personally if they owned, rather than rented, their farmland. All this was immensely helpful in pushing this long-term project forward, even if I was unable to identify a specific plot of land that could be used to try the experiment. I intend to continue this project. If you have any insights or connections, I am interested.</p></blockquote><p><strong>52: More AI Advocacy In Australia</strong></p><blockquote><p>Good Ancestors is focused on AI safety policy in Australia. Middle powers might be a useful path to influence as the US and China focus on racing, rather than safety. The ACX grant helped us give testimony about AI safety to the Australian Senate alongside Google, Microsoft and Facebook (We were the only nonprofit to give oral evidence to the inquiry. </p><div class=\"youtube-wrap\" id=\"youtube2-eXUlR0ZgA-c\"><div class=\"youtube-inner\"></div></div><p>We also engaged government on other AI-related issues, including cybersecurity, biosecurity, consumer law and automated decision making (<a href=\"https://www.goodancestors.org.au/ai-safety\">https://www.goodancestors.org.au/ai-safety</a>). We&#8217;re currently working to inform voters about where parties stand on AI safety for the election, ahead of engaging on a likely Australian AI Act in 2025 (<a href=\"https://www.australiansforaisafety.com.au/\">https://www.australiansforaisafety.com.au/</a>).</p></blockquote><p>This is the same Australian lobbying organization we founded in Year 1, after a change in name and leadership. I continue to be excited about AI safety in middle-tier countries for a few reasons. First, these countries have some power in international organizations to set international standards. Second, companies will usually comply with any not-excessively-burdensome regulation set by any country with a significant market. Third, AI safety is underfunded by the standard of government programs, so Australia setting up a national AI Safety Institute would significantly expand the field. It&#8217;s kind of crazy that ACX Grants tier levels of money can have significant effects at this scale, but GA continues to do a great job and we continue to be proud to support them.</p><p><strong>53: Campus For African School Of Economics At Zanzibar Charter City</strong></p><blockquote><p>The ACX grant helped launch the first research center at the African School of Economics-Zanzibar, which is a main anchor of the Fumba Town charter city project in Zanzibar. This research center is called the Africa Urban Lab (AUL), focused on rapid urbanization across Africa. The AUL launched its first Diploma program in Urban Development with 38 students in our first cohort (now graduated!), including mayors, and deputy mayor, a director of a national Ministry of urban development, and many others. We published our research framing papers for the AUL's research agenda. We raised funding to launch an Urban Expansion Program that's now selecting 15 African cities to support in implementing urban expansion planning on the urban periphery. We held two Public Talks by renowned cities scholars and practitioners. We received additional funding from Emergent Ventures and from the Templeton Foundation. And we've partnered with 8 universities across the region, and with one of these universities (Ardhi) we'll be working with them to update their urban planning and urban economics curriculum (amplifying AUL's impact beyond our own organization). A longer update from end of 2024 is here: <a href=\"https://www.aul.city/blog/reflecting-on-africa-urban-lab-s-inaugural-year-2024-highlights\">https://www.aul.city/blog/reflecting-on-africa-urban-lab-s-inaugural-year-2024-highlights</a>)</p></blockquote><p><strong>54: Online Training Program For Health Workers In Developing Countries</strong></p><blockquote><p>To date, over 11,000 health workers in Nigeria have completed our course on basic, life-saving newborn care. ACX funding was catalytic for helping us secure government approvals and complete an evaluation of the impact of our training on health workers' clinical practices. The evaluation shows that birth attendants provide better birth care after taking the course. We fed the evaluation results into an updated model, which suggests the program is 24 times more cost-effective than direct cash transfers (a widely recognized benchmark for cost-effectiveness). The program is likely to become even more cost-effective as we scale up. <a href=\"https://healthlearn.org/blog/updated-impact-model\">https://healthlearn.org/blog/updated-impact-model</a></p></blockquote><p><strong>55: Smartphone Pupillometry To Diagnose Neurological Conditions</strong></p><blockquote><p>We have continued to expand our work in the smartphone pupillometry space and the development of our application, PupilScreen (https://www.apertur.ai/). We have expanded our pilot/research program to include new sites across the United States (Missouri, New Jersey, Kentucky, USAC racing, PitFit driver performance training in Indiana) and the world (Nepal, Taiwan, South Africa). We continue to publish at the leading edge of the pupillometry literature as well looking at concussion (https://neuro.jmir.org/2024/1/e58398 and https://pubmed.ncbi.nlm.nih.gov/39682632/), cerebral vasospasm (https://pubmed.ncbi.nlm.nih.gov/39128501/), and stroke (https://pubmed.ncbi.nlm.nih.gov/39674431/ and https://pubmed.ncbi.nlm.nih.gov/39561861/). Currently, we are raising a $3 million seed round via a SAFE to fund the expansion of our work into the hands of healthcare workers and the general public. We will first focus on traumatic brain injury for clinical use and develop a neuro-monitoring wellness application utilizing our technology for the general public.</p></blockquote><p>They add: &#8220;We would welcome connections to anyone that you think might be interested in supporting our work further by investing in our $3M seed round of funding.&#8221;</p><p><strong>56: Mike Saint-Antoine&#8217;s Biology Tutorial Videos</strong></p><blockquote><p>Since getting the grant, I've continued to make Youtube tutorials as planned. One series that I'm especially proud of is about how to make a neural network in the Julia programming language completely from scratch, with no imports, up to the point of being able to solve MNIST (<a href=\"https://www.youtube.com/playlist?list=PLWVKUEZ25V97tNULapu07DhWv6_W4NfpE\">https://www.youtube.com/playlist?list=PLWVKUEZ25V97tNULapu07DhWv6_W4NfpE</a>). Also, a college student in Pakistan came across my videos and invited me to give a virtual Zoom-lecture to her department, so I ended up teaching a 6-hour \"Python-for-Biologists\" workshop to more than a hundred college students in Pakistan over Zoom. So that was pretty awesome. Also, lately I've been teaching some in-person classes too, mostly at Fractal University in NYC, and I also recently organized a day-long, in-person Beginner Python class for people in my local area (Philly suburbs) who wanted to learn some basic programming. I'm having a lot of fun with this project, and am grateful to Scott and the grant funders for their generosity!</p></blockquote><p><strong>57: Conceptual Boundaries Workshop On AI Safety</strong></p><p>The workshop was completed successfully; you can read a writeup <a href=\"https://www.lesswrong.com/posts/NitP3AsMeuycJQbfa/retrospective-on-mathematical-boundaries-workshop\">here</a>.</p><p><strong>58: Apart Research To Incubate AI Safety Scientists</strong></p><p>No update received, but they have a <a href=\"https://apartresearch.com/lab\">public website</a>, and you can see their impact metrics <a href=\"https://apartresearch.com/impact\">here</a>. They seem to be <a href=\"https://forum.effectivealtruism.org/posts/x5R4mpJRqPwpQAPqv/why-is-apart-research-suddenly-in-dire-need-of-funding\">in urgent need</a> of more funding.</p><p><strong>59: Primer On How To Achieve Political Change</strong></p><p>No update received and I can&#8217;t find anything about this. </p><p><strong>60: Research IVF Clinic Success Rates</strong></p><blockquote><p>We've built a predictive model that estimates the odds of having a child at different IVF clinics across the country while controlling for factors like patient age and infertility differences that can falsely make some clinics look better than others. We found that an average patient can increase their odds of having a kid by 43% just by going to a top 10% clinic. Patients unlucky enough to go to a bottom 10% clinic will reduce their odds of having a kid by 40%. Next month, we're adding several more clinics, 2023 data, additional procedural controls, and donor/gestational carrier models, which should push our accuracy beyond state-of-the-art models in this space and better isolate clinic impact on patient outcomes. We've launched ivf.clinic, a website where patients can access personalized IVF reports and browse our clinic rankings (though we're still squashing some bugs). Currently, we're expanding our research to include comprehensive insurance coverage and pricing data across clinics nationwide. If anyone has insights on automating the collection of IVF clinic pricing information, I'd love to hear from you at scelarek@gmail.com.</p></blockquote><p><strong>61: Replicate Study On Brain Wave Synchronization For Speeding Learning</strong></p><blockquote><p>We have acquired and configured the OpenBCI UltraCortex Mark IV 8-channel EEG headset and a clinical-grade Biosemi 32-channel EEG system. We&#8217;ve implemented the required components for the experimental pipeline (computing alpha from EEG, flashing bright white light, presenting stimulus images). We are currently putting them together into a single system that we&#8217;ll use to collect the data from several participants. We are aiming to gather data on several participants in late June / early July and complete the pilot of the replication in July 2025. If you&#8217;d like to be a participant in the study, [they might announce a link once they have it].</p></blockquote><p><strong>62: Advocate Repeal Of Interstate Runaway Compact</strong></p><p>No update received and I can&#8217;t find anything about this.</p><p><strong>63: Animal Welfare (Especially Fish) In Turkiye</strong></p><blockquote><p>Future For Fish asks companies to sign up to FFF's fish welfare commitment, which requires producers to certify their facilities and enforce specific standards for stocking density and harvest. Luckyfish, &#304;lknak, Divan (35 restaurants, 17 hotels) and NG Hotels (5 hotels) have signed and published FFF's fish welfare commitment with &#304;lknak publishing the commitment on their website. K&#305;l&#305;&#231; published its first sustainability report detailing fish welfare policies, including enforcing a maximum stocking density of 10 kg/m&#179; and confirmation of electrical stunning practices. Longer version with some caveats: <a href=\"https://manifund.org/projects/improving-fish-w\">https://manifund.org/projects/improving-fish-w</a></p></blockquote><p>From the longer document, these commitments involve things like reducing overcrowding, or stunning fish before killing them. Over 30 million fish were affected just from their single largest commitment, and they say 100 fish are helped per dollar spent.</p><p><strong>64: More Georgism Advocacy</strong></p><p>Lars and Will used the 2021 grant to co-found ValueBase. Will remained with the company, and Lars left to do advocacy work at the Center For Land Economics. Here&#8217;s their summary of how things are going:</p><blockquote><p>[Our] organization transitioned leadership with Greg Miller, a former Program Analyst at the US Department of Housing and Urban Development, and Lars Doucet, author of Land is A Big Deal and Co-Founder of Valuebase, working full time and Joe Caissie stepping aside. This transition happened naturally as the next career transition for each respective person. </p><p>Since then, progress has been made on pushing forward legislation.</p><ol><li><p>Maryland had two bills introduced to give Baltimore and counties the ability to enact split-rate taxes. One of the bills passed the state senate and would allow Baltimore to enact land value taxes within one mile of rail corridors&#8211;this contains 50% of Baltimore&#8217;s land value. However, the legislative session ended. We expect the bill to revive next session. The Center for Land Economics has been actively working to help efforts to get this bill passed the line. At the same time, we have uncovered systematic undervaluing of vacant land in assessments. We are writing a report on the assessment issues in Maryland with actionable steps to resolve them.</p></li><li><p>New York has a bill to enable five cities to enact split-rate taxes. We are working with city councilmembers across New York to build interest in implementing LVT. </p></li><li><p>Minnesota and Virginia also have legislation to enable cities to implement land value taxes. We are monitoring these efforts.</p></li></ol><p>There are a few other cities we are operating in. We have helped another organization prepare for a meeting in Tennessee by doing impact analysis of land value taxes in the city. We have presented to city officials in the City of South Bend who have expressed support for land value taxes. Finally, we are in conversation with a State Senator in Colorado who is a champion of land value taxes.</p><p>Meanwhile, we have soft launched and developed the OpenAVMKit, which uses a unified schema to do assessment accuracy reports and automated valuation methods for any property tax data given. Valuation of land is the key binding constraint to successful implementation of land value taxes. We plan to be the leaders in this space with strong benchmarking capabilities and a repo that can enable the open-source community to make the best automated valuation methods.</p><p>Along with these efforts, we have expanded the movement. We have posted to the <a href=\"https://progressandpoverty.substack.com/\">Progress and Poverty Substack</a> growing the subscriber base to around 5,000 subscribers. We have spoken to over 25 local advocates interested in working on land value taxes in their local communities.</p><p>Yet, there is a long way to go. We need to start earning income through technical assistance contracts as our grant funding expires. We need to continue pushing for a state to implement, and we need to be prepared to tell the success story for when they do.</p></blockquote><p><strong>65: EN&#8217;s Work On Bacteriophage Therapy</strong></p><blockquote><p>Our project is aimed at pioneering phage therapy in Nigeria, where limited resources/infrastructure have historically held back research in this field. Starting from the ground up, we are establishing the foundational systems needed to support a robust phage research ecosystem. So far, we&#8217;ve isolated 34 bacteriophages targeting Pseudomonas aeruginosa, an essential step toward building a comprehensive phage bank. This began with collecting a wide range of clinical Pseudomonas isolates, which we are now characterizing alongside the phages through genome sequencing and phenotypic assays including studies on phage stability across pH, temperature, and salinity ranges. Our long-term goal is to develop a phage-based hydrogel for treating diabetic wounds. On the regulatory front, we have secured approval from the Attorney General to register our nonprofit organization, the Centre for Phage Biology and Therapeutics. Additionally, we&#8217;re expanding into vaccine development; following a research stay in Prof. Roderick's lab at the University of Waterloo, we have initiated the design of a phage-based universal Salmonella vaccine aimed at covering all major serotypes&#8212;an urgent need underscored by Africa&#8217;s reliance on external vaccine sources during the COVID-19 pandemic. I have signed an MTA agreement with Roderick to use his phage-based vaccine platform patents to enable us to design vaccines against any common disease affecting us. This is only the beginning, but we are proud to be laying the scientific and institutional groundwork for homegrown phage innovation in Africa.</p></blockquote><p>Emergent Ventures funded EN before we did and deserves a lot of credit here also.</p><p><strong>66: Create An Artificial Kidney</strong></p><blockquote><p>For an implantable artificial kidney, the first essential component is a hemofilter designed to emulate the glomerulus. Critical requirements for this hemofilter include high permeability (to maximize flow for a given area), selectivity (specifically, the retention of albumin), and robust blood compatibility (ensuring sustained function over time). Our initial strategy focused on using negative surface charge to reduce fouling. </p><p>I began by testing polyelectrolyte (PE) coatings on 24nm pore membranes featuring a negative terminal charge, similar to the glomerular barrier. These initial static tests, assessing platelet adsorption in whole blood, yielded positive outcomes for some polyelectrolytes, indicating potentially desirable blood compatibility. However, static test setups are not truly representative of dynamic in-vitro conditions and don't provide data on key parameters like permeability, fouling progression, or changes in membrane selectivity. </p><p>To address these limitations, I designed and built a blood filtration setup. This system sustains human whole blood in circulation for 20 minutes, allowing us to analyze all the aforementioned parameters, as well as platelet activation markers. This has resulted in a fairly high-throughput system for evaluating any surface coating. I'm pleased to report this setup has been accepted for presentation at this year's European Society for Artificial Organs (ESAIO) conference. I am also currently working on a full manuscript, as I believe this system offers a viable way to partially replace animal experiments in our early-stage research, requiring only 1.2ml of human blood per run. </p><p>Working with a PhD student (hired to support both this research and work on membrane substrates), we have continued testing these PE coatings, alongside PEG coatings, on our membranes. Here, we're finding that optimization of the coating layer is crucial. With the current PE coatings, we observe a permeability drop of about an order of magnitude compared to the base membrane, making them unsuitable for an implantable device in their present form. This is likely due to the specific nature of the initial PE layer, which we can modify. We also suspect there may be ingress of PE into the pores, meaning we're not achieving just a surface coating (our goal), but rather a very thick coating, which would explain the flux loss. Optimizing the coating process to control penetration depth is now a primary focus of my ongoing work. </p><p>I am currently aiming for a flux of 20ul/min (as this is cap introduced by the protein gel layer anyway) but for it to be at this 'steady state' permeability without drop in permeability. I am also imaging the membranes after contact with SEM to see if there is indeed any platelet adsorption etc.</p></blockquote><p>Tugrul has the dubious honor of maybe being \"the only person to climb a 4000m peak with severe kidney failure\". To raise money and awareness for his artificial kidney project, he is running <a href=\"https://climbagainsttime.org/\">Climb Against Time</a>, where he will climb 41 mountains over 4000m (13000 ft) this summer. He is looking for donors and climbing partners. </p><p><strong>67: Add Tardigrade Genes To Human Cells</strong></p><p>The goal of this one was to make hybrid cells that are more resilient for research and certain medical applications. They report:</p><blockquote><p>The grant was to synthesize vectors for the expression of humanized tardigrade proteins that can be targeted to different areas of the cell. All the vectors were designed, generated, and transposed into human cells. The proteins all localize successfully (e.g. they match the designed target), with one exception (we are still working on validating it). We've done some stress testing with the trangenic cells, but haven't reached firm conclusions yet. We've further generated some multigene designs but have not yet transposed them into cells, but should shortly. We're hoping to submit a manuscript on the first round later this year.</p></blockquote><p><strong>68: Teach Forecasting To EU Policy-Makers</strong></p><p>The original project didn't work out, but our grantee (who still prefers to remain anonymous) is now working with an EU think tank pursuing the same agenda, and has been teaching forecasting workshops to policy-makers for the past two months. </p><p><strong>69: Platform For Single-Cell Imaging</strong></p><p>They ended up unable to accept this grant and returned the money.</p><p><strong>70: Open Source Polygenic Predictor For EA/IQ</strong></p><p>They have an update <a href=\"https://manifund.org/projects/create-open-sour#creator-actions\">here</a>. They think they have a predictor that can explain 12% of variance in intelligence, and they&#8217;re working on validating it and creating an easy-to-use website.</p><p><strong>71: Improve Flu Vaccines</strong></p><blockquote><p>The grant mainly funded agent based modelling to demonstrate the benefit of pre-existing immunity to pandemic influenza if and when a future pandemic occurs (academic publication will result). The original proposal was to attempt to influence the WHO influenza strain selection process. After attending WHO meetings and a global influenza conference, I believe this is not feasible. Stakeholder feedback was the potential short term negative effect on vaccine hesitancy is believed to outweigh the less tangible future benefit. Given the conservative nature of decision makers, pandemic vaccines are likely to remain research only. There are still green shoots of research into pandemic preparedness/prevention that I am continuing to work on. I'm working under the \"Australians for Pandemic Prevention\" brand of Good Ancestors, another group that ACX funded in 2024.</p></blockquote><p><strong>72: Scenario Analysis For Developing World Agricultural Programs</strong></p><blockquote><p>In addition to the research and analysis funded by the grant, I&#8217;ve learned to code with LLMs and have built an MVP of the project. The app is being considered for further development by staff at a large international organization.</p></blockquote><p><strong>73: Further C&#8217;s Political Career</strong></p><p>C&#8217;s political career is going well, but he continues to think it wouldn&#8217;t be strategic to give more information publicly at this time.</p><h2><strong>Lessons Learned</strong></h2><p>I'm most impressed with our lobbying/advocacy organizations. In particular, Good Ancestors has gotten the Australian government to sign onto an international AI safety declaration, partner with various x-risk-related organizations, and (possibly) extend charity tax deductions to some EA causes that previously didn't have it - I think this on its own goes a substantial way to paying back the cost of all ACX Grants. Coalition to Modify NOTA has a kidney donation bill in front of Congress that the (very illiquid) prediction markets give a 45% chance of passing; if it works, it could save thousands of lives. The Georgists are partly responsible for bills making land value taxes slightly easier to implement in a handful of states. Good Science Project seems to have significantly improved science. Are lobbying organizations a better bet than other types of nonprofit (within the constraints of ACX Grants)? I'm not sure. It could just be that lobbyists are (naturally) better at playing themselves up and sounding successful than (for example) scientists, or that politicians are good at people-pleasing and make people feel heard and encouraged in a way that might not change overall policy later. Also, I recently talked to some grantmakers who funded a lobbying organization that superficially seems excellent, but they expressed concern it was net negative (!) by taking away oxygen and spotlight from potentially more effective orgs. So I am encouraged but wary.</p><p>Animal welfare organizations were another standout success. Again, I don't know how to think about this - while I think our grantees were exceptional, there's also an issue where the scale of animal welfare challenges is so great, and work on them so neglected, that lots of organizations can save a million chickens here, or a million fish there, without particularly making a splash. On the one hand, this is exactly what effective altruism should be doing - exploring grants that are very high in linear utility even if they don't feel satisfying. On the other, they're unsatisfying - and also hard to assess retroactively. How many chickens should a good animal welfare grant save? Any realistic number will both be overwhelmingly large in absolute terms and far too small in relative terms.</p><p>I'm most ambivalent about our science grants. Many of them say they are successful and can point to published papers which explain the science they did. But it's hard to judge whether anything useful has changed based on the science getting done. I know it's important to fund basic research and not just last-mile technology startups, but it's hard for a mini-grants program like this one to evaluate these kinds of abstract interventions.</p><p>One disappointing result was that grants to legibly-credentialled people operating in high-status ways usually did better than betting on small scrappy startups (whether companies or nonprofits). For example, Innovate Animal Ag was in many ways overdetermined as a grantee - former Yale grad and Google engineer founder, profiled in NYT, already funded by Open Philanthropy - and they in fact did amazing work. On the other hand, there were a lot of promising ACX community members with interesting ideas who were going to turn them into startups any day now, but who ended up kind of floundering (although this also describes Manifold, one of our standout successes). One thing I still don't understand is that Innovate Animal Ag seemed to genuinely need more funding despite being legibly great and high status - does this screen off a theoretical objection that they don't provide ACX Grants with as much counterfactual impact? Am I really just mad that it would be boring to give too many grants to obviously-good things that even moron could spot as promising?</p><p>Someone (I think it might be Paul Graham) once said that they were always surprised how quickly destined-to-be-successful startup founders responded to emails - sometimes within a single-digit number of minutes regardless of time of day. I used to think of this as mysterious - some sort of psychological trait? Working with these grants has made me think of it as just a straightforward fact of life: some people operate an order of magnitude faster than others. The Manifold team created something like five different novel institutions in the amount of time it's taken some other grantees to figure out a business plan; I particularly remember one time when I needed something, sent out a request to talk about it with two or three different teams, and the Manifold team had fully created the thing and were pestering me to launch a trial version before some of the other people had even gotten back to me. I take no pleasure in reporting this - I sometimes take a week or two to answer emails, and all of the predictions about my personality that this implies would be correct - but it's increasingly something that I look for and respect. A lot of the most successful grants succeeded <em>quickly</em>, or at least were quick to get on a promising track. Since everything takes ten times longer than people expect, only someone who moves ten times faster than people expect can get things done in a reasonable amount of time.</p><p>In almost every case where I thought to myself &#8220;this is a cool idea, but I don&#8217;t know how it&#8217;s going to really pay off, as opposed to reaching a cool intermediate accomplishment and then stagnating&#8221;, this was a correct criticism, and I should have taken it more seriously. But I can&#8217;t rule out that these were good in vague and hard-to-measure ways that I should take more seriously.</p><p>This one is <em>really</em> self-serving, but in general when people were good communicators (or even bloggers) and wowed me with the writing-composition of their application, they turned out to be a good bet. And when people were hard to understand and annoying to communicate with, even if their ideas seemed good, they were less likely to pan out. </p><h2><strong>Overall Thoughts</strong></h2><p>The total cost of ACX Grants, both rounds, was about $3 million. Do these outcomes represent a successful use of that amount of money?</p><p>Very naively, startups originating from ACX Grants have about $50 million in value<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a>. If ACX Grants is equivalent to a pre-seed funder, and pre-seed funders usually get ~5%, then if we were VCs we would have a portfolio worth $2.5 million. About 1/5 of ACX Grants were attempting to be market-valued startups, so if we assume the charitable portion did about as well as the startup portion, then the charity portion is &#8220;worth&#8221; $10 million. There&#8217;s some reason to expect this is too high, since much of the startup value came from one successful outlier. But there&#8217;s another reason to expect this is too low, since we were aiming at charity rather than market cap, and any actual market cap that our grantees got was an unexpected side effect. I&#8217;m treating this as a sanity check rather than as a real number.</p><p>It&#8217;s harder to produce Inside View estimates, because so many of the projects either produce vague deliverables (eg a white paper that might guide future action) or intermediate results only (eg getting a government to pass AI safety regulations is good, but can&#8217;t be considered an end result unless those regulations prevent the AI apocalypse). Because we tend towards incubating charities and funding research (rather than last-mile causes like buying bednets), achieved measurable deliverables are thin on the ground. But here are things that ACX grantees have already accomplished:</p><ul><li><p>Improved the living/slaughter conditions of 30 million fish.</p></li><li><p>Helped create Manifold Markets, a prediction market site with thousands of satisfied users, whose various spinoffs play a central role in the rationalist/EA community.</p></li><li><p>Helped create thousands of jobs in Rwanda and other developing countries</p></li><li><p>Passed an instant runoff vote proposition in Seattle.</p></li><li><p>Saved between a few dozen and a few hundred lives in Nigeria through better obstetric care.</p></li></ul><p>And here are some intermediate deliverables from grantees:</p><ul><li><p>Made Australian government take AI x-risk more seriously (estimated from 50th percentile to 60th percentile outcome)</p></li><li><p>Gotten the End Kidney Deaths Act (could save &gt;1000 lives and billions of dollars per year) in front of Congress, with decent odds of passing by 2026. </p></li><li><p>Plausibly saved 2 billion chickens from painful death over next decade<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-2\" id=\"footnote-anchor-2\" target=\"_self\">2</a>.</p></li><li><p>Antiparasitic medication oxfendazole continues to advance through the clinical trial process.</p></li></ul><p>And here are some things that have not been delivered yet but that I remain especially optimistic about:</p><ul><li><p>Creation of anti-mosquito drones that provide a second level of defense along with bednets.</p></li><li><p>Revolutionize diagnosis of traumatic brain injury</p></li><li><p>Improve dietary guidelines in developing countries</p></li><li><p>Continue to support research and adoption of far UV light for pandemic prevention</p></li><li><p>Reduce lead poisoning in Nigeria</p></li></ul><p>I think these underestimate success since many projects have yet to pay off (or to convince me to be especially optimistic), and others have paid off in vague hard-to-measure ways.</p><p>Although I don&#8217;t think we&#8217;ve reached a level where it&#8217;s drop-down obvious I should continue ACX Grants, I&#8217;m leaning towards doing so. I welcome comments from any more experienced grantmakers who are better able to evaluate this. My current plan is:</p><ol><li><p>Make an ACX post with some lingering questions I still have about the structure of ACX Grants, and solicit advice from commenters.</p></li><li><p>Show these results to funders (including funders who are experienced VCs and better able to judge things than I am) and see if they think they got good value for money. Run the commenter advice by them and see if they agree.</p></li><li><p>Open up another application round, probably in a month or so, probably while I&#8217;m posting the non-book-review finalists so I can take a break from writing to administer the process.</p><p></p></li></ol><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-1\" id=\"footnote-1\" target=\"_self\">1</a><div class=\"footnote-content\"><p>Valuebase has raised $14 million suggesting a valuation in the mid 9 digits, Manifold was valued at $22 million, Highway Pharmaceuticals was $5 million, for a total of $50 - 100 million, but these are all old numbers, Manifold (the highest) has struggled to find revenue, and I want to leave room for the possibility that they&#8217;ve decreased since then. I can&#8217;t find evidence that any projects beyond those three have broken into the million-dollar range.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-2\" id=\"footnote-2\" target=\"_self\">2</a><div class=\"footnote-content\"><p>I count chickens who were never born at all as &#8220;saved&#8221;, and I endorse this decision based on my values. Your values may differ.</p><p></p></div></div>"
            ],
            "link": "https://www.astralcodexten.com/p/acx-grants-1-3-year-updates",
            "publishedAt": "2025-06-18",
            "source": "SlateStarCodex",
            "summary": "<p>The first cohort of ACX Grants was announced in <a href=\"https://www.astralcodexten.com/p/acx-grants-results\">late 2021</a>, the second in <a href=\"https://www.astralcodexten.com/p/acx-grants-results-2024\">early 2024</a>. In 2022, I posted <a href=\"https://www.astralcodexten.com/p/acx-grants-project-updates\">one-year updates</a> for the first cohort. Now, as I start thinking about a third round, I&#8217;ve collected one-year updates on the second and three-year updates on the first.</p><p>Many people said my request for updates went to their spam folder; relatedly, many people have not yet sent in their updates. If you&#8217;re a grantee who didn&#8217;t see my original email, but you do see this post, please fill in the update form <a href=\"https://forms.gle/41Vd18iFMu5R6c3Z7\">here</a>.</p><p>All quote blocks are the grantees&#8217; own words; text outside of quote blocks is my commentary.</p><h2><strong>First Cohort: Three Year Updates</strong></h2><p><strong>1: Discover Molecular Targets Of Antibiotics</strong></p><p>No update received this year, but see the 2022 update <a href=\"https://www.astralcodexten.com/p/acx-grants-project-updates\">here</a>.</p><p><strong>2: Ballot Proposition For Approval Voting In Seattle</strong></p><blockquote><p>We proposed an initiative to adopt \"approval voting\" for Seattle primaries. After the initiative qualified for the Nov 2022 ballot, the City Council added an alternative proposing \"instant-runoff voting\" (https://www.seattletimes.com/seattle-news/politics/competing-voting-reform-measures-make-seattles-november-ballot-after-city-council-oks-alternative/). While voting to do so, 3 councilmembers said that they hoped neither passed; one could see it as a way to prevent any election reform. Surprisingly, something did barely pass - the Council",
            "title": "ACX Grants 1-3 Year Updates"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3104/",
            "publishedAt": "2025-06-18",
            "source": "XKCD",
            "summary": "<img alt=\"Numbers can be tricky. On the day of my 110th birthday, I'll be one day younger than John Tukey was on his.\" src=\"https://imgs.xkcd.com/comics/tukey.png\" title=\"Numbers can be tricky. On the day of my 110th birthday, I'll be one day younger than John Tukey was on his.\" />",
            "title": "Tukey"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-06-18"
}