{
    "articles": [
        {
            "content": [
                "<header>\n  <h1>The Second Great Error Model Convergence</h1>\n  <time class=\"meta\" datetime=\"2025-12-29\">Dec 29, 2025</time>\n</header>\n<p>I feel like this has been said before, more than once, but I want to take a moment to note that\nmost modern languages converged to the error management approach described in Joe Duffy’s\n<a href=\"https://joeduffyblog.com/2016/02/07/the-error-model/#recoverable-errors-type-directed-exceptions\"><em>The Error Model</em></a>,\nwhich is a generational shift from the previous consensus on exception handling.</p>\n<p>C++, JavaScript, Python, Java, C# all have roughly equivalent <code>throw</code>, <code>catch</code>, <code>finally</code>\nconstructs with roughly similar runtime semantics and typing rules. Even functional languages like\nHaskell, OCaml, and Scala feature exceptions prominently in their grammar, even if their usage is\nfrowned upon by parts of the community.</p>\n<p>But the same can be said about Go, Rust, Swift, and Zig! Their error handling is similar to each\nother, and quite distinct from the previous bunch, with Kotlin and Dart being notable, ahem,\nexceptions. Here are some commonalities of modern error handling:</p>\n<p><em>First</em>, and most notably, functions that can fail are annotated at the call side. While the old way\nlooked like this:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-type\">Widget</span> <span class=\"hl-variable\">widget</span> <span class=\"hl-operator\">=</span> make_widget();</span></code></pre>\n\n</figure>\n<p>the new way is</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">let</span> <span class=\"hl-variable\">widget</span> = <span class=\"hl-title function_ invoke__\">make_widget</span>()?;</span></code></pre>\n\n</figure>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">const</span> widget = <span class=\"hl-keyword\">try</span> make_widget();</span></code></pre>\n\n</figure>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">let</span> widget <span class=\"hl-operator\">=</span> <span class=\"hl-keyword\">try</span> makeWidget()</span></code></pre>\n\n</figure>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">widget, err := makeWidget()</span>\n<span class=\"line\"><span class=\"hl-keyword\">if</span> err != <span class=\"hl-literal\">nil</span> {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">return</span> err</span>\n<span class=\"line\">}</span></code></pre>\n\n</figure>\n<p>There’s a syntactic marker alerting the reader that a particular operation is fallible, though the\nverbosity of the marker varies. For the writer, the marker ensures that changing the function\ncontract from infallible to fallible (or vice versa) requires changing not only the function\ndefinition itself, but the entire call chain. On the other hand, adding a new error condition to a\nset of possible errors of a fallible function generally <em>doesn’t</em> require reconsidering rethrowing\ncall-sites.</p>\n<p><em>Second</em>, there’s a separate, distinct mechanism that is invoked in case of a detectable bug. In\nJava, index out of bounds or null pointer dereference (examples of programming errors) use the same\nlanguage machinery as operational errors. Rust, Go, Swift, and Zig use a separate panic path. In Go\nand Rust, panics unwind the stack, and they are recoverable via a library function. In Swift and\nZig, panic aborts the entire process. Operational error of a lower layer can be classified as a\nprogramming error by the layer above, so there’s generally a mechanism to escalate an erroneous\nresult value to a panic. But the opposite is more important: a function which does only “ordinary”\ncomputations <em>can</em> be buggy, and <em>can</em> fail, but such failures are considered <em>catastrophic</em> and are\ninvisible in the type system, and sufficiently transparent at runtime.</p>\n<p><em>Third</em>, results of fallible computation are first-class values, as in Rust’s <code>Result&lt;T, E&gt;</code>.\nThere’s generally little type system machinery dedicated exclusively to errors and <code>try</code> expressions\nare just a little more than syntax sugar for that little Go spell. This isn’t true for Swift, which\ndoes treat errors specially. For example, the generic\n<a href=\"https://developer.apple.com/documentation/swift/sequence/map(_:)\"><code>map</code></a> function has to explicitly\ncare about errors, and hard-codes the decision to bail early:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">func</span> <span class=\"hl-title function_\">map</span>&lt;<span class=\"hl-type\">T</span>, <span class=\"hl-type\">E</span>&gt;(</span>\n<span class=\"line\">    <span class=\"hl-keyword\">_</span> <span class=\"hl-params\">transform</span>: (<span class=\"hl-keyword\">Self</span>.<span class=\"hl-type\">Element</span>) <span class=\"hl-keyword\">throws</span>(<span class=\"hl-type\">E</span>) -&gt; <span class=\"hl-type\">T</span></span>\n<span class=\"line\">) <span class=\"hl-keyword\">throws</span>(<span class=\"hl-type\">E</span>) -&gt; [<span class=\"hl-type\">T</span>] <span class=\"hl-keyword\">where</span> <span class=\"hl-type\">E</span> : <span class=\"hl-type\">Error</span></span></code></pre>\n\n</figure>\n<p>Swift does provide <a href=\"https://developer.apple.com/documentation/swift/result\">first-classifier type</a>\nfor errors.</p>\n<p>Should you want to handle an exception, rather than propagate it, the handling is localized to\na single throwing expression to deal with a single specific errors, rather than with any error from\na block of statements:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">let</span> <span class=\"hl-variable\">widget</span> = <span class=\"hl-keyword\">match</span> <span class=\"hl-title function_ invoke__\">make_widget</span>() {</span>\n<span class=\"line\">    <span class=\"hl-title function_ invoke__\">Ok</span>(it) =&gt; it,</span>\n<span class=\"line\">    <span class=\"hl-title function_ invoke__\">Err</span>(WidgetError::NotFound) =&gt; <span class=\"hl-title function_ invoke__\">default_widget</span>(),</span>\n<span class=\"line\">};</span></code></pre>\n\n</figure>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">let widget = make_widget() <span class=\"hl-keyword\">catch</span> <span class=\"hl-operator\">|</span>err<span class=\"hl-operator\">|</span> <span class=\"hl-keyword\">switch</span> (err) {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">error</span>.NotFound =&gt; default_widget(),</span>\n<span class=\"line\">};</span></code></pre>\n\n</figure>\n<p>Swift again sticks to more traditional try catch, but, interestingly, Kotlin does have <code>try</code>\nexpressions.</p>\n<hr />\n<p>The largest remaining variance is in what the error value looks like. This still feels like a\nresearch area. This is a hard problem due to a fundamental tension:</p>\n<ul>\n<li>\nOn the one hand, at lower-levels you want to exhaustively enumerate errors to make sure that:\n<ul>\n<li>\ninternal error handling logic is complete and doesn’t miss a case,\n</li>\n<li>\npublic API doesn’t leak any extra surprise error conditions.\n</li>\n</ul>\n</li>\n<li>\nOn the other hand, at higher-levels, you want to string together widely different functionality\nfrom many separate subsystems without worrying about specific errors, other than:\n<ul>\n<li>\nseparating fallible functions from infallible,\n</li>\n<li>\nensuring that there is some top-level handler to show a 500 error or an equivalent.\n</li>\n</ul>\n</li>\n</ul>\n<p>The two extremes are well understood. For exhaustiveness, nothing beats sum types (<code>enum</code>s in Rust).\nThis I think is one of the key pieces which explains why the pendulum seemingly swung back on\nchecked exceptions.</p>\n<p>In Java, a method can throw one of the several exceptions:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">void</span> <span class=\"hl-title function_\">f</span><span class=\"hl-params\">()</span> <span class=\"hl-keyword\">throws</span> FooException, BarException;</span></code></pre>\n\n</figure>\n<p>Critically, you <em>can’t</em> abstract over this pair. The call chain has to either repeat the two cases,\nor type-erase them into a superclass, losing information. The former has a nasty side-effect that\nthe entire chain needs updating if a third variant is added. Java-style checked exceptions are\nsensitive to “N to N + 1” transitions. Modern value-oriented error management is only sensitive  to\n“0 to 1” transition.</p>\n<p>Still, if I am back to writing Java at any point, I’d be <em>very</em> tempted to standardize on\ncoarse-grained <code>throws Exception</code> signature for all throwing methods. This is exactly the <em>second</em>\nwell understood extreme: there’s a type-erased universal error type, and the “throwableness” of a\nfunction contains one bit of information. We only care <em>if</em> the function can throw, and the error\nitself can be whatever. You still can downcast dynamic error value handle specific conditions, but\nthe downcasting is not checked by the compiler. That is, downcasting is “save” and nothing will\npanic in the error handling mechanism itself, but you’ll never be sure if the errors you are\nhandling can actually arise, and whether some errors <em>should</em> be handled, but aren’t.</p>\n<p>Go and Swift provide first-class universal errors, like Midori. Starting with Swift 4, you can also\nnarrow the type down.</p>\n<p>Rust doesn’t really have super strong conventions about the errors, but it started with mostly\nenums, and then <code>failure</code> and <code>anyhow</code> shone spotlight on the universal error type.</p>\n<p>But overall, it feels like “midpoint” error handling is poorly served by either extreme. In larger\napplications, you sorta care about error kinds, and there are usually a few place where it is pretty\nimportant to be exhaustive in your handling, but threading necessary types to those few places\ninfects the rest of the codebases, and ultimately leads to “a bag of everything” error types with\nmany “dead” variants.</p>\n<p>Zig makes an interesting choice of assuming mostly closed-world compilation model, and relying on\ncross-function inference to learn who can throw what.</p>\n<hr />\n<p>What I find the most fascinating about the story is the generational aspect. There really was a\nstrong consensus about exceptions, and then <a href=\"https://www.artima.com/articles/the-trouble-with-checked-exceptions\">an agreement that checked exceptions are a\nfailure</a>, and now, suddenly, we\nare back to “checked exceptions” with a twist, in the form of “errors are values” philosophy. What\nhappened between the lull of the naughts and the past decade industrial PLT renaissance?</p>"
            ],
            "link": "https://matklad.github.io/2025/12/29/second-error-model-convergence.html",
            "publishedAt": "2025-12-29",
            "source": "Alex Kladov",
            "summary": "I feel like this has been said before, more than once, but I want to take a moment to note that most modern languages converged to the error management approach described in Joe Duffy's The Error Model, which is a generational shift from the previous consensus on exception handling.",
            "title": "The Second Great Error Model Convergence"
        },
        {
            "content": [
                "<p><img alt=\"&quot;Theseus Fighting the Centaur Bianor&quot;, by Antoine-Louis Barye, 1867\" src=\"https://www.dbreunig.com/img/fighting_a_centaur.jpg\" /></p>\n\n<h3 id=\"a-year-shaped-by-synthetic-data-dramatically-uneven-performance-and-reliability-issues\">A year shaped by synthetic data, dramatically uneven performance, and reliability issues</h3>\n\n<p>One of the reasons <a href=\"https://www.dbreunig.com/2025/12/27/why-i-write.html\">why I write</a> is reflection. Looking over 2025’s work, there are consistent themes among the mess that help me understand the velocity of AI, its momentum and direction. I’m not going to polish this too much (if you want to dive in, check out the linked posts), but this exercise is quite clarifying to me.</p>\n\n<p>Here’s the tl;dr:</p>\n\n<ol>\n  <li>Immediate AI risk comes from people over-estimating AI capabilities.</li>\n  <li>Reliability and trust are the barriers preventing wide adoption.</li>\n  <li>Evaluations remain underutilized.</li>\n  <li>Synthetic data unlocked AI capabilities, but shapes its nature</li>\n  <li>There is a growing AI perception gap between quantitative users and qualitative users.</li>\n  <li>AI leaders are letting others define the story of AI.</li>\n</ol>\n\n<hr />\n\n<h3 id=\"immediate-ai-risk-comes-from-people-over-estimating-ai-capabilities\">Immediate AI risk comes from people over-estimating AI capabilities.</h3>\n\n<p>There are many risks we should be conscious of, but the downsides that are biting us now come from people believing in AI capabilities or sentience that isn’t there. “<a href=\"https://www.dbreunig.com/2025/01/01/cyren.html\">I don’t worry about superintelligent AGI’s taking over the world. I worry about bots convincing people they’re having an emotional connection when they’re not</a>.” This can be tied to teen suicides, senior scams, propagandist bots, and more. The natural language interface is wonderful for its flexibility and accessibility, but it exploits our evolutionary tendency to recognize humans where there are none.</p>\n\n<p>This danger is more pronounced by our current human-in-the-loop design pattern. We’re asking laypeople to evaluate AI capabilities in fields which they <em>do not understand</em>. Too often I hear, “<a href=\"https://www.dbreunig.com/2025/04/08/on-ai-observational-comics.html\">Chatbots know everything, but they make mistakes when it comes to things I know</a>.”</p>\n\n<p><strong>Posts:</strong></p>\n\n<ul>\n  <li><a href=\"https://www.dbreunig.com/2025/01/01/cyren.html\">Beware the Cyren’s Song</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/04/08/on-ai-observational-comics.html\">AI Chatbots Are Like Observational Comics</a></li>\n</ul>\n\n<hr />\n\n<h3 id=\"reliability-and-trust-are-the-barriers-preventing-wide-adoption\">Reliability and trust are the barriers preventing wide adoption.</h3>\n\n<p>As we saw above, people can easily spot issues with AI when it’s working in their domain. Sure, we’ve come a <em>long</em> way this year, but these gains have mostly come from <a href=\"https://www.dbreunig.com/2024/10/18/the-3-ai-use-cases-gods-interns-and-cogs.html\">Intern-style</a> applications. We keep the humans in the loop because humans are excellent at spotting and fixing issues the 10% of the time models flail.</p>\n\n<p>But when that figure is higher than ~10% or so (these are finger-in-the-air numbers), people simply avoid the AI. Agents, especially custom enterprise ones, have <a href=\"https://www.dbreunig.com/2025/12/06/the-state-of-agents.html\">a reliability problem</a> that hinders the development of the field. Teams that successfully ship agents do so by dialing back their complexity: chat interfaces, short tasks.</p>\n\n<p>But we should consider reliability a means to an end; and that end is <em>trust</em>.</p>\n\n<p>Trust is complex. It’s dependent on the task being done, the risk associated with the task, the UI that presents the task, and how the agent contextualizes the produced decision. <em>Reliability</em> can be measured at the model level, but <em>trust</em> has to be assessed end-to-end: from the model, to the application, to the user.</p>\n\n<p>Frustratingly, there’s few good ways to measure trust in the AI era. We can do user interviews (and I know teams that do), but these are <em>slow</em>. UX research always has been, but their pace feels especially sluggish in the context of AI-powered development, Many teams can hack this by “vibe shipping” – making changes to their app, pushing to production, running a few queries, then repeating – basically doing the UX reseach by themselves, on themselves.</p>\n\n<p>Everyone else should look to <em>delegation</em>. “<a href=\"https://www.dbreunig.com/2025/07/13/delegation-is-the-ai-metric-that-matters.html\">Forget the benchmarks – the best way to track AI’s capabilities is to watch which decisions experts delegate to AI</a>.”</p>\n\n<p><strong>Posts:</strong></p>\n\n<ul>\n  <li><a href=\"https://www.dbreunig.com/2025/07/13/delegation-is-the-ai-metric-that-matters.html\">Delegation is the AI Metric that Matters</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/09/15/ai-adoption-at-work-play.html\">Enterprise AI Looks Bleak, But Employee AI Looks Bright</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/12/06/the-state-of-agents.html\">Enterprise Agents Have a Reliability Problem</a></li>\n</ul>\n\n<hr />\n\n<h3 id=\"evaluations-remain-underutilized\">Evaluations remain underutilized.</h3>\n\n<p>At first I wrote, “under-appreciated.” But I think teams <em>get</em> why evaluations are valuable. The problem is most teams still don’t build them.</p>\n\n<p>They get <a href=\"https://www.dbreunig.com/2025/01/08/evaluating-llms-as-knowledge-banks.html\">the benefits</a>:</p>\n\n<blockquote>\n  <p>The real power of a custom eval isn’t just in model selection – it’s in the compound benefits it delivers over time. Each new model can be evaluated in hours, not weeks. Each prompt engineering technique can be tested systematically. And perhaps most importantly, your eval grows alongside your understanding of the problem space, becoming an increasingly valuable asset for your AI development.</p>\n</blockquote>\n\n<p>It used to be I had to argue that hand-tuned prompts would become overfit to a model. But OpenAI’s headline model deprecations this year pushed many teams to discover this empirically.</p>\n\n<p>Despite this hiccup, many teams continue to push forward, hand-editing prompts and vibe shipping as they go. Pre-scale, this is likely optimal: the speed of iteration this allows is too valuable to ignore. As a result, <em>so many</em> teams I talk to who were previously focusing on evaluation tooling have pivoted to synthetic data creation or LLM-as-a-Judge services. Our AI capabilities have improved dramatically, but human behavior remains a constraint.</p>\n\n<p><strong>Posts:</strong></p>\n\n<ul>\n  <li><a href=\"https://www.dbreunig.com/2025/01/08/evaluating-llms-as-knowledge-banks.html\">Your Eval is More Important Than the Model</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/01/30/mistral-small-human-centric-benchmarks.html\">Mistral Small &amp; Human-Centric Benchmarks</a></li>\n</ul>\n\n<hr />\n\n<h3 id=\"synthetic-data-unlocked-ai-capabilities-but-shapes-its-nature\">Synthetic data unlocked AI capabilities, but shapes its nature.</h3>\n\n<p>Investing in synthetic data creation unlocked AI capabilities in 2025. <a href=\"https://www.dbreunig.com/2024/12/18/synthetic-data-the-growing-ai-perception-divide.html\">Rephrasing high quality content into reasoning and agentic chains kept the scaling party alive</a>. Generating <a href=\"https://www.dbreunig.com/2025/04/11/what-we-mean-when-we-say-think.html#the-strengths--limits-of-reasoning-models\">new datasets for verifiable tasks</a> (like math and coding) helped AI coding apps evolve from better auto-complete services to async agents in less than a year.</p>\n\n<p>Remember: Claude Code arrived in <em>February</em>.</p>\n\n<p>Synthetic data did this. It provided the material needed for post-training, the mountains of examples necessary to upend an entire industry. But the limits of synthetic data, that it has been focused on quantitative tasks, <a href=\"https://www.dbreunig.com/2025/04/11/what-we-mean-when-we-say-think.html\">greatly shapes our tools and discourse</a>:</p>\n\n<blockquote>\n  <p>Those who use AIs for programming will have a remarkably different view of AI than those who do not. The more your domain overlaps with testable synthetic data and RL, the more you will find AIs useful as an intern. This perception gap will cloud our discussions.</p>\n</blockquote>\n\n<p>The current solution, being deployed by frontier chatbots, is to treat everything they can as a programming problem. If ChatGPT or Claude can write a quick Python script to answer your question, it will. Context engineering challenges are being reframed as coding tasks: give a model a Python environment and let them explore, search, and read and write files. Yesterday’s harness is today’s environment. <a href=\"https://www.dbreunig.com/2025/12/19/how-model-use-has-changed-in-2025.html\">In 2024 we called models, today we call systems</a>.</p>\n\n<p>Scale was all we needed in 2024. Reasoning kept the party going in 2025. Coding will be the lever in 2026.</p>\n\n<p><strong>Posts:</strong></p>\n\n<ul>\n  <li><a href=\"https://www.dbreunig.com/2025/01/20/on-authentic-data.html\">On Authentic Data</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/04/11/what-we-mean-when-we-say-think.html\">What We Mean When We Say ‘Think’</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/07/30/how-kimi-was-post-trained-for-tool-use.html\">How Kimi K2 Became One of the Best Tool Using Models</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/12/19/how-model-use-has-changed-in-2025.html\">How Model Use Has Changed in 2025</a></li>\n</ul>\n\n<hr />\n\n<h3 id=\"there-is-a-growing-ai-perception-gap-between-quantitative-users-and-qualitative-users\">There is a growing AI perception gap between quantitative users and qualitative users.</h3>\n\n<p>And this is the trillion dollar question: can we replicate our coding gains in qualitative fields? Can we generate synthetic data that unlocks better writing? Can we turn PowerPoint creation into a coding exercise? If we give GPT-5.2 a Python notebook can it write a better poem?</p>\n\n<p>If these things can’t be solved with coding, there will be tremendous opportunity to improve the qualitative performance of models through other means. Doing so, however, will likely require solutions that <a href=\"https://www.dbreunig.com/2025/08/04/the-rise-of-opinionated-models.html\">are opinionated rather than general</a>. Aesthetic performance requires subjective choices, not objective <em>correctness</em>.</p>\n\n<p>But for now, the lopsided nature of today’s models is creating a world where programmers experience a <em>very</em> different AI than most ChatGPT users. The divide in capabilities between a free ChatGPT or Copilot account and Claude Code with Opus 4.5 is <em>vast</em>. Public conversations about AI are <em>deeply</em> unproductive because what you and I are experiencing is lightyears beyond the default experience.</p>\n\n<p><strong>Posts:</strong></p>\n\n<ul>\n  <li><a href=\"https://www.dbreunig.com/2025/08/08/how-ai-coding-changes-product.html\">AI-Assisted Coding Will Change Product Management</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/04/11/what-we-mean-when-we-say-think.html\">What We Mean When We Say ‘Think’</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/04/18/the-wisdom-of-artificial-crowds.html\">The Wisdom of Artificial Crowds</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/07/31/how-kimi-rl-ed-qualitative-data-to-write-better.html\">How Kimi K2 RL’ed Qualitative Data to Write Better</a></li>\n  <li><a href=\"https://www.dbreunig.com/2025/08/04/the-rise-of-opinionated-models.html\">FLUX.1-Krea &amp; the Rise of Opinionated Models</a></li>\n</ul>\n\n<hr />\n\n<h3 id=\"ai-leaders-are-letting-others-define-the-story-of-ai\">AI leaders are letting others define the story of AI.</h3>\n\n<p>Compounding this problem is the fact that AI leaders aren’t even attempting to explain <em>how</em> AI works to the masses. <a href=\"https://x.com/dbreunig/status/2004319480386924889\">I recently wrote</a>:</p>\n\n<blockquote>\n  <p>The AI ecosystem is repeating digital advertising’s critical mistake.</p>\n</blockquote>\n\n<blockquote>\n  <p>One of the reasons the open online advertising ecosystem fell apart is because they terribly communicated how it all worked. The benefits of cross targeting were brushed over, because it was hard and complex to explain, and that left the door open for others to make privacy the <em>only</em> story, until it was too late. Which created the environment we have now, where most quality media is paywalled and only the giant platforms have sufficient scale for effective targeting.</p>\n</blockquote>\n\n<blockquote>\n  <p>The AI industry is failing to explain how AI works. People and companies either brush it aside as complex and/or oversimplify it with over-promised metaphors (“A PHD in your pocket!”) These same people then get upset when critics keep wringing their hands about hallucinations, financial engineering, power and water consumption, and much more.</p>\n</blockquote>\n\n<p>AI leaders don’t invest in explanations because AI is hard to explain. Further, they’re incentivized to over-simplify and over-promise. Combine this withthe lightning speed of development (even <a href=\"https://x.com/karpathy/status/2004607146781278521\">Karpathy feels left behind</a>!) and AI’s <a href=\"https://x.com/karpathy/status/1816531576228053133?lang=en\">jagged intelligence</a> becomes into a fault line, threatening to rupture.</p>\n\n<p><strong>Posts:</strong></p>\n\n<ul>\n  <li><a href=\"https://www.dbreunig.com/2025/01/31/deepseek-as-a-power-object.html\">DeepSeek as a Power Object</a></li>\n</ul>\n\n<hr />\n\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/dbreunig\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <label for=\"bd-email\">Enter your email to receive the occasional update.</label>\n  <div class=\"form-input\">\n    <input id=\"bd-email\" name=\"email\" type=\"email\" />\n    <input type=\"submit\" value=\"Subscribe\" />\n  </div>\n</form>"
            ],
            "link": "https://www.dbreunig.com/2025/12/29/2025-in-review.html",
            "publishedAt": "2025-12-29",
            "source": "Drew Breunig",
            "summary": "<p><img alt=\"&quot;Theseus Fighting the Centaur Bianor&quot;, by Antoine-Louis Barye, 1867\" src=\"https://www.dbreunig.com/img/fighting_a_centaur.jpg\" /></p> <h3 id=\"a-year-shaped-by-synthetic-data-dramatically-uneven-performance-and-reliability-issues\">A year shaped by synthetic data, dramatically uneven performance, and reliability issues</h3> <p>One of the reasons <a href=\"https://www.dbreunig.com/2025/12/27/why-i-write.html\">why I write</a> is reflection. Looking over 2025’s work, there are consistent themes among the mess that help me understand the velocity of AI, its momentum and direction. I’m not going to polish this too much (if you want to dive in, check out the linked posts), but this exercise is quite clarifying to me.</p> <p>Here’s the tl;dr:</p> <ol> <li>Immediate AI risk comes from people over-estimating AI capabilities.</li> <li>Reliability and trust are the barriers preventing wide adoption.</li> <li>Evaluations remain underutilized.</li> <li>Synthetic data unlocked AI capabilities, but shapes its nature</li> <li>There is a growing AI perception gap between quantitative users and qualitative users.</li> <li>AI leaders are letting others define the story of AI.</li> </ol> <hr /> <h3 id=\"immediate-ai-risk-comes-from-people-over-estimating-ai-capabilities\">Immediate AI risk comes from people over-estimating AI capabilities.</h3> <p>There are many risks we should be conscious of, but the downsides that are biting us now come from people believing in AI capabilities or sentience that isn’t there. “<a href=\"https://www.dbreunig.com/2025/01/01/cyren.html\">I don’t worry about superintelligent AGI’s taking over the world. I worry about bots convincing",
            "title": "2025 in Review: Jagged Intelligence Becomes a Fault Line"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-12-28_6a241bd395c2_yuzu-land/",
            "publishedAt": "2025-12-29",
            "source": "Harper Reed",
            "summary": "<p>Yuzu land</p> <figure> <img alt=\"image_1.jpg\" height=\"1350\" src=\"https://harper.blog/notes/2025-12-28_6a241bd395c2_yuzu-land/image_1.jpg\" width=\"1800\" /> </figure> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #309"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-12-28_857229e13ca7_my-pockets-are-full-of-yuzu/",
            "publishedAt": "2025-12-29",
            "source": "Harper Reed",
            "summary": "<p>My pockets are full of yuzu.</p>\n\n                        \n                        <hr />\n                        <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #308"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Tyler Cowen and Patrick Collison are sponsoring <a href=\"https://newaesthetics.art/\">A Call For New Aesthetics</a>, $5K - $250K grants to &#8220;artists, architects, and designers who are consciously working to define&#8221; a new aesthetics for the 21st century. Seems crazy ambitious, but that&#8217;s what people said about Progress Studies, and that one worked, so this duo has earned my trust. But please do me a favor and only apply if your aesthetics are good. It would be a shame if they put in all this work, and we just got another hundred years of bad aesthetics.</p><p><strong>2: </strong>MATS - a research fellowship for people who want to get into AI alignment, interpretability, security, and governance - is accepting applications for their summer cohort. 12 weeks, in person in either Berkeley or London, fully funded with $15K stipend, $12K compute budget, free room/board/travel. <a href=\"https://www.matsprogram.org/apply?utm_source=acx&amp;utm_medium=blog&amp;utm_campaign=s26\">Apply here</a>, they say the application will take &#8220;1 - 2 hours&#8221;, deadline January 18.</p><p><strong>3: </strong>Ozy <a href=\"https://thingofthings.substack.com/p/american-effective-altruists-should\">has a post arguing</a> that EAs should be more willing to donate to political campaigns, and that donations before January 1 are most effective. Includes his specific candidate recommendations for Democrats; thoughts for Republicans/independents/non-Americans to follow. </p><p>And a reader writes in to say that if you&#8217;re an American concerned about chip exports, you might want to call your senator. To reduce friction as much as possible, he gives a potential script - go to 5calls.org, pick the first random issue on their list, ignore their suggested script, and paste this instead:</p><blockquote><p>Hi, I&#8217;m X a constituent in Y. I&#8217;m calling about reports that the administration is allowing U.S. firms to sell advanced AI chips, like Nvidia&#8217;s H200, to approved customers in China.</p><p>I&#8217;m very concerned this could strengthen China&#8217;s strategic AI capabilities. Access to high-end chips is what limits how fast powerful AI models can be trained. Easing these controls risks accelerating China&#8217;s progress in military and intelligence applications, eroding the U.S. and allied lead in critical technologies.</p><p>I&#8217;m asking the Senator/Representative to push for full transparency on these export licenses, strict enforcement of end-use checks, and public hearings on whether these sales truly serve U.S. interests, and to support the GAIN AI Act.</p><p>Could you please log my concern and let me know the member&#8217;s position on this issue?</p></blockquote>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-414",
            "publishedAt": "2025-12-29",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Tyler Cowen and Patrick Collison are sponsoring <a href=\"https://newaesthetics.art/\">A Call For New Aesthetics</a>, $5K - $250K grants to &#8220;artists, architects, and designers who are consciously working to define&#8221; a new aesthetics for the 21st century. Seems crazy ambitious, but that&#8217;s what people said about Progress Studies, and that one worked, so this duo has earned my trust. But please do me a favor and only apply if your aesthetics are good. It would be a shame if they put in all this work, and we just got another hundred years of bad aesthetics.</p><p><strong>2: </strong>MATS - a research fellowship for people who want to get into AI alignment, interpretability, security, and governance - is accepting applications for their summer cohort. 12 weeks, in person in either Berkeley or London, fully funded with $15K stipend, $12K compute budget, free room/board/travel. <a href=\"https://www.matsprogram.org/apply?utm_source=acx&amp;utm_medium=blog&amp;utm_campaign=s26\">Apply here</a>, they say the application will take &#8220;1 - 2",
            "title": "Open Thread 414"
        },
        {
            "content": [
                "<p>Here’s to everyone having a great 2026 in all ways, so I figured what better way to end the year than with a little practical advice. Like everything else, dating is a skill. Practice makes perfect. It helps to combine it with outside analysis, to help you on your quest to Just Do Things.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Lack Reps</h4>\n\n\n<p>A common theme in these roundups is that the best thing you can do as a young man, to get better at dating and set yourself up for success, is to get out there and engage in deliberate practice.</p>\n<blockquote><p><a href=\"https://x.com/CartoonsHateHer/status/1952689804111388826\">Cartoons Hate Her</a>: <a href=\"https://www.cartoonshateher.com/p/dont-delay-dating-to-build-yourself\">Today I wrote about some of the worst dating advice that young men get</a>. Namely, the advice to delay dating or relationships until they’ve “built themselves,” usually into their 30s.</p>\n<div>\n\n\n<span id=\"more-24990\"></span>\n\n\n</div>\n<p>Getting dating experience- even when it clearly doesn’t matter- builds social skills and confidence. It’s not something you want to deliberately defer. Dating *is* working on yourself.</p>\n<p><a href=\"https://x.com/zdch/status/1952717461347766628\">Zac Hill</a>: Hard true and also generally applicable. Niko Canner told me a variant of this when I was about to work at Bridgewater to ‘acquire skills’:</p>\n<p>“what job are you acquiring skills for?”</p>\n<p>“basically my current job”</p>\n<p>“we’ll just keep doing that job, and you’ll acquire those skills!”</p></blockquote>\n<p>I didn’t date at all until well into my 20s because of reasons, so I have some experience with this, and it is absolutely was the opposite of correct ‘building myself’ strategy. Totally counterproductive. Even in terms of otherwise building yourself, the skills you get dating will help you elsewhere, and also motivate you and direct you. There are of course temporary exceptions if you go deep into a startup or something, but yeah, absolutely get out there.</p>\n<p>As a woman, you typically (by all reports) have no trouble getting reps as such, but there is still the danger that you waste those reps if you keep repeating the same procedures without learning how to improve, which could be in any number of ways including selection.</p>\n<p>Note that reps applies the whole way through, and don’t forget to postmortem.</p>\n<blockquote><p>Eliezer Yudkowsky: The way to get good at sex is the same as the way to get good at any other process: Once you’re done, roll out the whiteboard and together do a no-fault analysis of what went wrong, what went right, and what could’ve been done differently.</p>\n<p>Reactions divided into “lol u autists” and “well yes that is how it works” and my friends it is the second class that has acquired dangerously high sexual capabilities</p>\n<p>le petit postmortem</p>\n<p>Sofia: Both reactions are correct</p>\n<p>Aella: this is unironically the method behind the best sex of my life.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">You’re Single And Didn’t Even Shoot Your Shot</h4>\n\n\n<blockquote><p><a href=\"https://x.com/TheZvi/status/1965370890457358336\">Brooke Bowman</a>: in a romantic context, what does it mean to ‘shoot your shot’? i’m curious what the range of actions the phrase implies is</p>\n<p>is it like confessing your feelings/asking on a date or do you also think dropping your handkerchief counts.</p></blockquote>\n<p>I believe it means, both in romantic and non-romantic contexts: Create common knowledge that you are shooting your shot, that you are interested, and that failing to respond positively is a rejection, such that you cannot easily ‘shoot your shot’ again.</p>\n<p>Thus, anything can count, including dropping a handkerchief, if both parties know the other is sufficiently advanced.</p>\n<p>However, many people especially guys are highly clueless or ambiguously might be clueless, leading to a lot of thinking you shot your shot when you definitely haven’t shot your shot. The threshold is common knowledge, not merely that they pick up on you giving them an opening. That doesn’t count and does not close the book, you have only shot your shot when they know that you know that they know, and so on.</p>\n<p>If you are going to keep interacting in the future, beware ‘wasting your shot’ where you create common knowledge without giving yourself much chance to succeed. By definition you only get one shot (or at least, subsequent shots by default will at least be harder). However, that too can have advantages, as now you can move on having shot your shot, and you do create some amount of positive selection, and the act of creating common knowledge means they could reopen things in the future.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Didn’t Ask To Hold Her Hand</h4>\n\n\n<p>Any time someone says ‘I don’t see how this can backfire’ you definitely shouldn’t take their advice until you’ve figured out how it can backfire.</p>\n<blockquote><p><a href=\"https://x.com/liron/status/1989029611930337501\">Liron Shapira</a>: As a nerdy dating expert, I consider</p>\n<p>Bryan Caplan</p>\n<p>‘s <a href=\"https://www.betonit.ai/p/i-want-to-hold-your-hand\">handholding tactic</a> <a href=\"https://www.betonit.ai/p/i-come-not-to-help-pick-up-artists\">to be the best practice for shy men</a> looking to get into a romantic relationship (and not be stuck in the friend zone).</p>\n<p>Could this somehow backfire? I claim it can’t. Let’s game it out.</p></blockquote>\n<p>The suggestion isn’t that you do more requested hand holding while dating, it is to use this request as an escalation move out of a potential friend zone.</p>\n<p>The theory is that your romantic intent here is obvious, expressed in a non-creepy way, thus creating common knowledge, but it is not explicit so it is deniable common knowledge so you can still retreat to a friendship on a fail, she’ll at least be impressed you tried and maybe she eventually decides to return interest even if she doesn’t now, and probably she actually says yes and you can keep building from there.</p>\n<p>This is in contrast to <a href=\"https://www.betonit.ai/p/i-want-to-hold-your-hand\">Bryan’s advice to do this on all first dates</a>, or at least to establish you are indeed on one, and as a way of establishing common knowledge of the situation and failing fast.</p>\n<p>The part I 100% agree with is, provided you are interested, you are better off doing something rather than doing nothing, whether on an existing date or not. Shoot your shot, whatever your shot may be. And yes, if you’re too shy or unskilled to take a better or more subtle shot, then this is a shot one can take take.</p>\n<p>That doesn’t mean it should be this shot. So, let us count the ways this can backfire.</p>\n<ol>\n<li>She says no, where on a better executed move she would have said yes. Then it is much harder for you to try again, indeed the whole point here is that you wouldn’t try again. Skill absolutely matters, and this by design is a case of you only get one shot. Contra Liron, no, you’re not going to get a yes a majority of the time.\n<ol>\n<li>In addition to it coming off weird or as representing a lack of skill or awareness, this can be seen as insufficiently ambiguous or too far up the escalation ladder if you go too early.</li>\n<li>One thing is if she’s looking for a more casual vibe, going for ‘romantic coded’ actions like holding hands too early can give the ick when you were live. There’s a Sex and the City where exactly this ask is an instant dealbreaker, even after they’ve slept together, because it was a failure to read the room.</li>\n</ol>\n</li>\n<li>She says no, where on a better executed move that did not force clarity you would have gotten a maybe or a soft no that lets you stay in the game. Forcing clarity can work against you. This is fine if you’re shooting a bunch of shots, but not if this is an especially valuable shot to shoot.</li>\n<li>She says no, and rather than being impressed she is not impressed or weirded out, thus leaving the friendship in a worse position. Cost of shooting shots, but that’s one way in which it is not riskless, and the less ambiguous and more awkward the shot the greater the risk of this.</li>\n<li>She says yes, but it’s awkward in context, and so on.</li>\n</ol>\n<p>Again, I don’t want to discourage anyone too much here. It is far from the worst move, and again something beats nothing. But we don’t believe in misleading anyone.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You’re Afraid People Will Mock You Online</h4>\n\n\n<blockquote><p><a href=\"https://x.com/bumbadum14/status/1927858739874517252\">Bumbadum</a> (2.1m views): This type of behavior killed romance and I hate you people for it.</p>\n<p>I hate the knowledge that millions of young men cannot hope to ever express love in the purest most beautiful way because you disgusting whores will post it on social media and mock in private.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!UF5n!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3ac06772-9985-458a-b1b1-6fafd6f3df36_511x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!oqKl!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7b4f3c0d-7ab5-4a27-99ce-f23d3a9fe368_578x680.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Young men lost the ability to express those feelings. To write, to feel, to be comfortable. They have to bury deep down and hide it from the world less they be cruelly mocked.</p>\n<p>You disgusting hags lost the ability to ever see it. You disgusting cretins all wish to have a Notebook love story meanwhile any feeling of that unconditional love is met with mockery.</p>\n<p>I hate you all.</p>\n<p>I am getting DM’s that essentially describe romance movie plotlines that end with “but she hated romance”</p></blockquote>\n<p>Unfortunately Rona Wang (understandably) took her Twitter private by the time I got to this, so I couldn’t gather more context there, but there are some obvious notes here.</p>\n<ol>\n<li>The context is that she was the only girl at the hackathon. That’s a context where you don’t open at all, in any form, without strong indications of interest. If this was done in an ordinary mixed context, presumably that would be different.</li>\n<li>This is a clear NRN (no reply necessary) opening, which makes it less of a problem than opening moves that require a response, but even outside of the gender imbalance context I wouldn’t call it ‘romance.’</li>\n<li>You think this thread is bad for the guy who passed her the note?</li>\n</ol>\n<p>As in, no one knows who passed this note. He’s fine. And indeed, you have a play available, which is to reply with some version of ‘I am the guy who sent the note, she didn’t reply so I’m still single, I live in city and my DMs are open.’ Yes, many of the DMs won’t be kind, but if you’re okay with that, 61 million views on OP and it only takes one hit. If the context was different such that you looked better, you’re all set.</p>\n<p>Then on Nicole’s post (original had 5m views):</p>\n<ol>\n<li>Pretty sure it worked.</li>\n<li>Many of the comments assume that it didn’t and it was awful, but that it is odd given that the document says that it worked.</li>\n<li>This is indeed a high risk, high reward play, because you are putting her on the spot and if the answer isn’t an enthusiastic yes then oh boy is it no, you haven’t given her an out, the same way you really, really don’t want to propose and get anything but a yes.</li>\n<li>Third date is almost always going to be too early to do this, and also as executed it risks coming off as rather creepy and weird, even if you did read the room right.</li>\n<li>So it’s almost always a bad play as executed.</li>\n</ol>\n<blockquote><p><a href=\"https://x.com/AllyTaft/status/1927708309668180366\">Allyson Taft’s screenshotted post</a>: A guy did this to my best friend on a 3rd date, and we started calling him “Mr. Check Yes or No” in the group chat, and she never saw him again.</p>\n<p><a href=\"https://x.com/Pat_Stedman/status/1927710367435608566\">Pat Stedman</a>: Only works if she is already eager to be your girlfriend. NEVER do this stuff if there is any uncertainty, it will work against you.</p>\n<p>Brandon Burr: Stories like this are why a lot of guys in the dating world stopped trying to be romantic. It’s punished severely by a lot of women, unfortunately.</p>\n<p>Allyson Taft: I believe it. I think being able to read the room is an important skill for everyone, always, but especially in dating.</p>\n<p>Mimetic Value: You’re overanalyzing it and took it too seriously. This is exactly what I’d do if the date is NOT going well. It’s for giving her a final chance to confirm that he didn’t accidentally write her off too soon. He was already mentally checked out.</p>\n<p>Allyson Taft: He sure called her a lot afterwards for being checked out lmao.</p></blockquote>\n<p>Also known as, it’s good to be romantic, but you have to do a decent job of it. And you don’t want to put them to a decision like this unless you’re fine with being dumped if the answer isn’t an enthusiastic yes. The rest of the dinner was presumably also romantic, and was presumably a good idea if it had ended without this.</p>\n<p>I’m not pretending I am the best at being romantic, but don’t give up on the idea.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Didn’t Confirm Your Date</h4>\n\n\n<p>What are or should be the rules around confirming a date?</p>\n<p>A better question is, how should you navigate such situations yourself?</p>\n<p>Because rules, shumules. Play to win.</p>\n<p>So first off, the background and various reactions.</p>\n<blockquote><p><a href=\"https://x.com/Brooke_Lin1/status/1940202877068460050\">Brooke Lin</a> (19m views): From a friend and for context the previous convo was sunday night but who is in the wrong here?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!E7dt!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff64ea958-c8dc-4ad5-b5b4-5febed8b2f72_1006x1711.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>We got an update folks.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!b2OQ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3aab9a13-a2cf-46a6-be18-c64a347f18e0_1032x571.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!Oir4!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb70c7ecc-1b5e-46ce-bfed-ac36c281fe8b_992x1241.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/liron/status/1940794529206120705\">Liron Shapira</a>: Lol I used to give male dating advice, and one of the major focus areas was “flake defense”.</p>\n<p>(Flake defense turned out critical for meeting my wife.)</p>\n<p>The purple person here, who took the lead on the invite, should’ve demonstrated their attractive flake-defense skill afterwards.</p>\n<p><a href=\"https://x.com/catehall/status/1941157610289537253\">Cate Hall</a>: People have this all wrong. We should be encouraging this kind of behavior. Just think how much time this guy saved.</p>\n<p><a href=\"https://x.com/allie__voss/status/1940573569509216681\">Allie</a>: Ladies: if you say yes to a date, you’ve agreed to go on the date</p>\n<p>Playing games like “he needs to confirm or it doesn’t count!!!” because TikTok told you to is a really dumb way to waste your time</p>\n<p>Be picky about things that matter, but quit making up rules to be upset about.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!guoo!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd4bc0668-caab-4530-bb7c-62e73f0e1519_1006x588.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Autistotle: “Making up rules to be upset about” is at least half of all dating discourse.</p>\n<p>Lovable rogue: honestly as a guy who confirms *every* time, women still flake ~10-15% of the time. we should be trying to make the date happen not shit test each other!</p>\n<p>Shailesh: I always confirmed the previous evening. Yoo many times when they cancelled when I checked up 1 hr-30 min before.</p>\n<p><a href=\"https://x.com/webdevMason/status/1940786069387333922\">Mason</a>: Maybe the real problem with the apps is that nobody is actually very excited about the person they’re about to go on a date with at all. You are supposed to be looking forward to the date more than, like, a dentist appointment.</p>\n<p>Jordan Braunstein: I think everyone is underestimating the absolute scourge of flakiness among both young men and women. There’s no real social penalty for it anymore.</p>\n<p>If there’s a good chance the other person will flake, it becomes game theoretically rational to mitigate that risk by having extra confirmations or readily available backup plans.</p>\n<p>Gingercap: I kind of got the impression that being too excited about a date is kind of cringe and comes off as desperate.</p>\n<p>Noodle: Ehh when I was dating I made the mistake to get ready for the date only to be stood up or ghosted. Nothing wrong with confirming a date because its embarrassing to be waiting around forever for no reason.</p>\n<p><a href=\"https://x.com/TetraspaceWest/status/1941246543987868076\">Tetraspace</a>: If you’re going “yay I don’t have to go to the date :)” instead of “oh man I wanted to go to the date :(” something has went wrong earlier than the morning of the date</p></blockquote>\n<p>There are remarkably deep strategic and mechanism design considerations here. What the rules ‘should’ be is again not so relevant, nor is ‘who is at fault’ per se.</p>\n<p>So here are some various thoughts.</p>\n<ol>\n<li>If you are happy or righteous or similar about being able to cancel the date when they don’t confirm, you shouldn’t have said yes in the first place.</li>\n<li>The flake rate, on all sides, is sufficiently high that the default should now be to confirm on the day of the date. The cost of confirmation is low. In general as the asker it is your job to ensure the date actually happens.</li>\n<li>I can believe that we have reached the point where the flake rate when not getting confirmation is high enough that it is reasonable for the person asked to require confirmation and to treat this as a default dynamic.</li>\n<li>If you require confirmation, ideally you should note that you require confirmation, or better yet proactively ask for it if you don’t get it. But there are selection effect and signaling reasons to not do this. Either way, once you know you’re not going to show, you should explicitly cancel, not silently flake.</li>\n<li>If you don’t say you require confirmation, and don’t show without it, you flaked.</li>\n<li>Flaking is in general extremely poor form and should be treated as a very expensive action in all contexts, romantic or otherwise, especially without notice and especially without apologies.</li>\n<li>If your lack of confirmation causes flaking, that is often favorable selection. If their lack of confirmation causes you to flake, that is also favorable selection.</li>\n<li>If lack of same day confirmation causes flaking on a first date, that is still an unforced error by all involved. In other circumstances, either subsequent dates or non-romantic contexts, this is often not true.</li>\n<li>Confirmation can give both parties an out, so it serves a useful purpose when someone is getting pressured, but it is bad to give people an easy flake out because people will constantly cancel plans of all kinds when they shouldn’t.</li>\n<li>If this is a ‘test of enthusiasm’ or otherwise phrased or presented in ways similar to the OP then I would consider it a red flag.</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Didn’t Have Your Big Moment At The Prom</h4>\n\n\n<p>My revealed preference at the time was not to go at all, have no real options for going and make no effort to go. Neither of these options was remotely on the table, although I would like to think I would have happily accepted either of them.</p>\n<p>So I’m not sure I’m the best person to judge the options?</p>\n<blockquote><p><a href=\"https://x.com/Romy_Holland/status/1954243499890741347\">Romy</a>: imagine you’re a high school senior and it’s prom season. would you rather go with a 10 who will definitely not have sex with you, or a 7 who definitely will?</p>\n<p>Kip: I chose the no sex option because I didn’t want to have sex yet in high school</p>\n<p>Ronny: lol a 7 who will *definitely* have sex with you is a disturbing option in that case.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!eTJt!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa9ed18da-0a5e-4010-b0c4-0a9ff2924e9b_1032x434.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>I was thinking in terms of ‘you have no future with either of them, everyone is going to say goodbye and head off to college.’ If there is a real future involved then that should presumably dominate the question either way. As does the question of whether anyone believes in the pairing, including especially the two of you.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because Board Games Came Between You</h4>\n\n\n<p><a href=\"https://x.com/tracewoodgrains/status/1903835150175133711\">What does one make of</a> what was intended to be a singles event in which the men ended up playing board games and getting to know each other, while the women talked and got to know each other?</p>\n<blockquote><p>Tracing Woodgrains: dudes rock</p>\n<p>there’s actually a lot to be said about the framing of the paragraph — the women preferred to talk, the men preferred board games, the women lamented that the men didn’t talk with them bc they didn’t feel like playing board games with the men</p>\n<p>both are good activities!</p>\n<p>Ben Hoffman: This feels like a good example of the sort of information I’d have responded wrongly to, before I learned that if a woman keeps complaining about men doing X, that’s most likely an expression of preference for the sorts of men who do X, not an offer to transact with men who don’t.</p></blockquote>\n<p>The article of course framed this as the guys refusing to interact with the women, rather than both sides choosing distinct activities, and also it seeming still great?</p>\n<p>It seems like a good use of an evening to play board games where I meet new friends, or I sit around and talk and meet new friends, whether or not I am single. We all need more friends. The woman here says she left with potential new friends too.</p>\n<p>It does seem like it should not be a stable equilibrium. Why didn’t any of the women join the board games? Why didn’t any of the men go monopolize all the women? Both seem like highly overdetermined strategies, at least on repeated play, if things aren’t already going great.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Can’t Dance</h4>\n\n\n<p>Knowing how to dance, especially as a guy, <a href=\"https://x.com/Aella_Girl/status/1945239362406637625\">remains a cheat code</a>. It’s not as effective as it used to be because opportunities come up less often, and certainly it’s optional, but it is still very clearly a cheat code.</p>\n<p><a href=\"https://x.com/CartoonsHateHer/status/1945079294633312366\">Cartoons Hate Her asserts it no longer works because</a> if you dance like no one’s watching, your assumptions might be wrong, and then someone might film you and put it on the internet and suddenly everyone’s watching. Why take the risk?</p>\n<p>The answer is because that risk is dumb. This is similar to worries about children being kidnapped by strangers. No one is filming you and even if they are no it is not going to go viral, and if it does you will probably be fine or even benefit.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single And Should Try Punching</h4>\n\n\n<p><a href=\"https://brittanyhugoboom.substack.com/p/you-need-to-start-approaching-beautiful?r=fdsrf&amp;utm_campaign=post&amp;utm_medium=web&amp;triedRedirect=true\">Brittany Hugoboom advises you to approach the truly beautiful women</a> who seem out of your league but aren’t the type that thrive on and seek out attention, because often no one else will shoot their shot and you end up with little competition while everyone else goes for the ‘beautiful mid.’</p>\n<p>The comments are full of the usual ‘you don’t get it men are afraid to approach women due to potential retaliation’ but this completely misses the point here, which is that men are (statistically speaking) approaching the wrong women. There’s also a bunch of ‘oh we assume she already has someone or always has options’ whereas the whole point of the post is this often isn’t true, unless she’s willing and able to initiate, at least sufficiently to indicate the coast is clear.</p>\n<p>Yes, of course she (and most other women) can get infinite attention on apps, but most strongly prefer to get approached organically if at all possible.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Don’t Send Out Receptive Energy</h4>\n\n\n<p>Ask for and set up what you want and you’re more likely to get it.</p>\n<blockquote><p><a href=\"https://x.com/sailaunderscore/status/1948072800645996974\">Salia</a>: Pandemic of underfucked women.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!BMEw!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe73a64b-d395-4361-8993-5a2c696cdb6c_1200x770.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Eoin Walsh: The Men are not in vegan restaurants in downtown Manhattan.</p>\n<p><a href=\"https://x.com/sashachapin/status/1948447816994750487\">Sasha Chapin:</a> So I have no desire to comment on the culture war issues at play. I will note that I have had the following conversation with a number of women asking for advice, like, a half dozen</p>\n<p>Them: “I want men to take charge and act like men”</p>\n<p>Me: “Do you prompt that with receptive energy?”</p>\n<p>Them: “…what?”</p>\n<p>Meanwhile, women I know who understand how to do this have zero trouble! Seduction is a two-way game. A couple of women have taken my advice on this and found it life-altering.</p>\n<p>In general, you will have a much better time in life if you assume that it is your responsibility to prompt the interactions you would like to have.</p>\n<p>Annals of people taking this advice seriously:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!KeeU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3a2a4746-0059-4b2b-acc8-6bc8e51f05ee_861x847.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This person just gave me permission to mention that she’s been in a relationship for a month and it appears to be going well so far.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You’re A Depressed Comedian</h4>\n\n\n<p>The higher the stakes the better the first date idea, so sure, go for it. Waiting in line for a while also gives you a forced time excuse to talk.</p>\n<blockquote><p>Signull: If you want an elite-tier first date idea, here’s the cheat code: Buy tickets to a comedy show in NYC and deliberately show up disgustingly early so you get planted in the front row like sacrificial offerings.</p>\n<p>If the two of you can survive 90 minutes of being roasted by several lonely, depressed comics in graphic tees who pretty much look homeless, congrats, that’s basically a huge relationship stress test.</p>\n<p>Whatever comes after (assuming you didn’t get a reality check) will feel like easy mode.</p>\n<p>I was the depressed comic.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Didn’t Hand It To Her</h4>\n\n\n<blockquote><p>Grace Jarvis: if a woman tells you you have “nice hands” she is doing everything in her power not to fuck you senseless please release her from her torment her friends are receiving the kinds of messages someone in prison would send</p>\n<p><a href=\"https://x.com/gracejarvisohno/status/1993096159829934475\">Grave Jarvis</a> (14 months later): the person who kinda inspired this tweet and I have been together for over a year now</p>\n<p>by “kinda inspired” I mean, I thought “oh he has nice hands” and then I didn’t say anything because of the implication and wrote down the funniest hyperbolic version</p>\n<p><a href=\"https://x.com/mixedknuts/status/1993377618507526370\">Ted Knutson</a>: Can confirm with large sample size that this is true.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">You’re Single And Need The Right Reward Function</h4>\n\n\n<p>A very wise rule. If you don’t want to get feedback from someone, don’t date them, definitely don’t marry them, and probably don’t be friends with or work with them.</p>\n<blockquote><p><a href=\"https://x.com/ChrischipMonk/status/1974931033708699933\">Chris Lakin</a>: The reason that RLHF doesn’t work for your personality is there are very few people you want feedback from</p>\n<p>Jakeup: only marry someone whose feedback you want as your reward function.</p>\n<p><a href=\"https://x.com/ChrischipMonk/status/1974933668734083329\">Chris Lakin</a>: only date people whose feedback you want as your reward function.</p></blockquote>\n<p>Now imagine being an LLM and having to get feedback from *shudder* everyone.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single So Focus On The Basics</h4>\n\n\n<p>Brittany Hugoboom says focus on the basics that matter. You need shared values and a baseline level of physical attraction, and a few key traits, the rest is more of a bonus. Sorting for other things, as dating apps lead you towards, is in her model largely a trap.</p>\n<blockquote><p>Brittany Hugoboom:</p>\n<p>• Men, look for courage, justice, ambition, and discipline.</p>\n<p>• Women, look for benevolence, loyalty, and a kind heart.</p>\n<p>I always say: the best case scenario is finding love young. Not because it’s the only way. But because when you’re young, you’re more adaptable.</p>\n<p>If you both come from good families, they’ll cheer you on.</p>\n<p>You can build something from the ground up, together.</p>\n<p>Love after 30? Absolutely possible.</p>\n<p>But if you’re young and thinking about love, don’t let the world scare you out of it. We’re often told to wait forever and then older generations wonder why the young is no longer finding love.</p>\n<p>When you’re young, school is a great place to meet someone.</p>\n<p>So is church. A party. An event. Through mutual friends. I’d argue even Twitter or Substack would be a better way to find someone than a dating app.</p>\n<p>If you like someone’s mind and values, and also happen to like their photo, it’s perfect.</p></blockquote>\n<p><a href=\"https://brittanyhugoboom.substack.com/p/why-should-men-get-married\">Her blog seems full of other similarly basic pieces of largely good advice</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Not Single Anymore</h4>\n\n\n<blockquote><p><a href=\"https://x.com/kirawontmiss/status/1926342918542905706\">Kira:</a> LMFAOOOO</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!SBe9!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb896ca03-7e79-413f-8d96-fb109633f54a_1002x1309.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Mason: Honestly, “girl who gets bull-headed and wears cargo pants when he tells her to wear the dress” and “guy who told her to wear the dress but is amused by the cargo pants” are both lovable types</p>\n<p>Mazel tov, be married 50 years and bicker about the throw pillows on your deathbed</p>\n<p>She’s a terrible match for someone who takes this kind of thing personally, but it doesn’t look like she’s marrying that kind of guy</p>\n<p>He looks absolutely thrilled</p>\n<p>Marilyn Maupin: I got yelled at by so many people for saying they’ll be fine since she clearly understands what she did to herself</p>\n<p>Mason: Seriously, as long as she’s laughing at herself instead of doubling down and insisting he’s the jerk for proposing to her in the cargo pants they’re fine. Twitter consists of the most disagreeable people in the world insisting that everyone shy of perfect agreeableness is ngmi</p></blockquote>\n<p>I’d be thrilled too. You have a much better story this way, and it probably went fine given she posted it like this. If she’s actually mad about it, then yeah, red flag, but at the best possible time.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Don’t Just Do Things</h4>\n\n\n<blockquote><p><a href=\"https://x.com/roguewealth/status/1988214040594640939\">Alberto De Lucca</a>: My wife and I spoke many times about marrying. During one of these convos, I plain asked her: “do you want to marry me?” She said yes. I said, “ok, let’s do this.” We went out the next day and bought our rings (plus her engagement ring). We then planned to marry on her birthday party (a couple weeks in) but told no one. In fact, they thought I was going to propose to her.</p>\n<p>Anyway. Party starts. She gets on a mic. “Thank you for coming to my birthday everyone.” I get on my knees behind her. Everyone starts doing the awws and whatnot. I do the deed. She says yes. Everyone’s happy. On cue, my mother asks: “so when’s the wedding?” We look at each other: “how about today? Is there anyone who can officiate this marriage?”</p>\n<p>In walks the registrar with the papers. “I can, sure.” Waiters and personnel change the decor from a birthday party to a wedding party. We got married minutes later.</p>\n<p>The look on the faces of our families is something I’ll never forget.</p>\n<p>You can just do things.</p></blockquote>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/29/dating-roundup-8-tactics/",
            "publishedAt": "2025-12-29",
            "source": "TheZvi",
            "summary": "Here’s to everyone having a great 2026 in all ways, so I figured what better way to end the year than with a little practical advice. Like everything else, dating is a skill. Practice makes perfect. It helps to combine &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/29/dating-roundup-8-tactics/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Dating Roundup #8: Tactics"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3187/",
            "publishedAt": "2025-12-29",
            "source": "XKCD",
            "summary": "<img alt=\"1,300,000-1,400,000 ft: Ask a crew member to show you how to use the ISS food warmer.\" src=\"https://imgs.xkcd.com/comics/high_altitude_cooking_instructions.png\" title=\"1,300,000-1,400,000 ft: Ask a crew member to show you how to use the ISS food warmer.\" />",
            "title": "High Altitude Cooking Instructions"
        },
        {
            "content": [
                "<p>UPDATE(2025-12-29T13:04Z-5): If you run a git forge: disable unauthenticated clones for repos larger than 512Mi until further notice.</p>\n        <p>Recently <a href=\"https://inbox.sourceware.org/overseers/20251229005935.GJ30914@gnu.wildebeest.org/T/\">Sourceware had to disable git clone over HTTP</a> due to an attack where lots of random Git clients are cloning repositories. This was surprising to me, I thought the Git client didn't need any smarts on the server and most of the &quot;magic&quot; was just serving flat files based on the client needs. It turns out that <a href=\"https://git-scm.com/docs/git-http-backend\">the git HTTP backend</a> is way more complicated than I thought it was and the actual problem boils down to something that's as old as I am: the <a href=\"https://en.wikipedia.org/wiki/Common_Gateway_Interface\">Common Gateway Interface (CGI)</a>.</p>\n        <p>A CGI handler is a program that gets request metadata from environment variables and standard input, then returns the result over standard output. This means that the web server has to fork/exec a new process for every request. If your service ends up getting very popular very quickly, this can incur <a href=\"https://en.wikipedia.org/wiki/Fork_bomb\">forkbomb</a> attacks.</p>\n        <p>The default and recommended configuration for serving git repositories over HTTP is to use <a href=\"https://git-scm.com/docs/git-http-backend\">the git-http-backend CGI handler</a> to serve traffic. This means that every time a git client is cloning a repo, the server side needs to spawn a new copy of the process to handle the request. In most cases, this is fine. In extreme cases where lots of residential proxies are cloning every repo they can and making the server calculate absurd diffs between random commit hashes, this results in the opposite of rejoicing.</p>\n        <p>I am not entirely sure what to suggest to users of Anubis that serve git repositories with git-http-backend. My SRE instinct is that the entire model of using fork/exec with CGI is fundamentally broken and the git-http-backend service needs to be its own HTTP server that can run persistently and concurrently handle requests, but that is not something that can be slapped together instantly.</p>\n        <p>Am I missing something really simple that I don't know about? Google has failed me.</p>"
            ],
            "link": "https://xeiaso.net/notes/2025/distributed-git-ddos/",
            "publishedAt": "2025-12-29",
            "source": "Xe Iaso",
            "summary": "<p>UPDATE(2025-12-29T13:04Z-5): If you run a git forge: disable unauthenticated clones for repos larger than 512Mi until further notice.</p> <p>Recently <a href=\"https://inbox.sourceware.org/overseers/20251229005935.GJ30914@gnu.wildebeest.org/T/\">Sourceware had to disable git clone over HTTP</a> due to an attack where lots of random Git clients are cloning repositories. This was surprising to me, I thought the Git client didn't need any smarts on the server and most of the &quot;magic&quot; was just serving flat files based on the client needs. It turns out that <a href=\"https://git-scm.com/docs/git-http-backend\">the git HTTP backend</a> is way more complicated than I thought it was and the actual problem boils down to something that's as old as I am: the <a href=\"https://en.wikipedia.org/wiki/Common_Gateway_Interface\">Common Gateway Interface (CGI)</a>.</p> <p>A CGI handler is a program that gets request metadata from environment variables and standard input, then returns the result over standard output. This means that the web server has to fork/exec a new process for every request. If your service ends up getting very popular very quickly, this can incur <a href=\"https://en.wikipedia.org/wiki/Fork_bomb\">forkbomb</a> attacks.</p> <p>The default and recommended configuration for serving git repositories over HTTP is to use <a href=\"https://git-scm.com/docs/git-http-backend\">the git-http-backend CGI handler</a> to serve traffic. This means that every time a git client is cloning a repo, the",
            "title": "Git's HTTP server side design does not scale"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-29"
}