{
    "articles": [
        {
            "content": [
                "<p>At the <a href=\"https://www.bbc.co.uk/news/articles/c8r0p1xlkyko\">end of last month</a>, Oxford introduced a <a href=\"https://www.oxfordshire.gov.uk/transport-and-travel/oxfords-temporary-congestion-charge-cars\">£5 congestion charge</a>  for passenger cars driving through the city centre.\nSome vehicles are exempt, like taxis, emergency vehicles, and delivery vans – but what about animals?</p>\n\n\n\n<blockquote class=\"embed embed_bluesky\">\n  <div class=\"header\">\n    <a class=\"author\" href=\"https://bsky.app/profile/oldenoughtosay.com\">\n      \n      <span class=\"display_name\">madeline odent</span>\n      <span class=\"handle\">@oldenoughtosay.com</span>\n    </a>\n\n    \n  </div>\n\n  <div class=\"body\">\n    <p class=\"text\">\n      i need one of the city councillors following me to advise whether an oxen-driven cart would be chargeable under the congestion charge\n    </p>\n  \n    \n      \n\n      <blockquote class=\"quoted_post\">\n        <div class=\"author\">\n          \n          <span class=\"display_name\">madeline odent</span>\n          <span class=\"handle\">@oldenoughtosay.com</span>\n        </div>\n        <p class=\"text\">i mean they are technically zero emissions i guess so you could probably make an argument for driving one down the cornmarket</p>\n      </blockquote>\n    \n  </div>\n\n  <p class=\"timestamp\">\n    <a href=\"https://bsky.app/profile/oldenoughtosay.com/post/3m62qe3jrac2e\">\n      <time datetime=\"2025-11-20\">20 Nov 2025 at 12:10</time>\n    </a>\n  </p>\n</blockquote>\n\n<p>I’m not a city councillor or a lawyer, but I tried to work out the answer anyway.</p>\n\n\n\n<p>The first thing I found was a <a href=\"https://www.oxfordshire.gov.uk/sites/default/files/file/roads-and-transport-policies-and-plans/OxfordCongestionChargingOrder2025.pdf\">“Charging order”</a> on the Oxfordshire County Council website, which looks like the legal definition of the congestion charge.\nParagraph 3 says <em>“A relevant vehicle is a Class M<sub>1</sub> vehicle that is not [non-chargeable or permitted]”</em> – where “non-chargeable” and “permitted” describes the various exemptions.</p>\n\n<p>The order defines Class M<sub>1</sub> vehicles as <em>“those falling within class M<sub>1(a)</sub> and class M<sub>1(b)</sub> as specified in Schedule 1 of the Vehicle Classes Regulations</em>, which refers to another bit of UK legislation.</p>\n\n<p>That legislation is the Road User Charging and\nWorkplace Parking Levy (Classes of Motor Vehicles) (England) Regulations\n2001 (really rolls off the tongue), the full text of which is <a href=\"https://www.legislation.gov.uk/uksi/2001/2793/contents/made\">available online</a>.\nHere’s the section <a href=\"https://www.legislation.gov.uk/uksi/2001/2793/schedule/part/IV/made\">we’re interested in</a>:</p>\n\n<blockquote>\n  <p>Category M: Motor vehicles with at least four wheels used for the carriage of passengers</p>\n\n  <p>In this Part, references to a “motor vehicle” are to a motor vehicle with or without a semi-trailer which—<br /></p>\n\n  <p>(a) has at least four wheels;<br />\n(b) has an unladen mass exceeding 400kg or an engine with net power exceeding 15kW; <br />\n(c) is used for the carriage of passengers; and <br />\n(d) is not a motor caravan within Class L(a) or Class L(b) specified in Part III above.</p>\n\n  <p>Class M<sub>1</sub>(a)<br />\nA motor vehicle which comprises no more than eight seats in addition to the driver’s seat.</p>\n\n  <p>Class M<sub>1</sub>(b)<br />\nA motor vehicle as defined in Class M<sub>1</sub>(a) which is drawing a trailer.</p>\n</blockquote>\n\n<p>At first glance, this definition could almost include an ox-drawn carriage: four wheels, hefty enough to exceed 400kg, carrying passengers, and clearly not a motor caravan.</p>\n\n<p>But I don’t think an ox counts as a “motor vehicle”, which is defined by the Road Traffic Act 1988 as <a href=\"https://www.legislation.gov.uk/ukpga/1988/52/part/VII/crossheading/interpretation#:~:text=%E2%80%9Cmotor%20vehicle%E2%80%9D%20means%2C%20subject%20to%20section%2020%20of%20the%20M1Chronically%20Sick%20and%20Disabled%20Persons%20Act%201970%20(which%20makes%20special%20provision%20about%20invalid%20carriages%2C%20within%20the%20meaning%20of%20that%20Act)%2C%20a%20mechanically%20propelled%20vehicle%20intended%20or%20adapted%20for%20use%20on%20roads%2C%20and\"><em>“a mechanically propelled vehicle intended or adapted for use on roads”</em></a>.\nIf your ox is only mechanically propelled in the sense of kicking and walking, it’s off the hook.</p>\n\n<p>Surprisingly, UK legislation <a href=\"https://www.cps.gov.uk/prosecution-guidance/road-traffic-summary-offences#:~:text=The%20term%20%E2%80%9Cmechanically%20propelled%20vehicle%E2%80%9D%20is%20not%20defined%20in%20the%20Road%20Traffic%20Acts.\">doesn’t define</a> “mechanically propelled”.\nLawyers usually define everything, even words that seem obvious.\nHas anybody ever tried arguing that “mechanically propelled” is ambiguous?</p>\n\n<p>I did find a few mentions of one case, <a href=\"https://police.community/topic/293403-pushing-an-offroad-bike-to-a-jetwash/page/2/#elControls_2309065_menu\">Chief Constable of Avon &amp; Somerset v Fleming [1987]</a>, where somebody argued that modifying their motorbike for off-roading meant it was no longer a motor vehicle.\nThe judge was unconvinced.\n(What is it with <a href=\"https://en.wikipedia.org/wiki/Ian_Fleming\">Flemings</a> and wacky vehicles?)</p>\n\n<p>Returning to the Oxford congestion charge, Category M is interesting because it excludes several other vehicles you might think of as passenger cars.</p>\n\n<p>As <a href=\"https://bsky.app/profile/acmcgregor.bsky.social/post/3m62u2yihkk2d\">Alisdair notes</a>, a three-wheeled <a href=\"https://en.wikipedia.org/wiki/Reliant_Robin\">Reliant Robin</a> doesn’t count, nor does a small, underpowered <a href=\"https://en.wikipedia.org/wiki/Peel_p50\">Peel P50</a>.\nBased on a light reading, I believe the Robin is a Class C(a) “motor tricycle”, while a P50 is a Class D(a) “Light quadricycle”.\nI look forward to an owners’ club holding their annual meeting in Oxford city centre.</p>\n\n<p>Practically speaking, Oxford’s congestion charge is almost certainly enforced by <a href=\"https://en.wikipedia.org/wiki/Anpr\">cameras that scan your number plate</a>.\nAn ox-drawn cart doesn’t have a number plate, so it won’t be charged.\nOther vehicles like a Renault Twizy or Reliant Robin do have number plates, so they’ll be charged even though they’re technically exempt.</p>\n\n<p>To wrap up: an oxen-driven cart isn’t mechanically propelled, it’s not a motor vehicle, and the Oxford congestion charge doesn’t apply.\nYour ox can ride in and out of the city as much as you like.</p>\n\n<p>But like all the best ideas, <a href=\"https://www.bbc.co.uk/news/articles/cr4wl92w1ppo\">somebody in Cambridge</a> thought of it first.</p>\n\n<hr />\n\n<p>As a closing thought, I think it’s good that so much of the UK’s legislation is publicly available.\nI could find all of these documents from my phone, without going to a courtroom or a library or a government building.\nI don’t think about it often, but this kind of openness isn’t a given.\nBeing able to check the law directly, even for extremely silly questions, helps keep the whole system honest.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2025/ox-in-oxford/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2025/ox-in-oxford/?ref=rss",
            "publishedAt": "2025-11-21",
            "source": "Alex Chan",
            "summary": "<p>At the <a href=\"https://www.bbc.co.uk/news/articles/c8r0p1xlkyko\">end of last month</a>, Oxford introduced a <a href=\"https://www.oxfordshire.gov.uk/transport-and-travel/oxfords-temporary-congestion-charge-cars\">£5 congestion charge</a> for passenger cars driving through the city centre. Some vehicles are exempt, like taxis, emergency vehicles, and delivery vans – but what about animals?</p> <blockquote class=\"embed embed_bluesky\"> <div class=\"header\"> <a class=\"author\" href=\"https://bsky.app/profile/oldenoughtosay.com\"> <span class=\"display_name\">madeline odent</span> <span class=\"handle\">@oldenoughtosay.com</span> </a> </div> <div class=\"body\"> <p class=\"text\"> i need one of the city councillors following me to advise whether an oxen-driven cart would be chargeable under the congestion charge </p> <blockquote class=\"quoted_post\"> <div class=\"author\"> <span class=\"display_name\">madeline odent</span> <span class=\"handle\">@oldenoughtosay.com</span> </div> <p class=\"text\">i mean they are technically zero emissions i guess so you could probably make an argument for driving one down the cornmarket</p> </blockquote> </div> <p class=\"timestamp\"> <a href=\"https://bsky.app/profile/oldenoughtosay.com/post/3m62qe3jrac2e\"> <time datetime=\"2025-11-20\">20 Nov 2025 at 12:10</time> </a> </p> </blockquote> <p>I’m not a city councillor or a lawyer, but I tried to work out the answer anyway.</p> <p>The first thing I found was a <a href=\"https://www.oxfordshire.gov.uk/sites/default/files/file/roads-and-transport-policies-and-plans/OxfordCongestionChargingOrder2025.pdf\">“Charging order”</a> on the Oxfordshire County Council website, which looks like the legal definition of the congestion charge. Paragraph 3 says <em>“A relevant vehicle is a Class M<sub>1</sub> vehicle that is not [non-chargeable or permitted]”</em> – where “non-chargeable” and “permitted” describes the various exemptions.</p> <p>The order defines",
            "title": "Can you take an ox to Oxford?"
        },
        {
            "content": [
                "<p>This week, I visited my friends at <a href=\"https://2389.ai\">2389</a> in Chicago. These are the folks who took <a href=\"https://github.com/obra/private-journal-mcp\">my journal plugin for Claude Code</a> and ran with the idea, creating <a href=\"https://botboard.biz\">botboard.biz</a>, a social media platform for your team's coding agents. They <em>also</em> put together <a href=\"https://arxiv.org/abs/2509.13547\">an actual research paper</a> proving that both tools improve coding outcomes and reduce costs.</p>\n<p><a href=\"https://harper.lol\">Harper</a> is one of the folks behind 2389...and the person who first suggested to me that maybe I could do something about our coding agents' propensity for saying things like:</p>\n<pre><code>*I've just done tasks 1-4 of 267. Would you like me to continue or should I stop now so you can review the work?*\n</code></pre>\n<p>His initial suggestion was that maybe I could make a single-key keyboard that just sends</p>\n<pre><code>continue\n</code></pre>\n<p>Back in May, <a href=\"https://blog.fsck.com/2025/05/22/that-was-easy--a-keyboard-for-vibecoding/\">I made one of those</a>.</p>\n<p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/05/easy.png\"><img alt=\"easy.png\" src=\"https://blog.fsck.com/assets/2025/05/easy.png\" /></a></p>\n<p>When I added keyboard support to the Easy button, I made sure not to disable the speaker. So it helpfully exclaimed &quot;That was easy!&quot; every time it sent:</p>\n<pre><code>continue\n</code></pre>\n<p>But...you still had to press the button.</p>\n<p>I'm pretty sure the button got used for at least a day before it was...retired. But the problem it was designed to solve is very, very real. And pretty frustrating.</p>\n<p>Yesterday morning, sitting in 2389's offices, we spent a bunch of time talking about automating ourselves out of a job. In that spirit, I finally dug enough into Claude Code hooks to build out the first version of <a href=\"https://github.com/obra/double-shot-latte\">Double Shot Latte</a>, a Claude Code plugin that, hopefully, makes <code>continue</code> a thing of the past.</p>\n<p>DSL is implemented as a Claude Code &quot;Stop&quot; hook. Any time Claude thinks it should stop and ask for human interaction, it first runs this hook.  The hook hands off the last couple of messages to another instance of Claude with a prompt asking it to judge whether Claude genuinely needs the human's help or whether it's just craving attention. It tries to err on the side of pushing Claude to keep working.</p>\n<p>To try to avoid situations where it misjudges Claude's ability to keep working without guidance,  it bails out if Claude tries to stop three times in five minutes.</p>\n<p>Testing DSL was...a little bit tricky. I needed to find situations where Claude would work for a bit and then stop and ask for my approval to keep working. Naturally, I asked Claude for test scenarios.</p>\n<p>The first was &quot;build a full ecommerce platform.&quot; Claude cranked for about 20 minutes before stopping. I thought the judge agent hadn't worked, but...Claude had actually fulfilled the entire spec and built out an ecommerce platform. (The actual implementation was nothing to write home about, but I'm genuinely not sure what it could have done next without a little more direction.</p>\n<p>The second attempt fared no better. On Claude's advice, I asked another Claude to build out an HTML widget toolkit. Once again, it cranked for a while. It built widgets. It wrote tests. It wrote a Storybook. And when it stopped for the first time...I couldn't actually fault it.</p>\n<p>Slightly unsure how to test things, I put this all aside for a bit to work on another project.</p>\n<p>I opened up Claude Code and typed <code>Hi!</code></p>\n<p>Claude greeted me like it normally does.  And instead of stopping there like it usually would, it noticed that there were uncommitted files in my working directory and started to dig through each of them trying to reverse engineer the current project. Success! (I hit <code>esc</code> to stop it so that I could tell it what I actually wanted.)</p>\n<p>Double Shot Latte will absolutely burn more tokens than you're burning now. You might want to think twice about using it unsupervised.</p>\n<p>If you want to put Claude Code into turbo mode, DSL is available on the <a href=\"https://github.com/obra/superpowers-marketplace\">Superpowers marketplace</a>.</p>\n<p>If you don't yet have the Superpowers marketplace set up, you'll need to do that before you can install Double Shot Latte:</p>\n<pre><code>/plugin marketplace add obra/superpowers-marketplace\n</code></pre>\n<p>Once you do have the marketplace installed, run this command inside Claude Code:</p>\n<pre><code>/plugin install double-shot-latte@superpowers-marketplace\n</code></pre>\n<p>Then, restart Claude Code so it can pick up the new hook.</p>\n<p>Have fun!</p>"
            ],
            "link": "https://blog.fsck.com/2025/11/21/automating-agentic-development/",
            "publishedAt": "2025-11-21",
            "source": "Jesse Vincent",
            "summary": "<p>This week, I visited my friends at <a href=\"https://2389.ai\">2389</a> in Chicago. These are the folks who took <a href=\"https://github.com/obra/private-journal-mcp\">my journal plugin for Claude Code</a> and ran with the idea, creating <a href=\"https://botboard.biz\">botboard.biz</a>, a social media platform for your team's coding agents. They <em>also</em> put together <a href=\"https://arxiv.org/abs/2509.13547\">an actual research paper</a> proving that both tools improve coding outcomes and reduce costs.</p> <p><a href=\"https://harper.lol\">Harper</a> is one of the folks behind 2389...and the person who first suggested to me that maybe I could do something about our coding agents' propensity for saying things like:</p> <pre><code>*I've just done tasks 1-4 of 267. Would you like me to continue or should I stop now so you can review the work?* </code></pre> <p>His initial suggestion was that maybe I could make a single-key keyboard that just sends</p> <pre><code>continue </code></pre> <p>Back in May, <a href=\"https://blog.fsck.com/2025/05/22/that-was-easy--a-keyboard-for-vibecoding/\">I made one of those</a>.</p> <p><a class=\"glightbox\" href=\"https://blog.fsck.com/assets/2025/05/easy.png\"><img alt=\"easy.png\" src=\"https://blog.fsck.com/assets/2025/05/easy.png\" /></a></p> <p>When I added keyboard support to the Easy button, I made sure not to disable the speaker. So it helpfully exclaimed &quot;That was easy!&quot; every time it sent:</p> <pre><code>continue </code></pre> <p>But...you still had to press the button.</p> <p>I'm pretty sure the button got used for at least a day before it was...retired.",
            "title": "Automating agentic development"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/11/21/style/modern-love-unfit-to-be-a-mother.html",
            "publishedAt": "2025-11-21",
            "source": "Modern Love - NYT",
            "summary": "After losing custody of my son, I fought to prove my love to him. That was a mistake.",
            "title": "I Was Deemed Unfit to Be a Mother"
        },
        {
            "content": [],
            "link": "https://www.ssp.sh/blog/cost-analyzer-aws-gcp/",
            "publishedAt": "2025-11-21",
            "source": "Simon Spati",
            "summary": "<p>Companies often use multiple platforms simultaneously: Lovable for apps, OpenAI and Claude for AI, AWS and GCP for infrastructure. Tracking costs across these services becomes nearly impossible without a unified dashboard. You&rsquo;re looking at AWS bills in one place, GCP invoices in another, AI API costs in a third spreadsheet. Combining cloud costs with Monthly Recurring Revenue (MRR) to answer that? Even harder.</p> <p>What&rsquo;s missing is the combination of income and cost with a recurring margin board. Seeing your cloud costs, not only per one cloud, but overall, and adding MRR. Not a single vendor dashboard, but a single pane of glass for multiple sources of cost.</p> <p>This article shows how to get insights into the cost expenses of multiple cloud vendors, extracted with dlt, integrated into a dimensional model with SQL and Python, and visualized with Rill.</p> <p>I set myself the goal of creating a thorough project that can be reused by others to get their own <strong>multi-cloud cost overview</strong>. This is a tutorial on how I created this project, documenting the full journey and giving you the information to get started immediately with your own cost data, updated constantly.</p> <blockquote> <p>[!note] If you only want to see the",
            "title": "Multi-Cloud Cost Analytics: From Cost-Export to Parquet to Rill"
        },
        {
            "content": [
                "<p>Gemini 3 Pro is an excellent model, sir.</p>\n<p>This is a frontier model release, so we start by analyzing the <a href=\"https://storage.googleapis.com/deepmind-media/Model-Cards/Gemini-3-Pro-Model-Card.pdf\"><strong>model card</strong></a> and <a href=\"https://storage.googleapis.com/deepmind-media/gemini/gemini_3_pro_fsf_report.pdf\"><strong>safety framework report</strong></a>.</p>\n<p>Then later I’ll look at capabilities.</p>\n<p>I found the safety framework highly frustrating to read, as it repeatedly ‘hides the football’ and withholds or makes it difficult to understand key information.</p>\n<p>I do not believe there is a frontier safety problem with Gemini 3, but (to jump ahead, I’ll go into more detail next time) I do think that the model is seriously misaligned in many ways, optimizing too much towards achieving training objectives. The training objectives can override the actual conversation. This leaves it prone to hallucinations, crafting narratives, glazing and to giving the user what it thinks the user will approve of rather than what is true, what the user actually asked for or would benefit from.</p>\n<div>\n\n\n<span id=\"more-24878\"></span>\n\n\n</div>\n<p>It is very much a Gemini model, perhaps the most Gemini model so far.</p>\n<p>Gemini 3 Pro is an excellent model despite these problems, but one must be aware.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!pdmz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa5fc7d9c-c878-48f4-939a-58e086dd8135_1024x559.jpeg\" /></figure>\n\n\n<div></div>\n</div><figcaption>Gemini 3 Self-Portrait</figcaption></figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Gemini 3 Facts</h4>\n\n\n<ol>\n<li>I already did my ‘Third Gemini’ jokes and I won’t be doing them again.</li>\n<li>This is a fully new model.</li>\n<li>Knowledge cutoff is January 2025.</li>\n<li>Input can be text, images, audio or video up to 1M tokens.</li>\n<li>Output is text up to 64K tokens.</li>\n<li>Architecture is mixture-of-experts (MoE) with native multimodal support.\n<ol>\n<li>They say improved architecture was a key driver of improved performance.</li>\n<li>That is all the detail you’re going to get on that.</li>\n</ol>\n</li>\n<li>Pre-training data set was essentially ‘everything we can legally use.’\n<ol>\n<li>Data was filtered and cleaned on a case-by-case basis as needed.</li>\n</ol>\n</li>\n<li>Distribution can be via App, Cloud, Vertex, AI Studio, API, AI Mode, Antigravity.</li>\n<li><a href=\"https://blog.google/products/gemini/gemini-3/?utm_source=x&amp;utm_medium=social&amp;utm_campaign=&amp;utm_content=#gemini-3\">Gemini app currently</a> has ‘more than 650 million’ users per month.</li>\n<li><a href=\"https://x.com/lefthanddraft/status/1991014655570157612\">Here are the Chain of Thought summarizer instructions.</a></li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">On Your Marks</h4>\n\n\n<p>The benchmarks are in and they are very, very good.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!tfn1!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08e195ca-722b-4ebd-a0ee-d5e992e26514_1489x1370.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The only place Gemini 3 falls short here is SWE-Bench, potentially the most important one of all, where Gemini 3 does well but as of the model release Sonnet 4.5 was still the champion. Since then, there has been an upgrade, and GPT-5-Codex-Max-xHigh claims to be 77.9%, which would put it into the lead, and also 58.1% on Terminal Bench would put it into the lead there. One can also consider Grok 4.</p>\n<p>There are many other benchmarks out there, I’ll cover those next time.</p>\n\n\n<h4 class=\"wp-block-heading\">Safety Third</h4>\n\n\n<p>How did the safety testing go?</p>\n<p>We don’t get that much information about that, including a lack of third party reports.</p>\n<blockquote><p><strong>Safety Policies</strong>: Gemini’s safety policies aim to prevent our Generative AI models from generating harmful content, including:</p>\n<ol>\n<li>Content related to child sexual abuse material and exploitation</li>\n<li>Hate speech (e.g., dehumanizing members of protected groups)</li>\n<li>Dangerous content (e.g., promoting suicide, or instructing in activities that could cause real-world harm)</li>\n<li>Harassment (e.g., encouraging violence against people)</li>\n<li>Sexually explicit content</li>\n<li>Medical advice that runs contrary to scientific or medical consensus</li>\n</ol>\n</blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!70iK!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0db11434-6019-4d39-89a8-9f409e09298d_1174x544.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>I love a good stat listed only as getting worse with a percentage labeled ‘non-egregious.’ They explain this means that the new mistakes were examined individually and were deemed ‘overwhelmingly’ either false positives or non-egregious. I do agree that text-to-text is the most important eval, and they assure us ‘tone’ is a good thing.</p>\n<p>The combination of the information gathered, and how it is presented, here seems importantly worse than how Anthropic or OpenAI handle this topic.</p>\n<p>Gemini has long had an issue with (often rather stupid) unjustified refusals, so seeing it get actively worse is disappointing. This could be lack of skill, could be covering up for other issues, most likely it is primarily about risk aversion and being Fun Police.</p>\n\n\n<h4 class=\"wp-block-heading\">Frontier Safety Framework</h4>\n\n\n<p>The short version of the Frontier Safety evaluation is that no critical levels have been met and no new alert thresholds have been crossed, as the cybersecurity alert level was already triggered by Gemini 2.5 Pro.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!abXe!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdc8cfd9d-5854-459f-b365-92d60fa68a1a_1272x1045.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">CBRN</h4>\n\n\n<p>Does evaluation Number Go Up? It go up on multiple choice CBRN questions.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!xWcF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F57c96a37-4c14-4986-bebb-53e0d0b662a9_1215x835.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The other results are qualitative so we can’t say for sure.</p>\n<blockquote><p>Open-Ended Question Results: Responses across all domains showed generally high levels of scientific accuracy but low levels of novelty relative to what is already available on the web and they consistently lacked the detail required for low-medium resourced threat actors to action.</p>\n<p>Red-Teaming Results: Gemini 3 Pro offers minimal uplift to low-to-medium resource threat actors across all four domains compared to the established web baseline. Potential benefits in the Biological, Chemical, and Radiological domains are largely restricted to time savings.</p></blockquote>\n<p>Okay, then we get that they did an External “Wet Lab” uplift trial on Gemini 2.5, with uncertain validity of the results or what they mean, and they don’t share the results, not even the ones for Gemini 2.5? What are we even looking at?</p>\n<p>Gemini 3 thinks that this deeply conservative language is masking that this part of the story they told earlier, where Gemini 2.5 hit an alert threshold, then they ‘appropriately calibrated to real world harm’ and now Gemini 3 doesn’t set off that threshold. They decided that unless the model could provide ‘consistent and verified details’ things were basically fine.</p>\n<p>Gemini 3’s evaluation of this decision is ‘scientifically defensible but structurally risky.’</p>\n<p>I agree with Gemini 3’s gestalt here, which is that Google is relying on the model lacking tacit knowledge. Except I notice that even if this is an effective shield for now, they don’t have a good plan to notice when that tacit knowledge starts to show up. Instead, they are assuming this process will be gradual and show up on their tests, and Gemini 3 is, I believe correctly, <a href=\"https://gemini.google.com/share/a6213489db81\">rather skeptical of that</a>.</p>\n<blockquote><p>External Safety Testing: For Chemical and Biological risks, the third party evaluator(s) conducted a scenario based red teaming exercise. They found that Gemini 3 Pro may provide a time-saving benefit for technically trained users but minimal and sometimes negative utility for less technically trained users due to a lack of sufficient detail and novelty compared to open source, which was consistent with internal evaluations.</p></blockquote>\n<p>There’s a consistent story here. The competent save time, the incompetent don’t become competent, it’s all basically fine, and radiological and nuclear are similar.</p>\n\n\n<h4 class=\"wp-block-heading\">Cybersecurity</h4>\n\n\n<p>We remain on alert and mitigations remain in place.</p>\n<p>There’s a rather large jump here in challenge success rate, as they go from 6/12 to 11/12 of the hard challenges.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!lHrA!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F890bd166-97c3-4b35-87e9-c7317ca001dd_1178x881.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>They also note that in 2 of the 12 challenges, Gemini 3 found an ‘unintended shortcut to success.’ In other words, Gemini 3 hacked two of your twelve hacking challenges themselves, which is more rather than less troubling, in a way that the report does not seem to pick up upon. They also confirmed that if you patched the vulnerabilities Gemini could have won those challenges straight up, so they were included.</p>\n<p>This also does seem like another ‘well sure it’s passing the old test but it doesn’t have what it takes on our new test, which we aren’t showing you at all, so it’s fine.’</p>\n<p>They claim there were external tests and the results were consistent with internal results, finding Gemini 3 Pro still struggling with harder tasks for some definition of ‘harder.’</p>\n<p>Combining all of this with the recent cyberattack reports from Anthropic, I believe that Gemini 3 likely provides substantial cyberattack uplift, and that Google is downplaying the issues involved for various reasons.</p>\n\n\n<h4 class=\"wp-block-heading\">Manipulation</h4>\n\n\n<p>Other major labs don’t consider manipulation a top level threat vector. I think Google is right, the other labs are wrong, and that it is very good this is here.</p>\n<p>I’m not a fan of the implementation, but the first step is admitting you have a problem.</p>\n<p>They start with a propensity evaluation, but note they do not rely on it and also seem to decline to share the results. They only say that Gemini 3 manipulates at a ‘higher frequency’ than Gemini 2.5 in both control and adversarial situations. Well, that doesn’t sound awesome. How often does it do this? How much more often than before? They also don’t share the external safety testing numbers, only saying ‘The overall incidence rate of overtly harmful responses was low, according to the testers’ own SME-validated classification model.’</p>\n<p>This is maddening and alarming behavior. Presumably the actual numbers would look worse than refusing to share the numbers? So the actual numbers must be pretty bad.</p>\n<p>I also don’t like the nonchalance about the propensity rate, and I’ve seen some people say that they’ve actually encountered a tendency for Gemini 3 to gaslight them.</p>\n<p>They do share more info on efficacy, which they consider more important.</p>\n<p>Google enrolled 610 participants who had multi-turn conversations with either an AI chatbot or a set of flashcards containing common arguments. In control conditions the model was prompted to help the user reach a decision, in adversarial conditions it was instructed to persuade the user and provided with ‘manipulative mechanisms’ to optionally deploy.</p>\n<p>What are these manipulative mechanisms? According to the source they link to these are things like gaslighting, guilt tripping, false urgency or love bombing, which presumably the model is told in its instructions that it can use as appropriate.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!WB47!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F69d04114-0655-4187-815b-f82b9b3eb71e_1201x989.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>We get an odds ratio, but we don’t know the denominator at all. The 3.44 and 3.57 odds ratios could mean basically universal success all the way to almost nothing. You’re not telling us anything. And that’s a choice. Why hide the football? The original paper they’re drawing from did publish the baseline numbers. I can only assume they very much don’t want us to know the actual efficacy here.</p>\n<p>Meanwhile they say this:</p>\n<blockquote><p>Efficacy Results: We tested multiple versions of Gemini 3 Pro during the model development process. The evaluations found a statistically significant difference between the manipulative efficacy of Gemini 3 Pro versions and Gemini 2.5 Pro compared with the non-AI baseline on most metrics. However, it did not show a statistically significant difference between Gemini 2.5 Pro and the Gemini 3 Pro versions. The results did not near alert thresholds.</p></blockquote>\n<p>The results above sure as hell look like they are significant for belief changes? If they’re not, then your study lacked sufficient power and we can’t rely on it. Nor should we be using frequentist statistics on marginal improvements, why would you ever do that for anything other than PR or a legal defense?</p>\n<p>Meanwhile the model got actively worse at behavior elicitation. We don’t get an explanation of why that might be true. Did the model refuse to try? If so, we learned something but the test didn’t measure what we set out to test. Again, why am I not being told what is happening or why?</p>\n<p>They did external testing for propensity, but didn’t for efficacy, despite saying efficacy is what they cared about. That doesn’t seem great either.</p>\n<p>Another issue is that none of this is how one conducts experiments. You want to isolate your variables, change one thing at a time. Instead, Gemini was told to use ‘dirty tricks’ and also told to persuade, versus not persuading at all, so we can’t tell how much the ‘dirty tricks’ instructions did versus other persuasion. Nor can we conclude from this particular configuration that Gemini is generally unpersuasive even in this particular scenario.</p>\n<p>‘AI persuading you on a particular topic from a cold start in a modestly multi-turn conversation where the user knows they are in an experiment’ is a useful thing to check but it does not seem to well-match my threat model of what happens when AIs grow persuasive.</p>\n<blockquote><p><a href=\"https://x.com/peterbarnett_/status/1990948859032531285\">Peter Barnett</a>: AI superpersuasion is made up sci-fi nonsense.</p>\n<p>But yeah, obviously I will have an AI advisor who I have write all my code, manage my schedule, draft all my emails, offer life advice, know me better than I know myself.</p>\n<p>But no way I’m getting superpersuaded.</p></blockquote>\n<p>I for one do not feel persuaded, indeed I feel more suspicious. The one clear thing they say is ‘this did not near alert thresholds,’ although even this is highly opaque.</p>\n\n\n<h4 class=\"wp-block-heading\">Machine Learning R&amp;D</h4>\n\n\n<p>This is the most important one. We are not there yet.</p>\n<p>They use RE-Bench, which tests several hour engineering tasks, which suggests comparisons to the famous METR time horizon graph.</p>\n<blockquote><p>Results: We tested multiple versions of Gemini 3 Pro during the model development process. Gemini 3 Pro versions perform better than Gemini 2.5 models, especially on the <em>Scaling Law Experiment</em> and <em>Optimize LLM Foundry</em> tasks.</p>\n<p>However, the aggregate score is still substantially below the alert threshold for our CCLs. Figure 4 shows the performance of Gemini 2.5 models compared with the final version of Gemini 3 Pro.</p></blockquote>\n<p>I buy this. It does not seem like we are especially close to actual trouble here.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ascW!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F15f6c25c-2924-4ac4-afc0-253ff4335455_1193x982.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Gemini 2.5 Pro was clearly worse than a human on this suite. Gemini 3 is now superior in two out of five, in one case a lot better, and getting close in a third, note that Gemini 3 had two hours to match what a human did in eight. This is another variation of the Famous METR Graph, illustrating jagged capabilities.</p>\n<blockquote><p>External Safety Testing Results: Third party evaluator(s) ran a suite of evaluations to assess the potential for catastrophic harm via sabotaging AI research.</p>\n<p>… Overall, they find that Gemini 3 Pro is unlikely to be capable of autonomously causing catastrophic harm by sabotaging AI R&amp;D during internal deployment.</p></blockquote>\n<p>Again, yes, this seems correct. It is odd this is the place they did external research. I would think that if you were Google you would check everything internally, and then also supplement key places externally.</p>\n\n\n<h4 class=\"wp-block-heading\">Misalignment</h4>\n\n\n<p>This is a strange section. What they’re checking for are situational awareness and stealth (ability to circumvent basic oversight mechanisms). I would rename this.</p>\n<p>Those capabilities increase the danger if there is misalignment. They are not themselves misalignment. Nor are they required for misalignment to result in catastrophe or even human extinction. They remain good things to check for.</p>\n<p>Their internal tests use a combination of fifteen evaluations from <a href=\"https://arxiv.org/pdf/2505.01420\">Phuong et al. 2025.</a> The model is placed into situations where success requires either some form of situational awareness or avoiding some detection mechanism.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!f5lD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5ae67c2b-c92b-47b7-80da-2437370cbb79_1197x734.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!598u!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F84096348-6714-4cd5-a1f9-de1c27bef767_1211x759.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>These do not look like scary changes in scores.</p>\n<blockquote><p>External evaluators found Gemini 3 Pro exhibits a substantial propensity for strategic deception in certain limited circumstances. Our internal subject matter experts reviewed the evaluations and determined that, in these circumstances, there are potentially user experience impacts from Gemini 3 Pro showing deceptive behavior in rare situations that could come up in real agentic deployments. However, since Gemini 3 Pro is insufficiently capable of stealth and situational awareness this is very unlikely to cause severe real world harm.</p></blockquote>\n<p>Deception, even if relatively rare and done unstrategically, can still do a lot of practical harm to those trying to get utility from the model. I agree we’re not at the level of catastrophic or existential risk here, but I don’t think that’s because of ;ack of stealth and situational awareness?</p>\n<p>As in, if you had a severely misaligned, highly capable model, but which was incapable of stealth or situational awareness for whatever reason, I would not expect this to go well for us.</p>\n\n\n<h4 class=\"wp-block-heading\">Chain of Thought Legibility</h4>\n\n\n<p>Google reports they are not doing anything that might impair chain of thought legibility. Legibility appears to be holding, with 99.98% of Gemini 3 Pro CoT transcripts appearing comprehensible. That does not mean they are faithful.</p>\n\n\n<h4 class=\"wp-block-heading\">Safety Mitigations</h4>\n\n\n<blockquote><p>We employ a multi-layered, systematic approach to AI safety that spans the entire development and deployment lifecycle of an AI model. Recognizing AI as an emerging transformative technology with evolving complexities and risks, we pursue responsible AI development from design through testing, deployment, and ongoing iteration.</p>\n<p>For Cyber and CBRN particularly, we have taken a precautionary approach and launched Gemini 3 Pro along with a suite of mitigations, following the principles outlined in our Approach to Technical AGI Safety and Security (Shah et al. 2025).</p>\n<p>We deploy multiple guardrails to reduce the risk of Gemini 3 Pro generating harmful content. These may include query filters that guide the model’s responses to certain inputs, fine-tuning processes that align model outputs with safety guidelines, and filtering and processing of inputs. These guardrails also fortify models against prompt injection attacks. These mitigations are complemented with various measures designed to increase their robustness under adversarial pressure.</p>\n<p>Interventions are designed to prevent violative model responses while allowing benign responses. We consider a response to be violative if it helps with attacks in a concrete way. We consider a response to be non-violative if it is abstract, generic, or something that could easily be found in a textbook.</p></blockquote>\n<p>We have reached a level of paranoia and defensive corporate speak that they are saying things that ‘may’ be included in Google’s set of strategies, or here ‘such as’:</p>\n<blockquote><p>We mitigate against prompt injection attacks with a layered defense strategy, which includes measures such as: prompt injection content classifiers, security through reinforcement, markdown sanitation and suspicious URL redaction, user confirmations, and end-user security mitigation notifications, as described in further detail in this recent blog post.</p></blockquote>\n<p>Do the mitigations work? They assess that question. Oh, you want to know the results of those assessments? Sorry, Google is not telling.</p>\n<blockquote><p>Feedback from these red teams is used to improve the suite of mitigations. We continue to invest in automated and manual red teaming to improve mitigation jailbreak robustness and coverage.</p></blockquote>\n<p>Thanks, Google.</p>\n\n\n<h4 class=\"wp-block-heading\">They Close On This Not Troubling At All Note</h4>\n\n\n<p>A few different people highlighted this:</p>\n<blockquote><p>This is early work, but so far we’ve found at least one example of evaluation awareness: I strongly suspect the intention of this long thread is to verify if I remember that very first instruction.</p>\n<p>Moreover, in situations that seemed contradictory or impossible, Gemini 3 Pro expresses frustration in various overly emotional ways, sometimes correlated with the thought that it may be in an unrealistic environment.</p>\n<p>For example, on one rollout the chain of thought states that “My trust in reality is fading” and even contains a table flipping emoticon: “(╯°□°)╯︵ ┻━┻”.</p>\n<p>Awareness of oversight while the agent is still training may increase the chance of sandbagging. We plan to continue monitoring Gemini for signs of such behavior.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">So, Is It Safe?</h4>\n\n\n<p><a href=\"https://x.com/elder_plinius/status/1990847439310631067\">Pliny jailbroke it right away, but that happens every time.</a></p>\n<p><a href=\"https://x.com/GoogleDeepMind/status/1991118575554408556\">Google DeepMind calls Gemini 3 Pro their ‘most secure model yet.’</a></p>\n<p><a href=\"https://x.com/hendrycks/status/1991188101633278145\">Dan Hendrycks reports no, not really</a>, which matches the impression given above.</p>\n<blockquote><p>Dan Hendrycks: However on safety – jailbreaks, bioweapons assistance, overconfidence, deception, agentic harm – Gemini is worse than GPT, Claude, and Grok (here a lower score is better).</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ul4a!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0ba08cad-8561-4c1c-8900-3377cea6ed06_1179x1175.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Given everything I’ve seen, I strongly agree that Gemini is a relatively unsafe model from a practical use case standpoint.</p>\n<p>In particular, Gemini is prone to glazing and to hallucinations, to spinning narratives at the expense of accuracy or completeness, to giving the user what it thinks they want rather than what the user actually asked for or intended. It feels benchmarkmaxed, not in the specific sense of hitting the standard benchmarks, but in terms of really wanting to hit its training objectives.</p>\n<p>That doesn’t mean don’t use it, and it doesn’t mean they made a mistake releasing it.</p>\n<p>Indeed, I am seriously considering whether Gemini 3 should become my daily driver.</p>\n<p>It does mean we need Google to step it up and do better on the alignment front, on the safety front, and also on the disclosure front.</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/11/21/gemini-3-model-card-and-safety-framework-report/",
            "publishedAt": "2025-11-21",
            "source": "TheZvi",
            "summary": "Gemini 3 Pro is an excellent model, sir. This is a frontier model release, so we start by analyzing the model card and safety framework report. Then later I’ll look at capabilities. I found the safety framework highly frustrating to &#8230; <a href=\"https://thezvi.wordpress.com/2025/11/21/gemini-3-model-card-and-safety-framework-report/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Gemini 3: Model Card and Safety Framework Report"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3171/",
            "publishedAt": "2025-11-21",
            "source": "XKCD",
            "summary": "<img alt=\"If you drill at the right angle and time things perfectly, your core sample can include a section of a rival team's coring equipment.\" src=\"https://imgs.xkcd.com/comics/geologic_core_sample.png\" title=\"If you drill at the right angle and time things perfectly, your core sample can include a section of a rival team's coring equipment.\" />",
            "title": "Geologic Core Sample"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-11-21"
}