{
    "articles": [
        {
            "content": [
                "<p>A lot of writing advice seems to amount to:</p>\n\n<blockquote>\n  <p>I start by having verbal intelligence that’s six standard deviations above the population mean. I find that this is really helpful! Also, here are some tips on spelling and how I cope with the never-ending adoration.</p>\n</blockquote>\n\n<p>I think this leaves space for advice from people with less godlike levels of natural talent e.g. your friend dynomight.</p>\n\n<h2 id=\"the-advice\">The advice</h2>\n\n<p>Here it is: Make something you would actually like.</p>\n\n<p>Actually, let me bold the important words: Make something <strong>you</strong> would <strong>actually</strong> like.</p>\n\n<h2 id=\"why-you\">Why <em>you</em>?</h2>\n\n<p>Why make something <strong>you</strong> would like? To be clear, I’m not suggesting you write “for yourself”. I assume that your terminal goal is to make something <em>other</em> people like.</p>\n\n<p>But try this experiment: Go write a few thousand words and give them to someone who loves you. Now, go through paragraph-by-paragraph and try to predict what was going through their heads. It’s impossible! I tell you, it cannot be done!</p>\n\n<p>Personally, I think this is because nobody really understands anyone else. (I recently discovered that my mother secretly hates tomatoes.) If you try to make something that other people would like, rather than yourself, you’ll likely just end up with something no one likes.</p>\n\n<p>The good news is that none of us are that unique. If <em>you</em> like it, then I guarantee you that lots of other will too. It’s a big internet.</p>\n\n<p>Most decisions follow from this principle. Should your thing be long and breezy or short and to the point? Should you start with an attention-grabbing story? Should you put your main conclusion upfront? How formal should you be? Should you tell personal stories? I think the answer is: Do whatever you would like, if you were the reader.</p>\n\n<p>Sometimes people ask me why this blog is so weird. The answer is simple: I like weird. I wish other blogs had more personality, and I can’t understand why everyone seems to put so much effort into being generic. Since I don’t understand weirdness-hating, I don’t think I have any chance of making weirdness-haters happy. If I tried to be non-weird, I think I’d be <em>bad</em> non-weird.</p>\n\n<p>This is also why I blog rather than making videos or podcasts or whatever. I <em>like</em> blogs. I can’t stand videos, so I don’t think I’d be any good at making them. Everyone, please stop asking me to watch videos.</p>\n\n<h2 id=\"why-actually\">Why <em>actually</em>?</h2>\n\n<p>Now, why make something you would <strong>actually</strong> like? In short, because your brain is designed to lie to you. One way it lies is by telling you your stuff is amazing even when it isn’t. To be more precise, this often happens:</p>\n\n<ol>\n  <li>You write something.</li>\n  <li>In reality, if someone else had written it, you wouldn’t like it. So you don’t <em>actually</em> like it.</li>\n  <li>But you can’t see that, because your stupid traitorous brain is lying to you.</li>\n  <li>So you don’t make all the changes that your thing needs.</li>\n  <li>And so probably no one else likes it either. :(</li>\n</ol>\n\n<p>Probably our brains lie to us for good reasons. Probably it’s good that we think we’re better looking than we are, because that makes us more confident and <a href=\"https://dynomight.net/beliefs/\">effectiveness beats accuracy</a>, etc. But while it’s hard to improve your looks, it’s easy to improve your writing. At least, it would be if you could see it for what it is.</p>\n\n<p>Your brain also lies to you by telling you your writing is clear. When you write, you take some complex network of ideas that lives in your brain and compile it into a <a href=\"https://dynomight.net/internet-writing/\">linear sequence of words</a>. Other people <em>only</em> see those words.</p>\n\n<p>There’s no simple formula for avoiding either of these. But try to resist.</p>\n\n<h2 id=\"be-on-your-readers-side\">Be on your reader’s side</h2>\n\n<p>I don’t know how to explain this, but I think it’s very important: You should be your reader’s ally. Or, if you like, their <a href=\"https://en.wikipedia.org/wiki/Consigliere\">consigliere</a>.</p>\n\n<p>As a simple example, why is the word “consigliere” up there a link? Well, not everyone knows what that means. But I don’t like having a link, because it sort of makes me look stupid, like I just learned that word last week. But I’m on your side, goddamnit.</p>\n\n<p>As another example, many people wonder how confident their tone should be. I think your confidence should reflect whatever you actually believe. Lots of people pick a conclusion and dismiss all conflicting evidence. Obviously, that does not treat the reader as an ally. But at the same time, after you’ve given a fair view of the evidence, <em>if</em> you think there’s a clear answer, admit it. Your readers want to know! Compare these three styles:</p>\n\n<ol>\n  <li>“This is the Truth, only fools disagree.”</li>\n  <li>“Here’s what I think and why I think it.”</li>\n  <li>“Here’s a bunch of evidence, about which I supposedly have no opinion.”</li>\n</ol>\n\n<p>Number 1 is dishonest. But arguably number 3 is <em>also</em> dishonest. Treat your reader like an ally, who wants all the information, including your opinion.</p>\n\n<h2 id=\"ideas-arent-that-valuable\">Ideas aren’t that valuable</h2>\n\n<p>I want to write a post called “measles”. The idea is to look into why it declined <a href=\"https://ourworldindata.org/grapher/measles-cases-and-death\">when it did</a>, what risks measles vaccines might pose, and what would happen if people stopped getting vaccinated.</p>\n\n<p>That’s the whole idea. I have nothing else and don’t know the answers. Yet I’m pretty sure this would be good, just because when I tried to find answers, none of the scientifically credible sources treated me like an ally. Instead, they seemed to regard me as a complete idiot, who can’t be trusted with any information that might lead to the “wrong” conclusion.</p>\n\n<p>If you want that idea, take it! That would make me happy, because I have hundreds of such ideas, and I won’t live long enough to write more than a tiny fraction of them. Almost all the value is in the <em>execution</em>.</p>\n\n<p>Some people worry about running out of ideas. I swear this is impossible. The more you write, the <em>easier</em> ideas are to find.</p>\n\n<p>One reason is that when you write, you learn stuff. This qualifies you to write about more things and reveals more of world’s fractal complexity. Also, experience makes it <em>much</em> easier to recognize ideas that would translate into good posts, but only makes it <em>slightly</em> easier to execute on those ideas. So the ideas pile up, at an ever-accelerating pace.</p>\n\n<p>If you <em>really</em> run out of ideas, just take one of your old ones and do it again, better. It’s fine, I promise.</p>\n\n<h2 id=\"getting-feedback\">Getting feedback</h2>\n\n<p>The obvious antidote for your lying brain is feedback from other people. But this is tricky. For one thing, the people who love you enough to read your drafts may not be in your target audience. If they wouldn’t read it voluntarily, you probably don’t want to optimize <em>too</em> hard for them.</p>\n\n<p>It’s also hard to get people to give negative feedback. I sometimes ask people to mark each paragraph according to a modified <a href=\"https://perell.com/note/cribs-my-writing-feedback-formula/\">CRIBS</a> system as either Confusing, Repetitive, Interesting, Boring or Shorten. I also like to ask, “If you <em>had</em> to cut 25%, what would you pick?”</p>\n\n<p>People are better at finding problems than at giving solutions. If they didn’t understand you, how could they tell you what to change? It’s usually best if you propose a change, and then ask them if that fixes the problem.</p>\n\n<p>Also, remember that people can only read something for the first time once. Also, do not explain your idea to people before they read. Make them go in blind.</p>\n\n<p>(If you’re working with professional editors, none of this applies.)</p>\n\n<h2 id=\"editing\">Editing</h2>\n\n<p>You should probably edit, a lot. Some people with Godlike Talent don’t edit. But the rest of us should.</p>\n\n<p>One way to edit is leave your writing alone for a week or two. This gives you back some of the perspective of a new reader, and makes it emotionally easier to delete stuff.</p>\n\n<p>Here’s another exercise: Take your thing and print it out. Then, go through and circle the “good parts”. Then, delete everything else. If absolutely necessary, bring back other stuff to connect the good parts. But are you sure you need to do that?</p>\n\n<h2 id=\"be-funny-maybe\">Be funny, maybe</h2>\n\n<p>I think you fuckers all take yourselves too seriously.</p>\n\n<p>There might be some <a href=\"https://dynomight.net/bourdieu/\">Bourdieu</a>-esque cultural capital thing with humor. Maybe making jokes while discussing serious ideas is a kind of countersignaling, like a billionaire wearing sneakers. Maybe it’s a way of saying, “Look at me, I can act casual and people still take me seriously! Clearly I am a big deal!” If you look at it that way, it seems kind of gross. But I wouldn’t worry about it, because Bourdieu-esque countersignaling makes everything seem gross. If you like humor, do humor.</p>\n\n<p>My one insight is that humor needs to be “worth it”. Very short jokes are funny, even when they’re not very funny. For example, my use of “fuckers” up there wasn’t very funny. But it <em>was</em> funny (to me) because it’s just a single word. Except it’s crude, so maybe it wasn’t funny? <em>Except</em>, hey look, now I’m using it to illustrate a larger idea, so it wasn’t <em>pointlessly</em> crude. Thus, it was funny after all. Q.E.D.</p>\n\n<p>Behold the Dynomight funniness formula:</p>\n\n<p>     <code>(Actual funniness) = (Baseline funniness) / (Cost of joke)</code></p>\n\n<p>The “cost” measures how distracting the joke is. This includes the length, but also the topic. If you’re writing now in 2025, a joke about Donald Trump has to be much funnier than, say, a joke about, say, <a href=\"https://en.wikipedia.org/wiki/Lee_Kuan_Yew\">Lee Kuan Yew</a>.</p>\n\n<p>Increasing baseline funniness is hard. But decreasing “cost” is often easy. If in doubt, decrease the denominator.</p>\n\n<p>In real life, very few people can tell jokes with punchlines. But lots of people can tell funny stories. I think that’s because in stories, the jokes come on top of something that’s independently interesting. If a joke with a punchline bombs, it’s very awkward. If a funny aside in a story fails, people might not even notice a joke was attempted. The same is all true for writing.</p>\n\n<h2 id=\"who-will-read-it\">Who will read it?</h2>\n\n<p>Most people who write stuff hope that other people will read it. So how does that work nowadays? Discussing this feels <em>déclassé</em>, but I am your ally and I thought you’d want to know.</p>\n\n<p>You might imagine some large group of people who are eagerly looking for more blogs: People who, if they see something good, will immediately check the archives and/or subscribe. I am like that. You might be like that. But such people are <em>very</em> rare. I know many bloggers who put aggressive subscribe buttons everywhere but, if pressed, admit they never subscribe to anything. This is less true for blogs devoted to money, politics, or culture war. But it’s extra-double true for generalist blogs.</p>\n\n<p>If you’ve grown up with social media, you might imagine that your stuff will “go viral”. This too is rare, particularly if your post isn’t related to money, politics, culture war, or <a href=\"https://dynomight.net/jaccuse/\">stupid bullshit</a>. And even if something does blow up, people do not go on social media looking for long feeds to read.</p>\n\n<p>I recently had a post that supposedly got 210k views on twitter. Of those twitter showed the reply with the link to my post to 9882 people (4.7%). Of those, 1655 (0.79%) clicked on the link. How many read the whole thing? One in ten? And how many of those subscribed? One in twenty? We’re now down to a number you can count on your fingers.</p>\n\n<p>There are some places where people <em>do</em> go to find long things to read. When my posts are on <a href=\"https://news.ycombinator.com/\">Hacker News</a>, this usually leads to several thousand views. But I think the median number who subscribe as a result is: Zero. Most people who find stuff via Hacker News <em>like</em> finding via Hacker News.</p>\n\n<p>I’m not complaining, mind you. Theoretically, the readers of this blog could fill a small stadium. It’s nothing compared to popular writers, but it feels like an outrageous number to me. But I’ve been at this for more than five years, and I’ve written—gulp—186 posts. It wasn’t, like, easy.</p>\n\n<p>Special offer: If you want me to subscribe to your blog, put the URL for the RSS feed in the comments to this post, and I will subscribe and read some possibly nonzero fraction of your posts. (Don’t be proud, if you want me to subscribe, I’m <em>asking</em> you to do it.)</p>\n\n<h2 id=\"haters\">Haters</h2>\n\n<p>Most people are pretty chill. They read stuff because they hope to get something out of it. If that doesn’t happen, they’ll stop reading and go on with their lives. But on any given day, <em>some</em> people will be in a bad mood and something you write will trigger something in them, and they will say you are dumb and bad.</p>\n\n<p>You cannot let the haters get you down. It’s not just an issue of emotions. If the haters bother you, you may find yourself writing for them rather than for your allies. <em>No!</em></p>\n\n<p>For example, say you’ve decided that schools should stop serving lunch. (Why? I don’t know why.) When making your case, you may find yourself tempted to add little asides like, “To be clear, this doesn’t mean I hate kids. Children are the future!” My question is, who is that <em>for</em>? Is it for your ally, the reader who likes you and wants to know what you think? Or is it for yourself, to protect you from the haters?</p>\n\n<p>This kind of “defensive” writing gets tiring very quickly. Your allies probably do not want or need very much of it, so keep it in check.</p>\n\n<p>Also, I think defensiveness often just makes the problem worse. The slightly-contrarian friend is hated much more than the adversary. If you write “I think {environmentalism, feminism, abortion, Christianity} is bad”, people will mostly just think, “huh.” But if you write, “I am <em>totally</em> in favor of {environmentalism, feminism, abortion, Christianity}! I am one of the good people! I just have a couple very small concerns…”, people tend to think, “Heretic! Burn the witch!” Best to just leave your personal virtue out of it.</p>\n\n<p>Much the same goes for other clarifications. Clear writing is next to godliness. But the optimal number of confused readers is not zero. If you try to chase down <em>every</em> possible misinterpretation, your writing will become very heavy and boring.</p>\n\n<p>It’s probably human nature to be upset when people say mean things about you. We’re designed for small tribal bands. For better or worse, people who persist in internet writing tend to be exceptionally self-confident and/or thick-skinned.</p>\n\n<p>If you’d like some help being more thick-skinned, remember that people who have negative reasons are <em>much</em> more likely to respond than people who have positive ones. (If you think something is perfect, what is there to say?)</p>\n\n<p>Also, I <em>strongly</em> suggest you read comments for some posts you think are good. For example, here are <a href=\"https://news.ycombinator.com/item?id=43045406\">some comments</a> for Cold Takes’s legendary <a href=\"https://www.cold-takes.com/does-x-cause-y-an-in-depth-evidence-review/\">Does X cause Y? An in-depth evidence review</a>. I think the comments are terrible, in both senses. They’re premised on the idea that because the author doesn’t use fancy statistical jargon, they must be statistically illiterate. But if the post tried to make those people happy, it would be worse.</p>\n\n<p>Finally, there are whole communities devoted to sneering at other people. They just can’t stand the idea of people writing blogs and exploring weird ideas. This really bothers some writers. Personally, I wonder what they have going on in their lives that <em>that’s</em> how they’d spend their time.</p>\n\n<h2 id=\"miscellanea\">Miscellanea</h2>\n\n<p><strong>Should you use AI?</strong></p>\n\n<p>I think you should not. If you secretly use AI, you are not treating the reader as your ally. If you openly use AI, nobody will read it. The end.</p>\n\n<p>Also, I think AI is currently still quite bad at writing compared to a skilled human. (<em>Currently</em>.) It’s is great at explaining well-understood facts. But for subjects that are “hard”, with sprawling / tangled / contradictory evidence, it still mostly just regurgitates the abstracts with a confident tone and minimal skepticism. You can do better.</p>\n\n<p><strong>That nagging feeling.</strong></p>\n\n<p>Often, I’m writing something and there will be one section that I can’t figure out how to write. I’ll move the paragraphs around, re-write it from scratch several times, and something always feels off. Eventually, I’ll realize that it isn’t a <em>writing</em> problem, it’s an <em>ideas</em> problem. What I need to do is change my conclusion, or re-organize the whole post.</p>\n\n<p>It’s always tempting to ignore that feeling. Everything else is already in place. But if you do that, you’ll be throwing away one of the best parts of writing—how it helps you think.</p>\n\n<p><strong>Use the correct amount of formatting.</strong></p>\n\n<p>In the long-long ago, writing was paragraph after paragraph. At some point, we decided that was boring, and started adding more “formatting”, like section titles and lists and tables and figure captions, etc.</p>\n\n<p>I think we’ve now reached the point where it’s common to use <em>too</em> much formatting. Some people go crazy and create writing that’s almost <em>all</em> formatting. This is disorienting for readers, and I think it often reflects writers being afraid to do the hard work of writing paragraphs that make sense.</p>\n\n<p>If in doubt, I think it’s best to start with less formatting, to make sure your paragraphs are the “cake” and the formatting is just “icing”.</p>\n\n<p><strong>Explain why you already believe it.</strong></p>\n\n<p>Often, people want to make some argument, and they find themselves mired in endless amounts of new research.  But hold on. If you’re trying to make some argument, then you already believe it, right? Why is that? Either:</p>\n\n<ol>\n  <li>You have good reasons; or</li>\n  <li>You don’t.</li>\n</ol>\n\n<p>If it’s the former, you don’t need to do new research. Just mentally switch from trying to explain “why it is true” to explaining <a href=\"https://www.lesswrong.com/posts/Psr9tnQFuEXiuqGcR/how-to-write-quickly-while-maintaining-epistemic-rigor\"><em>why</em> you already believe it</a>. Give your ally you true level of confidence. If it’s the latter, stop believing stuff without good reasons!</p>\n\n<p><strong>How to write.</strong></p>\n\n<p>I don’t think it’s possible to say much that’s useful about this. Giving advice about writing is like giving advice about how to hit a golf ball, or socialize at parties, or do rock climbing. You learn by doing.</p>\n\n<p>Different people follow different processes.  Some write slowly from beginning to end. Some write quick disorganized drafts and edit endlessly. Some make outlines, some don’t. Some write on paper, some with a computer. Some write in the morning, some write at night. Do whatever you want. Just do a lot of it.</p>\n\n<p><strong>Stop when it’s not getting better.</strong></p>\n\n<p>When you’re writing something, you’re too close to judge if it’s good or not. Don’t think about it. Just try to make it <em>as good</em> as possible. At some point, you’ll find you can’t improve it anymore. At that point, you are done.</p>"
            ],
            "link": "https://dynomight.net/writing-advice/",
            "publishedAt": "2025-05-29",
            "source": "Dynomight",
            "summary": "<p>A lot of writing advice seems to amount to:</p> <blockquote> <p>I start by having verbal intelligence that’s six standard deviations above the population mean. I find that this is really helpful! Also, here are some tips on spelling and how I cope with the never-ending adoration.</p> </blockquote> <p>I think this leaves space for advice from people with less godlike levels of natural talent e.g. your friend dynomight.</p> <h2 id=\"the-advice\">The advice</h2> <p>Here it is: Make something you would actually like.</p> <p>Actually, let me bold the important words: Make something <strong>you</strong> would <strong>actually</strong> like.</p> <h2 id=\"why-you\">Why <em>you</em>?</h2> <p>Why make something <strong>you</strong> would like? To be clear, I’m not suggesting you write “for yourself”. I assume that your terminal goal is to make something <em>other</em> people like.</p> <p>But try this experiment: Go write a few thousand words and give them to someone who loves you. Now, go through paragraph-by-paragraph and try to predict what was going through their heads. It’s impossible! I tell you, it cannot be done!</p> <p>Personally, I think this is because nobody really understands anyone else. (I recently discovered that my mother secretly hates tomatoes.) If you try to make something that other people would like, rather than yourself, you’ll",
            "title": "My advice on (internet) writing, for what it’s worth"
        },
        {
            "content": [
                "<p>Stories describe stuff that happens, in patterns that feel understandable to reader/viewers. The more stories we&#8217;ve heard, the stronger are our expectations about future stories, and the more we think we understand about what happens.</p><p>Long ago stories only described objective events and actions, including words said. Then stories added descriptions of character feelings and thoughts. Especially evaluative feelings, such as re status and norm violations, which story elements are how interesting, and which story endings are how satisfying.</p><p>We now use stories for many purposes, such as to teach, bond, entertain, and show off. We bond together by showing each other how we share similar evaluations. We often care more about that than about learning about reality, and so don&#8217;t mind unrealistic stories. Those who complain about story unrealism may seem suspiciously unbonded.</p><p>People in a culture use the stories of that culture to help infer how associates evaluate things. The stories of other cultures, who evaluate differently, thus seem wrong and low quality in key ways. Most historical fiction today emphasizes how wrong were past cultures, compared to ours.</p><p>Our using stories to infer our culture makes story-tellers especially influential re cultural change. Which makes such people high status in the modern world, where cultural change activists are high status.</p><p>The modern world also emphasizes motives as key story elements, in addition to actions, thoughts, and feelings. Sometimes motives are described explicitly, but typically key story patterns are intended to evoke our standard motive scenarios, without needing to explicitly declare motives. Modern stories tend to give at least two layers of motives to characters, especially villains. Stage and screen depictions of stories are especially able to show multiple motive layers.</p><p>In reality, we typically know little about the motives of people around us, and often little about our own motives. Which means we usually have little data with which to judge or critique the realism of stories. And we are not usually very inclined to so correct. So the motives of our stories can drift pretty far from realism. As we illustrated in our book <em><a href=\"http://elephantinthebrain.com\">The Elephant in the Brain</a></em>.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/stories-are-behavior-understood",
            "publishedAt": "2025-05-29",
            "source": "Robin Hanson",
            "summary": "<p>Stories describe stuff that happens, in patterns that feel understandable to reader/viewers. The more stories we&#8217;ve heard, the stronger are our expectations about future stories, and the more we think we understand about what happens.</p><p>Long ago stories only described objective events and actions, including words said. Then stories added descriptions of character feelings and thoughts. Especially evaluative feelings, such as re status and norm violations, which story elements are how interesting, and which story endings are how satisfying.</p><p>We now use stories for many purposes, such as to teach, bond, entertain, and show off. We bond together by showing each other how we share similar evaluations. We often care more about that than about learning about reality, and so don&#8217;t mind unrealistic stories. Those who complain about story unrealism may seem suspiciously unbonded.</p><p>People in a culture use the stories of that culture to help infer how associates evaluate things. The stories of other cultures, who evaluate differently, thus seem wrong and low quality in key ways. Most historical fiction today emphasizes how wrong were past cultures, compared to ours.</p><p>Our using stories to infer our culture makes story-tellers especially influential re cultural change. Which makes such people high status in the modern",
            "title": "Stories Are Behavior, Understood"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3835\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3835",
            "publishedAt": "2025-05-29",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3835\"> Read more </a> </p>",
            "title": "Hidden Open Thread 383.5"
        },
        {
            "content": [
                "<p>Tyler Cowen of Marginal Revolution continues to disagree with my <a href=\"https://www.astralcodexten.com/p/contra-mr-on-charity-regrants\">Contra MR On Charity Regrants</a>. Going through <strong><a href=\"https://marginalrevolution.com/marginalrevolution/2025/05/so-many-mistakes.html\">his response</a></strong> piece by piece, slightly out of order:</p><blockquote><p>Scott takes me to be endorsing Rubio&#8217;s claim that the third-party NGOs simply pocket the money. In reality my fact check with o3 found (correctly) that the money was &#8220;channelled through&#8221; the NGOs, not pocketed. Scott lumps my claim together with Rubio&#8217;s as if we were saying the same thing. My very next words (&#8220;I do understand that not all third party allocations are wasteful&#8230;&#8221;) show a clear understanding that the money is channeled, not pocketed, and <a href=\"https://marginalrevolution.com/marginalrevolution/2025/02/deep-research-considers-the-costs-and-benefits-of-us-aid.html\">my earlier and longer post on US AID</a> makes that clearer yet at greater length. Scott is simply misrepresenting me here.</p></blockquote><p>The full post is in the image below:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F57bccfa3-0792-41f6-ab6e-e194483bb90a_961x477.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"477\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F57bccfa3-0792-41f6-ab6e-e194483bb90a_961x477.png\" title=\"\" width=\"961\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Maybe I&#8217;m just revealing my poor reading comprehension, but I think that:</p><ul><li><p>Starting with Rubio&#8217;s claim that only 12% goes to recipients because 88% is &#8220;pocketed&#8221;&#8230;</p></li><li><p>Then saying you are going to &#8220;fact check&#8221; it&#8230;</p></li><li><p>Then quoting and bolding sentence from the &#8220;fact check&#8221; which includes a claim that 75-90% goes to &#8220;third parties&#8221;, as if this is a &#8220;fact-check&#8221; of the 88% number which finds it correct&#8230;</p></li><li><p>Then saying that it demonstrates &#8220;something is badly off here&#8221;, when correctly understood it would not demonstrate that at all (at least not without some kind of unusual and very controversial argument for why giving to partners must be bad)...</p></li><li><p>Then saying that USAID defenders were unwilling to consider this when the &#8220;debate&#8221; (about Rubio&#8217;s claims) was going on&#8230;</p></li></ul><p>&#8230;will inevitably lead to people thinking Tyler is confirming or at least directionally agreeing with Rubio.</p><p>I wasn&#8217;t the only person who understood it this way. So did eleven people who commented to this effect on the ACX subreddit<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a>, 22 people who commented this on Marginal Revolution itself, a <a href=\"https://x.com/Jabaluck/status/1925952529151443025\">Yale economics professor </a>, a <a href=\"https://www.cgdev.org/expert/justin-sandefur\">Center for Global Development senior economist</a> - and, presumably, my friend who, when I told them last week that I had a post I wanted them to proofread, responded, without even knowing what it was about, I quote, <em>\"before clicking on the link my guess is it's about tyler cowen's inane USAID post...I was so angry\"</em>.</p><p>So I apologize for any misunderstanding I may have had, but I think Tyler should also consider apologizing for a post that may have been unclear to a lot of people.</p><blockquote><p>Someone should tell [Scott] that Emergent Ventures overhead is typically two percent, five percent for dealing with screwier banking systems.  (That is one reason why I won the recent Time magazine award for innovation in philanthropy.)  I am well aware there are various ways of calculating overhead, but there are now more than one thousand Emergent Ventures winners, and all of them can testify to how radically stripped-down the process is. </p></blockquote><p>The overhead for ACX Grants is 0%; I agree that it&#8217;s important to try to keep overhead as low as possible. So why do USAID charities have higher overhead than Tyler&#8217;s regrants? </p><p>My original hypothesis was that it&#8217;s more expensive to run a system of African clinics than a grants program. But in the process of trying to confirm, I found that wasn&#8217;t the answer at all. It&#8217;s because the 30% number I gave yesterday is an accounting concept called NICRA which is often cited as overhead, but different from the common-sense conception.</p><p>Let&#8217;s consider a typical USAID partner NGO. To avoid accusations of cherry-picking, we&#8217;ll take the biggest one: <a href=\"https://www.forbes.com/sites/saradorn/2025/02/03/these-are-the-top-usaid-recipients-from-religious-groups-to-major-us-companies-as-trump-targets-agency/\">Catholic Relief Services</a>, which operates a series of clinics throughout Africa. USAID gives them about $500 million per year, and they get another $1 billion from other donors.</p><p>Their NICRA is 27%, which matches the 30% number I gave yesterday (CTRL+F &#8220;NICRA&#8221; <a href=\"https://www.crs.org/sites/default/files/tools-research/emergency-preparedness-and-response-handbook.pdf\">here</a>). But the percent of their money spent on administrative costs , which is probably closer to what most people mean by overhead, was 6.3% (supporting/total on page 22 <a href=\"https://www.crs.org/sites/default/files/crs-annual-report-2023.pdf\">here</a>). Of that 6.3%, about 4%pp went to salaries and 2%pp to fundraising.</p><p>Why is NICRA so much higher than true overhead? I&#8217;m not an accountant, but my understanding of <a href=\"https://www.councilofnonprofits.org/articles/consider-adding-federally-negotiated-indirect-cost-rate-your-revenue-portfolio\">this document</a> suggests NICRA is a legal fiction negotiated with the United States government in a way that is convenient for funding but has different numerators and denominators than real expenses. Because many real contributions and expenses cannot be included in the denominator, the overall rate appears artificially high. </p><p>(is CRS unusual in its low overhead, maybe because of its Catholic affiliation? I checked one of USAID&#8217;s biggest secular partners, the Johns Hopkins Program for International Education on Obstetrics and Gynecology (JHPIEGO), which despite its name operates AIDS, malaria, and COVID clinics in Africa. Its NICRA was 17% and its true overhead was 3.9%, and I couldn&#8217;t otherwise find any big difference from CRS.)</p><p>Is it bad that CRS spends 4% on salaries? That&#8217;s $60 million of their $1.5 billion budget. They say this includes finance, HR, legal, internal audit, IT, risk-management, and insurance. Does a $1.5 billion charity really need $60 million worth of audits, risk management, insurance, etc? I don&#8217;t know, but it seems harsh to blow up the whole thing because you&#8217;re mad about 4%.</p><p>What does the 94% non-administrative money go to? The largest category is food (to feed starving people in developing countries). The second-largest is salaries (for local personnel like doctors and nurses). </p><p>The <a href=\"https://web.archive.org/web/20240223011930/https://2017-2020.usaid.gov/sites/default/files/documents/1869/USAIDInternationalFood_AssistanceReportFY2018.pdf\">third-largest category</a> (20%, so $300 million of their total $1.5 billion yearly budget) is the types of re-re-grants people are concerned about. Sometimes they give the money to their local Catholic equivalent, like <a href=\"https://caritasnigeria.org/\">Caritas Nigeria</a>. In some war-torn places, they give the money to local groups that are already stuck in the war-torn area instead of trying to send American staffers in themselves - I think this is what&#8217;s going on in the <a href=\"https://www.crs.org/sites/default/files/2.crs_eth_jeop_tigray_case_story_ii_june_2021_mt_jl_0.pdf\">Joint Emergency Operation</a> in Tigray. </p><p>Why doesn&#8217;t USAID give grants to these groups directly, instead of giving them to CRS to give grants to them? Sometimes it&#8217;s because random locals in Tigray with a comparative advantage in dodging warlords don&#8217;t also have a comparative advantage in interfacing with the US government, which demands large amounts of paperwork. Other times it&#8217;s because these are such small grants that they&#8217;re a bad match for USAID&#8217;s long application and compliance process. Still other times, it&#8217;s because CRS has more people on the ground and more expertise in figuring out who needs money.</p><p>Do these groups charge an additional overhead layer? I&#8217;m having trouble figuring this out. <a href=\"https://www.ecfr.gov/current/title-2/subtitle-A/chapter-II/part-200/subpart-A/subject-group-ECFR2a6a0087862fd2c/section-200.1\">This </a>seems to suggest CRS isn&#8217;t allowed to charge its own overhead on anything beyond the first $50,000 that it sub-grants - but I&#8217;m not sure I&#8217;m understanding it correctly. In other cases, CRS pays the other charities&#8217; overheads out of its own overhead costs. I can&#8217;t get a great read on how often grants really are double-overheaded. But for CRS, it seems like the absolute worst case scenario, where all of its regrants have double overhead, is something like 7.2% total overhead (6% CRS overhead, plus another 6% partner overhead on the 1/5 of its money that it gives to partners). </p><p>In the original post, I was imagining something like a 30% overhead plus another layer of 10% overhead totalling 40%. But it&#8217;s really more like 7.2%. So <strong>I got this one extremely wrong, sorry</strong>. The reason I didn&#8217;t catch this was that I thought that certain program expenses (like doctor salaries) were included in overhead, so &#8220;30% overhead&#8221; didn&#8217;t immediately stand out as crazy to me. <strong>I have added this to my <a href=\"https://www.astralcodexten.com/p/mistakes\">Mistakes </a>page and regret the error.</strong></p><p>Anyway, Tyler&#8217;s 2-5% grant program overhead is pretty similar to the real overhead of CRS, JHPIEGO, and presumably other USAID charities, so I don&#8217;t think there&#8217;s a mystery here.</p><blockquote><p>Scott could have simply asked me how [Mercatus overhead] works. It is also the case that we do not receive or seek federal government research funding, but if we did the overhead going to GMU would be zero (are you listening o3?). Depending on the exact source of the funding, <em>very likely we would make a lot of money on such grants because we would receive significant &#8220;overhead&#8221; payments for what would not be actual overhead expenses</em>. That is one big problem with the system, I might add. We at Mercatus have made the judgment that we do not wish to become institutionally/financially addicted to such overhead&#8230;and I wish more non-profits would do the same.</p></blockquote><p>In my original post, I quoted o3 saying that Mercatus took about 8% as direct overhead, and that many other administrative expenses that a normal charity would have to charge as overhead were instead covered by George Mason University, but that under normal federal grant rules these would count for about 30%. I didn&#8217;t mean to imply that Mercatus actually took federal funding or charged these numbers (which is why I used the hypothetical &#8220;if&#8221; on that statement) and if it came off this way, I&#8217;m sorry. But other than that, I&#8217;m not sure what Tyler is objecting to. </p><p>The 8% number comes from Mercatus&#8217; 990 form <a href=\"https://www.mercatus.org/media/document/990-form-feb-2025\">here</a> - management + general + fundraising as a percent of total expenses (again, compare to Catholic Relief Services&#8217; 6%). </p><p>The claim that George Mason covers services that would usually have to be charged as overhead is also well-cited; for example, <a href=\"https://archive.is/a8o60#selection-608.0-608.3\">this article says that</a> Mercatus rents its office space from GMU for a cost of $1 for a twenty-eight year lease - surely not the market price in Northern Virginia.</p><p>There&#8217;s nothing wrong with this - ACX Grants maintains its 0% overhead because <a href=\"https://manifund.org/\">Manifund </a>covers our bills. My point is that it&#8217;s nothing to be proud of either. Mercatus hasn&#8217;t discovered some amazing new way to do charity without overhead costs, such that USAID charities that charge overhead are bloated and wasteful, but Mercatus is innovative and lean. They&#8217;ve just found someone who covers many of their bills for free. </p><blockquote><p>There was an earlier time when US AID did much less channeling through American third party NGOs. That was in my view a better regime, though of course Congress wanted to spend more money on Americans, and furthermore parts of the Republican Party, often in the executive branch, viewed the NGO alternative as more flexible and also more market-friendly. That created a small number of triumphs, such as PEPFAR, and a lot of waste, and I am happy to clear away much of that waste. Doing so also will improve aid decision-making in the future. It is right to believe that US AID can operate on another basis, and also right to wish to stop a system that allows spending on ostensible &#8220;democracy promotion.&#8221; I find it a useful discipline to have an initial approach to the problem that starts with this question &#8220;if you can&#8217;t find poverty-fighting domestic institutions in a country to fund directly, with sufficient trust, perhaps you should be giving aid elsewhere.&#8221; I also find it plausible that doing a lot of initial and pretty radical clearing away of NGO relations is the best way to get there, though I agree that point is debatable.</p></blockquote><p>Why? Are local charities more efficient than US charities? I don&#8217;t know, and I see no evidence that Cowen knows either. I suppose they might take less than 6% in overhead, since salaries are cheaper there and there are fewer compliance costs. But they also seem to have a lot of corrupt warlords in those countries, and &#8220;fewer compliance costs&#8221; is not an unalloyed good.</p><p>I would love to see a careful analysis of whether it&#8217;s more efficient to fund local vs. US charities. If it turned out the answer was local charities, then I would support a transition plan to get as much USAID money distributed locally as possible while causing as little disruption to on-the-ground services as possible. My impression is that pre-Trump USAID was actually <a href=\"https://web.archive.org/web/20250118170457/https:/www.usaid.gov/sites/default/files/2025-01/FY2024%20Localization%20Progress%20Report_Final_508_2.pdf\">in the middle of something like this</a> (they had identified a target of 50% locals, but were having trouble finding good ones).</p><p>What instead happened was that almost all USAID programs were simply terminated, with no attention to minimizing disruption, and no plan to replace them with local charities, and so <a href=\"https://www.vox.com/future-perfect/402944/pepfar-hiv-donald-trump-elon-musk-global-health\">probably several million people will die</a>. If Tyler will condemn this as a terrible decision, then we&#8217;re on the same page and everything else here is minor nitpicking. But if this is what he means by the &#8220;radical clearing away of NGO relations&#8221; that he finds &#8220;plausible&#8221; as &#8220;the best way&#8221;, then we&#8217;re not at all on the same page and I think Tyler should say so clearly and admit he disagrees with me.</p><p>Also - &#8220;I find it a useful discipline to have an initial approach to the problem that starts with this question &#8216;if you can&#8217;t find poverty-fighting domestic institutions in a country to fund directly, with sufficient trust, perhaps you should be giving aid elsewhere.&#8217;&#8221;  Why? Switzerland has great institutions - should we give our charity money there? There&#8217;s a obvious tension between the two goals of giving charity to countries dysfunctional enough to need it, but functional enough to use it effectively. Existing international aid is a complex balance between these two goals, and using (functional) US institutions to help get charity into (dysfunctional) countries is one proposed solution. There are probably others, and maybe Tyler has one in mind, but he doesn&#8217;t argue for it here, just gives a sort of faux-profound slogan.</p><blockquote><p>Scott writes: &#8220;When Trump and Rubio try to tar them [US AID] as grifters in order to make it slightly easier to redistribute their Congress-earmarked money to kleptocrats and billionaire cronies, this goes beyond normal political lying into the sort of thing that makes you the scum of the earth, the sort of person for whom even an all-merciful God could not restrain Himself from creating Hell.&#8221; Is that how the rationalist community should be presenting itself? In a time when innocent Americans are gunned down in the streets for their (ostensible) political views, and political assassination attempts seem to be rising, and there even has been a rationalist murder cult running around, does this show a morally responsible and clear thinking approach to the post that was published?</p></blockquote><p>I want to make it clear: I am not recommending that people kill Donald Trump or Marco Rubio. I am recommending that God consider sending them to Hell. I think this is a moderate compromise proposal, <a href=\"https://www.ncronline.org/opinion/guest-voices/will-musk-and-trump-go-hell-defunding-corporal-works-mercy\">endorsed by leading Hell experts</a><a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-2\" id=\"footnote-anchor-2\" target=\"_self\">2</a>. </p><p>I reject the claim that criticism is tantamount to violence - a claim which anyway I usually hear applied to transgender sex workers rather than, say, Donald Trump. Partly this is because I think a writer&#8217;s first responsibility is to to truth, second to goodness, and only very far down the list to manage the emotions of some hypothetical psychopath who may or may not be reading their work.</p><p>But primarily it&#8217;s because applied consistently, it makes it impossible to ever criticize anything - after all, even the most tepid criticism could fuel someone sufficiently on the edge. This is impractical, so nobody ever does apply it consistently, so it inevitably ends up as an <a href=\"https://slatestarcodex.com/2014/08/14/beware-isolated-demands-for-rigor/\">isolated demand for rigor</a>. I think this is true for Tyler, who <a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/update-on-the-supervillains.html\">has called </a>proponents of pharma price controls &#8220;supervillains&#8221; and accused them of potentially &#8220;inducing millions of premature deaths&#8221;. Although he reserves the &#8220;supervillain&#8221; term for pharma price controllers <a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/quantifying-the-super-villains.html\">consistently</a>, plenty of other people are &#8220;villains&#8221; - <a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/more-randian-villains.html\">for example</a>, Gavin Newsom for excluding Tesla from a 4% electric vehicle rebate.</p><p>We all have our breaking points. For some of us, it&#8217;s when people kill millions of children. For others, it&#8217;s when they exclude cool companies from 4% electric vehicle rebates. Rather than accusing anyone who reaches a breaking point and uses harsh words of fanning terrorism, I think we should agree that it&#8217;s permissible to call someone a very bad person - even a villain! - but not permissible to engage in terrorism or assassination. The blame for the latter lies entirely with the terrorists/assassins, not with writers who criticize their target.</p><p>Even if Tyler disagrees with this, I think there are enough other people calling Donald Trump a bad person that it&#8217;s not worth his time to respond to me in particular; he should present some kind of more general explanation of his views.</p><p>(also, rumor says Trump has a Service to protect him from this sort of danger, although I&#8217;m not surprised Tyler doesn&#8217;t know about it - I hear it&#8217;s secret.)</p><blockquote><p>More generally, I wonder if Scott ever has dealt with US AID or other multilaterals, or the world of NGOs, much of which surrounds Washington DC. I have lived in this milieu for almost forty years, and sometimes worked in it, from various sides including contractor. A lot of people have the common sense to realize that these institutions are pretty wasteful (not closedly tied to measured overhead btw), too oriented toward their own internal audiences, and also that the NGOs (as recipients, not donors) &#8220;capture&#8221; US AID to some extent. As an additional &#8220;am I understanding this issue correctly?&#8221; check, has Scott actually spoken to anyone involved in this process on the Trump administration side?</p></blockquote><p>This has been a general pattern in debates with Tyler. I will criticize some very specific point he made, and he&#8217;ll challenge whether I am important enough to have standing to debate him. &#8220;Oh, have <em>you</em> been to 570 different countries? Have <em>you</em> eaten a burrito prepared by an Ethiopian camel farmer with under-recognized talent? Have <em>you</em> read 800 million books, then made a post about each one consisting of a randomly selected paragraph followed by the words &#8216;this really makes you think, for those of you paying attention&#8217;?&#8221;</p><p>I am not an expert on aid. But the development fellows and econ professors I mentioned above are, and they agree with my criticism. I ran this post by someone who&#8217;s worked closely with USAID and affiliated programs for a decade and they said they took my side. Not that it matters - the blogosphere, like the Royal Society, ought to be <em>nullius in verba</em>, not a chest-puffing competition of credentials but a data dump of receipts.</p><p>(although the expert I talked to also volunteered that they have never seen someone who has vast personal experience with and expertise in USAID refer to the program as &#8220;US AID&#8221; with a space, the way Tyler regularly does.)</p><p>And - fine - I admit I&#8217;ve never hob-nobbed with Trump administration officials. But I have delivered medicine in a Third World country. I&#8217;ve helped treat patients who were definitely going to die within a year, for want of medication that would be routine anywhere else. I&#8217;ve looked in parents&#8217; eyes while telling them their kid wasn&#8217;t going to recover. It sucks. I can&#8217;t say that it teaches anything directly useful for understanding the details of the public charity funding landscape. Maybe everything I&#8217;m writing here about NICRA vs. overhead and sub-grants vs. sub-sub-grants is totally and embarrassingly wrong, and my lack of familiarity with DC NGO culture is to blame. </p><p>But - someone recently asked Elon Musk why he cancelled PEPFAR. Musk <a href=\"https://www.nationalreview.com/corner/elon-musk-on-aids-medication-ill-fix-it-right-now/\">responded </a>that what, huh, he didn&#8217;t know he cancelled PEPFAR, that must have been a mistake, somebody should get around to fixing it. If he&#8217;s telling the truth, maybe this redeems him a little? Certainly it makes him better than the ghouls cheering on its cancellation. But it doesn&#8217;t redeem him very <em>much</em>. I think if Elon had the same experiences I had, he wouldn&#8217;t have been able to sleep at night for fear that he had accidentally cancelled PEPFAR. He would have been calling his lieutenants at odd hours of the morning, all through the winter and early spring, saying &#8220;Hey, you definitely didn&#8217;t cancel the developing world medical funding, did you?&#8221; and the lieutenants would respond &#8220;Elon, you&#8217;ve asked me that four times tonight already, please stop obsessing over this.&#8221;</p><p>In the same way, I think if Tyler had the experiences I&#8217;ve had, he would not so casually write a handwavy four-line post vaguely insinuating slanders on USAID while protesting that he never quite said them clearly. If someone told him the post was misleading, he would care a lot about this, rather than acting like one of the most worth-worrying-about points was whether overly strong criticism of Trump might lead to his assassination. He wouldn&#8217;t be so breezy about a &#8220;radical clearing away of NGO relations&#8221;, or engage with the destruction of the charity ecosystem on the level of faux-profound slogans. Maybe Tyler is much nicer and more rational than I am and able to treat this whole situation with perfect Zen calm. But to me, it comes across as a sort of <a href=\"https://www.econlib.org/archives/2016/01/the_invisible_t.html\">&#8220;missing mood&#8221;</a> in the Bryan Caplan sense. </p><blockquote><p>There are a bunch of other things wrong with Scott&#8217;s discussion of overhead, but it is not worth going through them all. I am all for keeping the very good public health programs, and yes I do know they involve NGO partners, and jettisoning a lot of the other accretions. That is the true humanitarian attitude, and it is time to recognize it as such. Better rhetoric, better thinking, and less anger are needed to get us there. It is now time for Scott to return to his usual high standards of argumentation and evidence.</p></blockquote><p>Another missing mood! This has none of the intellectual curiosity that Tyler would apply to something he considered important. Just - there are &#8220;very good&#8221; programs and also &#8220;accretions&#8221;, USAID truly is a land of contrasts.</p><p>Here&#8217;s <a href=\"https://www.congress.gov/crs-product/IF10261\">Congress</a>&#8217; chart of where USAID money goes:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9d4dd3f9-1f4e-47d2-b8af-b1900ad33247_298x298.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"298\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9d4dd3f9-1f4e-47d2-b8af-b1900ad33247_298x298.png\" width=\"298\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>&#8220;Humanitarian&#8221; is things like giving food to starving people. &#8220;Governance&#8221; is mostly grants to the government of Ukraine, <a href=\"https://www.lawfaremedia.org/article/how-the-attack-on-usaid-hurts-ukraine\">which apparently </a>&#8220;allowed the government to sustain its operations, helping pay state workers salaries and provide state services&#8230;[as the] economy shrank and budgets were redirected to the country&#8217;s defense&#8221;. The other categories should be self-evident.</p><p>Which of these are the &#8220;accretions&#8221;? If &#8220;Health&#8221; and &#8220;Humanitarian&#8221; are what Cowen is calling &#8220;very good public health programs&#8221;, and the Ukraine aid is probably controversial but everyone can understand why we&#8217;re doing it, what&#8217;s left?</p><p>I keep hearing about how most USAID money goes to rich woke snobs who use it to throw parties celebrating how much better they are than you. But where are these people? Are they hiding in the 6% overhead in Catholic Relief Services? The 3.9% overhead in JHPIEGO? The Ukrainians? The African clinics? I hear a lot about how USAID is funding foreign journalists to be really liberal, but it looks like all &#8220;democracy and human rights&#8221; grants combined - the category that this would fall into - are <a href=\"https://foreignassistance.gov/\">2-5%</a> of the budget (and this category also includes a lot of things like election observers).</p><p>The whole point of this debate is that (almost) everyone agrees &#8220;keep the good stuff, but jettison the bad stuff&#8221;. But the discussion is dominated by people who think USAID is 90% grift and operas about transgender people, and that the AIDS work is a tiny veneer on top of that to add credibility. My impression is that it&#8217;s the opposite. We can&#8217;t sensibly consider how to act on a policy of &#8220;keep the good stuff, but jettison the bad stuff&#8221; without a careful reckoning of who&#8217;s right, and whether the relevant instrument is a scalpel vs. a chainsaw. </p><p>This is why I found Tyler&#8217;s post saying that he was &#8220;fact checking&#8221; Marco Rubio&#8217;s claim that it was mostly waste, and <em>indeed</em> found that 75-90% &#8220;went to third-parties&#8221; and that &#8220;not <em>all</em> third parties are wasteful&#8221; but &#8220;USAID defenders [aren&#8217;t] keen to deal with such estimates&#8221; to provide such negative value. It looks like it&#8217;s offering this much-needed clarity, but in fact it&#8217;s the opposite. </p><p>In conclusion, I support keeping good stuff and jettisoning waste. If Tyler also supports this, then we&#8217;re on the same team. I continue to hope he will edit his original post to reflect this.</p><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-1\" id=\"footnote-1\" target=\"_self\">1</a><div class=\"footnote-content\"><p>ACX subreddit sources: <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu213b5/\">1</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu27x4m/\">2</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu20h4r/\">3</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu1zr1m/\">4</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu3g6s8/\">5</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu26tmn/\">6</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu3hfrn/\">7</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu1yzl1/\">8</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kuizdn/tyler_responds_to_contra_mr_on_charity_regrants/mu24klc/\">9</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kt3tgh/contra_mr_on_charity_regrants/mtqky12/\">10</a>, <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1kt3tgh/contra_mr_on_charity_regrants/mu00tbs/\">11</a>. I can&#8217;t figure out how to link individual Marginal Revolution comments, so you will have to trust me when I say there were 22 of them.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-2\" id=\"footnote-2\" target=\"_self\">2</a><div class=\"footnote-content\"><p>As a Jew, I believe that people are only tortured in Hell for twelve months, and get Saturdays off (<a href=\"https://en.wikipedia.org/wiki/Gehenna#Rabbinical_Judaism\">really!</a>). Like I said, moderate compromise!</p></div></div>"
            ],
            "link": "https://www.astralcodexten.com/p/sorry-i-still-think-mr-is-wrong-about",
            "publishedAt": "2025-05-29",
            "source": "SlateStarCodex",
            "summary": "<p>Tyler Cowen of Marginal Revolution continues to disagree with my <a href=\"https://www.astralcodexten.com/p/contra-mr-on-charity-regrants\">Contra MR On Charity Regrants</a>. Going through <strong><a href=\"https://marginalrevolution.com/marginalrevolution/2025/05/so-many-mistakes.html\">his response</a></strong> piece by piece, slightly out of order:</p><blockquote><p>Scott takes me to be endorsing Rubio&#8217;s claim that the third-party NGOs simply pocket the money. In reality my fact check with o3 found (correctly) that the money was &#8220;channelled through&#8221; the NGOs, not pocketed. Scott lumps my claim together with Rubio&#8217;s as if we were saying the same thing. My very next words (&#8220;I do understand that not all third party allocations are wasteful&#8230;&#8221;) show a clear understanding that the money is channeled, not pocketed, and <a href=\"https://marginalrevolution.com/marginalrevolution/2025/02/deep-research-considers-the-costs-and-benefits-of-us-aid.html\">my earlier and longer post on US AID</a> makes that clearer yet at greater length. Scott is simply misrepresenting me here.</p></blockquote><p>The full post is in the image below:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F57bccfa3-0792-41f6-ab6e-e194483bb90a_961x477.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"477\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F57bccfa3-0792-41f6-ab6e-e194483bb90a_961x477.png\" title=\"\" width=\"961\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0",
            "title": "Sorry, I Still Think MR Is Wrong About USAID"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-29"
}