{
    "articles": [
        {
            "content": [
                "<p>(<a href=\"https://charitydotwtf.substack.com/p/on-friday-deploys-sometimes-that\">Cross posted from its original source</a>)</p>\n<p>‘Tis the season that one of my favorite blog posts gets pulled out and put in rotation, much like “White Christmas” on the radio station. I’m speaking, of course, of “<a href=\"https://substack.com/home/post/p-181561576\" rel=\"\">Friday Deploy Freezes are Exactly Like Murdering Puppies</a>” (<a href=\"https://charity.wtf/2019/05/01/friday-deploy-freezes-are-exactly-like-murdering-puppies/\" rel=\"\">old link on WP</a>).</p>\n<p>This feels like as good a time as any to note that I am not as much of an extremist as people seem to think I am when it comes to Friday deploys, or deploy freezes in general.</p>\n<p>(Sometimes I wonder why people think I’m such an extremist, and then I remember that I did write a post about murdering puppies. Ok, ok. Point taken.)</p>\n<p>Take <a href=\"https://www.linkedin.com/posts/michael-davis-7033548_friday-deploy-freezes-are-exactly-like-murdering-activity-7408181339444707328-8GjS?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAEP-B4Bn1IFS4Br7okfkI7z81XqQEOEKro\" rel=\"\">this recent thread from LinkedIn</a>, where <a href=\"https://www.linkedin.com/in/michael-davis-7033548\" rel=\"\">Michael Davis</a> posted an endorsement of my Puppies article along with his own thoughts on holiday code freezes, followed by a number of smart, thoughtful comments on why this isn’t actually attainable for everyone. <a href=\"https://www.linkedin.com/in/payamazadi-nyc\" rel=\"\">Payam Azadi</a> talks about an “icing” and “defrosting” period where you ease into and out of deploy freezes (never heard of this, I like it!), and a few other highly knowledgeable folks chime in with their own war stories and cautionary tales.</p>\n<p>It’s a great thread, with lots of great points. I recommend reading it. I agree with all of them!!</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\">\n<source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"312\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%2141Lq%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F097e02dc-5952-42ba-b532-d2efada0d4dc_768x1024.jpeg?resize=234%2C312&#038;ssl=1\" width=\"234\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><span style=\"font-family: 'Open Sans Condensed', Helvetica, sans-serif; font-size: 30px; font-weight: bold;\">If you can’t move swiftly with confidence, you need workarounds</span></div>\n</div>\n</div>\n</figure>\n</div>\n<p>For the record, I do not believe that everyone should get rid of deploy freezes, on Fridays or otherwise.</p>\n<p>If you do not have the ability to move swiftly <em>with confidence</em>, which in practice means “you can generally find problems in your new code before your customers do”, which generally comes down to the quality and usability of your observability tooling, and your ability to explore high cardinality dimensions in real time (which most teams <em>do not have</em>), then deploy freezes before a holiday or a big event, or hell, even weekends, are probably the sensible thing to do.</p>\n<p>If you can’t do the “right” thing, you find a workaround. This is what we do, as engineers and operators.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21TfFn%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4718da54-36dd-423c-a6e3-ed1fb960a789_978x360.jpeg?w=428&#038;ssl=1\" /></div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">Deploy freezes are a hack, not a virtue</h2>\n<p>Look, you know your systems better than I do. If you say you need to freeze deploys, I believe you.</p>\n<p>Honestly, I feel like I’ve <em>always</em> been fairly pragmatic about this. The one thing that does get my knickers in a twist is when people adopt a holier-than-thou posture towards their Friday deploy freezes. Like they’re doing it because they Care About People and it’s the Right Thing To Do and some sort of grand moral gesture. Dude, it’s a fucking hack. Just admit it.</p>\n<p>It’s the best you can do with the hand you’ve been dealt, and there’s no shame in that! That is ALL I’m saying. Don’t pat yourself on the back, act a little sheepish, and I am so with you.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\">\n<source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21xmpo%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d44e948-84a0-4457-a8e7-e6407c8005f7_1458x440.jpeg?w=412&#038;ssl=1\" />\n<div></div>\n</div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">I think we can have nice things</h2>\n<div class=\"pencraft pc-display-flex pc-alignItems-center pc-position-absolute pc-reset header-anchor-parent\">\n<div class=\"pencraft pc-display-contents pc-reset pubTheme-yiXxQA\">\n<div class=\"pencraft pc-reset header-anchor offset-top\" id=\"§i-think-we-can-have-nice-things\"></div>\n<p>I think there’s a lot of wisdom in saying “hey, it’s the holidays, this is not the time to be rushing new shit out the door absent some specific forcing function, alright?”</p>\n</div>\n</div>\n<p>My favorite time of year to be at work (back when I worked in an office) was always the holidays. It was so quiet and peaceful, the place was empty, my calendar was clear, and I could switch gears and work on completely different things, out of the critical line of fire. I feel like I often peaked creatively during those last few weeks of the year.</p>\n<p>I believe we can have the best of both worlds: a yearly period of peace and stability, with relatively low change rate, <em>and</em> we can evade the high stakes peril of locks and freezes and terrifying January recoveries.</p>\n<p>How? Two things.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21U-tY%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F27be66be-5f80-4664-a5fc-a47e3f4b6e1b_1452x540.jpeg?w=412&#038;ssl=1\" /></div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">Don’t freeze deploys. Freeze merges.</h2>\n<p>To a developer, ideally, the act of merging their changes back to main and those changes being deployed to production should feel like one singular atomic action, the faster the better, the less variance the better. You merge, it goes right out. You don’t want it to go out, you better not merge.</p>\n<p>The worst of both worlds is when you let devs keep merging diffs, checking items off their todo lists, closing out tasks, for days or weeks. All these changes build up like a snowdrift over a pile of grenades. You aren’t going to find the grenades til you plow into the snowdrift on January 5th, and then you’ll find them with your face. Congrats!</p>\n<p><strong>If you want to freeze deploys, freeze merges</strong>. Let people work on other things. I assure you, there is plenty of other valuable work to be done.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\">\n<source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21aR1f%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F673546bf-45ed-41e4-b615-72da93f44c24_2332x337.jpeg?w=558&#038;ssl=1\" />\n<div></div>\n</div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">Don’t freeze deploys unless <em>your goal</em> is to test deploy freezes</h2>\n<p>The second thing is a corollary. Don’t <em>actually</em> freeze deploys, unless your SREs and on call folks are bored and sitting around together, going “wouldn’t this be a great opportunity to test for memory leaks and other systemic issues that we don’t know about due to the frequency and regularity of our deploys?”</p>\n<p>If that’s you, godspeed! Park that deploy engine and sit on the hood, let’s see what happens!</p>\n<p>People always remember the outages and instability that we trigger with our actions. We tend to forget about the outages and instability we trigger with our <em>inaction</em>. But if you’re used to deploying every day, or many times a day: first, good for you. Second, I bet you a bottle of whiskey that something’s gonna break if you go for two weeks without deploying.</p>\n<p>I bet you the good shit. Top shelf. 🥃</p>\n<p>This one is <em>so easy</em> to mitigate, too. Just run the deploy process every day or two, but <strong>don’t ship new code out</strong>.</p>\n<p>Alright. Time for me to go fly to my sister’s house. Happy holidays everyone! May your pagers be silent and your bellies be full, and may no one in your family or friend group mention politics this year!</p>\n<p>💜💙💚💛🧡❤️💖<br />\ncharity</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\">\n<source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21cOpy%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0e52da0e-c92d-4735-8124-7ea5efdc7b5f_2048x1536.jpeg?w=439&#038;ssl=1\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"></div>\n</div>\n</div><figcaption class=\"image-caption\">Me and Bubba and Miss Pinky Persnickety</figcaption></figure>\n</div>\n<p>P.S. The title is hyperbole! I was frustrated! I felt like people were intentionally misrepresenting my point and my beliefs, so I leaned into it. Please remember that I grew up on a farm and we ended up eating most of our animals. Possibly I am still adjusting to civilized life. Also, I have two cats and I love them very much and have not eaten either of them yet.</p>\n<p>A few other things I’ve written on the topic:</p>\n<ul>\n<li><a href=\"https://substack.com/home/post/p-181561589\" rel=\"\">Shipping Software Should Not Be Scary</a></li>\n<li><a href=\"https://substack.com/home/post/p-181561541\" rel=\"\">Deploys: It’s Not Actually About Fridays</a></li>\n<li><a href=\"https://substack.com/home/post/p-181561517\" rel=\"\">How Much Is Your Fear of Continuous Deployment Costing You?</a></li>\n<li><a href=\"https://substack.com/home/post/p-181561522\" rel=\"\">Why Are My Tests So Slow? A List of Likely Suspects, Anti-Patterns, and Unresolved Personal Trauma</a></li>\n</ul>"
            ],
            "link": "https://charity.wtf/2025/12/24/on-friday-deploys-sometimes-that-puppy-needs-murdering-xpost/",
            "publishedAt": "2025-12-24",
            "source": "Charity Majors",
            "summary": "(Cross posted from its original source) ‘Tis the season that one of my favorite blog posts gets pulled out and put in rotation, much like “White Christmas” on the radio station. I’m speaking, of course, of “Friday Deploy Freezes are Exactly Like Murdering Puppies” (old link on WP). This feels like as good a time [&#8230;]",
            "title": "On Friday Deploys: Sometimes that Puppy Needs Murdering (xpost)"
        },
        {
            "content": [],
            "link": "https://bernsteinbear.com/blog/toy-load-store/?utm_source=rss",
            "publishedAt": "2025-12-24",
            "source": "Max Bernstein",
            "summary": "<p><em>Another entry in the <a href=\"https://pypy.org/categories/toy-optimizer.html\">Toy Optimizer series</a></em>.</p> <p>A long, long time ago (two years!) <a href=\"https://cfbolz.de/\">CF Bolz-Tereick</a> and I made a <a href=\"https://www.youtube.com/watch?v=w-UHg0yOPSE\">video about load/store forwarding</a> and an accompanying <a href=\"https://gist.github.com/tekknolagi/4e3fa26d350f6d3b39ede40d372b97fe\">GitHub Gist</a> about load/store forwarding in the Toy Optimizer. I said I would write a blog post about it, but never found the time—it got lost amid a sea of large life changes.</p> <p>It’s a neat idea: do an abstract interpretation over the trace, modeling the heap at compile-time, removing redundant reads and writes. That means it’s possible to optimize traces like this:</p> <div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>v0 = ... v1 = load(v0, 5) v2 = store(v0, 6, 123) v3 = load(v0, 6) v4 = load(v0, 5) v5 = do_something(v1, v3, v4) </code></pre></div></div> <p>into traces like this:</p> <div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>v0 = ... v1 = load(v0, 5) v2 = store(v0, 6, 123) v5 = do_something(v1, 123, v1) </code></pre></div></div> <p>This indicates that we were able to remove two redundant loads by keeping around information about previous loads and stores. Let’s get to work making this possible.</p> <h2 id=\"the-usual-infrastructure\">The usual infrastructure</h2> <p>We’ll start off with the usual infrastructure from the <a href=\"https://pypy.org/categories/toy-optimizer.html\">Toy Optimizer series</a>: a very stringly-typed representation of a",
            "title": "Load and store forwarding in the Toy Optimizer"
        },
        {
            "content": [],
            "link": "https://bernsteinbear.com/blog/launch-zjit/?utm_source=rss",
            "publishedAt": "2025-12-24",
            "source": "Max Bernstein",
            "summary": "<p><em>Originally published on <a href=\"https://railsatscale.com/2025-12-24-launch-zjit/\">Rails At Scale</a>.</em></p> <p>ZJIT is a new just-in-time (JIT) Ruby compiler built into the reference Ruby implementation, <a href=\"https://en.wikipedia.org/wiki/YARV\">YARV</a>, by the same compiler group that brought you YJIT. We (Aaron Patterson, Aiden Fox Ivey, Alan Wu, Jacob Denbeaux, Kevin Menard, Max Bernstein, Maxime Chevalier-Boisvert, Randy Stauner, Stan Lo, and Takashi Kokubun) have been working on ZJIT since the beginning of this year.</p> <p>In case you missed the last post, we’re building a new compiler for Ruby because we want to both raise the performance ceiling (bigger compilation unit size and SSA IR) and encourage more outside contribution (by becoming a more traditional method compiler).</p> <p>It’s been a long time since we gave an official update on ZJIT. Things are going well. We’re excited to share our progress with you. We’ve done a lot <a href=\"https://bernsteinbear.com/blog/merge-zjit/\">since May</a>.</p> <h2 id=\"in-brief\">In brief</h2> <p>ZJIT is compiled by default—but not enabled by default—in Ruby 4.0. Enable it by passing the <code class=\"language-plaintext highlighter-rouge\">--zjit</code> flag or the <code class=\"language-plaintext highlighter-rouge\">RUBY_ZJIT_ENABLE</code> environment variable or calling <code class=\"language-plaintext highlighter-rouge\">RubyVM::ZJIT.enable</code> after starting your application.</p> <p>It’s faster than the interpreter, but not yet as fast as YJIT. <strong>Yet.</strong> But we have a plan, and we have",
            "title": "ZJIT is now available in Ruby 4.0"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/12/24/style/tiny-modern-love-stories-its-not-easy-to-please-a-woman.html",
            "publishedAt": "2025-12-24",
            "source": "Modern Love - NYT",
            "summary": "To celebrate the season, we gathered five of our favorite holiday-themed Tiny Love Stories.",
            "title": "Tiny Love Stories: ‘It’s Not Easy to Please a Woman’"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2025/12/24/podcasts/modernlove-andrew-garfield-encore.html",
            "publishedAt": "2025-12-24",
            "source": "Modern Love - NYT",
            "summary": "The actor knows life is fleeting, but he wants to hold on to every moment.",
            "title": "‘Modern Love Podcast’: Andrew Garfield Wants to Crack Open Your Heart"
        },
        {
            "content": [
                "<p>Now that I am tracking all the movies I watch via Letterboxd, it seems worthwhile to go over the results at the end of the year, and look for lessons, patterns and highlights.</p>\n<p>Last year: <a href=\"https://thezvi.substack.com/p/zvis-2024-in-movies\">Zvi’s 2024 In Movies</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">The Ratings Scale</h4>\n\n\n<p><a href=\"https://letterboxd.com/thezvi/films/reviews/\">You can find all my ratings and reviews on Letterboxd.</a> I do revise from time to time, either on rewatch or changing my mind. I encourage you to follow me there.</p>\n<p>Letterboxd ratings go from 0.5-5. The scale is trying to measure several things at once.</p>\n<p>5: Masterpiece. All-time great film. Will rewatch multiple times. See this film.</p>\n<p>4.5: Excellent. Life is meaningfully enriched. Want to rewatch. Probably see this film.</p>\n<div>\n\n\n<span id=\"more-24979\"></span>\n\n\n</div>\n<p>4: Great. Cut above. Very happy I saw. Happy to rewatch. If interested, see this film.</p>\n<p>3.5: Very Good. Actively happy I saw. Added value to my life. A worthwhile time.</p>\n<p>3: Good. Happy that I saw it, but wouldn’t be a serious mistake to miss it.</p>\n<p>2.5: Okay. Watching this was a small mistake.</p>\n<p>2: Bad. I immediately regret this decision. Kind of a waste.</p>\n<p>1.5: Very bad. If you caused this to exist, you should feel bad. But something’s here.</p>\n<p>1: Atrocious. Total failure. Morbid curiosity is the only reason to finish this.</p>\n<p>0.5: Crime Against Cinema. Have you left no sense of decency, sir, at long last?</p>\n<p>The ratings are intended as a bell curve. It’s close, but not quite there due to selection of rewatches and attempting to not see the films that are bad:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!GJpF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F158178ed-2d58-4114-ba1a-7fcc620c8809_417x164.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">The Five Component Model of Movie Ratings</h4>\n\n\n<p>Trying to boil ratings down to one number destroys a lot of information.</p>\n<p>Given how much my ratings this year conflict with critics opinions, I asked why this was, and I think I mostly have an explanation now.</p>\n<p>There are several related but largely distinct components. I think the basic five are:</p>\n<ol>\n<li>Quality with a capital Q and whether the movie has ambition and originality.</li>\n<li>Whether the overall pacing, arc and plot of the movie holds your interest.</li>\n<li>What message the movie sends and whether its arc comes together satisfyingly.</li>\n<li>What does the movie make you feel? All the feels? None? Some of them?</li>\n<li>Whether the movie is a good fit for you personally.</li>\n</ol>\n<p>Traditional critic movie ratings tend, from my perspective, to overweight #1, exhibit predictable strong biases in #3 and #5, and not care enough about #2. They also seem to cut older movies, especially those pre-1980 or so, quite a lot of unearned slack.</p>\n<p>Scott Sumner picks films with excellent Quality, but cares little for so many other things that once he picks a movie to watch our ratings don’t even seem to correlate. We have remarkably opposite tastes. Him giving a 3.7 to The Phoenician Scheme is the perfect example of this. Do I see why he might do that? Yes. But a scale that does that doesn’t tell me much I can use.</p>\n\n\n<h4 class=\"wp-block-heading\">The Numbers</h4>\n\n\n<p>Order within a ranking is meaningful.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!I3wg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F87949d0d-a40d-476a-a1c4-9fccae74ea49_1420x1726.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Movies Have Decreasing Marginal Returns in Practice</h4>\n\n\n<p>Any reasonable algorithm is going to be very good at differentially finding the best movies to see, both for you and in general. As you see more movies, you deplete the pool of both existing and new movies. That’s in addition to issues of duplication.</p>\n<p>In 2024, I watched 36 new movies. In 2025, I watched 51 new movies. That’s enough of an expansion that you’d expect substantially decreasing returns. If anything, things held up rather well. My average rating only declined from 3.1 to 3.01 (if you exclude one kids movie I was ‘forced’ to watch) despite my disliking many of the year’s most loved films.</p>\n<p>My guess is I could have gotten up to at least 75 before I ran out of reasonable options.</p>\n\n\n<h4 class=\"wp-block-heading\">Very Briefly on the Top Picks and Whether You Should See Them</h4>\n\n\n<p>See The Naked Gun unless you hate fun. If you hated the original Naked Gun, or Airplane, that counts as hating fun. But otherwise, yes, I understand that this is not the highest Quality movie of the year, but this is worthy, see it.</p>\n<p>You should almost certainly see Bogunia and Companion.</p>\n<p>See Thunderbolts* unless you are automatically out on all Marvel movies ever.</p>\n<p>See A Big, Bold Beautiful Journey unless you hate whimsical romantic comedies or are a stickler for traditional movie reviews.</p>\n<p>See Sorry, Baby and Hamnet, and then Sentimental Value, if you are willing to spend that time being sad.</p>\n<p>See Novocaine and then maybe The Running Man if you want to spend that time watching action, having fun and being happy instead.</p>\n<p>See Relay if you want a quiet thriller.</p>\n<p>See Oh, Hi!, Splitsville and Materialists if you want to look into some modern dating dynamics in various ways, in that order or priority.</p>\n<p>See Wick is Pain if and only if you loved the John Wick movies.</p>\n<p>The world would be better if everyone saw A House of Dynamite.</p>\n<p>I anticipate that Marty Supreme belongs on this list, it counts as ‘I’m in,’ but due to holidays and the flu I haven’t been able to go out and see it yet. The over/under is at Challengers.</p>\n\n\n<h4 class=\"wp-block-heading\">Other Notes to Self to Remember (Reprise from 2024)</h4>\n\n\n<p>This helps you understand my biases, and helps me remember them as well.</p>\n<ol>\n<li><a href=\"https://www.youtube.com/watch?v=YigM-F4oSIE&amp;pp=ygUsaWYgdGhlIG1vdmllIHN0aW5rcyBqdXN0IGRvbid0IGdvIHRoZSBjcml0aWM%3D\">If the movie stinks, just don’t go</a>. You know if the movie stinks.</li>\n<li>Trust your instincts and your gut feelings more than you think you should.</li>\n<li>Maybe gut feelings are self-fulfilling prophecies? Doesn’t matter. They still count.</li>\n<li>You love fun, meta, self-aware movies of all kinds. Trust this instinct.</li>\n<li>You do not actually like action movies that play it straight. Stop watching them. However, action movies that do something cool or unique can be very cool.</li>\n<li>If the movie sounds like work or pain, it probably is, act accordingly.</li>\n<li>If the movie sounds very indy or liberal, the critics will overrate it.</li>\n<li>A movie being considered for awards is not a positive signal once you control for the Metacritic and Letterboxd ratings. If anything it is a negative.</li>\n<li>Letterboxd ratings adjusted for context beat Metacritic. Rotten Tomatoes is the best test for ‘will the movie stink’. No review source has much predictive value beyond knowing if the movie stinks, if you fail to control for context.</li>\n<li>Opinions of individuals very much have Alpha if you have enough context.</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">The Year of Living Disagreeably</h4>\n\n\n<p>That leaves six remarkably well reviewed movies, all of which are indeed very high on Quality, where I disagreed with the consensus, and had my rating at 3 or less. In order of Quality as I would rank them, they are: One Battle After Another, Sinners, Black Bag, Train Dreams, Weapons and Frankenstein.</p>\n<p>A strategy I think would work well for all six of those, at the risk of some spoilage, is to watch the trailer. If you respond to that trailer with ‘I’m in’ then be in. If not, not.</p>\n<p>The predictive power of critical reviews, at least for me, took a nosedive in 2025. One reason is that the ratings clearly got more generous in general. Average Metacritic, despite my watching more movies, went from 61 → 66, Letterboxd went 3.04 → 3.33. Those are huge jumps given the scales.</p>\n<p>In 2024, Letterboxd or Metacritic ratings were 48% and 46% correlated with my final ratings, respectively. This year that declined to 33% and 38%, and I discovered the best was actually Rotten Tomatoes at 44%, with IMDB at 42%.</p>\n<p>If you consider only movies where I gave a rating of 2.5 or more, filtering out what I felt were actively bad movies, the correlation dropped to 1% and 6%, or 3% for IMDB, or -4% (!) for Rotten Tomatoes. Essentially all of the value of critics was in identifying which things sucked, and from my perspective the rest was noise.</p>\n<p>Rotten Tomatoes is a one trick pony. It warns you about things that might suck.</p>\n<p>Even more than before, you have to adjust critic ratings for whether critics will overrate or underrate a movie of this type and with this subject matter. You can often have a strong sense of why the critics would put up a given number, without having to read reviews and thus risk spoilers.</p>\n<p>Using multiple sources, and looking at their relative scores, helps with this as well. A relatively high IMDB score, even more than Letterboxd, tells you that the audience and the movie are well-matched. That can be good news, or that can be bad news.</p>\n<p>Last year there were movies where I disagreed with the review consensus, but I always understood why in both directions. I might think Megalopolis is Coppola’s masterpiece despite its problems, but don’t get me wrong, I see the problems.</p>\n<p>This year I mostly get why they liked the ‘overrated six’ above, but there are several cases where I do not know what they were thinking, and I think the critical consensus is objectively wrong even by its own standards.</p>\n\n\n<h4 class=\"wp-block-heading\">I Hate Spoilers With the Fire of a Thousand Suns</h4>\n\n\n<p>I haven’t found a solution to the problem of ‘how do you check reviews without spoiling the movie?’ given that the average score itself can be a spoiler, but also I notice I haven’t tried that hard. With advances in LLMs and also vibe coding, I clearly should try again.</p>\n\n\n<h4 class=\"wp-block-heading\">You Son Of A Bitch, I’m In</h4>\n\n\n<p>The power of ‘I’m in’ peaked in 2024.</p>\n<p>The rule for ‘I’m in’ is:</p>\n<ol>\n<li>You must be excited and think to yourself, ‘You son of a bitch, I’m in.’</li>\n<li>Sources of this can include trailers, posters, talent and other info.</li>\n<li>However this cannot be on the basis of reviews.</li>\n</ol>\n<p>That year, there were 6 movies where in advance I said ‘I’m in,’ and they were 6 of my top 9 movies for the year.</p>\n<p>This year the power of ‘I’m in’ was still strong, but less reliable. I’d count 10 such movies this year, including 4 of my ultimate top 5, but the other 6 did not break into the 4+ range, and there was a 3 and a 2.5. That’s still a great deal, especially given how many movies where it seemed like one ‘should’ be excited, I noticed I wasn’t, and that proved correct, including One Battle After Another, Black Bag, Weapons and Sinners.</p>\n<p>I wonder: How much of the power of ‘I’m in’ is the attitude and thus is causal, versus it being a prediction? I have low confidence in this.</p>\n\n\n<h4 class=\"wp-block-heading\">Theaters Continue To Be Awesome</h4>\n\n\n<p>I control for this effect when giving ratings, but the experience is much better in a theater, maybe good for an experiential boost of ~0.3 points on the 0.5-5 point scale. That’s big. I have to consciously correct for it when rating movies I watch at home.</p>\n<p>I highly recommend getting a membership that makes marginal cost $0, such as the AMC A-List or the similar deal at Regal Cinemas. This helps you enjoy the movie and decide to see them more.</p>\n\n\n<h4 class=\"wp-block-heading\">Strong Opinions, Strongly Held: I Didn’t Like It</h4>\n\n\n<p>Unlike last year, there were remarkably many movies that are in green on Metacritic, but that I rated 2.5 or lower, and also a few of the 3s require explanation as per above.</p>\n<p>I don’t know how this happened, but an active majority of the movies I rated below 3 had a Metacritic score above 60. That’s bizarre.</p>\n<p>Minor spoilers throughout, I do my best to limit it to minor ones, I’ll do the 3s sorted by Metacritic, then the others sorted by Metacritic.</p>\n<ol>\n<li>One Battle After Another (Metacritic: 95, Zvi: 3) is probably going to win Best Picture. It’s not hard to see why. This was the highest Quality movie I’ve seen this year, and yet I did not enjoy watching it. The jokes mostly fell flat and aside from the daughter and the Dojo sensei I couldn’t emphasize with or root for the characters. Why? Fundamentally, because the movie depends on the idea that Bob is a Good Dude, and that the revolutionaries are sympathetic. Sorry, no dice, and no amount of stacking the deck with other awfulness is going to change that. There’s also a superposition between ‘this deck is stacked and the world presented is very different from ours’ and ‘actually this is our world and this is a call to action and that is what life is about, do you know what time it is?’ I grudgingly have to give this 3 stars anyway, because Quality is so high.</li>\n<li>Train Dreams (Metacritic 88, Zvi: 3): This is the easiest one to explain. It’s an arthouse movie where very little happens, that thinks it is being profound, and it really is not being profound.</li>\n<li>Black Bag (Metacritic 85, Zvi: 3): Here I’m actually confused where the 85 is coming from as opposed to a 65-75. I mean yes this is well done all around but there’s a reason it isn’t in the Oscar race, none of it is new or special and I didn’t feel it said anything, and it mostly left me cold.</li>\n<li>Sinners (Metacritic: 84, Zvi: 3): This oozes cool and I want to love it, I get why so many others love it, but for me the vampires simply don’t work. I know what it’s trying to do there, but it’s hitting us over the head with it and everything involving the vampires felt like it was going through the motions and it would have been so much better, as Matthew Yglesias suggests, to do this as about racism straight up without also using the metaphor.</li>\n</ol>\n<p>Now the ones I actively disliked:</p>\n<ol>\n<li>Weapons (Metacritic: 81, Zvi: 2.5): The first half of this would be great if you had stuck the landing, Amy Madigan is terrific, but it didn’t come together in the end, the plot holes are absurd and the central conceit feels unjustified in light of that. I felt like I had whiplash going from a well-observed, highly detailed and realistic meditation on grief and confusion and blame and how we deal with that, into something else entirely. I could be more forgiving, but it turns out I am not.</li>\n<li>Frankenstein (Metacritic: 78, Zvi: 2.5). I hated the message this version is trying to send, this is techno pessimistic and against knowledge and striving on a deep level, and frankly it was overly long and boring. Less about AI than you think.</li>\n<li>Jane Austen Wrecked My Life (Metacritic: 73, Zvi: 2.5). The critics are wrong. This is just bad. I went in expecting lousy, I was mildly disappointed by the level of lousy, and then I saw 73 and was confused. You Had One Job. You were supposed to Do The Thing. Then you didn’t do the thing, either in terms of justifying the romantic connection or actually engaging properly with Jane Austen. ‘Cmon now.</li>\n<li>Superman (Metacritic: 68, Zvi: 2.5): <a href=\"https://letterboxd.com/thezvi/film/superman-2025/\">I had a lot of thoughts on this one</a>. I found it both full of plot holes, and I hated that they back away from asking any of the movie’s potentially interesting questions. But I can see finding this cool if you care about very different things than this, and the new DC universe could ultimately be a huge upgrade.</li>\n<li>F1 (Metacritic: 68, Zvi: 2): I’d say the critics are wrong but the people had a good time. Then again, the people don’t know racing. I used to be an actual F1 fan, so let me say both that this is not how any of this works, this has nothing to do with Formula 1, and otherwise this was completely paint by numbers.</li>\n<li>Mission Impossible: Final Reckoning (Metacritic: 67, Zvi: 2.5): This was my biggest disappointment of the year. I was in! Dead Reckoning was historic due to its influence on Joe Biden and also a rip roaring good time that was remarkably smart about AI. Then this was none of those things. It squandered all the interesting setup, was far dumber about AI to the point of idiot plot and frankly the action scenes were not cool. What a disaster.</li>\n<li>Wicked: For Good (Metacritic: 67, Zvi: 1.5): My review was ‘Hard write, harder watch.’ Seriously, everyone involved tried so damn hard, yet there’s so little joy to be found here as they try to dutifully line things up. Everything feels forced. There’s barely any cool dancing and the songs are bad. Okay, yes, fine, the Costume Design is Oscar-level, but that does not a movie make.</li>\n<li>The Smashing Machine (Metacritic: 65, Zvi: 2.5): Emily Blunt deserves better, in all senses. Ultimately the movie is boring.</li>\n<li>Fantastic Four: First Steps (Metacritic: 65, Zvi: 2): All the fun happens off screen. Michael Flores defended this as a great ‘Fantastic Four movie’ on the theory that it captured their world and the Fantastic Four are boring. Weird flex.</li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Strong Opinions, Strongly Held: I Did Like It</h4>\n\n\n<p>There are four movies requiring explanation on the upside, where they were below 60 on Metacritic yet I actively liked them.</p>\n<p>All four seem like clear cases of ‘yes I know that technically this is lacking in some important way but the movie is fun, damn it, how can you not see this?’</p>\n<ol>\n<li>A Big Bold Beautiful Journey (Metacritic: 41, Zvi: 4.5): I understand the complaint that the movie has ‘unearned emotion’ and the script doesn’t lay the proper foundations for what it is doing. I don’t care. This otherwise has Quality behind only One Battle After Another and Bogunia. All you have to do is say ‘I’m in!’ and decide not to be the ‘stop having fun guys’ person who points out that technically all this emotion you could be feeling hasn’t been earned. Accept that some of the ‘work’ isn’t being fully done and do it your damn self. Why not do that?</li>\n<li>Novocaine (Metacritic: 58, Zvi: 4): A borderline case where again I think people need to remember how to have fun. This was a joy throughout, you can enjoy a good popcorn movie with a great premise and just go with it.</li>\n<li>The Running Man (Metacritic: 55, Zvi: 3.5): I thought this actually executed on its premise really well, and did a bunch of smart things both on the surface level and also under the hood. It won’t change your life but it gets it, you know?</li>\n<li>Honey, Don’t! (Metacritic: 45, Zvi: 3.5): Yeah, okay, it’s deeply silly and in some important senses there’s nothing there, but it’s sexy and fun, why not live a little.</li>\n</ol>\n<p>You can say the same thing about The Naked Gun. It has a 75, perfectly respectable, but its joke hit rate per minute is absurd, it is worth so much more than that.</p>\n\n\n<h4 class=\"wp-block-heading\">Award Show Dreams</h4>\n\n\n<p>I once again used consideration for awards as one selection criteria for picking movies. This helped me ‘stay in the conversation’ with others at various points, and understand the state of the game. But once again it doesn’t seem to have provided more value than relying on Metacritic and Letterboxd ratings, especially if you also used IMDB and Rotten Tomatoes.</p>\n<p>Last year I was very happy with Anora ending up on top. This year I’m not going to be happy unless something very surprising happens. But I do understand. In my word, given the rules of the game, I’d have Bogunia sweep the major awards.</p>\n\n\n<h4 class=\"wp-block-heading\">On To 2026</h4>\n\n\n<p>I’m very happy with this side hobby, and I expect to see over one new movie a week again in 2026. It was a disappointing year in some ways, but looking back I still got a ton of value, and my marginal theater experience was still strongly positive. I think it’s also excellent training data, and a great way to enforce a break from everything.</p>\n<p>It would be cool to find more good people to follow on Letterboxd, so if you think we’d mesh there, tag yourself for that in the comments.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2025/12/24/zvis-2025-in-movies/",
            "publishedAt": "2025-12-24",
            "source": "TheZvi",
            "summary": "Now that I am tracking all the movies I watch via Letterboxd, it seems worthwhile to go over the results at the end of the year, and look for lessons, patterns and highlights. Last year: Zvi’s 2024 In Movies. The &#8230; <a href=\"https://thezvi.wordpress.com/2025/12/24/zvis-2025-in-movies/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Zvi’s 2025 In Movies"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3185/",
            "publishedAt": "2025-12-24",
            "source": "XKCD",
            "summary": "<img alt=\"Vertebrae Georg\" src=\"https://imgs.xkcd.com/comics/sauropods.png\" title=\"Vertebrae Georg\" />",
            "title": "Sauropods"
        },
        {
            "content": [
                "<div class=\"not-prose mx-auto my-6 flex gap-4 rounded-lg border p-4 max-w-lg bg-red-50 dark:bg-red-900/20 border-red-200 dark:border-red-500/30\"><div class=\"mt-1 flex-shrink-0 text-red-500\"><svg class=\"w-6 h-6\" fill=\"none\" height=\"24\" stroke=\"currentColor\" viewBox=\"0 0 24 24\" width=\"24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m21.73 18-8-14a2 2 0 0 0-3.46 0l-8 14A2 2 0 0 0 4 21h16a2 2 0 0 0 1.73-3Z\"></path><line x1=\"12\" x2=\"12\" y1=\"9\" y2=\"13\"></line><line x1=\"12\" x2=\"12.01\" y1=\"17\" y2=\"17\"></line></svg></div><div class=\"flex-grow\"><h3 class=\"text-lg font-semibold text-red-800 dark:text-red-300\">Spoiler Warning</h3><div class=\"prose prose-sm dark:prose-invert max-w-none text-gray-700 dark:text-gray-300 mt-2\"><p>If you want to go through the Final Fantasy 14 duty Hell on Rails (Extreme)\n        blind, don't read this guide as it spoils how to easily solve one of the\n        mechanics in it.</p> <p>If you don't play Final Fantasy 14, most of the words in this article are going to\n        make no sense to you and I will make no attempt to explain them. Just know that most\n        of the words I am saying do have meaning even though they aren't in The Bible.</p></div></div></div>\n        <p>In phase 4 of Hell on Rails (Extreme), the boss will cast Arcane Revelation, which makes the arena look something like this:</p>\n        <figure class=\"max-w-3xl mx-auto not-prose w-full undefined\"><a href=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-rev-setup.jpg\"><source type=\"image/avif\" /><source type=\"image/webp\" /><img src=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-rev-setup.jpg\" /></a></figure>\n        <p>There will be a very large circle of bad moving around the arena. One tank and one healer will be marked with an untelegraphed AoE attack that MUST be soaked by at least one other player (or two for healers). Doomtrain will move the circle of bad anywhere from 1-3 times and leave only a small area of the arena safe. Normally you're supposed to solve it something like this:</p>\n        <figure class=\"max-w-3xl mx-auto not-prose w-full undefined\"><a href=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-revelation-normal.jpg\"><source type=\"image/avif\" /><source type=\"image/webp\" /><img src=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-revelation-normal.jpg\" /></a></figure>\n        <p>Instead of normal light party groups, break up into two groups: melee and casters. This will allow the melees to keep as much uptime as the mechanics allow, but also let the casters get uptime at a distance. Solving this is pretty easy with practice.</p>\n        <p>However as a caster this is kinda annoying because when the North side is safe, you have to fall down off the ledge and the only way to get back is by going around the long way with the janky teleporters that are annoying to hit on purpose but very easy to hit on accident. There is an easier way: you just stand in the upper corners so your melees can greed uptime and just soak all of the bad:</p>\n        <figure class=\"max-w-3xl mx-auto not-prose w-full undefined\"><a href=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-cheese.jpg\"><source type=\"image/avif\" /><source type=\"image/webp\" /><img src=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-cheese.jpg\" /></a></figure>\n        <p>This looks a lot easier but is actually very technically complicated for nearly every class. My example solve for this includes the following party members:</p>\n        <ul>\n        <li>Tank 1: <a href=\"https://ffxiv.consolegameswiki.com/wiki/Warrior\">Warrior</a> (WAR)</li>\n        <li>Tank 2: <a href=\"https://ffxiv.consolegameswiki.com/wiki/Gunbreaker\">Gunbreaker</a> (GNB)</li>\n        <li>Healer 1: <a href=\"https://ffxiv.consolegameswiki.com/wiki/White_Mage\">White Mage</a> (WHM)</li>\n        <li>Healer 2: <a href=\"https://ffxiv.consolegameswiki.com/wiki/Sage\">Sage</a> (SGE)</li>\n        <li>Melee 1: <a href=\"https://ffxiv.consolegameswiki.com/wiki/Samurai\">Samurai</a> (SAM)</li>\n        <li>Melee 2: <a href=\"https://ffxiv.consolegameswiki.com/wiki/Reaper\">Reaper</a> (RPR)</li>\n        <li>Ranged 1: <a href=\"https://ffxiv.consolegameswiki.com/wiki/Dancer\">Dancer</a> (DNC)</li>\n        <li>Ranger 2: <a href=\"https://ffxiv.consolegameswiki.com/wiki/Pictomancer\">Pictomancer</a> (PCT)</li>\n        </ul>\n        <p>The light party assignment is as follows:</p>\n        <ol>\n        <li>WAR, WHM, SAM, DNC</li>\n        <li>GNB, SGE, RPR, PCT</li>\n        </ol>\n        <p>Arcane Revelation can perform up to three hits. In each of the hits you need to mitigate the damage heavily or you will wipe. I've found the most consistent results doing this:</p>\n        <p>First hit: WAR casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Shake_It_Off\">Shake it Off</a>, <a href=\"https://ffxiv.consolegameswiki.com/wiki/Reprisal\">Reprisal</a>, and <a href=\"https://ffxiv.consolegameswiki.com/wiki/Rampart\">Rampart</a>; WHM casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Plenary_Indulgence\">Plenary Indulgence</a> and <a href=\"https://ffxiv.consolegameswiki.com/wiki/Medica_III\">Medica III</a>; SGE casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Kerachole\">Kerachole</a> and <a href=\"https://ffxiv.consolegameswiki.com/wiki/Eukrasian_Prognosis_II\">Eukrasian Prognosis II</a>; SAM (and RPR) casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Bloodbath\">Bloodbath</a> and mostly focuses on DPSing as much as possible to heal from the massive damage you will be taking throughout this mechanic; DNC casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Shield_Samba\">Shield Samba</a>.</p>\n        <p>After the hit: heal as much as you can to offset the hit you took. If you're lucky you didn't take much. If you're not: you took a lot. Dancer's <a href=\"https://ffxiv.consolegameswiki.com/wiki/Curing_Waltz\">Curing Waltz</a> can help here.</p>\n        <p>Second hit: GNB casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Heart_of_Light\">Heart of Light</a>, <a href=\"https://ffxiv.consolegameswiki.com/wiki/Reprisal\">Reprisal</a>, and <a href=\"https://ffxiv.consolegameswiki.com/wiki/Rampart\">Rampart</a>; SGE casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Holos\">Holos</a> and <a href=\"https://ffxiv.consolegameswiki.com/wiki/Eukrasian_Prognosis_II\">Eukrasian Prognosis II</a>; PCT casts <a href=\"https://ffxiv.consolegameswiki.com/wiki/Addle\">Addle</a>.</p>\n        <p>After the hit: SGE casts a <a href=\"https://ffxiv.consolegameswiki.com/wiki/Zoe\">Zoe</a>-boosted <a href=\"https://ffxiv.consolegameswiki.com/wiki/Pneuma\">Pneuma</a>. Generally you do what you can to heal and maintain DPS uptime. Hopefully you don't have to take another heavy hit.</p>\n        <p>Third hit: One of the tanks uses a <a href=\"https://ffxiv.consolegameswiki.com/wiki/Limit_Break#Level_2\">Tank Limit Break 2</a>, Healers dump as many mits as they have left, hopefully you won't die but getting to this point means you got very very unlucky.</p>\n        <p>Between each of these hits you need to heal everyone up to 100% <strong>as soon as possible</strong> otherwise you WILL wipe. Most of the damage assumptions in this guide assume that everyone is at 100% health. The melee classes can mostly be left to their own devices to greed as much uptime as possible, but they may need Aquaveil, Taurochole, or other single target damage mitigations as appropriate. By the end of this you will have used up all of your mitigations save tank invulns.</p>\n        <p>Here's a video of the first time I did this as Sage:</p>\n        <video class=\"not-prose sm:max-h-[50vh] mx-auto\" controls=\"controls\" id=\"636a97d1062df978a8f6fe1830b15beac9843382a008122ff9456e3b54d0d207\"><source src=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/sge-vid/index.m3u8\" type=\"application/vnd.apple.mpegurl\" /><source src=\"https://files.xeiaso.net/blog/HLSBROKE.mp4\" type=\"video/mp4\" /></video><div class=\"text-center\">Want to watch this in your video player of choice? Take this:<br /><a href=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/sge-vid/index.m3u8\" rel=\"noreferrer\">https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/sge-vid/index.m3u8</a></div>\n        <div class=\"flex space-x-2 bg-bg-soft dark:bg-bgDark-soft mx-auto min-h-fit\n        lg:w-[80ch] sm:w-[65ch] w-full\n        lg:p-4 p-2\n        // Base styles for all messages\n        mt-0 mb-0 rounded-none\n        // First message styles\n        first:mt-4 first:rounded-t-lg first:pb-2\n        // Last message styles\n        last:mb-4 last:rounded-b-lg last:pt-1\n        // Middle message top/bottom adjustment\n        [&amp;:not(:first-child)]:-mt-[1px] [&amp;:not(:first-child)]:py-1\"><div class=\"h-16 not-prose\"><img alt=\"Cadey is coffee\" class=\"h-16 w-16 rounded-xs\" src=\"https://stickers.xeiaso.net/sticker/cadey/coffee\" /></div><div class=\"flex-1 min-w-0\"><span class=\"font-semibold text-sm block mb-1\"><a href=\"https://xeiaso.net/characters#cadey\">Cadey</a></span><span class=\"mx-auto\"></span><div class=\"text-fg-1 dark:text-fgDark-1 text-sm prose-p:my-2\"><p>That exasperated laugh is because previously Arcane Revelation was my hard\n        prog point as even though I was able to do it consistently, others were not.\n        This caused many wipes 7 minutes into a 10 minute fight. This cheese makes it\n        consistent with random people on Party Finder.</p></div></div></div>\n        <p>One of the tanks will need to soak a stack tower with an invuln. Everyone else runs to the back of the car to enter the next phase and then you continue the fight as normal.</p>"
            ],
            "link": "https://xeiaso.net/notes/2025/doomtrain-ex-cheese/",
            "publishedAt": "2025-12-24",
            "source": "Xe Iaso",
            "summary": "<div class=\"not-prose mx-auto my-6 flex gap-4 rounded-lg border p-4 max-w-lg bg-red-50 dark:bg-red-900/20 border-red-200 dark:border-red-500/30\"><div class=\"mt-1 flex-shrink-0 text-red-500\"><svg class=\"w-6 h-6\" fill=\"none\" height=\"24\" stroke=\"currentColor\" viewBox=\"0 0 24 24\" width=\"24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m21.73 18-8-14a2 2 0 0 0-3.46 0l-8 14A2 2 0 0 0 4 21h16a2 2 0 0 0 1.73-3Z\"></path><line x1=\"12\" x2=\"12\" y1=\"9\" y2=\"13\"></line><line x1=\"12\" x2=\"12.01\" y1=\"17\" y2=\"17\"></line></svg></div><div class=\"flex-grow\"><h3 class=\"text-lg font-semibold text-red-800 dark:text-red-300\">Spoiler Warning</h3><div class=\"prose prose-sm dark:prose-invert max-w-none text-gray-700 dark:text-gray-300 mt-2\"><p>If you want to go through the Final Fantasy 14 duty Hell on Rails (Extreme) blind, don't read this guide as it spoils how to easily solve one of the mechanics in it.</p> <p>If you don't play Final Fantasy 14, most of the words in this article are going to make no sense to you and I will make no attempt to explain them. Just know that most of the words I am saying do have meaning even though they aren't in The Bible.</p></div></div></div> <p>In phase 4 of Hell on Rails (Extreme), the boss will cast Arcane Revelation, which makes the arena look something like this:</p> <figure class=\"max-w-3xl mx-auto not-prose w-full undefined\"><a href=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-rev-setup.jpg\"><source type=\"image/avif\" /><source type=\"image/webp\" /><img src=\"https://files.xeiaso.net/blog/2025/doomtrain-ex-cheese/arcane-rev-setup.jpg\" /></a></figure> <p>There will be a very large circle of bad moving around the arena. One",
            "title": "Arcane Cheese with Doomtrain Extreme"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-12-24"
}