{
    "articles": [
        {
            "content": [
                "<p>Calendar apps and physical notebooks have very different vibes. Calendar apps are formal and visually uniform — just colored rectangles with titles that snap to a fixed grid. Notebooks have texture — you can use different pens and highlighters to mark and annotate however you want.</p>\n<p>In our first prototype, we tried bringing both worlds together by starting with a digital notebook. We wanted to test whether the expressive freedom of pen and paper could coexist with synced digital events. The approach was to pull in your Google Calendar events as a static background layer, so you could sketch directly on top of them—circling important meetings, drawing arrows between tasks, or blocking out rough time estimates. Our goal was to preserve the iterative, flexible nature of notebook planning while still being able to see your scheduled events.</p>\n<p><img alt=\"A digitial notebook that allows you to scribble on top of your Google Calendar events\" src=\"https://www.inkandswitch.com/sketchy-calendar.png\" /></p>\n<h1>What we learned</h1>\n<p><strong>Sketching on your calendar feels liberating</strong>\nCalendar apps force everything into uniform colored blocks, making it hard to distinguish critical meetings from your partner’s events that you just need to avoid scheduling over. Pen and highlighter are far more expressive - sketch tentative plans in gray, highlight time blocks, or jot quick notes without popups. When using sketchy calendar we found ourselves adding much more personal detail than in Google Calendar, capturing not just meetings but what we actually spent our time on.</p>\n<p><img alt=\"Pens and markers are very expressive: you can block out time, sketch tenative events or annotate meetings\" src=\"https://www.inkandswitch.com/marks-on-calendar.webp\" /></p>\n<p><strong>It’s difficult to translate between the two worlds</strong>\nWhen building this prototype we struggled with how formal events and scribbles should interact. Should sketched events sync back to Google Calendar? Sure, we can use text recognition on handwriting, but you’d lose the implicit meaning of color and style. And how do you translate a roughly sketched time range into a fixed start and end?</p>\n<p>The reverse problem is equally tricky — if you draw an arrow pointing to an imported event that gets rescheduled, should the arrow automatically move? A simpler solution might be stopping auto-updates once you’ve drawn on the paper, and just indicating when underlying events have changed so users can update manually.</p>\n<p><strong>It’s useful to have a distinction between formal events and rough scribbles</strong> In our prototype, Google Calendar events and hand-drawn scribbles remain quite separate. Initially we thought this was a problem, but there’s actually value in distinguishing between formal events with fixed times and loose sketchy plans. When meeting others, everyone needs to show up on time. But when planning for yourself, it doesn’t matter if you use personal shorthand that only makes sense to you in the moment. Our current prototype solves this by keeping scheduled events in Google Calendar and personal plans as scribbles. Even in a world everyone had automatically syncrhonized sketchy calendars, it’d still be useful to have distinction between formal and informal events.</p>\n<p><strong>It’s nice to have a dedicated device for daily planning</strong>\nSketchy calendar feels like a notebook open next to your computer — you can see upcoming events alongside daily todos at a single glance. Having that context in your physical space keeps you aware of your priorities without switching away from your work. Unlike a physical notebook, the events stay synced, so when someone reschedules a meeting in Google Calendar, it automatically appears in your sketchy calendar.</p>\n<p><img alt=\"Sketchy calendar allows you to keep track of your current task and upcoming events\" src=\"https://www.inkandswitch.com/tablet-next-to-laptop.webp\" /></p>\n<p>Even without solving all the complex interactions between sketches and formal events, keeping them clearly separate proved surprisingly effective. The simple model of importing calendar events as a background layer while keeping all annotations as personal scribbles felt natural and useful. Next, we want to explore how this approach scales—what happens when you need to flip between days, weeks, or plan across an entire year?</p>"
            ],
            "link": "https://www.inkandswitch.com/ink/notes/scribble-on-google-calendar/",
            "publishedAt": "2025-07-15",
            "source": "Ink & Switch",
            "summary": "<p>Calendar apps and physical notebooks have very different vibes. Calendar apps are formal and visually uniform — just colored rectangles with titles that snap to a fixed grid. Notebooks have texture — you can use different pens and highlighters to mark and annotate however you want.</p> <p>In our first prototype, we tried bringing both worlds together by starting with a digital notebook. We wanted to test whether the expressive freedom of pen and paper could coexist with synced digital events. The approach was to pull in your Google Calendar events as a static background layer, so you could sketch directly on top of them—circling important meetings, drawing arrows between tasks, or blocking out rough time estimates. Our goal was to preserve the iterative, flexible nature of notebook planning while still being able to see your scheduled events.</p> <p><img alt=\"A digitial notebook that allows you to scribble on top of your Google Calendar events\" src=\"https://www.inkandswitch.com/sketchy-calendar.png\" /></p> <h1>What we learned</h1> <p><strong>Sketching on your calendar feels liberating</strong> Calendar apps force everything into uniform colored blocks, making it hard to distinguish critical meetings from your partner’s events that you just need to avoid scheduling over. Pen and highlighter are far more expressive - sketch",
            "title": "Ink Note Q2 2025: Scribble on your Google Calendar"
        },
        {
            "content": [
                "<p><strong>I.</strong></p><p>A thought I had throughout reading L.R. Hiatt&#8217;s <a href=\"https://www.amazon.com/Arguments-about-Aborigines-Australia-Anthropology/dp/0521566193?crid=38VBHTOAYO3ZG&amp;dib=eyJ2IjoiMSJ9.vNdlUDF2-B6ilJVMGN_iRVxmHkaaVQXYrHGhZcgb-rsuEEPasHda6m78Zgxqjb8qroU3IeMn-_pm04j7OT7C5pIzFJTOd5Qy8loO7IkcP4I.XwLdEkJCK8lfy41IOoxMakqknMAvuSvUVagC0UlW_cY&amp;dib_tag=se&amp;keywords=arguments+about+aborigines&amp;qid=1752403951&amp;sprefix=arguments+about+ab%2Caps%2C217&amp;sr=8-1\">Arguments About Aborigines</a> was: <em>What are anthropologists even doing?</em></p><p>The book recounts two centuries&#8217; worth of scholarly disputes over questions like whether aboriginal tribes had chiefs. But during those centuries, many Aborigines learned English, many Westerners learned Aboriginal languages, and representatives of each side often spent years embedded in one another&#8217;s culture. What stopped some Westerner from approaching an Aborigine, asking &#8220;So, do you have chiefs?&#8221; and resolving a hundred years of bitter academic debate?</p><p>Of course the answer must be something like &#8220;categories from different cultures don&#8217;t map neatly into another, and Aboriginal hierarchies have something that matches the Western idea of &#8216;chief&#8217; in some sense but not in others&#8221;. And there are other complicating factors - maybe some Aboriginal tribes have chiefs and others don&#8217;t. Or maybe Aboriginal social organization changed after Western contact, and whatever chiefs they do or don&#8217;t have are a foreign imposition. Or maybe something about chiefs is taboo, and if you ask an Aborigine directly they&#8217;ll lie or dissemble or say something that&#8217;s obviously a euphemism to them but totally meaningless to you. All of these points are well taken. It still seems weird that the West could interact with an entire continent full of Aborigines for two hundred years and remain confused about basic facts of their social lives. You can repeat the usual platitudes about why anthropology is hard as many times as you want; it still doesn&#8217;t quite seem to sink in.</p><p>If you want to know the exact contours of two hundred years of scholarly debates around Aborigines, <em>Arguments About Aborigines</em> - which is shockingly well-written for an academic book - is the text for you. It also had some unexpected answers to the original question: <em>what are anthropologists even doing</em>.</p><p>In the nineteenth century, anthropologists - buoyed by the success of Darwin&#8217;s theory of evolution - tried to invent grand Theories of Everything about the rise of humankind. These usually looked like &#8220;All savages originally did P, then passed through intermediate stages where they did Q, R, and S sequentially, and finally reached the light of civilization where they did T&#8221;. We still remember some of these fondly: the classic motif of a caveman clubbing a random woman and dragging her off to be his wife comes from a real theory by anthropologist John McLennan that this was the original marriage ritual of humankind, with advanced cultures eventually adding epicycles like &#8220;consent&#8221; and &#8220;courtship&#8221;. There is still dim cultural awareness of James Frazier&#8217;s <em>The Golden Bough</em>, which purports to prove that all religion came from an ur-ritual of killing the king to ensure the fertility of the land. Still, observers eventually noticed that &#8220;all savages do P&#8221; isn&#8217;t true for basically any P, and after some delay anthropologists stopped trying to argue that surely some X was actually a distant distorted cultural memory of P which all savages must have done in an even-more-savage past.</p><p>In the early twentieth century, anthropologists embarked on a more ambitious project - demonstrating that something about primitive culture proved that their own political faction was right about everything. Marxists discovered idyllic tribes untouched by capitalism, peacefully sharing their communal resources. Missionaries discovered that every primitive religion was merely a distorted form of Christianity, with a few extra gods and rituals added in to serve local appetites. Feminists discovered that women everywhere developed unique indigenous forms of resistance to patriarchal domination. Postcolonialists discovered that all the other anthropologists were racist. Freudians discovered so many things that it would take ten books of this length to even begin to talk about them. </p><p>The mid-to-late twentieth century is Hiatt&#8217;s own era; given his lack of distance, he holds off on making too many generalizations. There is widespread discontent at the excesses of previous eras, and ideologically-driven practice has fragmented into a grab-bag of more careful but less unified techniques. The responsible experts would never dream of something so declasse as having a paradigm.</p><p>But my own thoughts on anthropology have been shaped by two letter-S-intensive books. First, <em>The Secret Of Our Success</em> by Joseph Henrich (<a href=\"https://slatestarcodex.com/2019/06/04/book-review-the-secret-of-our-success/\">reviewed by me here</a>). Second,  <em>Sick Societies</em> by Robert Edgerton (<a href=\"https://www.thepsmiths.com/p/review-sick-societies-by-robert-b\">reviewed by Jane Psmith here</a>).</p><p>The former chronicles the wonders of cultural evolution. Seemingly &#8220;primitive&#8221; societies&#8217; seemingly &#8220;barbaric&#8221; practices turn out to be brilliant beyond &#8220;civilized&#8221; man&#8217;s ability to comprehend. For example, the Montagnais-Naskapi tribe performs a divination ritual using an animal&#8217;s shoulder bones to decide where to hunt. This sounds stupid, but Henrich chronicles how the divination ritual actually has useful mathematics-of-randomness properties that makes it more likely to generate efficient hunting patterns than the tribesmen would get through normal decision procedures. The Aztecs performed a complicated series of rituals to corn before they ate it, mixing it with powdered shells; only in the 1900s did Westerners realize that this process activates vitamins; without it, anyone who eats too much corn risks dying of niacin deficiency. Henrich&#8217;s conclusion is that primitive tradition is a repository of wondrous practices selected by millennia of trial-and-error, and we pooh-pooh it at our peril.</p><p>The latter says: nah, actually primitive tradition is often just dumb. Edgerton goes through just as many examples as Henrich, but with the opposite moral: some primitive tribe had done something since time immemorial, but it was stupid and cruel and made their lives worse or, in some cases, pushed them into extinction. So for example (both quotes from the Psmith review, content warning for graphic violence applies to everything between here and section II):</p><blockquote><p>Among the Pokot of Kenya, where brutal wifebeating was the norm, men often reported they only trusted food prepared by their mothers or sisters; their wives might poison them. Others said their wives were trying to kill them by witchcraft. Several women agreed that yes, they certainly were, and one woman told the ethnographers she had succeeded.</p></blockquote><p>And:</p><blockquote><p>The Dugum Dani of western Papua New Guinea were so notoriously warlike that when an Australian police post was introduced to the area, anthropologist Karl Heider predicted that it would do little to stem the Dani&#8217;s endemic violence. In fact, though, they quickly abandoned their warfare as soon as the presence of the colonial authorities gave them a plausible coordinating mechanism, and many later expressed relief that they were free of the cycle of violence and retribution. Similarly, highlanders who had practiced brutal initiation ceremonies &#8220;in which they were forced to drink only partly slaked lime that blistered their mouths and throats, were beaten with stinging nettles, were denied water, had barbed grass pushed up their urethras to cause bleeding, were compelled to swallow bent lengths of cane until vomiting was induced, and were required to fellate older men, who also had anal intercourse with them&#8221; gave them up after only minimal contact with outside disapproval. Some later told anthropologists they felt &#8220;deeply shamed&#8221; by their treatment of their own sons and were relieved to stop.</p></blockquote><p>Many of these seem like <a href=\"https://slatestarcodex.com/2017/11/30/book-review-inadequate-equilibria/\">inadequate equilibria</a>, or <a href=\"https://slatestarcodex.com/2014/07/30/meditations-on-moloch/\">multipolar traps</a> - nobody wants to be the first person to skip the brutal initiation ceremony and look like a pussy. But other problems are just stupid. The Marind-anim were warlike raiders who stole other tribes&#8217; children because their own women were infertile. Unbeknownst to them, their own women were infertile because of a &#8220;fertility ritual&#8221; where multiple men would rape each woman on her wedding night so violently that it destroyed her reproductive system. Eventually European colonizers made them stop, and their fertility miraculously rebounded.</p><p>(also, the story about the oracle bone divination hunting <a href=\"https://x.com/C_Harwick/status/1548678967812579330\">appears to be fake</a>)</p><p>Edgerton and Henrich don&#8217;t come out of nowhere. They&#8217;re the modern reincarnations of Hobbes and Rousseau - with the former calling primitive life &#8220;nasty, brutish, and short&#8221;, and the latter idealizing it as an Edenic paradise to which we could only dream of returning. Nowadays both sides are in disrepute - young anthropology students are taught to abjure Hobbesians with the scornful incantation &#8220;White Man&#8217;s Burden&#8221;, and Rousseauians by uttering &#8220;Noble Savage&#8221;. Still, Edgerton and Henrich are proofs that ideas can never be fully banished, and under the surface the debate continues.</p><p>The Australian Aborigines are a tempting battleground for this conflict. Even as we&#8217;re not supposed to dub them noble savages, so we <em>definitely</em> aren&#8217;t supposed to call them &#8220;the oldest society in the world&#8221; with a &#8220;fifty thousand year history&#8221; - just because they <em>arrived</em> fifty thousand years ago doesn&#8217;t mean their culture has been <em>stagnant</em> during that time. Still, certain decamillennia-old rock art appears to depict some of the same beings mentioned in Aboriginal mythology during colonial times and into the present. And on a very literal interpretation of cultural evolution, the longer you&#8217;ve been in a specific niche, the more adapted to it you get. We are citizens of an industrial society that gets five or ten years to adopt to each new paradigm before the technologists throw out something new to knock us off balance again, heirs to a Judeo-Christian tradition barely three thousand years old and a Greco-Roman-Indo-European tradition hardly any older. What does something <em>really</em> ancient look like? The Aborigines, whose culture can seem impossibly complex at times (is this an illusion? we&#8217;ll discuss that later!) give a feeling of something over-optimized, a genetic algorithm run for 999,999,999 epochs until it ends up at weird edge cases that break the reward module and get assigned infinite utility.</p><p>It also seems, in other ways, pointless, cruel, and dysfunctional along axes I didn&#8217;t even realize were possible. So let&#8217;s dig up the corpses of Hobbes and Rousseau and let them duke it out some more.</p><p><strong>II.</strong></p><p>Australian Aborigines are a polygynic gerontocracy with infant betrothal.</p><p>When an Aboriginal man comes of age, he gets mock-abducted from his parents by unrelated elders and forced to spend five to fifteen years going through a series of grueling initiation rituals. During some parts of the rituals, he must spend months isolated from all other humans, living on his own in the wilderness. During others, he endures horrible mutilations, starting with circumcision and only getting more horrifying and creative from there. The more initiations he goes through, and the more secret societies he joins, the cooler and higher-status he becomes.</p><p>Somewhere in this process - before, during, or after, depending on the tribe and situation - he is matched not with a wife, but with a mother-in-law. He promises to serve the mother-in-law and her husband for his remaining adolescence and young adulthood, doing chores for them and bringing them his best food. In exchange, the mother-in-law promises him her (perhaps not yet born!) daughter&#8217;s hand in marriage. If he&#8217;s really cool, she may promise him <em>all</em> her future daughters in marriage.</p><p>The marriage takes place after the daughter reaches puberty. At this point, the man - who was probably fifteen or so at the time of betrothal - is probably in his thirties. So a modal marriage might be between a 30 year old man and a 14 year old woman. And this is the best case scenario: if a future mother-in-law has five sons before her first daughter, maybe the man is 40-something by the time he&#8217;s wed.</p><p>This system is great for old men, who get lots of young wives, plus the devoted service of the tribe&#8217;s adolescent men, plus they get to dress up as cool gods and demons and freak everyone out at initiation ceremonies. It&#8217;s terrible for women, who are married off to men 20 or 30 years their seniors without being asked. And it&#8217;s also terrible for young men, who have to remain celibate into their thirties, get various body parts mutilated in weird rituals, and spend the best years of their lives serving future in-laws. Why and how does this system endure?</p><p>We&#8217;ll return to the why question later. The how question is the subject of most of the individual case studies in the book, starting with:</p><p><strong>III.</strong></p><p>Americans like to trip up their politicians at town halls by daring them to answer how many genders there are. The Aborigines would not be tripped up. They would immediately answer eight.</p><p>&#8220;Gender&#8221; is technically the wrong term. Most anthropologists use words like &#8220;section&#8221;. But there are some notable resemblances. Your &#8220;section&#8221; determines who you are, how people address you, and (especially) who you can marry.</p><p>The details vary from tribe to tribe, but Hiatt describes the section system of the Kamilaroi of New South Wales:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!sktX!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb511d000-4303-4192-b1f1-db106c5f5b97_2874x2055.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1041\" src=\"https://substackcdn.com/image/fetch/$s_!sktX!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb511d000-4303-4192-b1f1-db106c5f5b97_2874x2055.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Ego = self, F = father, M = mother, B = brother, Z = sister, S = son, D = daughter, FZS = father's sister's son, and so on</figcaption></figure></div><p>Suppose I, a man, am <em>Kumbo</em>. Then all of my brothers are also <em>Kumbo,</em> and all of my sisters are <em>Buta</em>, the female counterpart of <em>Kumbo. </em>My father and his brothers are <em>Kubbi</em>, and their sisters are <em>Kapota</em>. I may only marry a <em>Mata</em> woman, and our sons will be <em>Kubbi</em>.</p><p>Further, everyone of the same section is . . . sort of the same person? My father&#8217;s brothers, who are <em>Kubbi</em> like him, are also sort of my fathers. If I visit a far-off tribe, the <em>Kubbis</em> there will behave paternally to me, and I owe them some measure of filial respect. Likewise, I may call all <em>Butas</em> &#8220;sister&#8221;, and all <em>Ippata</em> &#8220;mom&#8221;. I can never have sex with any <em>Buta</em> or <em>Ippata</em> - that would be incest.</p><p>You can take this pretty far! If I tell another <em>Kumbo</em> &#8220;Look, we are in some sense the same person, therefore I should be allowed to sleep with your wife&#8221;, this . . . actually sometimes works? I&#8217;d want to have a very good pre-existing relationship, and I&#8217;d owe him a favor, but it could happen!</p><p>This system might seem pointlessly complex, an exercise in building castles in the air. But in the late 19th century, anthropologists from distant lands compared notes and noticed that the Iroquois of North America do the same thing, as do other scattered groups across several continents. So there must be some underlying logic. What is it?</p><p>Lewis Morgan, the American who first made the discovery, suggested it was a relic of ancient group marriage (cf. grand 19th-century stage-based Theories Of Everything). Suppose that primitive cultures married entire families: a group of brothers from one family marries a group of sisters from another. This might explain the Australian system. If you didn&#8217;t know which sibling of a group was your father, then you might want to use the same word for &#8220;father&#8221; as for &#8220;paternal uncle&#8221;, for &#8220;brother&#8221; as &#8220;male cousin&#8221;, and for &#8220;husband&#8221; as &#8220;husband&#8217;s brother&#8221;, since there was no way of keeping track of which was which. Extend these principles, and you get something like the Australian system.</p><p>This was clever, and there was even some circumstantial evidence: Aboriginal brothers did sometimes lend one another their wives, as mentioned above. It didn&#8217;t take an anthropological genius to guess that this sort of fraternal wife-swapping might be an adaptation to the grueling difficulty that young men had in getting a wife the usual way. And it also had side benefits: Aboriginal men were frequently out on very long hunting trips. They were both concerned for their wives&#8217; welfare (how would they defend themselves without a man around?) and jealous (what if they tried to sleep with someone their own age?) Lending one&#8217;s wife to a brother (who, again, was <em>basically</em> the same person as you) or even a non-relative person of your section (who, again, was <em>technically</em> your brother and therefore <em>basically&#8230;</em>) was a pretty wild way to avoid feeling cuckolded, but apparently seemed to work.</p><p>What if your brother (or other fellow sectioner) had sex with your wife, and you ended up raising a child that wasn&#8217;t yours? Here the Aboriginals again doubled down on their strategy of solving seemingly minor problems with dramatic culture-wide interventions: they simply denied that sex led to conception! (<a href=\"https://gwern.net/doc/sociology/1996-hiatt-argumentsaboutaborigines-ch7-conceptionandmisconception.pdf\">sort of, kind of, read the whole chapter here for more</a>) Conception occurs when a child&#8217;s father ritually summons the spirit of his clan to impregnate the mother. It&#8217;s <em>his</em> child because <em>he</em> was the one who summoned the spirit, plus because he summoned <em>his</em> clan spirit. If the child was conceived when his brother or fellow-sectioner was with his wife - well, sometimes the spirits come at unexpected times.</p><p>But this doesn&#8217;t fit Morgan&#8217;s theory, where nobody knows or cares who the real father is. And wife-swapping between brothers was hardly a default - when it happened at all, there was a formal ceremony, and even afterwards the first brother was still the &#8220;real&#8221; husband and the secondary brother just a substitute. And there were other problems: why does the section system use the same word for &#8220;mother&#8221; and &#8220;mother&#8217;s sister&#8221;? It&#8217;s hardly mysterious who a given child&#8217;s mother is! A new wave of anti-Morgan anthropologists argued that the section system wasn&#8217;t as extreme as it had seemed to their predecessors: is it really any weirder for Aborigines to call all <em>Kubbi</em> men &#8220;father&#8221; than for Southerners to call any young man &#8220;sonny boy&#8221;, or for Western men to call their mothers-in-law &#8220;Mom&#8221;?</p><p>As anthropology advanced, it became less interested in theories about what primitive universals an institution might be a relic of, and more interested in asking what function the institution served. Here the scholars were on somewhat firmer ground. The section system was one way of preventing incest in a world where everyone was traveling and wife-swapping regularly, there were no written records, and nobody was keeping great track of whether someone from another clan was secretly their half-sister or cousin. Assuming everyone followed all the rules, there was no way that a legitimate marital partner could be any closer than a second cousin; most would be much further. </p><p>But also, the system divided people into groups that cut across more obvious groupings like clans and tribes. If I visited another clan, I would have some people there who considered themselves sort-of-in-some-sense my father who might offer me hospitality on that basis; other people who would be sort-of-in-some-sense my brothers who I could hang out with, and a pre-selected set of women who were sort-of-in-some-sense my wives and who I could pursue romantically. </p><p>Just as in the US a Jew who moves from NYC to SF might seek out the local Jewish community and expect a warm welcome from people who were in some sense &#8220;related&#8221; to him even if not quite in a literal familial way, so a <em>Kumbo</em> could go anywhere in Australia and find a place in the social network.</p><p><strong>IV.</strong></p><p>Just when you think you&#8217;re starting to understand this Australian Aborigine stuff: why is there a special language you only speak when you&#8217;re close to your mother-in-law? And how come, when you hear certain obscenities, you have to attack all of your sisters with spears?</p><p>First, the mother-in-law languages. This is another one of those things that sounds like some kind of wild one-off but turns out to recur across cultures all over the world. In Australia, they take the form of &#8220;fifty or so substitutes for the most common words in everyday discourse, although in certain cases they have been elaborated to the point where they function for practical purposes as independent languages&#8221;. They are spoken in cases where your mother-in-law is especially salient, including when talking to your brothers-in-law or when your mother-in-law is within hearing range. They&#8217;re <em>not</em> languages you speak <em>to</em> your mother-in-law, because talking to her directly is taboo and no Aborigine would ever do it.</p><p>Also taboo: looking at your mother-in-law, touching your mother-in-law, and getting too close to the 12.5% of the population who are <em>basically</em> your mother-in-law because they belong to the same section as her. The monstrous mother-in-law recurs again and again as a character in myth and fable, usually as a member in good standing of the <a href=\"https://www.astralcodexten.com/p/book-review-the-geography-of-madness\">penis-stealing witch brigade</a>:</p><blockquote><p>Ancestral women called Ganabuda were travelling across the country in a group. A Lizard Man named Spiky Head seduced a women related to him as a potential mother-in-law [ie someone from the mother-in-law section; for a <em>Kumbo</em>, this would be <em>Kapota</em>]. He had a penis capable of proceeding underground and rising to the surface under the object of his desire. The Ganabdua women attacked his testicles with sharpened digging sticks, cut off his penis, and killed him. </p></blockquote><blockquote><p>The Ganabuda women encountered Crow Man, who proceeded to have sexual intercourse with a young potential mother-in-law, as well as a classificatory mother&#8217;s mother [ie someone from the mother&#8217;s mother&#8217;s section; for a <em>Kumbo</em>, a <em>Buta</em>]. His mega-penis inflicted severe injury upon them, and they died. The Ganabuda women then killed the Crow Man.</p></blockquote><blockquote><p>An ancestral man named Dangidjara had intercourse with a potential mother-in-law. He then went hunting and brought meat back to her. Eventually she gave birth to a son. Dangidjara continued his journey. One day ants bit his genitals, which detached themselves from his body and ran away. He pleaded with them to return, but they refused. Eventually he retrieved them.</p></blockquote><p>According to Hiatt, the Aborigines still haven&#8217;t gotten over this particular <em>leitmotif:</em></p><blockquote><p>Some years ago the wife of the Prime Minister of Australia was presented with an Aboriginal painting depicting an old man who developed &#8216;a grossly enlarged penis as a result of having sex with his mother-in-law&#8217;.</p></blockquote><p>All of this coexists uneasily with the fact that a man must negotiate with the (future) mother-in-law in order to promised a bride in the first place, and that he must spend years serving his future mother-in-law (presumably with the help of intermediaries) in order to &#8220;earn&#8221; the bride when she comes of age.</p><p>What&#8217;s going on?</p><p>Nineteenth-century anthropologists didn&#8217;t bother to invent a grand Theory of Everything about this one. They thought it was obvious: mother-in-laws suck. Hiatt writes that Freud believed that the custom &#8220;had a good deal to commend it&#8221;, and he cites a letter from the great psychologist to his fiancee where he said of his own impending mother-in-law that she was &#8220;alien and will always remain so to me. I seek for similarities with you, but find hardly any &#8230; I can foresee more than one opportunity of making myself disagreeable to her and I don&#8217;t intend to avoid them&#8221;. This is funny, but also raises the question: if so many primitive societies have mother-in-law taboos, and our more &#8220;liberated&#8221; society still has an expectation and archetype that sons will hate their mother-in-laws, are these coming from the same place? And what is that place?</p><p>At least in the Australian case, twentieth-century anthropologists note two relevant facts.</p><p>First, in a culture where old men marry younger women, a man is the same age as his mother-in-law. A man just starting the process of earning a bride might be 18, his mother-in-law might also be 18, and his father-in-law might be 38. The man will then spend the next 15 - 20 years essentially celibate, serving the in-law couple in the hopes of earning a bride when he in his thirties. It must be tempting for the man to just cut out the middleman and have sex with the same-age mother-in-law directly. It must be equally tempting for the mother-in-law, hitched to a man twenty years her senior but now being served by this strapping young lad, to allow and encourage such a relationship. Hiatt collects evidence that none of these temptations escaped the notice of Aboriginal men. What&#8217;s a jealous father-in-law to do? Aboriginal elders took the nuclear option, layering every taboo they could think of over the idea of such relationships.</p><p>Second, remember that the man has been promised the mother-in-law&#8217;s female children (definitely at least the first, sometimes even more) as his bride. He really <em>really</em> does not want to accidentally father her female children! And since the Aborigines deny that sex leads to conception, you can&#8217;t just <em>tell him</em> why it&#8217;s a bad idea for him to have sex with the woman who will birth his future wife. The best you can do is spread rumors that she is definitely a penis-stealing witch, plus make him so creeped out by her that he has to speak an entirely different language when she&#8217;s in the area.</p><p>(the second factor is Australia-specific, but I leave as an exercise to the reader whether the first factor has any relevance to the weaker forms of mother-in-law hatred found in civilized nations)</p><p>But how come, when you hear certain obscenities, you have to attack all of your sisters with spears?</p><p>This custom, called the <em>mirriri </em>in the tribes Hiatt focuses on, is an anthropological favorite. The attacks are somewhere between ritualized and real, and sisters do occasionally get seriously wounded. The most common provocation is when a man hears his sister&#8217;s husband curse her. But the sister he attacks with spears might not necessarily be the same sister who got cursed, and sometimes other quarrels (for example, a sister vs. the sister&#8217;s daughter) could provoke the same response.</p><p>Early theories focused on the brother-in-law relationship. If a husband quarreled with his wife, there might be some lingering fear that the wife&#8217;s brothers would intervene on her side, thus turning a marriage that should have been an inter-clan alliance into an opportunity for inter-clan conflict. Just as men defuse the fear of sex with their mother-in-law by ritually hating and fearing her, so brothers-in-law could defuse the fear that they would take their sister&#8217;s side in a conflict (and so start an inter-clan war) by ritually reviling and attacking her. And maybe this display would work even better if they attacked random other sisters too, just to drive home how little they cared about sororal bonds.</p><p>This theory floundered on the observation that although the most classic cause for <em>mirriri </em>was a sister-vs-brother-in-law conflict, any sister-related conflict had the potential to provoke the response, even when there was no marriage or inter-clan alliance involved. So the next generation of anthropologists concluded that - yeah, it&#8217;s an incest thing again. If you&#8217;re keeping young people in a decades-long state of sexual frustration, maybe their sisters start to look pretty good; certainly the past few years of online pornography have suggested that this option is never far from the sexually-frustrated-young-person mind. Not only would such a relationship have the usual downsides of incest, but it really <em>could</em> blow up alliances and start an inter-clan war. </p><p>Many Aboriginal conflicts involve screaming insults at each other, and many of those insults are sexual. So an Aboriginal man hearing a conflict with his sister probably hears a lot of descriptions of her genitals, sexual proclivities, etc. Maybe this is awkward enough that he feels the need to signal how aroused he isn&#8217;t the most dramatic way he knows how - trying to impale her with a spear (this signal would <em>not</em> have survived Freudian psychology). And maybe, just to hammer in how little he gets aroused by sisters, he has to try to impale <em>all</em> of them with spears. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/$s_!KD6o!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4349b1f7-071d-4074-b80c-dd40b325beb5_527x149.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"149\" src=\"https://substackcdn.com/image/fetch/$s_!KD6o!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4349b1f7-071d-4074-b80c-dd40b325beb5_527x149.png\" width=\"527\" /><div></div></div></a></figure></div><p>Don&#8217;t keep your culture&#8217;s young men in a decades-long state of sexual frustration, that&#8217;s my advice.</p><p><strong>V.</strong></p><p>Whenever race-and-IQ types talk about the intellectual advantages of Western Man, someone shows up to tell them that they wouldn&#8217;t last a day in Aboriginal Australia. I am sure this is true. Plop me down in Arnhem Land, and it would take five minutes before I forgot whether it was <em>Kubbi </em>or <em>Murri</em> that was taboo relative to <em>Kumbo</em>, accidentally had sex with my classificatory sister, and got speared by ten clans simultaneously.</p><p>Reading this book - only a fraction of which I&#8217;ve been able to represent here - it&#8217;s hard not to be awed by the complexity of Aboriginal society. Is cultural evolution showing off what it can given 50,000 years to work with? Or does every society seem this byzantine to foreigners who are 50,000 years removed from the most recent common ancestor?</p><p>If some Aboriginal anthropologist came to America and tried to list our sex taboos, what would they find? No sex between close family members up to second cousin, that&#8217;s obvious. No sex with bosses, subordinates, or clients. A strict taboo on even <em>mentioning</em> sex at work, enforced by a caste of powerful witches called &#8220;HR ladies&#8221;. Acknowledging even the slightest attraction to anyone under 18 makes you a monster, but people who are just slightly older than 18 - even by one day - are called &#8220;barely legal&#8221; and feature especially prominently in sexual imagery. No sex across &#8220;age gaps&#8221;, where some people define &#8220;gap&#8221; as &#8220;half your age plus seven&#8221; and other people refuse to define it but reserve the right to judge transgressors anyway. Men can&#8217;t have sex with other men, unless they&#8217;re part of a special caste called &#8220;gay people&#8221; who must move to New York, speak in a weird voice, and cultivate an interest in musical theater. Married people can&#8217;t have sex with anyone besides their spouse, unless they&#8217;re part of a special caste called &#8220;poly people&#8221; who must move to San Francisco, dye their hair, and get jobs in tech. At some point maybe our hypothetical anthropologist starts longing for the simplicity of someone telling him which 12.5% of the population are his classificatory wives.</p><p>Should we take this seriously? Some Western taboos are just the local versions of cultural universals - no culture is pro-incest, and most place some kind of limits on pedophilia. Do we just have the basics? Does every tribe think their culture is just a variety of &#8220;the basics&#8221;? Do we have anything as weird as mother-in-law languages? </p><p><strong>VI.</strong></p><p>Let&#8217;s return to the question we punted earlier: why?</p><p>Grant that these taboos / rituals / etc make sense as part of the project of stabilizing this polygynic gerontocracy where thirty-something men marry pubertal women. Why would anyone arrange a society this way?</p><p>Hobbes might ask - why worry about the why question? Sometimes old people get the upper hand in a society and successfully implement a gerontocracy that benefits them while screwing over everyone else. There&#8217;s no law of physics saying this can&#8217;t happen, and there are plenty of Substack articles with the word &#8220;Boomer&#8221; in the title asserting that it happens even today. If young men and women can&#8217;t band together and protect their interests, that&#8217;s a skill issue.</p><p>Rousseau might suggest we hold off until we hear the Aboriginal elders&#8217; side of the story. The final chapter of <em>Arguments </em>hints at this perspective. In one of their initiation ceremonies, the elders chop, boil, and otherwise process a species of yam which is poisonous in its raw state but edible with sufficient preparation. Then they symbolically go through the same steps with the young people being initiated into the cult. The lesson seems to be that young people, like yams, start out toxic and inedible in the raw, but can become socially useful after sufficient preparation. Young people are dumb, violent, and horny. As long as they&#8217;re kept subservient to the elders, they can&#8217;t do anything stupid like start a war, or marry for love instead of inter-clan-alliance-formation.</p><p>And (the elders might continue), handing us control of everything has gone pretty well. In one paragraph, which Hiatt places half in his own voice, half in the voice of anarchist-leader-and-amateur-Australian-Aborigine-scholar Peter Kropotkin, he says:</p><blockquote><p>Few peoples can have placed higher value on altruism and mutual aid than the Aborigines of Australia. The genius of the Australian polity lay in its deployment of the goodwill inherent in kinship as a central principle of organization for society as a whole. Government in these circumstances was otiose; its absence, Kropotkin would say, was to be regarded not as a low level of political evolution but as a luminous peak. Natural resources and the land itself were equitably distributed among descent groups; appropriation of clan estates by force was unknown, and theft of private property a rarity. The business of everyday life was conducted informally through unspoken understandings, quiet consensus or noisy agreement. In general the authoritarian mode in public affairs was discountenanced. Vanity and self-importance were mocked. Nearly everywhere men insisted on speaking for themselves and, conversely, evinced a reluctance to speak on behalf of others.</p></blockquote><p>Still not noble enough for you?</p><blockquote><p>[During the early days of the colonization of Australia], fifteen convicts were flogged for allegedly setting out to plunder a native [ie Aboriginal] encampment at Botany Bay. The reason for the punishment was communicated to [local Aboriginal representative] Arabanoo, who was brought along to witness it. He was not impressed; instead of expressing gratitude to the authorities, he evinced only disgust and terror. When a large group of Aborigines was assembled two years later to watch the lashing of a convict caught in the act of stealing fishing tackle [from them], all reacted with abhorrence to the brutishness of the spectacle. One of the women went so far as to snatch a stick and menace the flogger. Tench noted that on a previous occasion when a bundle of stolen spears had been recovered and placed on the beach, an old man came up and singled out his own from the rest: &#8216;and this honesty, within the circle of their society, seemed to characterize them all&#8217;. Sharing, moreover, was commonplace and spontaneous, as evidenced by Arabanoo&#8217;s gifts of food not only to his countrymen but to the colonists&#8217; children who flocked around him.</p></blockquote><p>Aside from the whole gerontocratic-patriarchy-with-decades-of-mutilation-and-sexual-frustration thing, and maybe the decamillennia of technological stagnation, Aboriginal society has much to recommend it. There is broad inter-clan peace, social equality (modulo age and gender), and enough mutual aid that nobody goes hungry unless everyone does. Neighboring tribes get along, there&#8217;s no religious warfare, and you spend large portions of your time dressing up in cool costumes and terrifying people with bull-roarers. Don&#8217;t accuse me of noble-savaging - I&#8217;m just speaking for some combination of a hypothetical Aboriginal elder, L.R. Hiatt, and Kropotkin.</p><p>Okay, says Hobbes, sure, large-scale organized violence was rare. But <a href=\"https://x.com/cremieuxrecueil/status/1944122950195499485\">high-single-to-low-double-digit percents</a> of the population died of small-scale disorganized violence, far higher than the murder rate even in very dangerous countries like America or pre-crackdown El Salvador. And although anthropologists still debate exactly why Aborigines practiced so much infanticide, one pretty popular position is that women were trying to punish their husbands for all the forced marriages and beatings, using the only cudgel that they had. Also, aren&#8217;t we cheating by not talking about those initiation ceremonies in greater depth? It&#8217;s not just the circumcision! Have you ever looked up &#8220;subincision&#8221; on Wikipedia? I don&#8217;t recommend it! </p><p>Sure, says Rousseau, but may I present as Exhibit A pages 181-182, from a chapter focusing on a rare non-horrible initiation ceremony among the Tiwi people of the the Northern Australian islands:</p><blockquote><p>On Bathurst and Melville Islands, as on the Australian mainland, suicide in traditional society seems to have been unusual if not unknown. In recent years, however, there has been an outbreak of self-mutilation among Tiwi young men. According to Gary Robinson, a contributing factor is prolonged psychological dependence on maternal kin, well beyond adolescence, and a conflict-laden enmeshment in the the vicissitudes of the paternal family. Traditionally, as we have seen, this would have been impossible. At puberty, a lad was ritually removed from his family surroundings and placed under the tutelage of outsiders. More importantly, clearly defined status objectives were implanted in his mind, and by the time he had attained them by passing through a series of initiatory grades, he was ready to marry and start his own family. Masculine values were reinforced through regular engagement in male corporate activities, particularly hunting, fighting, and ceremonial; while idealization of the father, who by now was unlikely to be alive, provided an individualized role model for the firm delineation of personal identity.</p><p>The Tiwi say that when a boy&#8217;s public hair begins to grow, dogs bark at him in camp and crocodiles and bulls chase him in the bush. In the old days, the source of provocation was forcibly plucked out [that is, they pulled out all his pubic hairs in an initiation ceremony - &#8220;non-horrible&#8221; is a matter of degree!] As a son&#8217;s burgeoning sexuality was potentially a destabilizing force in his father&#8217;s harem, the preservation of paternal and filial goodwill depended on separation through the institution of initiation, followed by the son&#8217;s growing absorption in the corporate affairs of men (which included the cultivation of patronage necessary for the promise of a wife from outside his own band). All these traditional structures have now collapsed, and nothing viable has been put in their place. The transition from childhood dependence to adult autonomy, once mediated by external authority, is now beset by incoherence and uncertainty of aims. The family itself is the remaining authority, and children often lack the motivation to solve their problems by making a clean break with it. Ambivalence inherent in the father-son relationship remains unresolved and a source of instability, fluctuating between violence and mutual aid. Young men have nightmares about death, and suffer chronically from melancholy, depression, and rage.</p><p>In 1986, three Tiwi brothers travelled to the mainland in order to establish contact with a descendant of one of Joe Cooper&#8217;s buffalo-shooters, related to them as a classificatory father. They had fantasies about being initiated and in the process acquiring power to win fights, get women, and in general overcome their anomy. The pilgrimage proved futile. Within a short period following their return to Melville Island, one brother had narrowly survived a suicide attempt after grasping an electrical power line. Another, just before his thirtieth birthday, broke into a store and hanged himself while awaiting police questioning.</p></blockquote><p>This is an all-too-common pattern when hunter-gatherer societies are forcibly integrated into sedentary nations - see eg my review of <a href=\"https://www.astralcodexten.com/p/book-review-the-arctic-hysterias\">The Arctic Hysterias</a> for more. It&#8217;s so common that we&#8217;re no longer surprised - of course colonialism is bad for these people&#8217;s mental health.</p><p>But maybe it should feel more mysterious. When Third World immigrants move to the US, they&#8217;re usually pretty happy with their decision. They might not assimilate completely, but they&#8217;re often able to hold down jobs or at least avoid spiraling into alcoholism and suicide. But when a people gets colonized - after the bad part with the conquest and land theft and oppression, once they&#8217;re granted citizenship and the settlers feel vaguely apologetic - doesn&#8217;t it end up kind of like being an immigrant into a First World country? In fact, isn&#8217;t it strictly superior? Instead of dodging ICE goons, you get full citizenship, access to the welfare system, maybe some affirmative action. You don&#8217;t even have to abandon your family or leave your ancestral village. </p><p>Is this latter part the problem? The typical immigrant moves to New York and gets a job as an Uber driver for rich people. Maybe it&#8217;s worse if you stay on a reservation where everyone else is as poor as you? Maybe this is the same problem as decaying Rust Belt / Appalachian towns, or the post-industrial British heartland. When everyone else in your area is as poor as you, the poverty feeds on itself?</p><p>But that raises a second question: a modern Aborigine has two options. They can move to Sydney or Melbourne and try to assimilate, in which case they&#8217;re no worse off than any other poor immigrant, and better than most. Or they can stay in an Aboriginal village. If Hiatt is to be believed, Aboriginal villages weren&#8217;t mental health disasters when they were following their traditional ways. But in absolute terms, they&#8217;re much richer now: nobody starves, there&#8217;s decent medical care, people have quality clothes and houses, etc. So what&#8217;s gotten worse?</p><p>The obvious answer is something like pride. Even if the average Aborigine has more stuff now, they get it from something like convenience store work or welfare or something, and this is less pride-inducing than being a traditional hunter (even if traditional hunters had less stuff and often starved). Still, really? Pride? The difference between a flourishing traditional lifestyle and spiraling into alcoholism and suicide is some sort of belief that hunting kangaroos is inherently masculine and cool, but working a minimum wage job is inherently cringe? Something like this has to be true, but I can&#8217;t make myself understand it. Also, even if Aborigines have been forced onto marginal lands, the Inuit mostly stayed in the same spot - those who want to continue hunting can. What equilibrium traps them in between two worlds, either of which seems better than the limbo in between?</p><p>(in the Inuit case, it seems to be that traditional lifestyles are so miserable that nobody would ever do them if they had any other option, even a marginal existence of welfare and alcoholism - but it&#8217;s not <em>exactly</em> the same kind of misery that causes post-colonial alienation, and there&#8217;s some other sense in which the post-colonial alienation is worse. I think there&#8217;s a lot to unpack here.)</p><p>Hiatt seems to think the damage centers around the disappearance of the initiation system. In traditional Aboriginal society, young men would be isolated from their family for a period of many years while they underwent a series of tortures expected to eventually result in a high-status social role within the community. The West has the same system: we call it &#8220;grad school&#8221;. But Aborigines do poorly in Australian education, with below 10% graduating college despite increasingly intense affirmative action (a decade ago, before this push, it was below 1%). It probably sucks to go from an initiation system where you have the same fair chance as everyone else, to a different initiation system, designed by a foreign culture whose own adolescents are much better at it than you are.</p><p>While we&#8217;re swinging from Rousseauian noble savage aficionados to Hobbesian White Man&#8217;s Burden paternalists, what would it look like to design a society that took Hiatt&#8217;s critique seriously? Would it be humane to dole out welfare checks whose size is proportional to how many degrees of Freemasonry the recipient can attain? How many points they can score at in some kind of artificial boomerang-throwing contest? Would young people go off to join the Freemasons and spend years practicing boomerang-throwing, then come back as high-status members of society able to attract a wife and support a family? Would they be happy?</p><p>With the benefit of one (1) anthropology book, the best I can do is say that traditional Aboriginal society seemed remarkably well-adapted to being what it was, but that what it was seems pretty terrible and I&#8217;m glad I never had to participate it. Still, my participation in it was never an option, many Aborigines <em>are</em> being forced to participate in <em>my</em> crazy society, and they don&#8217;t seem to like that either. The greatest anthropological argument of all is as tough as ever.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://www.amazon.com/Arguments-about-Aborigines-Australia-Anthropology/dp/0521566193\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"437\" src=\"https://substackcdn.com/image/fetch/$s_!Z6vU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1fc1cf9a-95b2-4a2e-96fe-9e0790670c1b_272x437.png\" width=\"272\" /><div></div></div></a></figure></div><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/book-review-arguments-about-aborigines",
            "publishedAt": "2025-07-15",
            "source": "SlateStarCodex",
            "summary": "<p><strong>I.</strong></p><p>A thought I had throughout reading L.R. Hiatt&#8217;s <a href=\"https://www.amazon.com/Arguments-about-Aborigines-Australia-Anthropology/dp/0521566193?crid=38VBHTOAYO3ZG&amp;dib=eyJ2IjoiMSJ9.vNdlUDF2-B6ilJVMGN_iRVxmHkaaVQXYrHGhZcgb-rsuEEPasHda6m78Zgxqjb8qroU3IeMn-_pm04j7OT7C5pIzFJTOd5Qy8loO7IkcP4I.XwLdEkJCK8lfy41IOoxMakqknMAvuSvUVagC0UlW_cY&amp;dib_tag=se&amp;keywords=arguments+about+aborigines&amp;qid=1752403951&amp;sprefix=arguments+about+ab%2Caps%2C217&amp;sr=8-1\">Arguments About Aborigines</a> was: <em>What are anthropologists even doing?</em></p><p>The book recounts two centuries&#8217; worth of scholarly disputes over questions like whether aboriginal tribes had chiefs. But during those centuries, many Aborigines learned English, many Westerners learned Aboriginal languages, and representatives of each side often spent years embedded in one another&#8217;s culture. What stopped some Westerner from approaching an Aborigine, asking &#8220;So, do you have chiefs?&#8221; and resolving a hundred years of bitter academic debate?</p><p>Of course the answer must be something like &#8220;categories from different cultures don&#8217;t map neatly into another, and Aboriginal hierarchies have something that matches the Western idea of &#8216;chief&#8217; in some sense but not in others&#8221;. And there are other complicating factors - maybe some Aboriginal tribes have chiefs and others don&#8217;t. Or maybe Aboriginal social organization changed after Western contact, and whatever chiefs they do or don&#8217;t have are a foreign imposition. Or maybe something about chiefs is taboo, and if you ask an Aborigine directly they&#8217;ll lie or dissemble or say something that&#8217;s obviously a euphemism to them but totally meaningless to you. All of these points are well taken. It still seems weird that the",
            "title": "Book Review: Arguments About Aborigines"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-15"
}