{
    "articles": [
        {
            "content": [],
            "link": "https://simonwillison.net/2025/Apr/30/criticism-of-the-chatbot-arena/#atom-entries",
            "publishedAt": "2025-04-30",
            "source": "Simon Willison",
            "summary": "<p>The <a href=\"https://lmarena.ai/\">Chatbot Arena</a> has become the go-to place for <a href=\"https://simonwillison.net/2024/Jun/27/ai-worlds-fair/#slide.013.jpeg\">vibes-based evaluation</a> of LLMs over the past two years. The project, originating at UC Berkeley, is home to a large community of model enthusiasts who submit prompts to two randomly selected anonymous models and pick their favorite response. This produces an <a href=\"https://en.wikipedia.org/wiki/Elo_rating_system\">Elo score</a> leaderboard of the \"best\" models, similar to how chess rankings work.</p> <p>It's become one of the most influential leaderboards in the LLM world, which means that billions of dollars of investment are now being evaluated based on those scores.</p> <h4 id=\"the-leaderboard-illusion\">The Leaderboard Illusion</h4> <p>A new paper, <strong><a href=\"https://arxiv.org/abs/2504.20879\">The Leaderboard Illusion</a></strong>, by authors from Cohere Labs, AI2, and Princeton, Stanford, Waterloo, and Washington universities spends 68 pages dissecting and criticizing how the arena works.</p> <p><img alt=\"Title page of academic paper &quot;The Leaderboard Illusion&quot; with authors Shivalika Singh, Yiyang Nan, Alex Wang, Daniel D'souza, Sayash Kapoor, Ahmet Üstün, Sanmi Koyejo, Yuntian Deng, Shayne Longpre, Noah Smith, Beyza Ermis, Marzieh Fadaee, and Sara Hooker from various institutions including Cohere Labs, Cohere, Princeton University, Stanford University, University of Waterloo, Massachusetts Institute of Technology, Allen Institute for Artificial Intelligence, and University of Washington. Corresponding authors: {shivalikasingh, marzieh, sarahooker}@cohere.com\" src=\"https://static.simonwillison.net/static/2025/leaderboard-illusion.jpg\" /></p>",
            "title": "Understanding the recent criticism of the Chatbot Arena"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3795\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-3795",
            "publishedAt": "2025-04-30",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-3795\"> Read more </a> </p>",
            "title": "Hidden Open Thread 379.5"
        },
        {
            "content": [
                "<p>President Trump&#8217;s approval rating <a href=\"https://www.rollingstone.com/politics/politics-features/trump-polling-plummets-approval-rating-new-low-1235325964/\">has fallen </a>to near-historic lows. With economic disruption from the tariffs likely to hit next month, his numbers will probably get even worse; this administration could reach unprecedented levels of unpopularity. If I were a far-right populist, I would be thinking hard about a strategy to prevent the blowback from crippling the movement.</p><p>Such a strategy is easy to come by. Anger over DOGE and deportations has a natural floor. If Trump&#8217;s base starts abandoning him, it will be because of the tariffs. But tariffs aren&#8217;t a load-bearing part of the MAGA platform. Other right-populist leaders like Orban, Bukele, and Modi show no interest in them. They seem an idiosyncratic obsession of Trump&#8217;s, a cost that the rest of the movement pays to keep him around. </p><p>So, (our hypothetical populist strategist might start thinking after Trump&#8217;s approval hits the ocean trenches and starts drilling) - whatever. MAGA minus Trump&#8217;s personal idiosyncrasies can remain a viable platform. You don&#8217;t even have to exert any effort to make it happen. Trump will retire in 2028 and pass the torch to Vance. And although Vance supports tariffs now, that&#8217;s only because he&#8217;s a spineless toady. After Trump leaves the picture, Vance will gain thirty IQ points, make an eloquent speech about how tariffs were the right tool for the mid-2020s but no longer, and the problem will solve itself. Right?</p><p>Don&#8217;t let them get away with this. Although it&#8217;s true that tariffs owe as much to Trump&#8217;s idiosyncrasies as to the inexorable logic of right-wing populism, the ability of a President to hold the nation hostage to his own idiosyncrasies is itself a consequence of populist ideology.</p><p>If one day Joe Biden had conceived a personal hatred for the nation of Ecuador and tried to sacrifice America&#8217;s interests on the altar of some anti-Ecuador crusade, his handlers would nod, smile, give him a few extra pills, and he would forget about the whole thing. And maybe that particular metaphor owes more to Biden&#8217;s age than the inexorable logic of liberal institutionalism. But to the same would be true (to a lesser degree) of Clinton/Obama/Harris/whoever. Congressional Democrats would push back. State Department bureaucrats and White House staffers would water down the orders.  DNC operatives would say it doesn&#8217;t play well with [list of one million different activist groups who must be kept satisfied at all times]. Democrat-controlled media would attack the policy, and the base would rebel against it. In the end, Clinton/Obama/Harris would relent: partly to preserve political capital, partly because only the sort of person who would relent in these situations would have gotten the job in the first place. I think both liberals and conservatives agree that this story is directionally correct - otherwise you wouldn&#8217;t need the &#8220;unitary executive&#8221; doctrine or 3,000,000 pages of Moldbug prose. But why is it correct? </p><p>Organizations tend to accumulate bureaucracy. For at least the past few decades, the bureaucratic institutional middle layer has been occupied mostly by liberals, adding a liberal spin to whatever policies it executes. Progressive politicians have responded by outsourcing more and more tasks to it, while right-wing politicians have fumed against it.</p><p>Populism, especially far-right Trump-style populism, isn&#8217;t just a grab bag of opinions on immigration, crime, etc. On a deeper level, it&#8217;s a toolbox of strategies, justifications, and beneficial memes for circumventing the institutional middle layer. Some of this is unitary executive doctrine. Some of it is an intense us/them distinction which treats any internal dissent as treason. Some of it is hard-forged antibodies to believing the media or expert class about anything. Some of it is a principled refusal to ever listen to or care about corruption allegations. Liberals treat these as anomalous vices, but they&#8217;re all load-bearing parts of a social technology for letting leaders ignore the institutional middle layer and govern without their consent.</p><p>(the left also needs to cultivate certain vices to sustain its institutionalist strategy; Bentham Bulldog <a href=\"https://benthams.substack.com/p/the-right-demands-loyalty-the-left\">amply describes</a> the subsequent left-wing failure mode as ideological cults, and the right-wing failure mode as cults of personality). </p><p>Which side&#8217;s vices are worse? That&#8217;s an empirical question, and the past ten years of national politics have been one long IRB-less experiment. The Democrats made a compelling case for their own inferiority during Biden-Harris, but the Republicans are lapping them pretty hard right now, and I&#8217;m prepared to declare statistical significance. </p><p>The obvious failure mode of the populist strategy is that they elect a moron or psychopath - or, more politely, a person with idiosyncrasies - and then their side&#8217;s commitments to ignoring experts, punishing disloyalty, circumventing checks and balances, and trusting the plan makes it impossible to push back. To defuse this critique, the populists veer hard into conflict theory - all problems are caused by the elites, and as long as we get someone on the right side, their good intentions (or at least anti-elite intentions) will more than compensate for their lack of restraint and expertise. Any given dictator could always turn out to be a benevolent dictator; you can always glance behind you at the institutions controlled by your enemies and say &#8220;I like my chances&#8221;.</p><p>But all of this depends on empirical parameters. How likely is it that your fellow populists will unite behind a good strongman rather than a bad one? How much damage will his inevitable idiosyncrasies cause, compared to the devil-you-know of the institutions? Once you&#8217;ve undermined the usual checks-and-balances, how much resistance will the vestigial checks-and-balances your side has left in place be able to mount against genuinely bad policies.</p><p>Trump and his tariffs are our first and strongest data point for determining these parameters in the American setting. Again imagining a right-wing populist who is disappointed in the tariffs, this person will have to admit that the first and only time their side got a chance to elect a friendly strongman, they screwed it up and elected a moron who destroyed the economy. The first and only time they got a chance to compare his damage to the damage of the institutions, the institutions came out looking at least more compatible with normal economic activity. And the first and only time they got a chance to see if the vestigial checks-and-balances left in place by his own party could restrain him, his subordinates proved to be spineless toadies who praised his genius and munificence even as he bankrupted the country. </p><p>As I wrote in <a href=\"https://www.astralcodexten.com/p/acx-endorses-harris-oliver-or-stein\">my pre-election post last October</a>:</p><blockquote><p>[Hugo] Chavez provides a useful model [for thinking about Trump]. Chavez fired everyone competent or independent in government, because they sometimes talked back to him or disagreed with him; he replaced them with craven yes-men and toadies. His ideas weren&#8217;t all bad, but when he did have bad ideas, there was nobody to challenge or veto them. He frequently chose what was good for his ego (or his ability to short-term maintain power) over what was good for the country, and there was no system to punish him for those decisions. Since rule-of-law would block his whims, he kept undermining rule-of-law until it was no longer strong enough to protect things like property, investment, or a free economy.</p></blockquote><p>I&#8217;m not a fan of either the ideological cults of the left or the personality cults of the right. In the absence of an obvious third alternative, I don&#8217;t think there&#8217;s a better option than taking either the left or the right as a starting point, identifying them as the lesser evil, and trying to fix their failure modes along the way. </p><p>This administration has made me more confident that the left is the better starting point for this salvaging effort. Some of this new confidence is downstream of my personal moral commitments, which I don&#8217;t expect every American to share. But most people agree prosperity is better than poverty; if the tariffs cause economic devastation, it will provide a hard-to-ignore sign of the current administration&#8217;s incompetence. When that happens, the smarter elements of the populist right will try to disavow protectionism. I might believe them when they say they personally wouldn&#8217;t have instituted those exact tariffs. But they will still have to answer for them as a predictable consequence of their ideology.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/the-populist-right-must-own-tariffs",
            "publishedAt": "2025-04-30",
            "source": "SlateStarCodex",
            "summary": "<p>President Trump&#8217;s approval rating <a href=\"https://www.rollingstone.com/politics/politics-features/trump-polling-plummets-approval-rating-new-low-1235325964/\">has fallen </a>to near-historic lows. With economic disruption from the tariffs likely to hit next month, his numbers will probably get even worse; this administration could reach unprecedented levels of unpopularity. If I were a far-right populist, I would be thinking hard about a strategy to prevent the blowback from crippling the movement.</p><p>Such a strategy is easy to come by. Anger over DOGE and deportations has a natural floor. If Trump&#8217;s base starts abandoning him, it will be because of the tariffs. But tariffs aren&#8217;t a load-bearing part of the MAGA platform. Other right-populist leaders like Orban, Bukele, and Modi show no interest in them. They seem an idiosyncratic obsession of Trump&#8217;s, a cost that the rest of the movement pays to keep him around. </p><p>So, (our hypothetical populist strategist might start thinking after Trump&#8217;s approval hits the ocean trenches and starts drilling) - whatever. MAGA minus Trump&#8217;s personal idiosyncrasies can remain a viable platform. You don&#8217;t even have to exert any effort to make it happen. Trump will retire in 2028 and pass the torch to Vance. And although Vance supports tariffs now, that&#8217;s only because he&#8217;s a spineless toady. After Trump leaves the",
            "title": "The Populist Right Must Own Tariffs"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3083/",
            "publishedAt": "2025-04-30",
            "source": "XKCD",
            "summary": "<img alt=\"Juno mission data suggests that Jupiter actually contains Matryoshka doll-style nested copies of every other planet in the Solar System.\" src=\"https://imgs.xkcd.com/comics/jupiter_core.png\" title=\"Juno mission data suggests that Jupiter actually contains Matryoshka doll-style nested copies of every other planet in the Solar System.\" />",
            "title": "Jupiter Core"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-04-30"
}