{
    "articles": [
        {
            "content": [
                "<p>I was in the city a few weeks ago and exclusively used Waymo for the entire trip. My biggest complaint? I needed to walk four minutes to a pick-up spot. Other than that, the car just showed up, traversed San Francisco streets easily, and the cost was reasonable<sup id=\"fnref-5148-1\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5148-1\" title=\"Read footnote.\">1</a></sup>.  Sitting in the back seat watching the robot drive through San Francisco, I realized now I was at ease with the machine taking me hither and fro. I&#8217;ve been on more than 20 rides, and I think robots can drive a car in a crowded city.</p>\n<p>I am dissatisfied when I ask ChatGPT or Claude.ai to write something for me. The writing has no life, no flair. It&#8217;s repeating patterns it&#8217;s been trained on, and the result is a pretty good imitation, but the voice is tinny and robotic. Anyone exploring AI has a similar experience; they test the robots on topics where they are the expert and quickly find it&#8217;s not creative, but impressively derivative. No art, no flair.</p>\n<p>The point: there is a whole class of tasks where, job loss aside<sup id=\"fnref2:5148-1\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5148-1\" title=\"Read footnote.\">1</a></sup>, I am fine with robots doing the job with absolutely no flair. I need the job done safely, efficiently, and reliably. Every time. I require no flair for a car taking me from Point A to Point B. I want no pomp and circumstance. The perfect ride is one I forget immediately because nothing interesting happens.</p>\n<h2>The Trap</h2>\n<p>Problem is, I like driving. Her name is Audrey. She&#8217;s a black Porsche 718, and I love driving her. We love zipping around the small mountain roads of the Santa Cruz Mountains. I like the feel of her wheels on the road, I like how she growls when we decide to go fast. It&#8217;s a visceral experience full of colors, sights, and sounds.</p>\n<p>In a hypothetical future world where all I ever knew was sitting in the back of a robot car, I would not appreciate the work involved because I&#8217;d never had the opportunity to learn to drive.  This might be fine for many humans on the planet, but not for me. I learned how to drive on <a href=\"https://en.wikipedia.org/wiki/California_State_Route_17\">Highway 17</a>, a scary mountain freeway that required me to become a competent driver as quickly as possible. I remember those lessons, they made me… me.</p>\n<p>I liked learning to drive.</p>\n<p>Better yet, I like learning. It gives me appreciation of the craft.</p>\n<p>I recently received a job description from a friend. As I started to read it, here&#8217;s the vent that went through my head:</p>\n<ul>\n<li>&#8220;Robots, really?&#8221;</li>\n<li>&#8220;Well, Rands, not everyone is a writing zealot like you. Many humans are intimidated by writing, so chill. They completed the necessary task.&#8221;</li>\n<li>&#8220;Yeah, but… if they don&#8217;t learn how to write well, isn&#8217;t that a problem?&#8221;</li>\n</ul>\n<p>I looked at him when done and said, &#8220;ChatGPT?&#8221;</p>\n<p>&#8220;Is it that obvious?&#8221;</p>\n<p>This is the problem. And it&#8217;s large. For every task we&#8217;re asking the robots to perform, there was an essential initial step where the robots were trained on data generated by hard-working humans so the robots could perform the task. It&#8217;s called machine learning. They need to learn from the hard work of our learning, except it&#8217;s not learning, it&#8217;s mimicking and repeating patterns. While it&#8217;s a joy to sit in the back of Waymo and appreciate the robot doing an effective job, it&#8217;s a <strong>trap</strong> and a <strong>familiar one</strong>.</p>\n<h2>Minimum Viable Friendship</h2>\n<p>Remember back when you first got on Facebook or your first social network. A revelation, right? <em>Everyone is here!</em> Suddenly, you connected with friends from high school, finding long-lost friends, and it all felt very social. Your brain told you you&#8217;d found all these valuable friends, but this is a <strong>minimum viable friendship</strong>.</p>\n<p>What does it mean to have a friend? To have a friendship? Your definition differs from mine, but off the top of my head, it includes:</p>\n<p>Shared and repeated in-person experiences and achievements that built familiarity and eventually trust. The magnitude and consistency of these shared experiences and stories become embedded in your brain, connecting you. Their presence in your mind moves you, often randomly, to reach out and remind all involved, &#8220;Hello. Hi. Remember. We are friends.&#8221;</p>\n<p>Facebook or other social network connections are humans that you know, but for many, we do the minimum work to build and maintain the relationship. Brief interactions tickle the &#8220;I&#8217;m being social&#8221; bit of your brain, but you aren&#8217;t. You&#8217;re sitting in your slippers in your Cave doing the minimum viable work, telling yourself you&#8217;re being social. These services are not built to help you be social; they are designed to extract data, which ironically is being used to train the robots to help you be less social.</p>\n<p>Maintaining any relationship is work, and like all complex skills, you start with no skill. Via repeated failures and successes, you learn the work necessary to build healthy personal and working relationships. You learn over and over again, and the act of doing work is the lesson.</p>\n<p>Are you wondering why we&#8217;re so <a href=\"https://amzn.to/4jLlNYY\">anxious</a>?  It&#8217;s because we&#8217;ve never been connected with more humans less. We&#8217;re forgetting about the important work of investment in relationships, or we&#8217;ve never learned how to create, develop, and maintain relationships because we think those vacuous relationships we&#8217;ve made on the Internet are substantive relationships. They are not<sup id=\"fnref-5148-2\"><a class=\"jetpack-footnote\" href=\"https://randsinrepose.com/feed/#fn-5148-2\" title=\"Read footnote.\">2</a></sup>. I believe building relationships takes time, patience, and proximity. You learn how to friendship by doing the hard work.</p>\n<h2>Do The Work</h2>\n<p>I&#8217;ve made a career being a human terrified by becoming irrelevant long before AI showed up to drive my car. You bet I am poking every bit of AI that I can. Daily. I am trying to figure out what it can and can&#8217;t do, and this article aside, I am optimistic, just like I&#8217;ve been for the last three decades, that revolutionary innovations will knock your socks off in the next few years. It&#8217;s still early days for AI. Really.</p>\n<p>However, I am deeply suspicious of AI, especially after watching decades of social networks monetize our attention while teaching us to ignore facts and truth, minimizing our desire to understand. Many humans don&#8217;t check their facts; they believe what they read in the feed. Most humans believe the manufactured reality is designed to get them to believe someone else&#8217;s agenda. The convenience of these services and tools has made us lazy and, worse, not curious.</p>\n<p>AI does an incredible job of confidently sounding like it knows what it&#8217;s talking about, so it&#8217;s easy to imagine what it will do in the hands of those who want to manipulate you. AI does a shockingly good job at programming and other structured tasks we thought were the domain of hardworking engineers, but AI is not curious. AI is trained, but it does not learn.</p>\n<p>My primary fear is that, like Facebook before it, those humans empowered to build, write, and create with AI stop with the slop because the act provides an unearned sense of accomplishment. The work is the trying, trying again, failing, finding inspiration in the lessons of the failure, and going one more time. Only to fail once more. Being curious. <em>&#8220;Why am I failing?&#8221;</em> is required reflection. You ask yourself, you ask your friends, and then sometimes a lightning bolt strikes and you realize, &#8220;This is the lesson. I understand now. I know how to improve.&#8221;</p>\n<p>The value of creation is a function of the effort. Creation without effort is meaningless.</p>\n<h2>Waymo Paradox</h2>\n<p>I&#8217;ve been working on the ending of this article for a few months because I can&#8217;t tell if we&#8217;re screwed or blessed. I&#8217;m not excited by a world where humans aren&#8217;t required to go through trials that require them to learn.</p>\n<p>I&#8217;ve walked close friends through the arc of this piece to get their gut read, and most have a similar initial reaction. They&#8217;re concerned about AI running wild and doing unspeakable things to humanity. Yeah, I saw Terminator, too. This opinion has a valid recency bias, but I also think this is a repeat of a core human reaction — we fear the unknown. Change is scary.</p>\n<p>I think we&#8217;re screwed, not because of the power and potential of the tools. It starts with the greed of humans and how their machinations (and success) prey on the ignorant. We&#8217;re screwed because these nefarious humans were already wildly successful before AI matured and now we&#8217;ve given them even better tools to manufacture hate that leads to helplessness. But I have a cure for that helplessness. <strong>Curiousity</strong>.</p>\n<p>I think we&#8217;re blessed. We live at a time when the tools we build can empower those who want to create. The barriers to creating have never been lower; all you need is a mindset. <strong>Curiousity</strong>. How does it work? Where did you come from? What does this mean? What rules does it follow? How does it fail? Who benefits most from this existing? Who benefits least? Why does it feel like magic? What is magic, anyway? It&#8217;s an endless set of situationally dependent questions requiring dedicated focus and infectious curiosity.</p>\n<p>When faced with change or an aggressive unknown, I take a deep breath, count to four, pace my feet firmly on the ground, and ask, &#8220;Do I really understand what is going on here? Really?&#8221; I start with curiosity because curiosity informs action. Action creates consequence, and when consequence shows up, you start learning.</p>\n<p>Here&#8217;s the thing. We are equally screwed and blessed. These contradictory states exist at the same time. It&#8217;s a paradox, a confusing, in-progress, contradictory mess. It&#8217;s a state I understand because I am a human who continues to learn and I&#8217;m curious how it&#8217;s going to turn out.</p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-5148-1\">\nYes, I know humans will lose their jobs because of this innovation. That&#8217;s a different important article.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5148-1\" title=\"Return to main content.\">&#8617;</a>\n</li>\n<li id=\"fn-5148-2\">\nHey, I know many humans have substantive relationships online. My social circle exploded in the late 80s when I discovered the BBS system in the Bay Area, but the explosion, the satisfaction, and the learning occurred when I began to hang with these now real humans in person.&#160;<a href=\"https://randsinrepose.com/feed/#fnref-5148-2\" title=\"Return to main content.\">&#8617;</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://randsinrepose.com/archives/minimum-viable-curiousity/",
            "publishedAt": "2025-05-07",
            "source": "Rands in Repose",
            "summary": "I was in the city a few weeks ago and exclusively used Waymo for the entire trip. My biggest complaint? I needed to walk four minutes to a pick-up spot. Other than that, the car just showed up, traversed San Francisco streets easily, and the cost was reasonable1. Sitting in the back seat watching the&#8230; <a class=\"read-more\" href=\"https://randsinrepose.com/archives/minimum-viable-curiousity/\">More</a>",
            "title": "Minimum Viable Curiousity"
        },
        {
            "content": [
                "<p>The 2008 book <em><a href=\"https://academic.oup.com/book/3810\">Ritual and Its Consequences: An Essay on the Limits of Sincerity</a></em> is hard for me to understand, but I&#8217;ve been trying to figure it out, as the concepts it considers seem interesting and important:</p><blockquote><p>In any ritual, as with saying please, performing the act marks acceptance of the convention. It does not matter how you may feel about the convention, if you identify with it or not. In doing a ritual the whole issue of our internal states is often irrelevant. &#8230; Getting it right is not a matter of making outer acts conform to inner beliefs. &#8230; In daily life there is often much pushing, screaming, grabbing of hairbrushes, not helping with the dinner or feeding the dog, and so on. The parents then decide that everyone has to treat each other with a bit more respect, more civility, more use of please and thank you. Many of us have experienced this and know that it works&#8212;at least for a time, until the please and thank you begin to get lost. Ratcheting up the amount of love everyone feels, on the other hand, is not the way to make life more pleasant in the household. There is no need, and it is not even possible. &#8230;</p><p>Ritual &#8230; is nondiscursive in the sense that it cannot be analyzed as a coherent system of beliefs. The meaning of ritual is the meaning produced through the ritual action itself. &#8230;</p><p>Building a better society, therefore, is based upon ritualization: creating a canon of practices that everyone should follow. And the criterion for which actions from the past should become part of that ritual canon is simply based</p><p>on whether a continued performance of them helps to refine one&#8217;s ability to respond to others. &#8230; there is no foundation, there are no overarching sets of guidelines, laws, or principles. There are only actions, and it is up to humans to ritualize some of those actions and thereby set up an ordered world. &#8230;</p><p>Sincerity often grows out of a reaction against ritual. It criticizes ritual&#8217;s acceptance of social convention as mere action (perhaps even just acting) without intent, as performance without belief. The alternatives it often suggests are categories that grow out of individual soul-searching rather than the acceptance of social conventions.</p><p>Sincerity thus grows out of abstract and generalized categories generated within individual consciousness. The sincere mode of behavior seeks to replace the &#8216;&#8216;mere convention&#8217;&#8217; of ritual with a genuine and thoughtful state of internal conviction. &#8230;</p><p>From the point of view of sincerity, ritual is mere hypocrisy and convention. Viewed from ritual, however, sincerity can threaten the very existence of society by refusing its conventions. &#8230;</p><p>The Calvinist&#8217;s &#8216;&#8216;Am I really saved?&#8217;&#8217; and the teenager&#8217;s &#8216;&#8216;Am I really in love?&#8217;&#8217; are at heart similar kinds of questions. After three decades of marriage, kids, laundry, mortgages, funerals, fights, and in-laws, the relationship tends to be sustained by [ritual] &#8230; Relationships that fail to &#8230; over the long term tend to fall apart. It is not enough to love each other sincerely if people fail to act as if they love each other; and acting as if they love each other includes ritualized forms of expressing concern, verbally and in concrete deeds of helpfulness. &#8230;</p><p>Sincerity tries to resolve all ambiguity to forge a &#8216;&#8216;pure&#8217;&#8217; and &#8216;&#8216;unsullied&#8217;&#8217; consciousness. Fifty years ago in Russia or China it was the search for a &#8216;&#8216;true&#8217;&#8217; revolutionary consciousness. In the mid-nineteenth-century springtime of the peoples it was to be at one with the spirit of one&#8217;s folk, &#8230; Sartre&#8217;s &#8230; Iron in the Soul &#8230; showing the attraction of the workers&#8217; movement &#8230; along with the self-loathing of those who could not master such unidirectional sense of self-purpose. &#8230;</p><p>Both the scholarly community and commonsensical readings of world history &#8230; claim that traditional societies are governed by ritual&#8212;that is, by largely unquestioned external norms, customs, and forms of authority that regulate individual lives. In contrast, modern societies are seen as valuing individual autonomy, such that norms, customs, and authority are accepted only through the conscious choice of the rational individual. &#8230;</p><p>[But] the opposite of ritual is not &#8230; individual autonomy. It is rather sincerity&#8212;the belief that truth resides within the authentic self, that it is coherent, and that incoherence and fragmentation are therefore themselves signs of insincerity. &#8230; &#8216;modern&#8217; period, therefore, should instead be understood in part as a period in which sincerity claims have been given a rare institutional and cultural emphasis. &#8230; so pervasive have these sincerity claims become that even [fundamentalist] revolts against this so-called modern era are done in the name of finding ever-more-authentic forms of sincerity. (<a href=\"https://academic.oup.com/book/3810\">More</a>)</p></blockquote><p>I may have finally made some sense of all this, in terms of a view I <a href=\"https://www.overcomingbias.com/p/abstraction-worsens-drift\">described</a> four days ago:</p><blockquote><p>One simple way to [integrate economics and cultural evolution] is to pick an abstraction border level that separates the two. More detailed choices are made via optimization to implement heuristics, obey norms, and achieve subgoals that are set most abstractly by cultural evolution. For example, planning a route from A to B consists of searching for a path between them that minimizes a culture-chosen cost goal, prefers culture-chosen tech, avoids violating culture-set norms, and follows culture-inherited heuristic subpaths when available. &#8230;</p><p>It seems that a big trend of the modern era has been to move this border to higher levels of abstraction &#8230; puts a higher premium on intelligence &#8230; faster actual rates of change &#8230; [but] has a problem of being harder to reliably copy &#8230; contribut[ing] to cultural drift. &#8230; Another implication of this mixed view is that once you dig into a person to a sufficient depth, their coherence will degrade a lot. Culturally inherited goals and habits are just going to be a lot less coherent with each other, especially in a world where the environment is changing fast and culture is drifting. (<a href=\"https://www.overcomingbias.com/p/abstraction-worsens-drift\">More</a>)</p></blockquote><p>Before the modern era, we inherited culture more via rituals and habits, which specified our ideal goals implicitly and at lower levels of abstraction. These ritual/habits and resulting goals were not especially simple or coherent, but people were in the habit of not thinking about them very critically. As these changed only very slowly, people mostly knew what to do, and that was usually enough.</p><p>But we don&#8217;t like to think of ourselves as having an abstraction layer of goals that we simply inherit from culture. We&#8217;d rather think of ourselves as having simple deep consistent goals that drive all our behaviors, with no layer of change. We were thus vulnerable to &#8220;sincere&#8221; culture theories that try to explain ideal behavior in terms of a few simple deep ideal goals. Like truly saved, true love, true revolutionary consciousness, and true spirit of one&#8217;s people. Prior rituals and habits that pushed behaviors at odds with these theories were then rejected as hypocritical, as were &#8220;insincere&#8221; personal inclinations to behave in conflict with these theories.</p><p>The much faster rates of change in the modern world pushed people toward a more abstract border level of culture, and caused more cultural drift, both of which plausibly made people more open to such &#8220;sincere&#8221; culture theories. But, alas, as the behaviors recommended by such theories deviate substantially from the behaviors recommended by our prior inherited mix of rituals and habits, their adoption also has plausibly added greatly to cultural drift.</p>"
            ],
            "link": "https://www.overcomingbias.com/p/sincerity-adds-to-drift",
            "publishedAt": "2025-05-07",
            "source": "Robin Hanson",
            "summary": "The 2008 book Ritual and Its Consequences: An Essay on the Limits of Sincerity is hard for me to understand, but I&#8217;ve been trying to figure it out, as the concepts it considers seem interesting and important:",
            "title": "Sincerity Adds To Drift"
        },
        {
            "content": [
                "<p>Cathy Young&#8217;s new hit piece on Curtis Yarvin (aka Mencius Moldbug) doesn&#8217;t mince words. Titled <a href=\"https://substack.com/@cathyyoung/p-162138929\">The Blogger Who Hates America</a>, it describes him as an \"inept\", \"not exactly coherent\" \"trollish, ill-informed pseudo-intellectual\" notable for his \"woefully superficial knowledge and utter ignorance\".</p><p>Yarvin&#8217;s fans counter that if you look deeper, he has good responses to Young&#8217;s objections:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c979078-2b56-4c7a-9628-e740e3d8cbe7_584x296.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"296\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c979078-2b56-4c7a-9628-e740e3d8cbe7_584x296.png\" width=\"584\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Both sides are right. The synthesis is that Moldbug sold out.</p><p>In the late 2000s, Moldbug wrote some genuinely interesting speculations on novel sci-fi variants of autocracy. Admitting that the dictatorships of the 20th century were horrifying, he proposed creative ways to patch their vulnerabilities by combining 18th century monarchy with 22nd century cyberpunk to create something better than either. These ideas might not have been realistic. But they were cool, edgy, and had a certain intellectual appeal.</p><p>Then in the late 2010s, as soon as his ideas started getting close to power he dropped it all like a hot potato. The MAGA movement was exactly what 2000s Moldbug feared most - a cancerous outgrowth of democracy riding the same wave of populist anger as the 20th century dictatorships he loathed. But in the hope of winning a temporary political victory, he let them wear him as a skinsuit - giving their normal, boring autocratic tendencies the mystique of the cool, edgy, all-vulnerabilities-patched autocracy he foretold in his manifestos.</p><p>So, for example, Yarvin urges Trump to become more of a dictator, and Young accuses him of ignoring that fact that dictators can go crazy and do terrible things. The (anonymized) Twitter user above counters that Classic Moldbug includes a cleverly-designed procedure for an unremovable board of directors with well-aligned incentives who can remove a dictator if he screws up. That&#8217;s all true! Classic Moldbug does have that part! It&#8217;s great, at least as speculative fiction! But Trump hasn&#8217;t implemented it and never will, so who cares? The whole point of post-2015 Yarvin is to say &#8220;I, a cool person who has thought a lot about autocracy, conjecture that autocracies might go great if you do certain things, so don&#8217;t worry about Trump&#8221;, and hope you don&#8217;t notice that Trump isn&#8217;t doing any of the things.</p><p>Props to the <a href=\"https://vincentl3.substack.com/\">Architectonics </a>blog for writing <a href=\"https://vincentl3.substack.com/p/curtis-yarvin-contra-mencius-moldbug?r=b9rct&amp;utm_campaign=post&amp;utm_medium=web&amp;triedRedirect=true\">Curtis Yarvin Contra Mencius Moldbug</a> (<a href=\"https://vincentl3.substack.com/p/curtis-yarvin-contra-mencius-moldbug-66b\">Part 2 here</a>), which does a good job pointing this out in one limited domain: countries under international law vs. sovereign corporations under patchwork. But I think the problem is much broader. I&#8217;ll divide my argument into four parts:</p><ol><li><p>Classic Moldbug thought the default outcome of a modern populist dictatorship was disaster. To avert this, he proposed three mechanisms.</p></li><li><p>A dictator who was not in any sense democratically elected, and certainly not subject to re-election pressures.</p></li><li><p>A carefully-safeguarded board of directors who could remove the dictator at any time.</p></li><li><p>A patchwork of city-states, unbound by modern &#8220;international law&#8221;, with few barriers to the free flow of capital and population.</p></li></ol><p>I&#8217;ll then describe how carefully Moldbug explained that you <em>had</em> to have these things, or else the dictatorship would fail in more or less the ways normies expect dictatorships to fail - leaving himself no room for the kind of pivot he&#8217;s trying now. </p><h3>1: Classic Moldbug Believed Populist Dictatorship Would End In Disaster</h3><p>Classic Moldbug admitted that fascism and communism were extremely bad. He just drew different borders around political systems: fascism, communism, third world banana republic dictatorship, and democracy all cluster together as systems where coalitions rules because they can seize temporary power in a semi-lawless society. In the various totalitarianisms, it&#8217;s literal seizing of power through armed troops or secret police; in democracy, it&#8217;s electoral seizing of power through distributing the most goodies to coalition members. From <a href=\"https://www.unqualified-reservations.org/2007/08/against-political-freedom/\">here</a>, my bolding.</p><blockquote><p>Clearly, the worst forms of demotism, the really bad apes, were the totalitarian systems&#8212;fascism and communism. The main difference between fascism and communism was not in mechanism, but in origin&#8212;fascist elites tended to be militarist, communist elites intellectual. But the one-party state is a clear case of convergent evolution.</p><p>To a neocameralist, totalitarianism is democracy in its full-blown, most malignant form. Democracy doesn&#8217;t always deteriorate into totalitarianism, and lighting up at the gas pump doesn&#8217;t always engulf you in a ball of fire. Many people with cancer live a long time or die of something else instead. This doesn&#8217;t mean you should smoke half of Virginia before lunch.</p><p>A political party is a political party. It is a large group of people allied for the purpose of seizing and wielding power. If it does not choose to arm its followers, this is only because it finds unarmed followers more useful than armed ones. If it chooses less effective strategies out of moral compunction, it will be outcompeted by some less-principled party.</p><p>When one party gains full control over the state, it gains a massive revenue stream that it can divert entirely to its supporters. The result is a classic informal management structure, whose workings should be clear to anyone who watched a few episodes of <em><a href=\"https://en.wikipedia.org/wiki/The_Sopranos\">The Sopranos</a></em>. <strong>Without a formal ownership structure, in which the entire profit of the whole enterprise is collected and distributed centrally, money and other goodies leak from every pore.</strong></p><p>Totalitarian states are gangster states, in other words, and they tend to corruption and mismanagement. The personality cult of dictatorship is quite misleading&#8212;a totalitarian dictator has little in common with a neocameralist CEO, or even a cameralist monarch.</p><p><strong>The difference is the management structure.</strong> The CEO and the monarch owe their positions to a law which all can obey, and those who choose to obey the law are naturally a winning coalition against those who choose to break it. The dictator&#8217;s position is the result of his primacy in a pyramid of criminals. This structure is naturally unstable. There is always some other gangster who wants your job. Dictators, like Mafia chiefs, are not good at dying in bed.</p><p>The internal and external violence typical of totalitarian states is best explained, I think, by this built-in mismanagement. Dictators are violent because they have to be&#8212;they use violence as an organizing principle. The totalitarian state has no principle of legitimacy that would render it impractical for an ambitious subordinate to capture the state with a coup. European monarchs made war, sometimes they were assassinated, and there were even succession struggles, but coups in the modern sense were very rare.</p><p>Note that the financial logic which keeps the neocameralist state lawful does not apply in any way to the totalitarian state, <strong>because the latter does not have a stable management structure which is controlled by its shareholders</strong>. Lawlessness is not profitable for the state as a whole, but it may be quite profitable for the part that chooses lawlessness, and in the totalitarian state no one is counting as a whole.</p><p>Similarly, <strong>only shareholder control gives the neocameralist state an incentive to remain small and efficient</strong>. The totalitarian state has an incentive to become large and inefficient, because every functionary has an incentive to expand his or her own department, and no bean-counter who demands that the department do more with less.</p><p>In a totalitarian state, since no gangster is permanently safe from any other gangster, there is a strong incentive for anyone with power to take what he can, while he can. And there is no disincentive for him to avoid abusing a resource which neither he nor his allies benefit from. Under gangster management, the totalitarian states often engaged not only in mass murder, but mass murder of their most economically productive citizens.</p></blockquote><p>I&#8217;m trying to avoid subjecting you to too many Moldbug walls of text, but this is a constant hobbyhorse of his. Unless you implement his neocameralist ideology of shareholder control, your attempted autocracy will become a totalitarian state, which will be even worse than regular democracy.</p><h3>2: The Dictator Must Not Be Elected</h3><p>The original sin of democratic/totalitarian governments is permitting power struggles. When you permit power struggles, the most power-hungry person wins. This person is probably a bad guy. But even if he isn&#8217;t, he has to optimize for gaining and maintaining power, instead of for the national interest. This usually means paying off the people who raised him to and keep him in power, i.e. corruption. Sometimes the corruption is straightforward, like giving friendly colonels vast sums from the public treasury. Other times it&#8217;s more insidious; if someone rose to power because organized labor joined their coalition, they have to overpay public unions, pass stifling pro-labor regulations, and ban whatever productive economic activity the labor unions don&#8217;t like.</p><p>Therefore, we need a dictator who came to power without a struggle and doesn&#8217;t owe anyone anything. This is Moldbug&#8217;s read on &#8220;the divine right of kings&#8221;:</p><blockquote><p><a href=\"https://en.wikipedia.org/wiki/Divine_right_of_kings\">Divine-right monarchy</a> is very easy to understand, even for an atheist like me. We have already derived it. To an atheist, the King&#8217;s authority must be absolute, not because he is appointed by God, but because he is appointed by no one. If someone appoints him, that man is King. If their roles are divided&#8212;the famous &#8220;balance of powers&#8221; or &#8220;checks and balances&#8221;&#8212;they will struggle, and one or the other prevail. Probably the many over the few.</p></blockquote><p>How do you come to power without a fight? This is a tough ask, but Classic Moldbug bit the bullet: anybody who wants power is unworthy of it. You have to just sit there being worthy. When people get tired of sucking, they&#8217;ll give you power.</p><blockquote><p>The Procedure [for installing a virtuous government] comes in <em>Three Steps</em>:</p><p><em>1: Become worthy.<br />2: Accept power.<br />3: Rule!!1!</em></p><p>You think I&#8217;m kidding. But I&#8217;m not.</p></blockquote><p>How do you become worthy? You must absolutely, 100%, avoid any kind of candidacy in elections, protesting the government, criticizing the government, thinking you could do government better than the current government, or (god forbid) deliberately trying to take power:</p><blockquote><p>As a reactionary, you don&#8217;t believe that political power is a human right. You will never convince anyone to adopt the same attitude, without first adopting it yourself. Since you believe others should be willing to accept the rule of the New Structure, over which they wield no power, you must be the first to make the great refusal. They must submit to the New; you must submit to the Old.</p><p>The reactionary&#8217;s opinion of USG is that it is what it is. It is run by the people who run it. And at present, the present management may well be the best people in the world to run USG, and even if they&#8217;re not he can&#8217;t imagine what might be done about it&#8212;short of replacing the whole thing. This simple and final judgment, like the death penalty, admits no possible compromise.</p><p>In particular, passivism is to Gandhi as Gandhi is to Hitler. Hitler, before 1933, was a violent democratic activist; Gandhi was a nonviolent democratic activist. Passivism is not any sort of activism. Passivism is passivism. In plain English, you may not even begin to consider the rest of the Procedure until you have freed yourself <em>entirely</em> from the desire, built-in burden though it be of the two-legged ape, for power. Break the <em>steel rule</em>, change your name to &#8220;Darth,&#8221; don&#8217;t expect to keep your internship at the Jedi Council.</p><p><strong>As a matter of </strong><em><strong>both principle and tactics</strong></em><strong>, the passivist rejects any involvement with any activity whose goal is to influence, coerce, or resist the government, either directly or indirectly. He is revolted by the thought of setting public policy. He would rather drink his own piss, than shift public opinion. He finds elections&#8212;national, state or local&#8212;grimly hilarious.</strong> And if he needs to get from Richmond to Baltimore, he drives <a href=\"https://www.unqualified-reservations.org/images/richmond_to_baltimore.png\">through West Virginia</a>.</p><p>The passivist has a term for democratic activism directed by the right against the left. That term is <em>counter-activism</em>. Passivism does not dispute the fact that counter-activism sometimes works. For instance, it worked for Hitler. (We&#8217;ll say more about Hitler.) However, it only works in very unusual circumstances (such as those of Hitler), and is extremely dangerous when it does work (e.g., the result may be Hitler).</p><p>In case this isn&#8217;t crystal-clear, the <em>steel rule</em> precludes, in no particular order: demonstrations, press releases, suicide bombs, lawsuits, dirty bombs, Facebook campaigns, clean bombs, mimeographed leaflets, robbing banks, interning at nonprofits, assassination, &#8220;tea parties,&#8221; journalism, bribery, grantwriting, graffiti, crypto-anarchism, balaclavas, lynching, campaign contributions, revolutionary cells, new political parties, old political parties, flash mobs, botnets, sit-ins, direct mail, monkeywrenching, and <em>any other activist technique, violent or harmless, legal or illegal, fashionable or despicable [&#8230;]</em></p><p>In the First Step, passivism is a no-brainer. Why should you be interested in influencing OUSG? You&#8217;re trying to replace the Structure, not join it.</p></blockquote><p>One clear sign that you&#8217;re doing this right and haven&#8217;t been corrupted by power is that people won&#8217;t write hit pieces about your blog. I swear I&#8217;m not making this up:</p><blockquote><p>[A] passivist blog will appear, at worst, harmless and extremely strange. There&#8217;s something going on here, <a href=\"https://en.wikipedia.org/wiki/Ballad_of_a_Thin_Man\">Mr. Jones</a>. But you don&#8217;t know what it is&#8212;do you, Mr. Jones? As an existential enemy of USG, the reactionary may well deserve some immune attention. But he won&#8217;t get it, and he is quite happy with that.</p><p>True fact: the author of UR has received over 7 zillion very interesting emails, all of which deserve responses, often long, that most have not received (but will). Number of hostile communications received, in over two years of blogging: <em>zero</em>. One can ascribe this result to many hypotheses, not all flattering, but I put it down to passivism.</p></blockquote><p>If you break this rule and seek electoral power, you are punished with something terrible: right-wing populism, which is basically the same as Hitler and must be prevented at all costs.</p><blockquote><p>[The] third tactical benefit [of passivism is] Hitler prevention. To an orthodox reactionary, Hitler is basically the poster child for what happens if you break the <em>steel rule</em><strong>. Fascism </strong><em><strong>is</strong></em><strong> reaction, but laced with cancerous tumors of democracy&#8212;&#8220;right-wing populism,&#8221; as people say these days. If it loses it loses; if it wins, the tumors grow. An improvement on Communism, but not much of one.</strong></p><p>Just about all of Hitler&#8217;s shtick, right down to the name of his party, was ripped off from the Left. Who introduced nationalism to the Continent of Europe? The Hapsburgs, or Garibaldi? Under this camouflage, which never convinced anyone with a college education, Nazism was never in any way leftist. Rather, it was a demotic corruption of the old Prussian tradition [&#8230;]</p><p>Since most people are neither historians nor philosophers, the fact that Hitler was on the extreme Right, and this Reaction is also on the extreme Right, raises some natural concerns. Again: the only way to face these concerns is to (a) provide a complete engineering explanation of Hitler, and (b) include an effective anti-Hitler device in our design.</p><p>The reactionary&#8217;s basic answer to the Hitler Question is the Law of Sewage. (This is not my invention, but I don&#8217;t know where I got it. Heinlein, perhaps?) The Law is: if you put a drop of wine in a barrel of sewage, you get sewage. If you put a drop of sewage in a barrel of wine, you get sewage. You&#8217;ll find that this rule applies perfectly to many fields of human endeavor.</p><p>Thus, Nazism contains a great deal of reactionary wisdom, because those who created it were quite familiar with the old Continental tradition of government. <strong>However, the Nazi movement originated as a democratic political party.</strong> Thus Nazism combined the venom of democracy with the experience and efficiency of Prussia, an understandably dangerous combination [&#8230;]</p><p><strong>This is where passivism, by abjuring democracy, vaccinates itself against Hitler.</strong> True: at a higher level, the reactionary seeks to cause a transition in power, and thus in a sense seeks power itself. But he is not an activist, because he is not <em>working</em> for power. <strong>His actions do not excite the human political instinct, the love for forming coalitions and tearing hell out of the apes across the river.</strong></p><p>For one thing, said actions bear no resemblance to normal politics. For another, they cannot bring any actual power to the actors, even if they succeed. Which, however likely, must remain intuitively implausible&#8212;if not laughable. And thus the project of reaction does not attract those with a real taste for power, which if nothing else is very un-Nazi-like.</p></blockquote><p>In other words - the failure mode of neoreaction (good) is right-wing populism eg Nazism (bad). You&#8217;ll know you&#8217;ve fallen into the failure mode if your reactionary movement starts with a democratic political party, or if its members are feeling normal human political emotions.</p><p>If you can&#8217;t have a normal democratic party, how do you complete steps two and three - accepting power and ruling?</p><p><a href=\"https://www.unqualified-reservations.org/2009/11/gentle-introduction-to-unqualified/\">Moldbug&#8217;s answer</a> is complicated and not very related to our topic, but he thinks you first create the Antiversity, a shadow university system laser-focused on always telling the truth. Then you bootstrap it into a shadow government, which doesn&#8217;t engage in violent revolution or political campaigning, but just sits there being right about things (I&#8217;m imagining for example a shadow FDA that produces better drug information than the real FDA, so people gradually come to trust the shadow FDA more even though its rulings have no legal effect). Then people gradually switch their allegiance from the real government to the shadow government, until finally the shadow government proposes a pseudo-candidate in an election whose sole platform is &#8220;switch power from the real government to the shadow government&#8221;. Once he wins, he revokes the Constitution, implements the shadow government charter, and resigns.</p><p>Why do you have to use this weird process instead of taking power the normal way? Because if you take power the normal way, you will fall into the trap of right-wing populism and become like Hitler:</p><blockquote><p>You start to see the difference between this and the Nazis. For the Nazis, the equivalent of the Antiversity was&#8230; Hitler. Have you <em>read</em> Hitler? I have. (The <em>Table Talk</em> is the Hitler to read.) Frankly, Hitler reads a lot like me, if I lost 25 IQ points from drinking lead soda, and also had a nasty case of tertiary syphilis. I may have some of Hitler&#8217;s talents&#8212;I will be the first to admit it. But I have no intention of applying for his job. I would never be able to do it, anyway. I don&#8217;t think anyone could.</p></blockquote><h3>2.5: The Dictator Must Not Need Anyone&#8217;s Approval</h3><p>This is a trivial extension of the previous point - &#8220;If someone appoints [the King], that man is King&#8221;. If the people appoint the King, the people are King, and then you&#8217;re a demotic totalitarianism.</p><p>How do you avoid dependence on other people&#8217;s approval? In a democracy, you need the approval of 51% of people to win the next election; in a traditional dictatorship, you need the approval of the secret police or military to keep crushing your opponents.</p><blockquote><p>The reason [an unquestioned autocracy with no dissent] is peaceful and free is that we&#8217;ve defined [the autocrat&#8217;s] primary right so that it works just like a secondary right, [ie his legal rights are completely enforced by real power/control.]</p><p>Hitler, Stalin and Mao, on the other hand, had enemies. Stalin and Mao, especially, basically operated under the assumption that everyone in the world wanted to kill them and take their jobs. After a while this was quite the self-fulfilling prophecy. Terrorist government&#8212;as in the <a href=\"https://en.wikipedia.org/wiki/Reign_of_Terror\">Reign of Terror</a>, a usage that&#8217;s unfortunately lapsed&#8212;is a consequence not of absolute primary title, but of insecure primary title. It is best understood as a form of civil war.</p></blockquote><p>So a dictator who still has enemies risks being crazy and genocidal. We&#8217;ll never get a dictator with nobody who dislikes him, but can we get a dictator with <em>effectively</em> no enemies - ie one whose enemies have zero chance of seizing power and so who <em>might as well</em> not exist?</p><p>Yarvin admits this is a tough problem, but <a href=\"https://www.unqualified-reservations.org/2007/12/neocameralism-and-escalator-of/\">suggests cryptographically-locked weapons</a>:</p><blockquote><p>In a full CDCC government, the sovereign decision and command chain is secured from end to end by military-grade cryptography. All government weapons&#8212;not just nukes, but everything right down to small arms&#8212;are inoperable without code authorization. In any civil conflict, loyal units will find that their weapons work. Disloyal units will have to improvise. The result is predictable, as results should be.</p></blockquote><p>That is, all weapons need a key to fire (or have a key that can prevent them from firing). The dictator owns the key. He can selectively disable weapons of rebel forces, allowing even the tiniest remnant of loyalists to easily overpower them. There are probably some implementation difficulties here; the point is that <em>it&#8217;s definitely not democracy</em>, nor even some kind of two-bit dictatorship where the dictator depends on the continued goodwill of the army.</p><p>Why go to these lengths? Because without them, the dictator needs to curry favor through various corrupt strategies that undermine the national interest. Of these, the most malignant - the one Moldbug holds his deepest vituperation for - is fake news. Democratic parties necessarily lie, because they are not infinitely correct about everything, but they need the public to think they are. In order to maintain the support of the masses, <a href=\"https://www.unqualified-reservations.org/2009/01/gentle-introduction-to-unqualified/\">they will lie</a> about the nature of their policies, the details of their policies, and especially the success of their policies. </p><blockquote><p>There are two kinds of government: those whose formula of legitimacy depends on popular consent, and those whose doesn&#8217;t. Following contemporary usage, we can classify these as authoritarian and democratic.</p><p>An authoritarian state has no need to tell its subjects what to think, because it has no reason to care what they think. In a truly authoritarian government, the ruling authority relies on force, not popularity. It cares what its subjects do, not what they think. It may encourage a healthy, optimistic attitude and temperate lifestyle proclivities, but only because this is good for business. Therefore, any authoritarian state that needs an official religion must have something wrong with it. (Perhaps, for example, its military authority is not as absolute as it thinks.)</p><p>A democratic state which tells its citizens what to think is a political solecism. Think about the motivation for democracy: it consigns the state to the collective responsibility of its citizens, because it feels this is an independent and well-anchored hook on which to hang the common good. Once the republic has an established church, this hook is no longer independent, and the (postulated) value-add of democracy is nullified.</p><p>Without separation of church and state, it is easy for a democracy to indulge itself in arbitrarily irresponsible misgovernment, simply by telling its bishops to inform their congregations that black is white and white is black. Thus misdirected, they are easily persuaded to support counterproductive policies which they wrongly consider productive.</p></blockquote><p>Moldbug warns that this is especially characteristic of right-wing populism, which is why he [Moldbug] <a href=\"https://www.unqualified-reservations.org/2008/11/patchwork-3-what-we-have-and-whats-so/\">is relieved when right-wing populism loses</a>:</p><blockquote><p><strong>The entire political structure of the American populist tradition is set up to select for ignorance and stupidity</strong>, and select against organization and cohesion. Thus it is <strong>simultaneously undesirable and ineffective</strong>, and even those of us who like myself sympathize with it to a considerable degree are often slightly relieved to see it lose, as it always does.</p></blockquote><h3>3: The Dictator Must Be Limited By A Board Of Directors</h3><p>How do we know that the dictator won&#8217;t have terrible policies, or be sadistic, or rename every state to &#8220;Statey McStateFace&#8221; just for fun?</p><p>Moldbug <a href=\"https://www.unqualified-reservations.org/2009/10/gentle-introduction-to-unqualified/\">proposes running the dictatorship as a joint-stock corporation</a>. This helps in two ways. First, the dictator will be checked by a board of directors, who can fire him if he goes crazy. Second, the board of directors (or the investors who elect them?) will be aligned because they have stock. The stock goes up if the nation does better. If the dictator tries to kill the Jews and the market thinks that&#8217;s bad for business, then the directors will fire and replace the CEO.</p><blockquote><p>What happens if the controllers disagree on what &#8220;responsible&#8221; government means? We are back to politics. Factions and interest groups form. Each has a different idea of how Steve should run California. A coalition of a majority can organize and threaten him: do this, do that, or it&#8217;s out with Steve and in with Marc. Logrolling allows the coalition to micromanage: more funding for the threatened Mojave alligator mouse! And so on. That classic failure mode, parliamentary government, reappears [...] Actually, there&#8217;s one way to do it. We can define responsibility in financial terms. If we think of California as a profitable corporation, a capital asset whose purpose is to maximize its production of cash, we have a definition of responsibility which is not only precise and unambiguous, but indeed quantitative...We have, of course, reinvented the joint-stock company. There is no need to argue over whether this design works. It does.</p></blockquote><p>How would the board of directors remove a dictator who didn&#8217;t want to be removed? If the country is running on the cryptographically-locked weapon system discussed earlier, the directors will have a higher-level key that can overrule the dictator&#8217;s key and make sure that factions loyal to the board have working weapons while those loyal to the dictator don&#8217;t.</p><p>How would the system guard against the dictator arresting the directors and torturing the key out of them? Maybe the directors could live in foreign countries (remember, they aren&#8217;t motivated by patriotism - they just want their stock to go up). Or maybe some of this process can be done cryptographically, so that nobody knows how many shares people have, how they voted, or even who the directors are at any given time. If the dictator started poking around to try to figure this out, the directors could remove him.</p><p>I bring this up partly because 2025-Yarvin <a href=\"https://archive.is/fNurj\">has been pushing the corporations vs. democracies argument pretty hard recently</a>. Corporations, he argues, are nimbler and better-run than democracies. A big part of their advantage is that the buck stops with an autocratic CEO instead of a limited President. Therefore, to improve upon democracy, give President Trump the limitless powers of a corporate CEO.</p><blockquote><p>[When people ask me why I think monarchies are better than democracies] I ask them to look around the room and basically point out everything in the room that was made by a monarchy. Because these things that we call companies are actually like monarchies. And then you&#8217;re looking around yourself and you see, for example, a laptop. And that laptop was made by Apple, which is a monarchy. Whereas if your MacBook Pro was made by the California Department of Computing, you can only imagine it [&#8230;] I think that if you took any of the Fortune 500 CEOs, some of them are good, some of them are bad. But the overall quality, just pick one at random, and put him or her in charge of Washington, and I think you&#8217;d get something much, much better than what&#8217;s there [&#8230;]</p><p>One of the things about monarchy that&#8217;s been known for quite some time&#8212;and again, even in very, very anti-monarchial regimes and periods, an exception is made for this&#8212;is that a ship always has a captain. An airplane always has a captain. Basically, in any very safety-critical environment &#8230; you should have someone in charge.</p></blockquote><p>But even granting that corporations are better-governed than democracies, this comparison doesn&#8217;t work. Corporate and national governance are trying to solve different problems. Corporate governance asks &#8220;Given pre-existing rule of law and the certainty that all of our bylaws will be enforced by a greater power, how do we ensure competent administration?&#8221; National government asks &#8220;How do we generate rule of law out of nothing in a way that can prop itself up and defend against attacks?&#8221;</p><p>What prevents Tim Apple from refusing to pay dividends to Apple investors and keeping all the profit for himself? Easy question, it&#8217;s the United States government, no problem here. What prevents Donald Trump from murdering America&#8217;s five richest billionaires and taking their stuff? The police? What about the thing where Trump is the police chief&#8217;s boss&#8217;s boss&#8217;s boss&#8217;? Awkward, but that&#8217;s why we have separation of powers, checks and balances, government-of-law-and-not-of-men, all that stuff. What prevents Donald Trump from calling in the military to arrest all the other separate powers that are supposed to check and balance him? Uh, more separation of power, different checks and balances, some sort of loyalty to the Constitution. When Yarvin points out that companies thrive without separation-of-powers, that&#8217;s because they never encounter the problem that separation of powers was intended to solve.</p><p>Classic Moldbug understood this well, which was why he proposed a separate power capable of checking his dictator - the board of directors<a class=\"footnote-anchor\" href=\"https://www.astralcodexten.com/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a> - and a mechanism for keeping the system stable against power grabs - the cryptographic weapons. </p><p>But the regime he boosts today has nothing like this, so it&#8217;s facile to use the corporate comparison argument.</p><h3>4: The Dictator Must Be Embedded Within A Patchwork Of Similar Corporate City-States.</h3><p>Architectonics already did a great job covering this one. Read his <a href=\"https://vincentl3.substack.com/p/curtis-yarvin-contra-mencius-moldbug?r=b9rct&amp;utm_campaign=post&amp;utm_medium=web&amp;triedRedirect=true\">Part 1</a> and <a href=\"https://vincentl3.substack.com/p/curtis-yarvin-contra-mencius-moldbug-66b\">Part 2</a>, then meet me back here for the Conclusion section.</p><h3>At Long Last, I&#8217;ve Created The Populist Strongman From My Classic Series Of 11,000 Blog Posts &#8220;Don&#8217;t Create The Populist Strongman&#8221;</h3><p>I enjoyed reading <em>Unqualified Reservations, </em>way back in 2013. I didn&#8217;t agree with it, but I thought some parts of it were good, and even the bad parts helped me think clearly about the nature of power. I hoped the neoreactionaries would take the good parts, ditch the rest, and build something useful out of it. I think some people, mostly outside the organized neoreactionary movement, <a href=\"https://www.astralcodexten.com/p/what-ever-happened-to-neoreaction\">did exactly that</a> (subscribers-only post, sorry).  Unfortunately, Yarvin went the opposite direction, jettisoning the good stuff in favor of the bad. All the warnings against populism, party politics, corrupt power-seeking officials, misinformation, and mobocracy have been filed away in favor of a Flanderized &#8220;maybe dictatorship is good&#8221;.</p><p>One reason I respect Sam Altman is that back in 2016, when he founded an AI charity to bring a positive singularity to the world, he realized that it would later be extraordinarily tempting to turn it into a normal profit-focused company and get rich. So he tied himself to the mast by designing a nonprofit structure capable of thwarting all the machinations his future self could throw at it. A few years later, he gave into temptation, tried to turn it into a normal profit-focused company, <a href=\"https://apnews.com/article/openai-chatgpt-nonprofit-sam-altman-3dbfca4d13586debf9740e0dede8ba47\">and failed</a>, because the structure he designed was really good. This was the best possible outcome, and one of many reasons I number him among the all-time greats.</p><p>Moldbug deserves a similar level of respect. He clearly saw that the failure mode of his philosophy was that power-seeking people would use it to support right-wing populism. He included a fantastic number of tests to determine whether any given self-professed reactionary was the real deal or a false prophet, begging his readers to apply them carefully to anyone claiming the mantle of reaction. Then he got corrupted by power and tried to use his philosophy to endorse right-wing populism. But the tests are still there! Anyone who reads through 11,000 blog posts can see all the red flags where Moldbug says &#8220;&#8230;and if I ever do X, then I&#8217;ve sold out and you should stop listening to me.&#8221; Another all-time great!</p><p>Just the few posts I&#8217;ve highlighted in this essay have listed over a dozen tests - by tests I mean something where Moldbug says something is an absolutely vital feature of the new regime, or that without it things would descend into kleptocracy, or that this is the only safeguard against Hitler, or something along those lines. These include:</p><ul><li><p>The reactionary party always tells the truth</p></li><li><p>The reactionary party is an exclusive-members only club</p></li><li><p>The reactionary party's supporters don't have normal political emotions or feel anger at the other side</p></li><li><p>The reactionary party starts by appealing to the smartest people, and is wary of including commoners</p></li><li><p>The reactionary party refuses to hold a normal democratic office like President</p></li><li><p>The reactionary party has a shadow government in place before getting elected</p></li><li><p>The reactionary party resigns within a year in favor of an apolitical administrator</p></li><li><p>The reactionary party openly campaigns on a platform of abolishing the Constitution, and goes through with it immediately upon election.</p></li><li><p>The regime did not originate as a democratic political party (except a reactionary party meeting the criteria above)</p></li><li><p>The regime doesn't use activism, journalism, or any other attempt to shape public opinion</p></li><li><p>The regime is perfectly secure, backed by cryptographically-locked weapons</p></li><li><p>The regime is a joint-stock corporation controlled by shareholders</p></li><li><p>State revenue is distributed to shareholders as dividends</p></li><li><p>There is a board of directors representing shareholders which can fire the executive if needed</p></li><li><p>There is a stable royalty dynasty with a clear succession</p></li><li><p>Reactionary blogs don't attract negative attention</p></li></ul><p>We&#8217;re told not to let the perfect be the enemy of the good. But Moldbug seems pretty fixed on perfection, constantly warning that you <em>have</em> to follow these rules or else you&#8217;ll get Hitler and it will be even worse than normal democracy. By my count, the Trump administration is zero out of sixteen.</p><p>People have a right to change their mind. But I haven&#8217;t seen Yarvin give a clear rundown of exactly where he changed his mind, why he did so, and why he no longer thinks the dire warnings he gave fifteen years ago still apply. If he did and he missed it, he can let me know and I&#8217;m sorry.</p><p>I should end by saying it&#8217;s possible that Yarvin hasn&#8217;t sold out. He&#8217;s previously said things about how a good reactionary has to support the current regime, even if he hates them. He even <a href=\"https://graymirror.substack.com/p/bidenharris-2024\">tongue-in-cheek endorsed</a> Joe Biden, back when he was President. Maybe he actually hates Trump and his movement, but feels duty-bound to support them anyway, the same way he would support Stalin if he were in Stalinist Russia. I don&#8217;t know about this one - the pro-Trump stuff seems different in character from the more ironic pro-Biden posts. And he <a href=\"https://x.com/curtis_yarvin\">started using X</a> a few months ago to retweet dunks on his political opponents, something that no duty compelled him to do and a sure sign of a deranged mind. If it&#8217;s true, all I can suggest is that he find a philosophy which doesn&#8217;t force him to do this.</p><p>But I think it&#8217;s more likely he feels genuine despair about the state of the country, his faux cheerfulness has finally cracked, and he&#8217;s decided it&#8217;s worth compromising his principles for a long shot at getting some of what he wants. I sympathize - I&#8217;m also pretty desperate and low on faux cheer - but I can only remind him of <a href=\"https://www.unqualified-reservations.org/2008/11/patchwork-3-what-we-have-and-whats-so/\">what a very wise man said back in 2008</a>:</p><blockquote><p>Since populists have no idea [how government really works], they participate enthusiastically in the sham. Sometimes they win a little, but in the end they always lose. And they are such gentlemen about it, too. Somehow no one has ever explained to Middle America that if you don&#8217;t know who the sucker at the table is, the sucker is you.</p></blockquote><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://www.astralcodexten.com/feed#footnote-anchor-1\" id=\"footnote-1\" target=\"_self\">1</a><div class=\"footnote-content\"><p>Some successful Silicon Valley companies have a semi-captive board of directors which rubber-stamps the CEO. But these are usually ones like Meta where the CEO has done an incredible job proving his judgment again and again, so that investors are willing to relax their usual paranoia. Even here, sometimes your genius once-in-a-generation CEO takes too much ketamine, goes crazy, and then you wish you&#8217;d held out for a slightly-less-captive board.</p></div></div>"
            ],
            "link": "https://www.astralcodexten.com/p/moldbug-sold-out",
            "publishedAt": "2025-05-07",
            "source": "SlateStarCodex",
            "summary": "<p>Cathy Young&#8217;s new hit piece on Curtis Yarvin (aka Mencius Moldbug) doesn&#8217;t mince words. Titled <a href=\"https://substack.com/@cathyyoung/p-162138929\">The Blogger Who Hates America</a>, it describes him as an \"inept\", \"not exactly coherent\" \"trollish, ill-informed pseudo-intellectual\" notable for his \"woefully superficial knowledge and utter ignorance\".</p><p>Yarvin&#8217;s fans counter that if you look deeper, he has good responses to Young&#8217;s objections:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c979078-2b56-4c7a-9628-e740e3d8cbe7_584x296.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"296\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c979078-2b56-4c7a-9628-e740e3d8cbe7_584x296.png\" width=\"584\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Both sides are right. The synthesis is that Moldbug sold out.</p><p>In the late 2000s, Moldbug wrote some genuinely interesting speculations on novel sci-fi variants of autocracy. Admitting that the dictatorships of the 20th century were horrifying, he",
            "title": "Moldbug Sold Out"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3086/",
            "publishedAt": "2025-05-07",
            "source": "XKCD",
            "summary": "<img alt=\"Frankly, given their extreme gravitational fields and general instability, even 12-inch globes should probably be banned.\" src=\"https://imgs.xkcd.com/comics/globe_safety.png\" title=\"Frankly, given their extreme gravitational fields and general instability, even 12-inch globes should probably be banned.\" />",
            "title": "Globe Safety"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-05-07"
}