{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>I've never seen so many developers curious about leaving the Mac and giving Linux a go. Something has really changed in the last few years. Maybe Linux just got better? Maybe <a href=\"https://world.hey.com/dhh/cheap-mini-pcs-have-gotten-really-good-c70ab40f\">powerful mini PCs</a> made it easier? Maybe Apple just fumbled their relationship with developers <a href=\"https://mobilegamer.biz/apples-new-eu-app-store-rules-are-insane-intentionally-confusing-and-blatantly-unlawful-say-pundits/\">one too many times</a>? Maybe it's all of it. But whatever the reason, the vibe shift is noticeable.<br /><br /></div><div>This is why the future is so hard to predict! People have been joking about \"The Year of Linux on the Desktop\" since the late 90s. Just like self-driving cars were supposed to be a thing back in 2017. And now, in the year of our Lord 2025, it seems like <a href=\"https://world.hey.com/dhh/self-driving-is-finally-happening-1d973fdd\">we're getting both</a>!<br /><br /></div><div>I also wouldn't underestimate the cultural influence of a few key people. <a href=\"https://www.youtube.com/watch?v=pVI_smLgTY0\">PewDiePie sharing his journey into Arch and Hyprland with his 110 million followers</a> is important. <a href=\"https://www.youtube.com/watch?v=ZH3iKbEiks0\">ThePrimeagen moving to Arch and Hyprland</a> is important. Typecraft teaching beginners <a href=\"https://www.youtube.com/watch?v=2CP_9-jCV6A\">how to build an Arch and Hyprland setup from scratch</a> is important (and who <a href=\"https://www.youtube.com/watch?v=zikJTpJgzzo\">I just spoke to about Omarchy</a>). Gabe Newell's <a href=\"https://store.steampowered.com/steamdeck\">Steam Deck</a> being built on Arch and pushing Proton to <a href=\"https://www.protondb.com/explore?selectedFilters=whitelisted\">over 20,000 compatible Linux games</a> is important.<br /><br /></div><div>You'll notice a trend here, which is that <a href=\"https://archlinux.org/\">Arch Linux</a>, a notoriously \"difficult\" distribution, is at the center of much of this new engagement. Despite the fact that it's been around since 2003! There's nothing new about Arch, but there's something new about the circles of people it's engaging.<br /><br /></div><div>I've put Arch at the center of <a href=\"https://omarchy.org\">Omarchy</a> too. Originally just because that was what <a href=\"https://hypr.land/\">Hyprland</a> recommended. Then, after living with the wonders of 90,000+ packages on the community-driven <a href=\"https://aur.archlinux.org/\">AUR package repository</a>, for its own sake. It's really good!</div><div><br />But while Arch (and Hyprland) are having a moment amongst a new crowd, it's also \"just\" Linux at its core. And Linux really is the star of the show. The perfect, free, and open alternative that was just sitting around waiting for developers to finally have had enough of the commercial offerings from Apple and Microsoft.</div><div><br />Now obviously there's a taste of \"new vegan sees vegans everywhere\" here. You start talking about Linux, and you'll hear from folks already in the community or those considering the move too. It's easy to confuse what you'd like to be true with what is actually true.</div><div><br />And it's definitely true that Linux is still a niche operating system on the desktop. Even among developers. Apple and Microsoft sit on the lion's share of the market share. But the mind share? They've been losing that fast.<br /><br /></div><div>The window is open for a major shift to happen. First gradually, then suddenly. It feels like morning in Linux land!</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/get-in-losers-we-re-moving-to-linux-5e1b93cd",
            "publishedAt": "2025-07-03",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>I've never seen so many developers curious about leaving the Mac and giving Linux a go. Something has really changed in the last few years. Maybe Linux just got better? Maybe <a href=\"https://world.hey.com/dhh/cheap-mini-pcs-have-gotten-really-good-c70ab40f\">powerful mini PCs</a> made it easier? Maybe Apple just fumbled their relationship with developers <a href=\"https://mobilegamer.biz/apples-new-eu-app-store-rules-are-insane-intentionally-confusing-and-blatantly-unlawful-say-pundits/\">one too many times</a>? Maybe it's all of it. But whatever the reason, the vibe shift is noticeable.<br /><br /></div><div>This is why the future is so hard to predict! People have been joking about \"The Year of Linux on the Desktop\" since the late 90s. Just like self-driving cars were supposed to be a thing back in 2017. And now, in the year of our Lord 2025, it seems like <a href=\"https://world.hey.com/dhh/self-driving-is-finally-happening-1d973fdd\">we're getting both</a>!<br /><br /></div><div>I also wouldn't underestimate the cultural influence of a few key people. <a href=\"https://www.youtube.com/watch?v=pVI_smLgTY0\">PewDiePie sharing his journey into Arch and Hyprland with his 110 million followers</a> is important. <a href=\"https://www.youtube.com/watch?v=ZH3iKbEiks0\">ThePrimeagen moving to Arch and Hyprland</a> is important. Typecraft teaching beginners <a href=\"https://www.youtube.com/watch?v=2CP_9-jCV6A\">how to build an Arch and Hyprland setup from scratch</a> is important (and who <a href=\"https://www.youtube.com/watch?v=zikJTpJgzzo\">I just spoke to about Omarchy</a>). Gabe Newell's <a href=\"https://store.steampowered.com/steamdeck\">Steam Deck</a> being built on Arch and pushing Proton to <a",
            "title": "Get in losers, we're moving to Linux!"
        },
        {
            "content": [
                "<p>Back in 2017, everyone went crazy about these things:</p>\n\n<p><img alt=\"goggles\" src=\"https://dynomight.net/img/blue-light/goggles.png\" /></p>\n\n<p>The theory was that perhaps the pineal gland isn’t the <a href=\"https://plato.stanford.edu/entries/pineal-gland/\">principal seat of the soul</a> after all. Maybe what it does is spit out melatonin to make you sleepy. But it only does that when it’s dark, and you spend your nights in artificial lighting and/or staring at your favorite glowing rectangles.</p>\n\n<p>You could sit in darkness for three hours before bed, but that would be boring. But—supposedly—the pineal gland is only shut down by <em>blue</em> light. So if you selectively block the blue light, maybe you can sleep well and also participate in modernity.</p>\n\n<p>Then, by around 2019, blue-blocking glasses seemed to disappear. And during that brief moment in the sun, I never got a clear picture of if they actually work.</p>\n\n<p>So, do they? To find out, I read all the papers.</p>\n\n<h2 id=\"light-and-eyes\">Light and eyes</h2>\n\n<p>Before getting to the papers, please humor me while I give three excessively-detailed reminders about how light works. First, it comes in <a href=\"https://en.wikipedia.org/wiki/Visible_spectrum\">different wavelengths</a>.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Color</th>\n      <th>Wavelength (nm)</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>violet</td>\n      <td>380–450</td>\n    </tr>\n    <tr>\n      <td>blue</td>\n      <td>450–485</td>\n    </tr>\n    <tr>\n      <td>cyan</td>\n      <td>485–500</td>\n    </tr>\n    <tr>\n      <td>green</td>\n      <td>500–565</td>\n    </tr>\n    <tr>\n      <td>yellow</td>\n      <td>565–590</td>\n    </tr>\n    <tr>\n      <td>orange</td>\n      <td>590–625</td>\n    </tr>\n    <tr>\n      <td>red</td>\n      <td>625–750</td>\n    </tr>\n  </tbody>\n</table>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/Linear_visible_spectrum.svg\" /></p>\n\n<p>Outside the visible spectrum, infrared light and microwaves and radio waves have even longer wavelengths, while ultraviolet light and x-rays and gamma rays have even shorter wavelengths. Shorter wavelengths have more energy. Do not play around with gamma rays.</p>\n\n<p>Other colors are hallucinations made up by your brain. When you get a mixture of all wavelengths, you see “white”. When you get a lot of yellow-red wavelengths, some green, and a little violet-blue, you see “brown”. Similar things are true for pink/purple/beige/olive/etc. (Technically, the original spectral colors and everything else you experience are also hallucinations made up by your brain, but never mind.)</p>\n\n<p>Second, the <a href=\"https://en.wikipedia.org/wiki/Black-body_radiation\">ruleset of our universe</a> says that all matter gives off light, with a mixture of wavelengths that depends on the temperature. Hotter stuff has atoms that are jostling around faster, so it gives off more total light, and shifts towards shorter (higher-energy) wavelengths. Colder stuff gives off less total light and shifts towards longer wavelengths. The “color temperature” of a lightbulb is the temperature some chunk of rock would have to be to produce the same visible spectrum. Here’s a <a href=\"https://commons.wikimedia.org/wiki/File:Color_temperature_black_body_800-12200K.svg\">figure</a>, with the x-axis in kelvins.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/color_temperature.svg\" /></p>\n\n<p>The sun is around 5800 K. That’s both the physical temperature on the surface and the color temperature of its light. Annoyingly, the orange light that comes from cooler matter is often called “warm”, while the blueish light that comes from hotter matter is called “cool”. Don’t blame me.</p>\n\n<p>Anyway, different light sources produce widely <a href=\"https://www.comsol.com/blogs/calculating-the-emission-spectra-from-common-light-sources/\">different spectra</a>.</p>\n\n<p><img alt=\"A graph of the combined plots of the emission spectra for different light sources.\" src=\"https://dynomight.net/img/blue-light/Combined-plot-of-emission-spectra.png\" /></p>\n\n<p>You can’t sense most of those differences because you only have three types of <a href=\"https://en.wikipedia.org/wiki/Cone_cell\">cone cells</a>. Rated color temperatures just reflect how much those cells are stimulated.</p>\n\n<p>Your eyes probably see the frequencies they do because that’s where the sun’s spectrum is concentrated. In dim light, cones are inactive, so you rely on <a href=\"https://en.wikipedia.org/wiki/Rod_cell\">rod cells</a> instead. You’ve only got one kind of rod, which is why you can’t see color in dim light. (Though you might not have noticed.)</p>\n\n<p>Finally, <em>amounts</em> of light are typically measured in <strong>lux</strong>. Your eyes are amazing and can deal with <a href=\"https://en.wikipedia.org/wiki/Lux\">upwards of 10 orders of magnitude</a>.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Situation</th>\n      <th>lux</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Moonless overcast night</td>\n      <td>0.0001</td>\n    </tr>\n    <tr>\n      <td>Full moon</td>\n      <td>0.2</td>\n    </tr>\n    <tr>\n      <td>Very dark overcast day</td>\n      <td>100</td>\n    </tr>\n    <tr>\n      <td>Sunrise or sunset</td>\n      <td>400</td>\n    </tr>\n    <tr>\n      <td>Overcast day</td>\n      <td>1,000</td>\n    </tr>\n    <tr>\n      <td>Full daylight</td>\n      <td>20,000</td>\n    </tr>\n    <tr>\n      <td>Direct sunlight</td>\n      <td>50,000</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>In summary, you get <em>widely</em> varying amounts of different wavelengths of light in different situations, and the sun is <em>very</em> powerful. It’s reasonable to imagine your body might regulate its sleep schedule based that input.</p>\n\n<h2 id=\"experiments\">Experiments</h2>\n\n<p>OK, but do blue-blocking glasses actually work? Let’s read some papers.</p>\n\n<h3 id=\"kayumov\">Kayumov</h3>\n\n<p><a href=\"https://doi.org/10.1210/jc.2004-2062\">Kayumov et al. (2005)</a> had 19 young healthy adults stay awake overnight for three nights, first with dim light (&lt;5 lux) and then with bright light (800 lux), both with and without blue-blocking goggles. They measured melatonin in saliva each hour.</p>\n\n<p>The goggles seemed to help a lot. With bright light, subjects only had around 25% as much melatonin as with dim light. Blue-blocking goggles restored that to around 85%.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/kayumov.png\" /></p>\n\n<p>I rate this as <em>good</em> evidence for a <em>strong</em> increase in melatonin. Sometimes good science is pretty simple.</p>\n\n<h3 id=\"burkhart\">Burkhart</h3>\n\n<p><a href=\"https://doi.org/10.3109/07420520903523719\">Burkhart and Phelps (2009)</a> first had 20 adults rate their sleep quality at home for a week as a baseline. Then, they were randomly given either blue-blocking glasses or yellow-tinted “placebo” glasses and told to wear them for 3 hours before sleep for two weeks.</p>\n\n<p>Oddly, the group with blue-blocking glasses had much lower sleep quality during the baseline week, but this improved a lot over time.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/burkhart.png\" /></p>\n\n<p>I rate this as <em>decent</em> evidence for a <em>strong</em> improvement in sleep quality. I’d also like to thank the authors for writing this paper in something resembling normal human English.</p>\n\n<h3 id=\"van-der-lely\">Van der Lely</h3>\n\n<p><a href=\"https://doi.org/10.1016/j.jadohealth.2014.08.002\">Van der Lely et al. (2014)</a> had 13 teenage boys wear either blue-blocking glasses or clear glasses from 6pm to bedtime for one week, followed by the other glasses for a second week. Then they went to a lab, spent 2 hours in dim light, 30 minutes in darkness, and then 3 hours in front of an LED computer, all while wearing the glasses from the second week. Then they were asked to sleep, and their sleep quality was measured in various ways.</p>\n\n<p>The boys had more melatonin and reported feeling sleepier with the blue-blocking glasses.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/van_der_lely1.jpg\" /></p>\n\n<details>\n  \nHowever, the sleep quality measurements show no real effect. They are all pretty close in the two groups, sometimes slightly better with the blue-blocking glasses and sometimes slightly worse.\n\n\n  <p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/van_der_lely2.jpg\" /></p>\n\n  <p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/van_der_lely3.png\" /></p>\n\n</details>\n\n<p>I rate this as <em>decent</em> evidence for a <em>moderate</em> increase in melatonin, and <em>weak</em> evidence for <em>near-zero</em> effect on sleep quality.</p>\n\n<h3 id=\"gabel\">Gabel</h3>\n\n<p><a href=\"https://doi.org/10.1038/s41598-017-07060-8\">Gabel et al. (2017)</a> took 38 adults and first put them through 40 hours of sleep deprivation under white light, then allowed them to sleep for 8 hours. Then they were subjected to 40 <em>more</em> hours of sleep deprivation under either white light (250 lux at 2800K), blue light (250 lux at 9000K), or very dim light (8 lux, color temperature unknown).</p>\n\n<p>Their results are weird. In younger people, dim light led to more melatonin that white light, which led to more melatonin that blue light. That carried over to a tiny difference in sleepiness. But in older people, both those effects disappeared, and blue light even seemed to cause more sleepiness than white light. The cortisol and wrist activity measurements basically make no sense at all.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/gabel.svg\" /></p>\n\n<p>I rate this as <em>decent</em> evidence for a <em>moderate</em> effect on melatonin, and <em>very weak</em> evidence for a <em>near-zero</em> effect on sleep quality. (I think its decent evidence for a near-zero effect on sleepiness, but they didn’t actually measure sleep quality.)</p>\n\n<h3 id=\"esaki\">Esaki</h3>\n\n<p><a href=\"http://dx.doi.org/10.1080/07420528.2017.1318893\">Esaki et al. (2017)</a> gathered 20 depressed patients with insomnia. They first recorded their sleep quality for a week as a baseline, then were given either blue-blocking glasses or placebo glasses and told to wear them for another week starting at 8pm.</p>\n\n<p>The changes in the blue-blocking group were a bit better for some measures, but a bit worse for others. Nothing was close to significant. Apparently 40% of patients complained that the glasses were painful, so I wonder if they all wore them as instructed.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/esaki.svg\" /></p>\n\n<p>I rate this was <em>weak</em> evidence for <em>near-zero</em> effect on sleep quality.</p>\n\n<h3 id=\"shechter\">Shechter</h3>\n\n<p><a href=\"https://doi.org/10.1016/j.jpsychires.2017.10.015.\">Shechter et al. (2018)</a> gave 14 adults with insomnia either blue-blocking or clear glasses and had them wear them for 2 hours before bedtime for one week. Then they waited four weeks and had them wear the other glasses for a second week. They measured sleep quality through diaries and wrist monitors.</p>\n\n<p>The blue-blocking glasses seemed to help with everything. People fell asleep 5 to 12 minutes faster, and slept 30 to 50 minutes longer, depending on how you measure. (SOL is sleep onset latency, TST is total sleep time).</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/shechter.svg\" /></p>\n\n<p>I rate this as <em>good</em> evidence for a <em>strong</em> improvement in sleep quality.</p>\n\n<h3 id=\"knufinke\">Knufinke</h3>\n\n<p><a href=\"https://doi.org/10.1080/17461391.2018.1544278\">Knufinke et al. (2019)</a> had 15 young adult athletes either wear blue-blocking glasses or transparent glasses for four nights.</p>\n\n<p>The blue-blocking group did a little better on most measures (longer sleep time, higher sleep quality) but nothing was statistically significant.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/knufinke.svg\" /></p>\n\n<p>I rate this as <em>weak</em> evidence for a <em>small</em> improvement in sleep quality.</p>\n\n<h3 id=\"janků\">Janků</h3>\n\n<p><a href=\"https://doi.org/10.1080/07420528.2019.1692859\">Janků et al. (2019)</a> took 30 patients with insomnia and had them all go to therapy. They randomly gave them either blue-blocking glasses or placebo glasses and asked the patients to wear them for 90 minutes before bed.</p>\n\n<p>The results are pretty tangled. According to sleep diaries, total sleep time went up by 37 minutes in the blue-blocking group, but slightly decreased in the placebo group. The wrist monitors show total sleep time <em>decreasing</em> in both groups, but it did decrease less with the blue-blocking glasses. There’s no obvious improvement in sleep onset latency or the various questionnaires they used to measure insomnia.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/janků.svg\" /></p>\n\n<p>I rate this as <em>weak</em> evidence for a <em>moderate</em> improvement in sleep quality.</p>\n\n<h3 id=\"esaki-again\">Esaki (again)</h3>\n\n<p><a href=\"https://doi.org/10.1111/bdi.12912\">Esaki et al. (2020)</a> followed up on their 2017 experiment from above. This time, they gathered 43 depressed patients with insomnia. Again, they first recorded their sleep quality for a week as a baseline, then were given either blue-blocking glasses or placebo glasses and told to wear them for another week starting at 8pm.</p>\n\n<p>The results were that subjective sleep quality seemed to improve more in the blue-blocking group. Total sleep time went down by 12.6 minutes in the placebo group, but increased by 1.1 minutes in the blue-blocking group. None of this was statistically significant, and all the other measurements are confusing. Here are the main results. I’ve added little arrows to show the “good” direction, if there is one.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/esaki-again.svg\" /></p>\n\n<p>These confidence intervals don’t make any sense to me. Are they blue-blocking minus placebo or the reverse? When the blue-blocking number is higher than placebo, sometimes the confidence interval is centered above zero (VAS), and sometimes it’s centered below zero (TST). What the hell?</p>\n\n<p>Anyway, they also had a doctor estimate the <a href=\"https://en.wikipedia.org/wiki/Clinical_global_impression\">clinical global impression</a> for each patient, and this looked a bit better for the blue-blocking group. The doctor seemingly <em>was</em> blinded to the type of glasses the patients were wearing.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/esaki-again2.svg\" /></p>\n\n<p>This is a tough one to rate. I guess I’ll call it <em>weak</em> evidence for a <em>small</em> improvement in sleep quality.</p>\n\n<h3 id=\"guarana\">Guarana</h3>\n\n<p><a href=\"https://gwern.net/doc/zeo/2020-guarana.pdf\">Guarana et al. (2020)</a> sent either blue-blocking glasses or sham glasses to 240 people, and asked them to wear them for at least two hours before bed. They then had them fill out some surveys about how much and how well they slept.</p>\n\n<p>Wearing the blue-blocking glasses was positively correlated with both sleep quality and quantity with a correlation coefficient of around 0.20.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/guarana.svg\" /></p>\n\n<p>This paper makes me nervous. They never show the raw data, there seem to be huge dropout rates, and lots of details are murky. I can’t tell if the correlations they talk about weight all people equally, all surveys equally, or something else. That would make a huge difference if people dropped out more when they weren’t seeing improvements.</p>\n\n<p>I rate this as <em>weak</em> evidence for a <em>moderate</em> effect on sleep. There’s a large sample, but I discount the results because of the above issues and/or my general paranoid nature.</p>\n\n<h3 id=\"domagalik\">Domagalik</h3>\n\n<p><a href=\"https://doi.org/10.3389/fnins.2020.00654\">Domagalik et al. (2020)</a> had 48 young people wear either blue-blocking contact lenses or regular contact lenses for 4 weeks. They found no effect on sleepiness.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/domagalik.svg\" /></p>\n\n<details>\n  \nThey also found that blocking blue light was <em>harmful</em> for attention and working memory.\n\n\n  <p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/domagalik2.svg\" /></p>\n\n</details>\n\n<p>I rate this as <em>very weak</em> evidence for <em>near-zero</em> effect on sleep. The experiment seems well-done, but it’s testing the effects of blocking blue light all the time, not just at night. Given the effects on attention and working memory, don’t do that.</p>\n\n<h3 id=\"bigalke\">Bigalke</h3>\n\n<p><a href=\"https://doi.org/10.1016/j.sleh.2021.02.004\">Bigalke et al. (2021)</a> had 20 healthy adults wear either blue-blocking glasses or clear glasses for a week from 6pm until bedtime, then switch to the other glasses for a second week. They measured sleep quality both through diaries (“Subjective”) and wrist monitors (“Objective”).</p>\n\n<p>The differences were all small and basically don’t make any sense.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/bigalke.svg\" /></p>\n\n<p>I rate this <em>weak</em> evidence for <em>near-zero</em> effect on sleep quality. Also, see how in the bottom pair of bar-charts, the y-axis on the left goes from 0 to 5, while on the right it goes from 30 to 50? Don’t do that, either.</p>\n\n<h3 id=\"see-also\">See also</h3>\n\n<p>I also found a couple papers that are related, but don’t directly test what we’re interested in:</p>\n\n<ul>\n  <li>\n    <p><a href=\"https://doi.org/10.1016/j.sleep.2012.12.011\">Appleman et al. (2013)</a> either exposed people to different amounts of blue light at different times of day. Their results suggest that early-morning exposure to blue light might shift your circadian rhythm earlier.</p>\n  </li>\n  <li>\n    <p><a href=\"https://doi.org/10.1016/j.physbeh.2015.06.028\">Sasseville et al. (2015)</a> had people stay awake from 11pm to 4am on two consecutive nights, while either wearing blue-blocking glasses or not. With the blue-blocking glasses there was more overall light to equalizing the total incoming energy. I can’t access this paper, but apparently they found no difference.</p>\n  </li>\n</ul>\n\n<h2 id=\"drumroll\">Drumroll</h2>\n\n<p>For a synthesis, I scored each of the measured effects according to this rubric:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Rating</th>\n      <th>Meaning</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>↑↑↑</td>\n      <td>large increase</td>\n    </tr>\n    <tr>\n      <td>↑↑</td>\n      <td>moderate increase</td>\n    </tr>\n    <tr>\n      <td>↑</td>\n      <td>small increase</td>\n    </tr>\n    <tr>\n      <td>↔</td>\n      <td>no effect</td>\n    </tr>\n    <tr>\n      <td>↓</td>\n      <td>small decrease</td>\n    </tr>\n    <tr>\n      <td>↓↓</td>\n      <td>moderate decrease</td>\n    </tr>\n    <tr>\n      <td>↓↓↓</td>\n      <td>large decrease</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>And I scored the quality of evidence according to this one:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Rating</th>\n      <th>Meaning</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>★☆☆☆☆</td>\n      <td>very weak evidence</td>\n    </tr>\n    <tr>\n      <td>★★☆☆☆</td>\n      <td>weak evidence</td>\n    </tr>\n    <tr>\n      <td>★★★☆☆</td>\n      <td>decent evidence</td>\n    </tr>\n    <tr>\n      <td>★★★★☆</td>\n      <td>good evidence</td>\n    </tr>\n    <tr>\n      <td>★★★★★</td>\n      <td>great evidence</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Here are the results for the three papers that measured melatonin:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Study</th>\n      <th>Effect on melatonin</th>\n      <th>Quality of evidence</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Kayumov</td>\n      <td>↑↑↑</td>\n      <td>★★★★☆</td>\n    </tr>\n    <tr>\n      <td>Van der Lely</td>\n      <td>↑↑</td>\n      <td>★★★☆☆</td>\n    </tr>\n    <tr>\n      <td>Gabel</td>\n      <td>↑</td>\n      <td>★★★☆☆</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>And here are the results for the papers that measured sleep quality:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Study</th>\n      <th>Effect on sleep</th>\n      <th>Quality of evidence</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Burkhart</td>\n      <td>↑↑↑</td>\n      <td>★★★☆☆</td>\n    </tr>\n    <tr>\n      <td>Van der Lely</td>\n      <td>↔</td>\n      <td>★★☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Gabel</td>\n      <td>↔</td>\n      <td>★☆☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Esaki</td>\n      <td>↔</td>\n      <td>★★☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Shechter</td>\n      <td>↑↑↑</td>\n      <td>★★★☆☆</td>\n    </tr>\n    <tr>\n      <td>Knufinke</td>\n      <td>↑</td>\n      <td>★★☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Janků</td>\n      <td>↑↑</td>\n      <td>★★☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Esaki (again)</td>\n      <td>↑</td>\n      <td>★★☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Guarana</td>\n      <td>↑↑</td>\n      <td>★★☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Domagalik</td>\n      <td>↔</td>\n      <td>★☆☆☆☆</td>\n    </tr>\n    <tr>\n      <td>Bigalke</td>\n      <td>↔</td>\n      <td>★★☆☆☆</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>We should adjust all that a bit because of publication bias and so on. But still, here are my final conclusions after staring at those tables:</p>\n\n<ol>\n  <li>\n    <p>There is <strong>good</strong> evidence that blue-blocking glasses cause a <strong>moderate</strong> increase in melatonin. It could be large, or it could be small, but I’d say there’s an ~85% chance it’s not zero.</p>\n  </li>\n  <li>\n    <p>There is <strong>decent</strong> evidence that blue-blocking glasses cause a <strong>small</strong> improvement in sleep quality. This could be moderate (or even large) or it could be zero. It might be inconsistent and hard to measure. But I’d say there’s an ~75% chance there is <em>some</em> positive effect.</p>\n  </li>\n</ol>\n\n<p>I’ll be honest—I’m surprised.</p>\n\n<h2 id=\"so\">So….</h2>\n\n<p>If those effects are real, do they warrant wearing stupid-looking glasses at night for the rest of your life? I guess that’s personal.</p>\n\n<p>But surely the sane thing is not to <em>block</em> blue light with headgear, but to not create blue light in the first place. You can tell your glowing rectangles to block blue light at night, but lights are harder. Modern LED lightbulbs typically range in color temperature from 2700K for “warm” lighting to 5000 K for “daylight” bulbs. Judging from <a href=\"https://commons.wikimedia.org/wiki/File:Black_body_visible_spectrum.gif\">this animation</a> that should reduce blue frequencies to around 1/3 as much.</p>\n\n<p><img alt=\"\" src=\"https://dynomight.net/img/blue-light/Black_body_visible_spectrum.gif\" /></p>\n\n<p>Old-school incandescent bulbs are 2400 K. But to really kill blue, you probably want 2000K or even less. There are obscure LED bulbs out there as low as 1800K. They look <em>extremely</em> orange, but candles are apparently 1850K, so probably you’d get used to it?</p>\n\n<p>So what do we do then? Get two sets of lamps with different bulbs? Get fancy bulbs that change color temperature automatically? Whatever it is, I don’t feel very optimistic that we’re going to see a lot of RCTs where researchers have subjects install an entire new lighting setup in their homes.</p>"
            ],
            "link": "https://dynomight.net/blue-light/",
            "publishedAt": "2025-07-03",
            "source": "Dynomight",
            "summary": "<p>Back in 2017, everyone went crazy about these things:</p> <p><img alt=\"goggles\" src=\"https://dynomight.net/img/blue-light/goggles.png\" /></p> <p>The theory was that perhaps the pineal gland isn’t the <a href=\"https://plato.stanford.edu/entries/pineal-gland/\">principal seat of the soul</a> after all. Maybe what it does is spit out melatonin to make you sleepy. But it only does that when it’s dark, and you spend your nights in artificial lighting and/or staring at your favorite glowing rectangles.</p> <p>You could sit in darkness for three hours before bed, but that would be boring. But—supposedly—the pineal gland is only shut down by <em>blue</em> light. So if you selectively block the blue light, maybe you can sleep well and also participate in modernity.</p> <p>Then, by around 2019, blue-blocking glasses seemed to disappear. And during that brief moment in the sun, I never got a clear picture of if they actually work.</p> <p>So, do they? To find out, I read all the papers.</p> <h2 id=\"light-and-eyes\">Light and eyes</h2> <p>Before getting to the papers, please humor me while I give three excessively-detailed reminders about how light works. First, it comes in <a href=\"https://en.wikipedia.org/wiki/Visible_spectrum\">different wavelengths</a>.</p> <table> <thead> <tr> <th>Color</th> <th>Wavelength (nm)</th> </tr> </thead> <tbody> <tr> <td>violet</td> <td>380–450</td> </tr> <tr> <td>blue</td> <td>450–485</td> </tr> <tr> <td>cyan</td> <td>485–500</td> </tr> <tr> <td>green</td>",
            "title": "Do blue-blocking glasses improve sleep?"
        },
        {
            "content": [
                "<p><em>[Original thread here: <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than\">Missing Heritability: Much More Than You Wanted To Know</a>]</em></p><p>1: Comments From People Named In The Post<br />2: Very Long Comments From Other Very Knowledgeable People<br />3: Small But Important Corrections<br />4: Other Comments</p><h2>Comments From People Named In The Post</h2><p>Sasha Gusev of <a href=\"https://theinfinitesimal.substack.com/\">The Infinitesimal</a>, a leading critic of twin studies and the person whose views most inspired the post, <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129589398\">kindly replied</a>. His reply has four parts - I&#8217;ll address each individually. <strong>First, GxE interactions:</strong></p><blockquote><p>I think the post conflates gene-gene and gene-environment interactions; the latter (specifically interactions between genes and the \"shared\" environment) also get counted by twin models as narrow sense heritability. While I agree there is very little evidence for gene-gene interactions (particularly dominance, as you cite [and, interestingly, twin/adoption studies actually forecast a huge amount of dominance -- another discrepancy we do not understand]) there is quote substantial evidence for gene-environment interactions including on educational attainment (see Cheesman et al: <a href=\"https://www.nature.com/articles/s41539-022-00145-8\">https://www.nature.com/articles/s41539-022-00145-8</a> ; Mostafavi et al: <a href=\"https://elifesciences.org/articles/48376\">https://elifesciences.org/articles/48376</a>), IQ, and BMI. In fact, Peter Visscher led a paper that came to the conclusion that twin estimates for the heritability of BMI are very likely to be overestimated by gene-environment interactions (<a href=\"https://pubmed.ncbi.nlm.nih.gov/28692066/\">https://pubmed.ncbi.nlm.nih.gov/28692066/</a>). A large amount of GxE plus some amount of equal environment violation seems like a very plausible and parsimonious answer to the heritability gap.</p></blockquote><p>I asked Gusev:</p><blockquote><p>I'm having trouble understanding what you mean by GxE interactions explaining much missing heritability.</p><p>For the Scarr-Rowe interaction, this would make heritability look higher in high-SES families. But wouldn't this affect twin and molecular estimates equally unless there's some reason that subjects for one type of study are consistently from a different economic stratum than the other?</p><p>If we're thinking more about, let's say, a pair of fraternal twins where one of them is ugly and so parents don't invest resources in their education, wouldn't this show up equally in twin studies and GWAS? That is, if this is a very uncommon effect, we shouldn't expect it to affect large twin studies much. But if it's a common effect, then shouldn't we expect that every ugly person is less intelligent, and so GWAS will find that a gene for ugliness is associated with lower intelligence (both within and between families)? Can you give an example of a case why this would show up in twin studies, but not GWAS, RDR, etc? Also, why would we privilege this circuitous explanation (ugliness is genetic and provokes strong parental response) over the more direct explanation (intelligence is genetic)?</p><p>Also, the papers you cite show effects on the order of 2-8%pp; do you think the real effect is higher?</p></blockquote><p>He answered:</p><blockquote><p>Take the peanut allergy example [from a paywalled post of Lyman Stone&#8217;s]. Let's say in order to develop an allergy you need a mutation in the PNUT gene AND ALSO grow up in a household with <em>[ed: possibly this should be &#8220;without&#8221;]</em> early exposure to nuts (no Bamba!); that's a gene-environment interaction. For MZ twins, they will always share PNUT mutant (or wildtype) and 100% of their household exposure, so they'll be perfectly correlated on allergy; for DZ twins, they will share PNUT mutations half the time and 100% of their household exposure, so their correlation drops in half. So the twin study will tell you allergy is a 100% heritable trait. Now we test the PNUT variant in a GWAS, the first thing you do is throw away all the relatives (i.e. take one of each twin). Some people will be PNUT mutants and grow up in a household with no exposure and be allergy free, some will be PNUT mutants with exposure and will have allergy (and vice versa for the non-carriers). The resulting correlation between PNUT mutation and allergy will be low, so the heritability estimate will be &lt;100%. TLDR: in the ACE twin model (and sib-reg), AxA and AxC interactions get counted as A. In the GWAS (and RDR) model, AxA and AxC get counted as E. In my opinion AxA could plausible be considered \"heritability\" in the sense that it only relies on genes, but AxC cannot.</p></blockquote><p>Shouldn&#8217;t this be easily detectable in adoption studies? Adoptees have different family environments than their bio parents, so they should act like the unrelated people in GWASs. But in fact adoption studies get similar numbers to twin studies.</p><p>Also, shouldn&#8217;t this make polygenic scores <em>gain</em> predictive power within families, rather than lose it? After all, you&#8217;re restricting your analysis of genetic effects to people who are in the exact same environment. But in fact, every polygenic score loses a lot of predictive power when you do a within-family validation.</p><p>Also, shouldn&#8217;t this show up as nonlinear kinship-similarity curves? That is, siblings grow up in the same family, so you should see their similar genes exerting similar effects. But cousins grow up in different families, so you should see their similar genes exerting weaker effects. Granted, your family will be less different from your cousin&#8217;s family than from the average family in the population, but you could quantify how much more similar and you should see a corresponding drop in heritability. But in fact, heritability estimates decline linearly with shared DNA, the way a traditional, GxE-interaction-free model would suggest.</p><p>Also, shouldn&#8217;t this show up as high shared environment in twin studies? After all, it&#8217;s saying that many traits are heavily determined by the shared environment. Sure, in this example it&#8217;s genetically mediated. But for anything less than 100% genetic mediation, the remainder ends up in C. So you would need for the shared environment to have huge effects, but somehow never in a way that isn&#8217;t genetically mediated in every single pair of twins in an entire sample. </p><p>Also, if lots of apparent heritability is mediated by the shared environment, why would heritability estimates constantly increase over the lifespan, as people get further from the shared environment?</p><p>Elsewhere, Gusev linked <a href=\"http://gusevlab.org/projects/hsq/#h.eujbeu4ca5ot\">a more thorough explanation of his theory of interactions</a>. It&#8217;s pretty interesting, but (he admits) kind of the opposite of everyone else&#8217;s theory of interactions. Everyone else is looking for interactions where poor people have lower heritability of behavioral traits than rich people (because poor people might be malnourished/undereducated/etc, whereas rich people usually get enough resources to achieve their genetic potential, whatever it may be). But Gusev instead looks for interactions where <em>rich</em> people have lower heritability than <em>poor</em> people (because poor people face many challenges and their ability to overcome those challenges might depend on their genes, but rich people will do fine regardless of what genes they have). My impression is there are many studies on both sides; I&#8217;m not expert enough in the field to know whose studies are better or whether they can be reconciled, but it&#8217;s a bad omen that people looking for these effects can&#8217;t even agree on what the sign is.</p><p>And <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129590469\">maybeiamwrong2 here gives another good explanation</a> of Gusev&#8217;s theory of interactions and heritability.</p><p><strong>Second, usefulness of scores across ancestry groups:</strong></p><blockquote><p>You mention epidemiologists being the biggest losers of stratification in polygenic scores, but I think it is important to note a related group: the people who take polygenic scores trained in one population (with a ton of stratification) and directly apply them to other populations to make claims about innate abilities (see: <a href=\"https://theinfinitesimal.substack.com/p/how-population-stratification-led\">this post</a>). This is especially true for Edu/IQ GWAS, where every behavior geneticist has been screaming \"do not do that!\" since the very first study came out. People like Kirkegaard, Piffer, Lasker, etc. (and their boosters on social media like Steve Sailer and Cremieux) dedicated their careers to taking crappy GWAS data from and turning it into memes that show Africans on the bottom and Europeans on the top. These people also happen to be the court geneticists, so to speak, for SSC/ACX. I don't mean to come off as antagonistic and I'm sure some people will see this comment and immediately discount me as being an ideologue/Lysenkoist/etc so it does my broader position no favors, but this stuff has done and continues to do an enormous amount of damage to the field (including the now complete unwillingness of public companies like 23andme to collaborate on studies of sensitive traits</p></blockquote><p>Gusev later says he&#8217;s specifically referring to figures like this one from Davide Piffer (from <a href=\"https://www.qeios.com/read/HDJK5P.2\">here</a>; note that although the article looks nice and says &#8220;peer-approved&#8221; at the top, Qeios is not a real journal in the usual sense):</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!WQrV!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcedc0cf1-ca47-4e40-be25-353add80293d_592x489.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"462.56756756756755\" src=\"https://substackcdn.com/image/fetch/$s_!WQrV!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcedc0cf1-ca47-4e40-be25-353add80293d_592x489.png\" width=\"560\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>The horizontal axis is EA4, a polygenic score for predicted educational attainment, generally believed to correlate somewhat with IQ. The vertical axis is observed IQ of each group. Piffer&#8217;s point is that different ethnic groups&#8217; predicted genetic intelligence seems to correlate pretty well with their observed intelligence, so maybe group differences in intelligence are genetic.</p><p>Gusev notes that &#8220;every behavior geneticist has been screaming &#8216;do not do that!&#8217; since the very first study came out&#8221;, which is true. I know of three main reasons why this is a bad idea:</p><ol><li><p>Polygenic scores will mistake social factors correlated with genetic factors as genetic. For example, in a society where black people have lower IQ because of racism and poor access to schooling, people with a certain gene (the gene for black skin) will have lower IQ. Therefore, a study that blindly correlates genes with IQ will incorrectly assume that the gene for black skin is a gene for IQ/etc. This will ironically seem to justify the original inequality (it will look like black people &#8220;only&#8221; have low IQ for genetic reasons). This is by far the biggest problem with a plot like this one, and the one Gusev&#8217;s post above talks about - and the post offers a good example of a real result on height which encountered this exact problem.</p></li><li><p>Different ethnic groups could have different genetic structure of intelligence. That is, white people and black people might be equally intelligent, but because of different genes. If you train a predictor on white people, and then try to use it on black people, it will falsely conclude the black people are less intelligent because they have fewer of the white people intelligence genes.</p></li><li><p>Different groups could have the same intelligence genes, but in different <em>linkage disequilibrium</em>. That is, suppose Gene X and Gene Y are so close on the genome that they&#8217;re practically always inherited together. Scientists can&#8217;t isolate the effect of either, and they might only have one in their panel. Let&#8217;s say Gene X is in the panel, and Gene Y is an &#8220;intelligence gene&#8221;. Then the panel would show that Gene X is an intelligence gene. That&#8217;s fine as far as it goes - a score produced with that panel would still predict intelligence correctly. But if you apply it to a genetically different group, the assumption that Gene X and Gene Y always travel together might no longer hold. Then you might notice that black people lack Gene X, and incorrectly conclude that they lack an &#8220;intelligence gene&#8221;.</p></li></ol><p>I think all of these concerns are real and important. Piffer gestured at some weak statistical corrections he tried to do for [2] and [3], (see the sentence in his paper beginning &#8220;transferring polygenic scores across populations has proven challenging in this field of research&#8221;) but for problem [1], all he did was admit in the second-to-last paragraph that it might be a problem, and say that &#8220;the findings drawn from these tests should be viewed as provisional and subject to alteration&#8221;, which is obviously pretty weak for something this explosive and controversial.</p><p>On the other hand, I don&#8217;t fully understand how these issues apply here. AFAICT, the EA4 score used in this paper was constructed entirely from European people with &lt;3% non-white ancestry, so it doesn&#8217;t seem like it should be noticing under-educated black people in the sample and falsely concluding that black people&#8217;s genes cause low education. It must be claiming that black people have fewer of the genes that are associated with education <em>in a sample of white people</em>. It&#8217;s possible that you could still get population stratification (maybe because of the &lt;3% admixture in your supposedly European population?), but I think if that&#8217;s the theory then people should say it explicitly, or else explain what kind of alternate model they&#8217;re working from. (It&#8217;s also possible I totally misunderstood the claims that EA4 limits itself to people with European ancestry; if so, please let me know)</p><p>So maybe there&#8217;s more of a role here for problems [2] and [3], about the difficulty of applying a score trained on Europeans to non-European populations? My question there is - shouldn&#8217;t this produce nonsense results, rather than results which reflect the populations&#8217; real-world IQs? I think the counterargument here would have to be that by coincidence or colonialism, the populations with the furthest genetic difference from Europeans also happen to have the lowest real-world IQs (for social reasons) - or at least that this trend holds in a vague enough way to produce the vague correlation seen on the graph. There&#8217;s some evidence for this - this Piffer&#8217;s application of EA4 predicts that Chinese (real average IQ 105) have the same educational attainment as Puerto Ricans (real average IQ 82). So maybe it&#8217;s just showing average genetic distance from its European sample after all, and Chinese and Puerto Ricans are about equally distant on average? This wouldn&#8217;t explain why the predictor correctly finds that Ashkenazi Jews come out highest, but that could be because their &#8220;European&#8221; sample <em>did</em> include Ashkenazi Jews, and so here problem [1] <em>does</em> come in.</p><p>Except that later (Figure 7), Piffer graphs polygenic score for <em>height</em> against real <em>IQ</em> and finds no correlation, so it doesn&#8217;t seem like it&#8217;s just that polygenic scores naturally get lower as you get further from the group it was trained on. So now I&#8217;m back to being confused.</p><p>Maybe the best we can do is blame autocorrelation? That is, for all the data points on the graph, there are really only three clusters - Europeans, Africans, and everyone else. So you really only need ~3 unlucky coincidences to get this finding. And three unlucky coincidences, if you admitted they were three unlucky coincidences, wouldn&#8217;t be statistically significant, let alone &#8220;p = 7e-08&#8221; (lol). So maybe all the technical issues just explain why we shouldn&#8217;t take the scores seriously, and the answer to why it matches reality is a combination of &#8220;bad luck&#8221; and &#8220;it doesn&#8217;t really match reality that well, cf. the Chinese vs. Puerto Rican issue, but with enough autocorrelated data points even small coincidental matches look very significant&#8221;.</p><p>I&#8217;ve <a href=\"https://www.astralcodexten.com/p/contra-kavanaugh-on-fideism\">written before</a> about how there are a thousand skeptics speculating about the personality flaws of people who say false things for every one doing the hard work of rebutting them. So consider this my request for someone who knows more than I do to explain exactly what went wrong with Piffer&#8217;s analysis to produce this particular pattern.</p><p>I also take issue with Gusev&#8217;s claim that these people are &#8220;the court geneticists, so to speak, for SSC/ACX&#8221; - I don&#8217;t think I&#8217;ve ever interacted with Piffer or mentioned him on this blog before. You can see a partial list of actual geneticists I sent my Missing Heritability post to for review at the bottom of the post, and they&#8217;re mostly the same people that Gusev links to and endorses.</p><p>Some of the people who Gusev accuses of &#8220;dedicating their careers to&#8221; these kind of results also deny this, and say they partly share Gusev&#8217;s criticisms (<a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129785833\">1</a>, <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129784088\">2</a>)</p><p><strong>Third, the overall framing:</strong></p><blockquote><p>I'm going to gently push back against the hereditarian/anti-hereditarian framing (which I understand is probably here as shorthand and scene setting). I am personally interested in accurate estimates that are free of assumptions. I believe twin study estimates are of low quality because the assumptions are untestable, not because they are high. I also think the public fixation on twin studies has created some real and damaging anti-genetics and anti-psychiatry backlash and wrong-headed Blank Slate views. People hear about twin studies, look up the literature and find that <a href=\"https://lymanstone.substack.com/p/why-twin-studies-are-garbage\">peanut allergy (or wearing sunglasses, or reading romance fiction) is estimated to be highly heritable</a> and have minimal shared environment, start thinking that the whole field is built on nonsense, and end up at quack theories about how schizophrenia is actually a non-genetic fungal condition or whatever. I've been very clear that there are direct genetic effects on essentially every trait out there, including behavioral traits and IQ. If someone were to run a large-scale RDR analysis of IQ tomorrow and got a heritability of 0.9 and it replicated and all that, I would say \"okay, it looks like the heritability is 0.9 and we need to rethink our evolutionary models\". If anything, large heritability estimates would make my actual day job much easier and more lucrative because I could confidently start writing a lot of grants about all the genome sequencing we should be doing.</p></blockquote><p>This paragraph surprised me, because people coming up with crackpot non-genetic theories about schizophrenia is part of why I think it&#8217;s so important to explain that twin studies are usually pretty good! </p><p>Schizophrenia has about the same level of missing heritability as IQ, EA, or any other trait (80% heritable in twin studies, ~10% heritable in best polygenic predictors, ~25% heritable according to GREML). I don&#8217;t really understand on what grounds you can object to the twin heritability estimates of IQ/EA/etc, but believe the ones for schizophrenia.</p><p>Elsewhere it seems like Gusev seems to accept this equivalence. As he put it <a href=\"https://www.psychiatrymargins.com/p/a-critical-introduction-to-behavioral\">in a discussion</a> with psychiatry blogger Awais Aftab: &#8220;For schizophrenia, which was thought to be largely genetic, the most we can expect from a common variant polygenic score is an accuracy (R-squared) of ~0.24, with the current score reaching about a third of that (Trubetskoy et al. 2022)&#8230;even for these estimates, we do not yet know to what extent they may be inflated by the kind of stratification and confounding I&#8217;ve mentioned.&#8221; This is not the way I expect people to talk when part of the reason behind their work is not wanting people to mistakenly think schizophrenia is non-genetic! </p><p>I responded <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129628994\">here</a>, and Gusev responded to my response <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129752323\">here</a>.</p><p><strong>Fourth, the consistency of twin studies:</strong></p><blockquote><p>Lastly, it's not clear to me where the conclusion that well-validated twin studies converge on \"similar results\" is coming from. To take one example: the leading lights of behavior genetics (Deary, McGue, Visscher, etc) ran a study looking at the relationship between intelligence and lifespan (<a href=\"https://pubmed.ncbi.nlm.nih.gov/26213105/\">https://pubmed.ncbi.nlm.nih.gov/26213105/</a>). This is a nice study for us because they put together three large, modern, twin cohorts with IQ measurements, but the heritability of IQ was just a nuisance parameter for them, so they had no reason to scrutinize the findings or file-drawer them. If we look at their MZ/DZ correlations in Table S6 we find that the heritability of IQ was 0.36 in the US sample; 0.98 in the Swedish sample; 0.24 in the Danish sample; and ... 0.52 on average. In other words, all over the place (but averaging out to the nice \"half nature half nurture\" result you see in books); the authors themselves used an AE model in Table 2 and reported a range of 0.20 to 0.98. This is far greater than the variability we see with GWAS or Sib-Reg, so what are we to make of that?</p></blockquote><p>This is a comparatively minor point, but I respond <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129628994\">here </a>and he responds <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129752323\">here</a>.</p><p><strong>Eric Turkheimer (<a href=\"https://ericturkheimer.substack.com/\">blog</a>), another person named as an &#8220;anti-hereditarian blogger&#8221; in the post, <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129669406\">writes</a>:</strong></p><blockquote><p>You say, \"Turkheimer is either misstating the relationship between polygenic scores and narrow-sense heritability [or at least egging on some very confused people who are doing that],\" but in the passage you quote I am perfectly clear that I am talking about the DGE heritability, that is Column E from Supplemental Table 3. The value of .048 is the median of 17 (arbitrarily classified by me) \"behavioral\" DGE heritabilities taken from that column.</p></blockquote><p>I don&#8217;t want to get into another &#8220;did you communicate this poorly?&#8221; argument after the recent Tyler Cowen one, so I will just quote the Turkheimer paragraphs I objected to and let readers make their own decisions. This is from <a href=\"https://ericturkheimer.substack.com/p/is-tan-et-al-the-end-of-social-science\">Is Tan Et Al The End Of Social Science Genomes</a>:</p><blockquote><p><em>The median [direct genomic effect] heritability for behavioral phenotypes is .048. Let that sink in for a second. How different would the modern history of behavior genetics be if back in the 80s one study after another had shown that the heritability of behavior was around .05? When Arthur Jensen wrote about IQ, he usually used a figure of .8 for the heritability of intelligence. I know that the relationship between twin heritabilities and SNP heritabilities is complicated, and in fact the DGE heritability of ability is one of the higher ones, at .233<a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than#footnote-6-162316870\">6</a>. But still, it seems to me that the appropriate conclusion from these results is that among people who don&#8217;t have an identical twin, genomic information is a statistically non-zero but all in all relatively minor contributor to behavioral differences.</em></p></blockquote><h2>Very Long Comments By Other Very Knowledgeable People</h2><p><strong>Peter Gerdes (<a href=\"https://peteri394q.substack.com\">blog</a>) <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129497940\">writes</a>:</strong></p><blockquote><p>From an apriori point of view we should expect the relationship between genes and observed features to be incredibly complicated -- basically as complicated as the relationship between computer code and program operation -- and I'd argue the evidence we see is exactly what that model of highly complicated interactions predicts. Namely GWAS misses a bunch of twin study variation and so do simple non-linear models. Or to put the point differently the answer is the narrow/broad gap but broad hereditary is just really damn complicated.</p><p>Yes, people cite papers for the claim that non-linear effects don't seem to make the difference. But if you dig in the supposed evidence against non-linear effects (like you linked) are really only evidence against other very simple elaborations of the linear model. Showing that you don't predict much more of the variance by adding some simple non-linearity (eg dominance effects at a loci or quadratic terms etc) is exactly what you would expect if most effects are extremely complicated and neither model is even close to the complete causal story.</p><p>I mean, imagine that some OSS project like the Linux kernel gets bifrucated into a bunch of national variants which are developed independently with occasional merges between individual nation's versions (basically it acts like genes under recombination). Or better yet a Turing complete evolutionary programming experiment with complex behavior. Indeed this later one can be literally tested if people want.</p><p>We know in this case that code explains 100% of program variation and if you did the equivalent of a GWAS against it you would probably find some amount of correlations. I mean some perf improvements/behavior will be rarely discovered so they will be highly predicted by whether some specific code strings show up (they are all downstream of the initial mutation event) and other things like using certain approaches will have non-trivial correlation with certain keywords in the code.</p><p>But no linear model would actually even get close to capturing the true (indeed 100%) impact of code on those performance measurements. And it would look like there were no non-linear effects (in the sense of the papers claiming this in genetics) because adding some really simple addition to the linear model like \"dominance loci\" or whatever isn't going to do much better because you aren't anywhere close to the true causal model.</p><p>So the evidence we have is exactly what we should expect a priori -- genes have some really complicated (essentially Turing complete) relationship with observed behavior and simple models are going to guess at some of that but linear models will do about as well as simple non-linear ones until you break through some barrier.</p></blockquote><p>This is a great point, and it&#8217;s especially helpful to know that the papers demonstrating few-to-zero interaction effects are weak. </p><p>But <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1lkzao6/missing_heritability_much_more_than_you_wanted_to/mzwtr97/\">Lunaranus</a> on the subreddit links <a href=\"https://en.wikipedia.org/wiki/Epistasis#Evolutionary_consequences\">https://en.wikipedia.org/wiki/Epistasis#Evolutionary_consequences</a>, which points out that if there are many interactions, it&#8217;s hard for organisms to evolve, because the same mutation could have totally different effects depending on what&#8217;s going on elsewhere in the genome. It suggests that organisms &#8220;evolve for evolvability&#8221;, and one way they do this is trying to minimize interaction effects. But see bza9&#8217;s argument against <a href=\"https://substack.com/profile/178409780-bza9?utm_source=substack-feed-item\">here</a>.</p><p><a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129517437\">Demost</a> argues against the comparison to computer code, pointing out that genomes have to get mixed and matched every generation. If you had to run a computer off a Linux ecosystem where each line of code was separately randomly selected from among all extant distros every time you booted up your computer, probably it would end up pretty additive too.</p><p>Related: if GxG  interactions are a big deal, wouldn&#8217;t you expect outbreeding depression? Suppose that Europeans split from Africans 50,000 years ago and start evolving separately and getting different genes. Then evolution would make Europeans preferentially accumulate new mutations that interact beneficially with existing European mutations, and the same for Africans, with each population building a tower of adaptations atop previous genes. Then when the two populations interbreed, it should be a disaster - half the genes necessary for their carefully-evolved interactions are missing, and fitness plummets. But interracial children are just as healthy as within-race children. In fact, even interspecies hybrids like mules are pretty healthy (their inability to breed comes from an unrelated chromosome issue). So evolution can&#8217;t be using interactions like this.</p><p>I don&#8217;t have enough of a quantitative sense for this to know whether there can be strong interaction effects which aren&#8217;t adaptations and which evolution keeps trying to get rid of, but which stick around anyway.</p><p>Also on interactions, Steve Byrnes <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129514879\">added</a>:</p><blockquote><p><em>&gt; If nonadditive interactions are so important, why have existing studies had such a hard time detecting them?</em></p><p>Ooh, I have an extensive discussion of this in a recent post: <a href=\"https://www.lesswrong.com/posts/xXtDCeYLBR88QWebJ/heritability-five-battles\">https://www.lesswrong.com/posts/xXtDCeYLBR88QWebJ/heritability-five-battles</a> Relevant excerpts follow:</p><p><em>&#167;4.3.3 Possibility 3: Non-additive genetics (a.k.a. &#8220;a nonlinear map from genomes to outcomes&#8221;) (a.k.a. &#8220;epistasis&#8221;)</em></p><p>&#8230;Importantly, I think the nature of non-additive genetics is widely misunderstood. If you read the wikipedia article on epistasis, or Zuk et al. 2012, or any other discussion I&#8217;ve seen, you&#8217;ll get the idea that non-additive genetic effects happen for reasons that are very &#8220;organic&#8221;&#8212;things like genes for two different mutations of the same protein complex, or genes for two enzymes involved in the same metabolic pathway.</p><p>But here is a very different intuitive model, which I think is more important in practice for humans:</p><p>&#8226; Genome maps mostly-linearly to &#8220;traits&#8221; (strengths of different innate drives, synaptic learning rates, bone structure, etc.)</p><p>&#8226; &#8220;Traits&#8221; map nonlinearly to certain personality, behavior, and mental health &#8220;outcomes&#8221; (divorce, depression, etc.)</p><p>As some examples: &#8230;</p><p>&#8226; I think the antisocial personality disorder (ASPD) diagnosis gets applied in practice to two rather different clusters of people, one basically with an anger disorder, the other with low arousal. So the map from the space of &#8220;traits&#8221; to the outcome of &#8220;ASPD&#8221; is a very nonlinear function, with two separate &#8220;bumps&#8221;, so to speak. The same idea applies to any outcome that can result from two or more rather different (and disjoint) root causes, which I suspect is quite common across mental health, personality, and behavior. People can wind up divorced because they were sleeping around, and people can wind up divorced because their clinical depression was dragging down their spouse. People can seek out company because they want to be widely loved, and people can seek out company because they want to be widely feared. Etc.</p><p>&#8226; I dunno, maybe &#8220;thrill-seeking personality&#8221; and &#8220;weak bones&#8221; interact multiplicatively towards the outcome of &#8220;serious sports injuries&#8221;. If so, that would be another nonlinear map from &#8220;traits&#8221; to certain &#8220;outcomes&#8221;.</p><p>All of these and many more would mathematically manifest as &#8220;gene &#215; gene interactions&#8221; or &#8220;gene &#215; gene &#215; gene interactions&#8221;, or other types of non-additive genetic effects. For example, in the latter case, the interactions would look like (some gene variant related to thrill-seeking) &#215; (some gene variant related to bone strength).</p><p>But that&#8217;s a very different mental image from things like multiple genes affecting the same protein complex, or the Zuk et al. 2012 &#8220;limiting pathway model&#8221;. In particular, given a gene &#215; gene interaction, you can&#8217;t, even in principle, peer into a cell with a microscope, and tell whether the two genes are &#8220;interacting&#8221; or not. In that last example above, the thrill-seeking-related genes really don&#8217;t &#8220;interact&#8221; with the bone-strength-related genes&#8212;at least, not in the normal, intuitive sense of the word &#8220;interact&#8221;. Indeed, those two genes might never be expressed at the same time in the same cell&#8230;.</p><p>As far as I can tell, if you call this toy example &#8220;gene &#215; gene interaction&#8221; or &#8220;epistasis&#8221;, then a typical genetics person will agree that that&#8217;s technically true, but they&#8217;ll only say that with hesitation, and while giving you funny looks. It&#8217;s just not the kind of thing that people normally have in mind when they talk about &#8220;epistasis&#8221;, or &#8220;non-additive genetic effects&#8221;, or &#8220;gene &#215; gene interactions&#8221;, etc. And that&#8217;s my point: many people in the field have a tendency to think about those topics in an overly narrow way.</p><p>&#8230;</p><p><em>&#167;4.4.3 My rebuttal to some papers arguing against non-additive genetics being a big factor in human outcomes:</em></p><p>The first thing to keep in mind is: for the kind of non-additive genetic effects I&#8217;m talking about (&#167;4.3.3 above), there would be a massive number of &#8220;gene &#215; gene interactions&#8221;, each with infinitesimal effects on the outcome.</p><p>If that&#8217;s not obvious, I&#8217;ll go through the toy example from above. Imagine a multiplicative interaction between thrill-seeking personality and fragile bone structure, which leads to the outcome of sports injuries. Let&#8217;s assume that there are 1000 gene variants, each with a tiny additive effect on thrill-seeking personality; and separately, let&#8217;s assume that there&#8217;s a different set of 1000 gene variants, each with a tiny additive effect on fragile bones. Then when you multiply everything together, you&#8217;d get 1000&#215;1000=1,000,000 different gene &#215; gene interactions involved in the &#8220;sports injury&#8221; outcome, each contributing a truly microscopic amount to the probability of injury.</p><p>In that model, if you go looking in your dataset for specific gene &#215; gene interactions, you certainly won&#8217;t find them. They&#8217;re tiny&#8212;miles below the noise floor. So absence of (that kind of) evidence is not meaningful evidence of absence.</p><p>The second thing to keep in mind is: As above, I agree that there&#8217;s not much non-additive genetic effects for traits like height and blood pressure, and much more for things like neuroticism and divorce. And many papers on non-additive genetics are looking at things like height and blood pressure. So unsurprisingly, they don&#8217;t find much non-additive genetics.&#8230;</p><p>[Then I discuss three example anti-epistasis papers including both of the ones linked in OP.]</p></blockquote><p><strong>Andy B <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129518812\">writes</a>:</strong></p><blockquote><p>Sequencing technology doesn't get discussed nearly enough in this area. Illumina short-read sequencing/SNP panels have been the major source of data for all of these studies, and they are absolutely delightful at finding SNPs but are crap at anything else. I think it will be appreciated that generally things that impact function aren't SNPs, they are broad changes, and so much human genomics seems to be hoping that the thing that is contributing to a change is able to spotted by being close to a SNP, instead of actually looking at the thing that is causing the change.</p><p>Genomes aren't lists of SNPs, they are mostly repeats and 2x150bp isn't going to get anywhere near close to capturing that variation, no matter how 'deep' you sequence. Long-read sequencing (PacBio &amp; ONT, not Illumina's synthetic tech) is clearly better, and continues to demonstrate that there is massive variation that is easy to see when you have a bunch of 20kbp fragment, while almost impossible when you're just aligning little chunks of text to a 3gbp genome.</p><p>I work in non-model genomics and long-read sequencing is such a clear winner I keep getting surprised when Illumina gets contracts for these massive human studies. The Human Pangenome Consortium is going to be providing a dataset that is way more useful than anything that's come before. Anecdotally, I hear that for some non-European genomic data they know that ~10% of the data from an individual DOESN'T EVEN MAP to the human reference (but is human genomic data). This is all invisible to analysis, or even worse, just confounds things, as the 'true' causal SNP is somewhere in the data that doesn't get analysed, and so we're stuck looking at noise and trying to make sense of it.</p><p>I feel like this is such a blind-spot for human genomics, as it's always about the latest and greatest AI/ML method to try and get some information out, when it's the underlying data which just sucks and doesn't have a hope in actually being linked to function. There was even a point on an Open Thread a few weeks back (Open Thread 374 from tabulabio) asking for people to get in touch about Frontier Foundation Genomic models, with the focus being on fancy new ML architectures.</p><p>When I asked ChatGPT to write this comment for me (\"Argue that sequencing technology could explain a lot of the Missing Heritability problem\") it actually pushed back against me, trying to use the Wainschtein et al. 2022 paper as evidence that '...[this paper] used high-quality WGS (which includes better SVs than Illumina) and still found that adding rare and structural variants only modestly increased heritability estimates\", which is NOT TRUE. Wainschtein uses the TOPMED dataset, which is from Illumina short reads. Yes, they do 'deep' sequencing, and yes it's analysed to the absolute hilt with the latest and greatest GatK pipeline and QC to the max. But that claim is false, it's just lists of SNPs, completely ignores huge chunks of the genome and just hopes that the thing contributing to a phenotype is is able to be fished out alongside a SNP.</p><p>Another anecdote - an older friend's wife died from a brain cancer. He was an old-school non-model genomicist and got all of the data from the oncologists and various tests and analysed things. All of it short-read, none of it turned anything up, either from his or the various doctors. Long-read sequencing run was eventually done after her death and indicated that it was a splice variant missed by short-reads. It was clear as day in the long-read data, since it didn't need to do fancy bioinformatic de bruijn graphs to figure out the splice isoform - it's just mapping the read against the genome and seeing it clear as day.</p></blockquote><p>Thanks - this is helpful, especially the comments on Wainschtein. I asked Andy whether the products advertised as &#8220;whole genome sequencing&#8221; that sequence every base in the genome&#8221; get his seal of approval, and he said:</p><blockquote><p>I don't mean to sound hyperbolic but Illumina is kind of like the Illuminati. It's everywhere, monolithic and it's influenced genomics massively.</p><p>I had a quick look at a few \"whole genome sequencing\" retailers, and they&#8217;re usually using Next Generation Sequencing, which in most cases means Illumina. The phrase \"sequence every base in the genome\" sounds impressive, but it&#8217;s a bit misleading. Yes, they generate <em>reads</em> from across the whole genome, but they&#8217;re in tiny fragments, and only make sense once you align them to a reference genome.</p><p>That's where reference bias comes in. You mostly detect things that are similar enough to map cleanly, and just a little different to be able to be called a variant. That&#8217;s fine for common variants, but bigger or more complex stuff tends to get missed or misinterpreted.</p><p>To give a sense of scale, the human genome is about 3 billion base pairs long. When you get your Illumina WGS results back from a provider, you don&#8217;t get a 3 Gbp text file with your actual genome. What you usually get is a variant (VCF) file with just the differences compared to the reference genome. And that makes sense to some extent. Why include everything that's the same? But there&#8217;s a lot of complex or unmappable variation that just isn&#8217;t detected with short reads.</p><p>If you used long-read sequencing and actually assembled your genome, you could get pretty close to your actual full genome, including regions that are repetitive, messy, or just structurally different. You&#8217;d see things that are completely invisible in an Illumina dataset. And you'd have much higher confidence in the things you see, since a lot of the artifacts come from using short-read data.</p><p>That&#8217;s why basically all genomics in non-model organisms is happening with long reads now. At the International Congress of Genetics in 2023 (major conference that only happens every five years) the keynote speaker Mark Blaxter opened the meeting by saying we can finally get real, complete genomes thanks to long-read sequencing. He was talking specifically about the Darwin Tree of Life project, which is trying to sequence all eukaryotic species in the UK.</p><p>So yeah, most consumer WGS is Illumina, and it&#8217;s fine if all you want is common SNPs. But I can't wait for human genomics to migrate to long reads and overturn some of the perceived wisdom from two decades of Illumina dominance [&#8230;] PacBio and ONT are almost on the same level as Illumina in terms of cost/genome, and they ACTUALLY give you the whole genome!</p></blockquote><p>I&#8217;d like to hear from some statistical geneticists about whether they already knew all of this, and whether or not they agree that it&#8217;s a blind spot for their field.</p><p><strong>Vinay Tummarakota <a href=\"https://x.com/unboxpolitics/status/1938579699095277894\">writes </a>on Twitter (sorry for formatting issues coming from change from tweets &#8594; blockquote):</strong></p><blockquote><p>An article like this was definitely needed: easy to follow and outlines the conceptual territory well. Wanted to share some constructive feedback in this thread!</p><p><em>- - - - #1: Pedigree Studies</em></p><p>In the article, Alexander favorably cites pedigree-based studies (e.g. studies based on siblings &amp; cousins rather than just twins) to corroborate twin studies. However, I would like to respectfully push back against this line of reasoning.</p><p>First, his claim that extended pedigrees drop the EEA is not quite correct. For example, the Swedish study he cites uses an extended twin-family design which assumes the EEA (see the Supplemental Material).</p><p>Second, the Scotland pedigree estimates he cites are likely biased due to pop strat. In the RDR paper, @alextisyoung tests a method called &#8220;Kinship FE&#8221;. At a high-level, Kinship FE estimates heritability using a pedigree model which accounts for shared nuclear family environment. Importantly, this method is quite similar to the methods employed in the two Scotland papers cited by Alexander: Hill et al and Marioni et al (both estimate heritability using pedigrees while modeling the effects of the shared nuclear family environment). Using simulations, Dr. Young shows that Kinship FE is biased in the presence of genetic nurture or pop strat. This is because these processes induce correlations between genes and env beyond the nuclear family. Unfortunately, pop strat bias is not mitigated by PC adjustments. So the key question is: are these at play for cognitive phenotypes? The answer is maybe for genetic nurture &amp; yes for pop strat. Tan et al Figure 1 shows that pop strat biases estimation of genetic effects for IQ &amp; edu. Thus, pedigree estimates should be interpreted w/caution.</p><p><em>- - - - #2: Adoption Studies</em></p><p>Alexander also favorably cites adoption studies to corroborate twin studies. However, heritability estimates derived from adoption studies cannot be directly compared against heritability estimates derived from twin studies because the former are usually biased *upward* by assortative mating (AM) while the latter are usually biased *downward*. Why the difference? Well, Alexander estimates heritability as 2*rBM, not 2*(rBM - rAM) where rBM is the bio mom corr and rAM is the adoptive mom corr. Because children are &gt;50% genetically similar to their bio moms in the presence of AM, this formula over-estimates heritability. Conversely, in a twin study, heritability is 2 * (rMZ - rDZ). Because DZ twins are &gt;50% genetically similar in the presence of genotypic assortment, this formula under-estimates heritability. To be clear, I don&#8217;t know if adjusting for AM will make adoption studies discordant with twin studies. However, I think you should do this adjustment before claiming that adoption studies corroborate twin studies. I should also note that one of the adoption studies cited by Alexander does adjust for assortative mating (the SIBS study) so the devil really is in the details of each study.</p><p><em>- - - - #3: BMI Case Study</em></p><p>BMI is a very useful phenotype for the purposes of investigating missing heritability for several reasons. </p><p>(1) It&#8217;s a well-defined continuous phenotype, so less room for measurement artifacts to ruin things.</p><p>(2) Its population GWAS effects are highly correlated w/its within-family GWAS effects, so it&#8217;s possible to use whole genome studies (WGS) of unrelated individuals to quantify its heritability.</p><p>(3) There&#8217;s little evidence of genotypic assortment, so we can compare estimates from different methods w/o worrying about pesky AM bias.</p><p>(4) It&#8217;s a quasi-behavioral trait since BMI is impacted by behaviors, attitudes, etc.</p><p>So what does BMI reveal about missing heritability? Well, unfortunately, not much.</p><p>I&#8217;m not aware of a theoretical model which compellingly explains why RDR/WGS/quasi-random adoption estimate heritability lower than twin studies with SibReg in between.</p><p>To me, this reveals how complicated this debate really is. Even for a phenotype with many highly desirable theoretical properties, estimation of heritability is not consistent between methods. IMO, the way to resolve this issue moving forward is to conduct more unified analyses. In other words, apply each of the methods to the same cohort w/the same phenotype definition and see what happens. The RDR study was illuminating in this regard IMO. When sampling &amp; measurement artifacts can be ruled out, the only differences between methods should lie in their actual theoretical properties (e.g. the assumptions they make). The primary obstacle to this, however, is statistical power. This is why I&#8217;ll end this thread by re-iterating my desire to see more highly-powered RDR and SibReg analyses moving forward.</p><p>EDIT: Ah, already noticed a mistake in my own thread &#128529; Alexander is calculating adoption heritabilities using 2*rBM, not 2*(rBM - rAM). I was getting some quantities jumbled in my head as I wrote the thread, my bad! Nonetheless, I think the point about AM stands.</p></blockquote><p>I appreciate these thoughts, although most of these biases and corrections are small enough that I don&#8217;t expect them to make a big difference to the results, or to line up in the particular Swiss cheese hole way where they let a big error get through.</p><h2>Small But Important Corrections</h2><p><strong>Jorgen Harris (<a href=\"https://jorgenharris.substack.com/\">blog</a>) <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129772646\">corrects me</a> on the crime adoption study (linked in a tweet in the main post):</strong></p><blockquote><p>Scott and Cremieux are misinterpreting the posted study. The key line is: </p><p>&gt; <em>\"Note, however, that a genetic influence is not sufficient to produce criminal convictions in the adoptee. Of those adoptees whose biological parents have three or more convictions, 75 percent never received a court conviction. Another way of expressing this concentration of crime is that the chronic male adoptee offenders with biological parents having three or more offenses number only 37. They make up 1 percent of the 3,718 male adoptees in Table 2 but are responsible for 30 percent of the male adoptee convictions.\"</em></p><p>So, 1% of male adoptees in the study have a parent with three or more convictions *and* themselves have been convicted of a crime. 3/4 of children whose parents have been convicted 3+ times are never convicted. [So] male adoptees whose parents had 3+ convictions made up 4% of the sample, not 1%. The 1% are the 1/4 of those adoptees with any criminal convictions.</p><p>Bigger picture, I think this study is consistent with a world where, a) a large share of kids who end up committing crimes/having serious behavioral and emotional problems despite being raised by fairly normal families are adoptees (as Scott observed), and b) most adoptees raised by fairly normal families don't end up committing crimes/having serious behavioral and emotional problems.</p></blockquote><p>Thank you. The tweet said that the 1% of adoptees with the most criminal parents commit 30% of the crime, but should have said that the 4% of adoptees with the most criminal parents commit 30% of the crime. </p><p>I agree that the study says that many adoptees with criminal parents never commit crime at all. These two claims (high relative rate, low absolute rate) can only be simultaneously true if the base rate of criminal conviction is low. But the base rate isn&#8217;t that low - somewhere between 10-20% of Americans have a criminal conviction. But the study uses a poorly-signposted combination of Americans and Danes between 1895 and the present, and maybe the base rate in that group is lower.</p><p><strong>E0 <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129518777\">writes</a>:</strong></p><blockquote><p><em>&gt; \"In the degenerate case where the mother and father have exactly the same genes (&#8220;would you have sex with your clone?&#8221;) the fraternal twins will also share 100% of their genes.\"</em></p><p>Why is this so? If Mom and Dad both have genes (a, b) at one location, won't sometimes twin 1 get (a, a) while twin 2 will get (b, b)? Agree there's more commonality than normal because there's a possibility of 1 getting (a, b) while 2 gets (b, a), which isn't normally true.</p></blockquote><p>Thanks, I agree this is true and have edited the post.</p><p><strong>IAmChalzz on the subreddit <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1lkzao6/missing_heritability_much_more_than_you_wanted_to/mzvtgqn/\">discusses</a> several possible issues and biases. Most are the sort of minor weaknesses I expect from all studies and don&#8217;t bother me too much, but one is a frank error on my part:</strong></p><blockquote><p>Scott confuses standard errors with confidence intervals when reporting on RDR/Sib-reg results. For some reason, this literature consistently reports standard errors instead of confidence intervals, don't ask me why. Because Scott uses the nonoverlapping confidence intervals for different Sib-regression estimates as a strike against the consistency and credibility of this literature, this affects his argument quite a bit.</p></blockquote><p>Thanks for the correction, I&#8217;ve weakly edited this out of the piece, though not fully rewritten the piece to be as good as it would have been if I never made this error in the first place.</p><h2>Other Comments</h2><p><strong>Kveldred <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129492893\">writes</a>: </strong></p><blockquote><p>Anecdata: I went to a fancy Christian private school (because my parents bankrupted themselves to find a somewhat-tolerable schooling environment for their weird son, not because I grew up fancy myself), and two of my classmates&#8212;out of about 100 total&#8212;were adopted through a similar \"help the worst-off\" sort of idea on the part of the parents. It was /very evident/ that they were... different... from the rest; you'd guess they'd been adopted even if they hadn't freely admitted it. The girl, as far as I know, didn't do great but didn't get in trouble; her brother did, indeed, end up arrested for assault.</p></blockquote><p><strong>Brandon Berg <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129495557\">writes</a>:</strong></p><blockquote><p>Note that, although that the story you linked doesn't mention it, the study that found people with Norman names overrepresented at Oxford was by Greg Clark, who argues that very long-run persistence of social status is driven by genetics and highly assortative mating (0.8 on a latent measure of socioeconomic competence). So in this case it wouldn't be necessarily be confounding, because persistent differences between people with Norman and Saxon names might well be genetic.</p><p>The idea that truly exogenous economic endowments can persist over several generations has pretty weak empirical support, as I believe you mentioned in a post several years ago. Studies finding otherwise are likely confounded by genetics.</p><p>But there was also a St. Louis Fed study finding that the intergenerational correlation for residual wealth (i.e. wealth greater than or less than that predicted by earnings) is only about 0.2. Except perhaps in the most extreme cases, wealth has to be actively maintained and fortified by each successive generation, or even very wealthy families fall off the map within a few generations. Consider that less than a century after his death, there are no longer any Rockefellers on the Forbes 400 list.</p></blockquote><p>This started a long discussion on whether it was more likely that Normans were genetically more prone to education than Saxons, or that wealth imbalances could last 900 years.</p><p>In favor of Normans being genetically smarter - the Normans who invaded England were the <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129497170\">military aristocracy</a> of Normandy, which was itself descended from the military aristocracy of Denmark. If military aristocrats are selected from the smartest/strongest/healthiest portion of the population, then they might have better genes than the unselected Saxons.</p><p>In favor of wealth imbalances lasting 900 years, even if <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129594928\">this rarely happens in normal situations,</a> the Normans were titled aristocrats in a political system carefully designed to preserve the privilege of titled aristocrats over many generations.</p><p><strong>Vera Wilde (<a href=\"https://wildetruth.substack.com\">blog</a>) <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129502307\">asks</a>:</strong></p><blockquote><p>Did you ask the polygenic embryo selection folks about collider bias?</p><p>In the section comparing Kemper&#8217;s sib-regression estimate (14%) and Young&#8217;s Icelandic estimate (~40%), you note that the UK Biobank sample may be skewed toward healthier, higher-SES volunteers (so-called healthy volunteer bias, which commonly creates selection effects in medical research). But the implications of such selection effects extend far beyond variability in heritability estimates.</p><p>This kind of bias can flip signs when people think they're being clever by adjusting for confounds (collider stratification bias). This is especially a relevant risk in highly selected samples like the UK Biobank, where the same factors that influence participation (e.g., health, SES, education) may also affect the outcomes of interest (mental and physical health). Conditioning on variables that causally contribute to both participation and outcome can introduce more bias than it corrects for.</p><p>I wrote a bit about this <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129502307\">here</a>: Munaf&#242; et al.'s schizophrenia example illustrates the mechanism more clearly than I can easily argue it for IQ: people at higher genetic risk for psychosis may be less likely to volunteer for studies (\"they're out to get me, so I'm not giving them my blood\"). This warps the apparent genetic architecture in large datasets. Doing embryo selection against schizophrenia risk based on such a sample, from which high-risk individuals disproportionately self-selected out, could backfire. And parents who paid $50K for it might not know for 20 years (or ever).</p><p>Hopefully the real-life practical implications are trivial: if you pay $50K for a prospective 3-point IQ gain, and collider stratification bias turns it into a 3-point loss, no big deal? You probably won't notice over dinner, as long as your kid slept well last night.</p><p>But I remain curious how the corporations selling embryo selection address the possibility that they're accidentally giving parents the exact opposite of what they're paying for. My guess is: they just don't tell anybody, and there's something in the fine print saying they could be wrong and aren't liable. Causality probably can't be proven in any individual case, and anyway you're paying for a best effort process, not a result.</p></blockquote><p>I haven&#8217;t heard anything about people adjusting for this, but I&#8217;d like to hear from someone who knows more.</p><p><strong>rad1kal writes:</strong></p><blockquote><p>I would just want to add that Sidorenko 2024 (<a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC11835202/\">https://pmc.ncbi.nlm.nih.gov/articles/PMC11835202/</a>) that you cite for the discussion on rare variants also measure heritability using Sib-Regression although not for EA.</p><p>They show that correcting for assortative mating their estimates are coherent with twin studies :</p><p>\"Therefore, if we account for assortative mating and assume that the resemblance between siblings is solely due to genetic effects (and not to common environmental), then our data are consistent with a heritability of 0.87 (s.e. 0.05) for height in the current population (Supplementary Note).\"</p><p>they also show that shared environment estimates from twin studies are inflated by assortative mating :</p><p>\"Our results for height and BMI agree with that conclusion in that we find no evidence of a residual sibling covariance (&#119888;2) for BMI, while the significant &#119888;2 observed for height is largely explained by assortative mating.\"</p><p>And the WGS estimate is higher for height than the RDR estimates (55%), my take on this is that there is an assumption in RDR that posit that the environment of individuals are independent to each others and don't influence each others in correlation to the relatedness which since it's violated bias the estimate downward. (<a href=\"https://hereticalinsights.substack.com/i/146616013/disassortative-mating\">https://hereticalinsights.substack.com/i/146616013/disassortative-mating</a>)</p><p>\"Moreover, our estimates of 0.76 and 0.55 can also be compared to estimates from GWAS and WGS data. For height, the SNP-based estimate is about 0.55&#8211;0.60 (ref.41) and the WGS estimate ~0.70 (ref. 42; but with a large s.e. of ~0.10). These estimates imply that for height there is substantial genetic variation not captured by either SNP array and, to a lesser extent, sequence data, presumably ultra-rare variants (frequency &lt;1/10,000 not included in ref.42)\"</p></blockquote><p>I don&#8217;t entirely understand what&#8217;s going on here, and I challenged rad1kal on some of the assortative mating implications <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129535838\">here</a>, but the blog that rad1kal linked (their own? I&#8217;m not sure) has a much deeper discussion of the Equal Environment Assumption than I included in my post, see <a href=\"https://hereticalinsights.substack.com/i/146616013/eea-extensively-employed-assumption\">here</a>.</p><p><strong>Austen <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129655172\">writes</a>:</strong></p><blockquote><p><em>\"more home truths are to be learnt from listening to a noisy debate in an alehouse than from attending a formal one in the House of Commons. An elderly country gentlewoman will often know more of character, and be able to illustrate it by more amusing anecdotes taken from the history of what has been said, done, and gossiped in a country town for the last fifty years, than the best bluestocking of the age will be able to glean from that sort of learning which consists in an acquaintance with all the novels and satirical poems published in the same period. People in towns, indeed, are woefully deficient in a knowledge of character, which they see only in the bust, not as a whole-length. People in the country not only know all that has happened to a man, but trace his virtues or vices, as they do his features, in their descent through several generations, and solve some contradiction in his behaviour by a cross in the breed half a century ago.\"</em></p><p>people today would never be able to grasp and see the hereditary argument play out the way even a shrewd village person would who never left their town all their life did. by knowing personally each family of the village, and their qualities and characteristics, and seeing their kids develop and grow, and their kid's kids, and how the traits are passed down from each parent and renewed in their children in the subsequent generation, the weight of the hereditary argument in palpable.</p><p>instead we have people arguing about heritability who have never observed anything firsthand or took those observations to heart, from pure statistics and data, and contriving all sort of confounding theories.</p><p>when you go back farther to the 19th century and before, it was almost taken as a given that hereditary effects were very large, by anyone who seriously thought about it, reasoning from experience and their powerful intuitions.</p></blockquote><p>Strong disagree, I think this is actually a great example of why you need science and not just common sense.</p><p>When people just observed other people in their same villages, half of people thought \"look, people are like their parents, obviously genetics matters\", and the other half thought \"look, people are like their parents, obviously parenting matters\". It took twin studies - which can separate out genetics from parenting - to distinguish between these two hypotheses. And even then, millions of people rejected it because it disagreed with their \"common sense\" - \"But John is so nice! And his mother worked so hard to teach him niceness! Obviously his mother's parenting worked! That's just common sense!\"</p><p>In fact, I think the ways this picture presents an overly rosy view of village common sense go beyond that. I've read (I think this was in <em><a href=\"https://gwern.net/doc/sociology/1996-hiatt-argumentsaboutaborigines-ch7-conceptionandmisconception.pdf\">Arguments About Aborigines</a></em>, but not going to hunt for a full citation) that in many poor uneducated parts of Europe until the 18th or 19th century, people still didn't agree on whether the mother gave any genes to the child, or whether she was just the \"soil\" in which the father's \"seed\" could grow. Aborigines had the opposite problem - they thought possible a spirit impregnated the mother, and the sex act helped summon the spirit but the father's \"genetics\" (to the degree that they understood the term) didn't matter. The ancient Greeks had an even weirder view, <a href=\"https://en.wikipedia.org/wiki/Telegony_(inheritance)\">telegony</a>, where the child's paternal genetics were the sum of everyone who the mother ever had sex with.</p><p>I think it's only possible to romanticize this sort of \"village common sense\" because you and the villagers are the beneficiaries of millennia of careful science, tuning those common-sense intuitions.</p><p>(I do think villagers had one other advantage lots of moderns didn&#8217;t, which was that they closely observed animal breeding. But that&#8217;s not common sense - that&#8217;s access to important scientific data!)</p>"
            ],
            "link": "https://www.astralcodexten.com/p/highlights-from-the-comments-on-missing-ed5",
            "publishedAt": "2025-07-03",
            "source": "SlateStarCodex",
            "summary": "<p><em>[Original thread here: <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than\">Missing Heritability: Much More Than You Wanted To Know</a>]</em></p><p>1: Comments From People Named In The Post<br />2: Very Long Comments From Other Very Knowledgeable People<br />3: Small But Important Corrections<br />4: Other Comments</p><h2>Comments From People Named In The Post</h2><p>Sasha Gusev of <a href=\"https://theinfinitesimal.substack.com/\">The Infinitesimal</a>, a leading critic of twin studies and the person whose views most inspired the post, <a href=\"https://www.astralcodexten.com/p/missing-heritability-much-more-than/comment/129589398\">kindly replied</a>. His reply has four parts - I&#8217;ll address each individually. <strong>First, GxE interactions:</strong></p><blockquote><p>I think the post conflates gene-gene and gene-environment interactions; the latter (specifically interactions between genes and the \"shared\" environment) also get counted by twin models as narrow sense heritability. While I agree there is very little evidence for gene-gene interactions (particularly dominance, as you cite [and, interestingly, twin/adoption studies actually forecast a huge amount of dominance -- another discrepancy we do not understand]) there is quote substantial evidence for gene-environment interactions including on educational attainment (see Cheesman et al: <a href=\"https://www.nature.com/articles/s41539-022-00145-8\">https://www.nature.com/articles/s41539-022-00145-8</a> ; Mostafavi et al: <a href=\"https://elifesciences.org/articles/48376\">https://elifesciences.org/articles/48376</a>), IQ, and BMI. In fact, Peter Visscher led a paper that came to the conclusion that twin estimates for the heritability of BMI are very likely to be overestimated by gene-environment interactions (<a href=\"https://pubmed.ncbi.nlm.nih.gov/28692066/\">https://pubmed.ncbi.nlm.nih.gov/28692066/</a>). A",
            "title": "Highlights From The Comments On Missing Heritability"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-07-03"
}