{
    "articles": [
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>As soon as I was old enough to travel on my own, London was where I wanted to go. Compared to Copenhagen at the time, there was something so majestic about Big Ben, Trafalgar Square, and even the Tube around the turn of the millenium. Not just because their capital is twice as old as ours, but because it endured twice as much, through the Blitz and the rest of it, yet never lost its nerve. I thought I might move there one day.</div><div><br />That was then. Now, I wouldn't dream of it. London is no longer the city I was infatuated with in the late '90s and early 2000s. Chiefly because it's <a href=\"https://en.wikipedia.org/wiki/Ethnic_groups_in_London\">no longer full of native Brits</a>. In 2000, more than sixty percent of the city were native Brits. By 2024, that had dropped to about a third. A statistic as evident as day when you walk the streets of London now.<br /><br /></div><div>Copenhagen, by comparison, was about eighty-five percent native Danes in 2000, and is still three-quarters today. Enough of a foreign presence to feel cosmopolitan, but still distinctly Danish in all of its ways. Equally statistically evident on streets and bike lanes.</div><div><br />But I think, what would Copenhagen feel like, if only a third of it was Danish, like London? It would feel completely foreign, of course. Alien, even. So I get the frustration that many Brits have with the way mass immigration has changed the culture and makeup of not just London, but their whole country.</div><div><br />That frustration was on wide display in <a href=\"https://x.com/hashtag/FreedomMarch\">Tommy Robinson's march</a> yesterday. British and English flags flying high and proud, like they would in Copenhagen on the day of a national soccer match. Which was both odd to see but also heartwarming. You can sometimes be forgiven for thinking that all of Britain is lost in self-loathing, shame, and suicidal empathy. But of course it's not.<br /><br /></div><div>Recently, <a href=\"https://politiken.dk/danmark/art10414206/I-2096-kan-flertallet-i-Danmark-v%C3%A6re-indvandrere-eller-efterkommere#:~:text=I%202096%20vil%20der%20v%C3%A6re,indvandringstal%20forts%C3%A6tter%20pr%C3%A6cis%20som%20nu.\">a projection that Danes would be a minority in their own country by 2096</a> caused an enormous stir in Denmark. Politicians across the spectrum decried what a catastrophe that would be for this world's oldest continuous monarchy. But a demographic nightmare worse than that has already enveloped London!</div><div><br />So it's tough to blame the Brits for being pissed. No matter how hard they voted one way or the other, Brexit or no Brexit, the erosion of their national identity kept marching forward at an ever-greater pace. Not due to some unavoidable cosmic destiny, but due to equal parts policy and apathy. The boats kept coming, the <a href=\"https://news.sky.com/story/government-struggling-to-reduce-migrant-hotel-use-as-asylum-claims-hit-record-level-13415697\">migrant hotels kept expanding</a>, and the British authorities kept cracking down on anyone who dared criticize that trajectory or the present-day reality.<br /><br /></div><div>Which brings us back to Robinson's powerful march yesterday. The banner said \"March for Freedom\", and focused as much on that now distant-to-the-Brits concept of free speech, as it did on restoring national pride.</div><div><br />And for good reason! The totalitarian descent into censorious darkness in Britain has been as swift as its demographic shift. British police are now making <a href=\"https://freespeechunion.org/police-make-30-arrests-a-day-for-offensive-online-messages/\"><em>30 arrests a day</em></a> for wrongthink, wrongspeech, and other online transgressions against \"the regime narrative\", as the BBC would have reported, if this were a statistic from a foreign nation.<br /><br /></div><div>Most recently, five officers(!) came to arrest comedian Graham Linehan for illicit tweets. When much of the media reports a story like this, it's often without citing the specific words in question, such that the reader might imagine something far worse than what was actually said. So you should actually <a href=\"https://grahamlinehan.substack.com/p/i-just-got-arrested-again\">read the three tweets</a> that landed Linehan in jail, and earned him a legal restraining order against using X. It's grotesque. &nbsp;</div><div><br />The easy way out of this uncomfortably <a href=\"https://x.com/TRobinsonNewEra/status/1967299244026630608\">large gathering of perfectly normal, peaceful Brits</a> who've had enough is to tar them all as \"far right\". That's not just a British tactic, but one used across Europe, and previously in the US as well. It used to work very well, because the historical stigma was so strong, but, like hurling \"nazi\" and \"fascist\" at the most middle-of-the-road political figures and positions, it's finally lost its power.&nbsp;<br /><br /></div><div>I really feel for the Brits because it's not obvious how they get themselves out of this pickle. They're still reeling from <a href=\"https://www.economist.com/britain/2025/06/18/the-grooming-gangs-scandal-is-a-stain-on-the-british-state\">the Pakistani rape gangs</a> that were left free to terrorize cities like Rotherham and Rochdale for years on end with horror-movie-like scenes of the most despicable, depraved abuse of British girls. Unlike Linehan's tweets, I actually implore you not to peruse these stories too closely, though, because they'll make you sick. So how do you even begin to correct course?<br /><br /></div><div>I don't know. But I'm glad that there clearly are many Brits who are determined to find out. Unwilling to just let their society wither away while their bobbies chase bad tweets instead of <a href=\"https://www.standard.co.uk/news/crime/mobile-phone-theft-london-met-police-b1244212.html\">the rampant street thefts</a> or those barbaric rape gangs. Unwilling to resign the rest of the country to the kind of demographic replacement that befell London over the last two decades.<br /><br /></div><div>You can rest assured that I'd be in the streets waving a Danish flag if these were my conditions in my native country. I think that's a pretty universal sentiment. There's absolutely nothing racist or xenophobic in saying that Denmark is primarily a country for the Danes, Britain primarily a united kingdom for the Brits, and Japan primarily a set of islands for the Japanese.<br /><br /></div><div>Here's how the Danish Prime Minister, Mette Frederiksen of the Social Democrats, recently put it <a href=\"https://politiken.dk/danmark/politik/art10545758/%C2%BBPr%C3%B8v-at-sige-s%C3%A6tningen.-Folk-tror-jo-det-er-l%C3%B8gn%C2%AB\">in an interview</a>:<br /><br /></div><blockquote><em>There are really a lot of us Danes who believed that when people came to this ‘world’s best country’ and were given such good opportunities, they would integrate. They would become Danish, and they would never, ever harm our society. All of us who thought that way have been wrong.</em></blockquote><div><br />This is the challenge before not just the British establishment, but much of the European one too: To come to the realization of the Danish Prime Minister. Someone nobody could credibly charge with being \"far right\".<br /><br /></div><div>Which should give the Brits some solace. The Social Democrats in Denmark were once staunch believers in unfettered immigration and thought it dirty to even talk about <a href=\"https://x.com/jonatanpallesen/status/1845525384407953560\">the problems</a>, but eventually reality and public pressure led them to better ideas. Why shouldn't that be possible in the UK?&nbsp;<br /><br /></div><div>Don't give up. You survived the Blitz. Britain will be back.<br /><br />  <figure class=\"attachment attachment--preview attachment--lightboxable attachment--jpeg\">\n      <a href=\"https://world.hey.com/dhh/e7d38e64/blobs/eyJfcmFpbHMiOnsiZGF0YSI6MjI2Mzc5MjkzOCwicHVyIjoiYmxvYl9pZCJ9fQ--8d1b4309a3d813b00a54fbbb2eb04acf72d8a097be594870dab6db32be5191b9/london-flags.jpeg?disposition=attachment\" title=\"Download london-flags.jpeg\">\n        <img alt=\"london-flags.jpeg\" src=\"https://world.hey.com/dhh/e7d38e64/representations/eyJfcmFpbHMiOnsiZGF0YSI6MjI2Mzc5MjkzOCwicHVyIjoiYmxvYl9pZCJ9fQ--8d1b4309a3d813b00a54fbbb2eb04acf72d8a097be594870dab6db32be5191b9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplX3RvX2xpbWl0IjpbMzg0MCwyNTYwXSwicXVhbGl0eSI6NjAsImxvYWRlciI6eyJwYWdlIjpudWxsfSwiY29hbGVzY2UiOnRydWV9LCJwdXIiOiJ2YXJpYXRpb24ifX0--86fa621099aa99aa0c7ae156d97d21b387d30fa6ac57aa5c89948af503464a06/london-flags.jpeg\" />\n</a>\n  </figure><br /><br /></div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/as-i-remember-london-e7d38e64",
            "publishedAt": "2025-09-15",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>As soon as I was old enough to travel on my own, London was where I wanted to go. Compared to Copenhagen at the time, there was something so majestic about Big Ben, Trafalgar Square, and even the Tube around the turn of the millenium. Not just because their capital is twice as old as ours, but because it endured twice as much, through the Blitz and the rest of it, yet never lost its nerve. I thought I might move there one day.</div><div><br />That was then. Now, I wouldn't dream of it. London is no longer the city I was infatuated with in the late '90s and early 2000s. Chiefly because it's <a href=\"https://en.wikipedia.org/wiki/Ethnic_groups_in_London\">no longer full of native Brits</a>. In 2000, more than sixty percent of the city were native Brits. By 2024, that had dropped to about a third. A statistic as evident as day when you walk the streets of London now.<br /><br /></div><div>Copenhagen, by comparison, was about eighty-five percent native Danes in 2000, and is still three-quarters today. Enough of a foreign presence to feel cosmopolitan, but still distinctly Danish in all of its ways. Equally statistically evident on streets and bike lanes.</div><div><br />But",
            "title": "As I remember London"
        },
        {
            "content": [
                "<h3 id=\"about-that-mit-report\">About that MIT report…</h3>\n\n<p>Last month, the internet was abuzz about an MIT report with a dramatic headline: “<em>95% of generative AI pilots at companies are failing</em>.”</p>\n\n<p>Fortune <a href=\"https://fortune.com/2025/08/18/mit-report-95-percent-generative-ai-pilots-at-companies-failing-cfo/\">had the exclusive</a>, and paywalled the write up. The report itself, published by MIT’s NANDA<sup id=\"fnref:nanda\"><a class=\"footnote\" href=\"https://www.dbreunig.com/2025/09/15/ai-adoption-at-work-play.html#fn:nanda\" rel=\"footnote\">1</a></sup>, <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc8rU8OpQWU44gYDeZyINUZjBFwu--1uTbxixK_PRSVrfaH8Q/viewform\">could only be accessed by filling out a Google Form</a>. I don’t think many people actually read the report, but the headline was enough. Here’s what happened the next day:</p>\n\n<blockquote>\n  <p>Shares of megacap tech and big-name chipmakers declined. Nvidia shares lost 3.5%, while Advanced Micro Devices and Broadcom slipped 5.4% and 3.6%, respectively. Shares of high-flying software stock Palantir dropped more than 9%, making it the S&amp;P 500′s worst performer. Other major tech-related names such as Tesla, Meta Platforms, and Netflix were also under pressure.</p>\n</blockquote>\n\n<p>Since then, many have <a href=\"https://www.futuriom.com/articles/news/why-we-dont-believe-mit-nandas-werid-ai-study/2025/08\">criticized the methodology and conclusions of the report</a>. Too few executives were surveyed, those that were didn’t represent the entire market, and the report (on the whole) reads as an advertisement for NANDA’s mission rather than a peer-reviewed research paper (because it’s not).</p>\n\n<p>Someone could probably start a pretty good investment fund that just <em>reads the papers</em> behind the headlines that move the market.</p>\n\n<hr />\n\n<p>You can read the actual report <a href=\"https://www.artificialintelligence-news.com/wp-content/uploads/2025/08/ai_report_2025.pdf\">here</a>, without filling out any Google Forms. It’s worth skimming, as there are a few datapoints more interesting than the headline claim.</p>\n\n<p>From those, I want to highlight these two figures (emphasis mine):</p>\n\n<p><img alt=\"\" src=\"https://www.dbreunig.com/img/nanda_chart.jpg\" /></p>\n\n<p>For all the criticism of the NANDA report, it <em>is</em> a survey of many business leaders. We can treat it as such. So while we might take that 95% figure with a grain of salt, we <em>can</em> trust that business leaders <em>believe</em> the biggest reason their AI pilots are failing is because their employees are unwilling to adopt new tools… While 90% of employees surveyed eagerly use AI tools they procure themselves.</p>\n\n<p>A Simpson’s classic comes to mind:</p>\n\n<p><img alt=\"&quot;Am I out of touch? No, it's the children who are wrong.&quot; – Seymore Skinner\" src=\"https://www.dbreunig.com/img/skinner_children.jpg\" /></p>\n\n<p>The subject of employees using their own ChatGPT or Claude accounts at work has been heavily discussed for years. It’s frequently referred to as the “Shadow AI Economy,” and is a source of anxiety for IT leaders and inside counsel.</p>\n\n<p>Just this week, OpenAI <a href=\"https://www.nber.org/papers/w34255\">published a paper on ChatGPT usage</a> that validates this specter:</p>\n\n<p><img alt=\"\" src=\"https://www.dbreunig.com/img/chatgpt_work_usage.jpg\" /></p>\n\n<p>OpenAI’s report is excellent and provides a rare look at how people use ChatGPT<sup id=\"fnref:claude\"><a class=\"footnote\" href=\"https://www.dbreunig.com/2025/09/15/ai-adoption-at-work-play.html#fn:claude\" rel=\"footnote\">2</a></sup>: ~80% of usage is for learning, searching, and writing. Often to help them perform their work!</p>\n\n<p>Thinking about the two plots above, I am reminded of the iPhone’s arrival in the enterprise. When the iPhone arrived, it was not seen as a work device. IT organizations continued to provide BlackBerrys, with their IT-controlled <a href=\"https://en.wikipedia.org/wiki/Good_Technology\">email and messaging</a>. Nearly all IT teams didn’t think this would change. More than once, I heard IT managers reply to iPhone support requests with, “Just wait for the <a href=\"https://en.wikipedia.org/wiki/BlackBerry_Storm\">BlackBerry Storm</a>.”</p>\n\n<p>But you know who loved iPhones? The C-suite. And they asked their IT leaders to support the device. IT caved, “<a href=\"https://www.infoworld.com/article/2297842/byod-you-ain-t-seen-nothing-yet-2.html\">Bring Your Own Device</a>” became a thing, and four years later <a href=\"https://www.nytimes.com/2011/11/16/technology/businesses-too-have-eyes-for-ipads-and-iphones.html\">Apple was an option in the enterprise</a>.</p>\n\n<p>Which brings us back to the charts above: employees are using ChatGPT while managers grumble that their AI projects aren’t adopted. If I had to guess, I’d wager there are a few things going on:</p>\n\n<ol>\n  <li><strong>Most companies adopt AI products slowly, bottlenecked by legal and security.</strong> There’s a reason you see Llama 3.1 continue to show up in McKinsey surveys: once teams win approval to use a model, they are loath to go back to compliance to seek an upgrade. New models emerge monthly, but security reviews take <em>many months</em>. This applies to AI applications as well: if a company buys one and employees tell them it’s not great, no one’s eager to take on legal again.</li>\n  <li><strong>Bundle deals are poor substitutes for great chatbots.</strong> I’ve heard from many friends that their workplace-provided chatbot were selected for security and trust reasons (think Microsoft Copilot and others). Rather than wrestle with bad UX or bad answers, these people opt for BYOAI (bring your own AI), IT concerns be damned.</li>\n  <li><strong>It’s hard to separate personal from business use.</strong> This is a classic IT problem: when people can’t be bothered to switch accounts before asking a question. We see it with email, browsing, and more. Savvier users quarantine accounts in separate browsers, but most people just use what’s there.</li>\n</ol>\n\n<p>The topic deserves further study – I don’t think this will be as easy as the iPhone and BYOD was. But I do think the dominant bottleneck here is IT and compliance. If enterprises don’t stand up continual review processes, they’ll be doomed to be stuck with last year’s tools and models… Then wonder why no one is adopting their AI.</p>\n\n<p>Until then: employees will continue to opt for BYOAI.</p>\n\n<hr />\n\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/dbreunig\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <label for=\"bd-email\">Enter your email to receive the occasional update.</label>\n  <div class=\"form-input\">\n    <input id=\"bd-email\" name=\"email\" type=\"email\" />\n    <input type=\"submit\" value=\"Subscribe\" />\n  </div>\n</form>\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:nanda\">\n      <p>NANDA stands for, “Networked AI Agents in Decentralized Archtecture.” <a class=\"reversefootnote\" href=\"https://www.dbreunig.com/2025/09/15/ai-adoption-at-work-play.html#fnref:nanda\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:claude\">\n      <p>To Anthropic’s credit, they’ve <a href=\"https://www.anthropic.com/economic-index\">already published several usage reports</a>. <a class=\"reversefootnote\" href=\"https://www.dbreunig.com/2025/09/15/ai-adoption-at-work-play.html#fnref:claude\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>"
            ],
            "link": "https://www.dbreunig.com/2025/09/15/ai-adoption-at-work-play.html",
            "publishedAt": "2025-09-15",
            "source": "Drew Breunig",
            "summary": "Read beyond the headline of the recent MIT AI report and an interesting story emerges: executives chalk up AI failures to lack of employee adoption, while employees bring-their-own-AI to work.",
            "title": "Enterprise AI Looks Bleak, But Employee AI Looks Bright"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Meetups this week include Ann Arbor, Bangkok, Brussels, Cape Town, Charlotte, Frankfurt, Kyiv, Lisbon, Madrid, Paris, Portland, Philadelphia, San Jose, Santa Cruz, Sydney, Waterloo, and others; see <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-2025-times-and\">the meetup post</a> for more information. And Prague and St. Louis have been added to the list for October.</p><p><strong>2: </strong>Comments of the week: neuroscientists on the synaptic memory review (<a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity/comment/155141343\">1</a>, <a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity/comment/155156547\">2</a>, <a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity/comment/155208148\">3</a>); comments by Eliezer on my review of his book (<a href=\"https://www.astralcodexten.com/p/book-review-if-anyone-builds-it-everyone/comment/154920454\">on when to lift a ban</a>, <a href=\"https://www.astralcodexten.com/p/book-review-if-anyone-builds-it-everyone/comment/154927504\">on the parallel scaling story</a>)</p><p><strong>3: </strong>New subscribers-only post, <a href=\"https://www.astralcodexten.com/p/im-gruesome-for-newsom\">I&#8217;m Gruesome For Newsom</a>:</p><blockquote><p>The case for Gavin Newsom is simple. The Republicans nominated someone with no positive qualities, and they won bigly. Now it is our turn to nominate someone with no positive qualities.</p><p>Positive qualities, the case goes, are overrated. They can get you a billion dollars, or a Nobel, or some other consolation prize. To become President, you must be chosen by God.</p><p>Donald Trump was chosen by God. You can tell because he's invincible. He can wriggle out of scandals that would sink Tricky Dick Nixon ten times over. He can run on a platform of punishing illegal immigrants, and the illegal immigrants themselves will rally to his banner. He can support Israel harder than anyone has ever supported it before, and Arab-Americans will break fifty years of Voting Blue No Matter Who to march behind him. He can get 100% evangelical backing while oozing contempt for Christianity, 100% libertarian support while trampling the Constitution, and 100% allegiance from Wall Street while dismantling global trade. KKK wizards and celebrity rappers compete to compliment him loudest; Nazis and the ADL jostle past each other to sing his praises. Shooting him in the head only makes him stronger.</p><p>To posit Trump's divine election is not to imply he has any positive qualities. When the Israelites stopped obeying the commandments, God punished them by raising an incompetent idolator named Jeroboam to the throne. Jeroboam started a disastrous war that killed 500,000 of his own men, after which his dynasty collapsed and his entire family was slain. Jeroboam was chosen by God to crush and humiliate Israel. But he <em>was</em> chosen by God. Has America been obeying the commandments lately?</p><p>The Bible describes the specific way that divine election works . . . </p></blockquote><p>Read it <a href=\"https://www.astralcodexten.com/p/im-gruesome-for-newsom\">here</a>.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-399",
            "publishedAt": "2025-09-15",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Meetups this week include Ann Arbor, Bangkok, Brussels, Cape Town, Charlotte, Frankfurt, Kyiv, Lisbon, Madrid, Paris, Portland, Philadelphia, San Jose, Santa Cruz, Sydney, Waterloo, and others; see <a href=\"https://www.astralcodexten.com/p/meetups-everywhere-2025-times-and\">the meetup post</a> for more information. And Prague and St. Louis have been added to the list for October.</p><p><strong>2: </strong>Comments of the week: neuroscientists on the synaptic memory review (<a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity/comment/155141343\">1</a>, <a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity/comment/155156547\">2</a>, <a href=\"https://www.astralcodexten.com/p/your-review-the-synaptic-plasticity/comment/155208148\">3</a>); comments by Eliezer on my review of his book (<a href=\"https://www.astralcodexten.com/p/book-review-if-anyone-builds-it-everyone/comment/154920454\">on when to lift a ban</a>, <a href=\"https://www.astralcodexten.com/p/book-review-if-anyone-builds-it-everyone/comment/154927504\">on the parallel scaling story</a>)</p><p><strong>3: </strong>New subscribers-only post, <a href=\"https://www.astralcodexten.com/p/im-gruesome-for-newsom\">I&#8217;m Gruesome For Newsom</a>:</p><blockquote><p>The case for Gavin Newsom is simple. The Republicans nominated someone with no positive qualities, and they won bigly. Now it is our turn to nominate someone with no positive qualities.</p><p>Positive qualities, the case goes, are overrated. They can get you a billion dollars, or a Nobel, or some other consolation prize. To become President, you must be",
            "title": "Open Thread 399"
        },
        {
            "content": [
                "<p>All the news that’s fit to print, but has nowhere to go.</p>\n\n\n<h4 class=\"wp-block-heading\">Important Rules Reminder</h4>\n\n\n<p>This important rule is a special case of an even more important rule:</p>\n<blockquote><p><a href=\"https://x.com/HedgeDirty/status/1966146960450306262\">Dirty Hexas Hedge</a>: One of the old unwritten WASP rules of civilization maintenance we&#8217;ve lost is: when someone behaves insincerely for the sake of maintaining proper decorum, you respond by respecting the commitment to decorum rather than calling out the insincerity.</p></blockquote>\n<p>The general rule is to maintain good incentives and follow good decision theory. If someone is being helpful, ensure they are better off for having been helpful, even if they have previously been unhelpful and this gives you an opportunity. Reward actions you want to happen more often. Punish actions you want to happen less often. In particular beware situations where you punish clarity and reward implicitness.</p>\n<div>\n\n\n<span id=\"more-24720\"></span>\n\n\n</div>\n<p>Another important rule would be <a href=\"https://x.com/elonmusk/status/1965681129404703206\">that contra Elon Musk here</a> you shouldn’t ‘sue into oblivion’ or ‘ostracize from society’ anyone or any organization who advocated for something you disagree with, even if it plausibly led to a bad thing happening.</p>\n<p>Even more importantly: When someone disagrees with you, you don’t use the law to silence them and you most definitely don’t choose violence. Argument gets counterargument. Never bullet, no arrest, no fine, always counterargument. I don’t care what they are advocating for, up to and including things that could plausibly lead to everyone dying. It does not matter. No violence. No killing people. No tolerance of those who think they can have a little violence or killing people who disagree with them, as a treat, or because someone on the other side did it. No. Stop it.</p>\n<p>This seems like one of those times where one has to, once again, say this.</p>\n\n\n<h4 class=\"wp-block-heading\">Bad News</h4>\n\n\n<p>This seems like a lot of percents?</p>\n<blockquote><p><a href=\"https://x.com/bdomenech/status/1957043590435348556\">Benjamin Domenech</a>: New death of the West stat: 42 percent of people in line to meet Buzz Lightyear at Disney theme parks last year were childless adults.</p>\n<p>Source: author A.J. Wolfe on Puck&#8217;s The Town podcast.</p>\n<p><a href=\"https://x.com/politicalmath/status/1957044897569206555\">PoliMath</a>: When I went to Disney in 2019, my kids were in line to meet Sleeping Beauty and the guy in front of us was a 30ish single dude who gave her a bouquet of roses and weirdly fawned over her. I admired the actress for not displaying her disgust.</p></blockquote>\n<p>If that is who gets the most value out of meet and greets, okay then. It also presumably isn’t as bad as it sounds since it has been a long time since Buzz Lightyear has been so hot right now, I presume characters in recent movies have a different balance. The price sounds sufficiently high that they should add more copies of such characters for meet and greets until the lines are a lot shorter? How could that not raise profits long term?</p>\n<p><a href=\"https://x.com/KelseyTuoc/status/1957167201506779140\">Some notes from Kelsey Piper on literary fiction.</a></p>\n<blockquote><p>A-100 Gecs (1m views): the pearl-clutching about no young white men being published in The New Yorker is so funny like men, writ large, are basically a sub-literate population in the US. men do not read literary fiction. if you have even a passing interaction with publishing you realize this.</p>\n<p>Kelsey Piper:</p>\n<ol>\n<li>Open disdain for people on the basis of their sex is bigoted and bad.</li>\n<li>Men obviously did read and write literary fiction for most of the history of literary fiction; so, if that has changed, I wonder why it has changed! Perhaps something to do with the open disdain!</li>\n</ol>\n<p>Like in general, I try not to waste too much of my time on “this hobby has too few Xs” or “this hobby has too few Ys,” since that can happen totally organically, and pearl-clutching rarely helps.</p>\n<p>However, if the hobbyists are saying “our hobby has no men because they are a ‘subliterate population,’” then I suddenly form a strong suspicion about why their hobby has no men, and it’s not that people innocently have different interests sometimes.</p></blockquote>\n<p><a href=\"https://x.com/robertwiblin/status/1957757503678107684\">John Murdoch gives us many great charts in the FT</a>, but often we lack key context and detail, because as John explains he only has very limited space and 700 words and everything needs to be parsable by a general audience, so spending space on methodology or a full y-axis is very expensive. We appreciate your service, sir. It would still be great to have the Professional Epistemically Ideal Edition available somewhere, any chance we can do that?</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/08/the-decline-in-reading-for-pleasure.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-decline-in-reading-for-pleasure\">Reading books for pleasure continues to decline by roughly 3% per year</a>. Alternatives are improving, while books are not improving, indeed the best books to read are mostly old books. So what else would you expect? Until recently I would say people are still reading more because a lot of screen use is reading, but now we have the rise of inane short form video.</p>\n<p><a href=\"https://www.theguardian.com/wellness/2025/sep/04/quit-lying-white-lies\">Madeleine Aggeler figures out very basic reasons</a> why you might want to not be constantly lying, and that she would be better off if she stopped lying constantly and that you really can tell people when you don’t want to do something, yet she fails to figure out that not lying does not require radical honesty. You can, and often should, provide only the information needed.</p>\n<p><a href=\"https://x.com/nntaleb/status/1960283572671021099\">The IQ tests we have are drawn from a compact pool of question types and so can, unsurprisingly, be trained for and gamed</a>. If you want to raise the result of your IQ test this way, you can totally do that. Goodhart’s Law strikes again. That doesn’t mean IQ is not a real or useful thing, or that these tests are not useful measures. It only means that if you want to make the (usually low-IQ) move of pretending to be higher IQ than you are by gaming the test, you can do that. So you need to not give people strong incentive to game the tests.</p>\n<p>I often hear discussion of ‘masking’ where autistics learn how to fake not being autistic and seem like normies, or similarly <a href=\"https://x.com/SilverVVulpes/status/1960334243487232403\">where sociopaths learn not to act like sociopaths (in the clinical sense, not the Rao Gervais Principle sense) and seem like normies</a>, because they realize that works out better for them. I mention this because I notice I rarely hear mention of the fact that (AIUI) the normies are mostly doing the same exact thing, except that they more completely Become The Mask and don’t see it as a strange or unfair or bad thing to do this kind of ubiquitous mimicry, and instead do it instinctively?</p>\n<p><a href=\"https://x.com/PaulSkallas/status/1961512072094560289\">There is an obvious incentive problem here</a>, very central and common.</p>\n<blockquote><p>Eugyppius: when you’re with girl, do not quietly remove bugs. call her attention to bugs first, then heroically remove them for her. they love this.</p>\n<p>Lindy Man: This is also good advice for the workplace. Never fix anything quietly.</p>\n<p>Sean Kelly: When I discover a bug and figure out the solution, I don&#8217;t fix it.</p>\n<p>I have an accomplice report it and play up how bad it is in the stand up.</p>\n<p>Then I sagely chime in, &#8220;I bet I can figure that one out.”</p>\n<p>If the bug looks tough, the accomplice suggests the H-1B with the shortest queue.</p>\n<p>Caroline: People will fix things quietly and then complain they’re underappreciated. Does anyone even know what you did? lol</p>\n<p>Kyle Junlong: ah yes, &#8220;half the work is showing your work.&#8221;</p>\n<p>honestly this is so powerful. i&#8217;m realizing how valuable communication and visibility is, not just in work but in relationships and life.</p>\n<p>i used to think managing other people&#8217;s perception of me was stupid and frivolous, but now i realize how *i* judge other people is solely based on my perception (eg., the convenient information) i have of them. so of course it makes sense to present myself well, because i like those who do present themselves well to me.</p></blockquote>\n<p>Over time, if you don’t take credit for things, people notice that you silently fix or accomplish or improve things without taking credit or bothering anyone about it, and you get triple credit, for fixing things, for doing it seamlessly and for not needing or requesting credit. The problem is, you need a sufficiently sustained and observed set of interactions, and people sufficiently aware of the incentive dynamics here, so that you can move the whole thing up a meta level.</p>\n<p>There is also the reverse. If you know someone who will always loudly take credit, you know that at most they are doing the things they loudly take credit for. If that.</p>\n\n\n<h4 class=\"wp-block-heading\">Inequality Within Salient Comparables</h4>\n\n\n<p>I am generally skeptical that we should worried about inequality, as opposed to trying to make people better off. One danger that I am convinced by is that <a href=\"https://x.com/davidmanheim/status/1964601397493805546\">extreme inequality that is directly in your fac</a>e can damage your mental health, if you see yourself in competition with everyone on the spectrum rather than being a satisficer or looking at your absolute level of wealth and power.</p>\n<blockquote><p><a href=\"https://x.com/goodalexander/status/1958858220060963274\">Good Alexander:</a> I think the main reason you find a lot of very unhappy tech people even at the highest levels</p>\n<p>&#8211; when you&#8217;re a typical employee everyone around you is making .5-2x what you are</p>\n<p>&#8211; when you start breaking out wealth goes on log scale. ppl with 10-1000x your net worth become common</p>\n<p>&#8211; this is native to network effects, scale associated with AI training, and other winner take all dynamics in tech</p>\n<p>&#8211; all of VC is structured this way as well &#8212; (1 unicorn returns entire fund rest of investments are zero) which psychologically reinforces all or nothing thinking</p>\n<p>&#8211; this makes competitive people miserable</p>\n<p>&#8211; this leads them to do hallucinogens or other psychoactive substances in order to accept their place in the universe</p>\n<p>&#8211; the conclusions drawn from these psychoactive substances are typically at direct odds with how they got to where they are</p>\n<p>&#8211; and after getting one shotted they&#8217;re still ultimately in a hard wired competition with people worth 10-1000x more than them</p>\n<p>&#8211; due to the structure of technology it becomes more or less impossible to break out of your &#8216;bracket&#8217; without engaging in increasingly dark things</p>\n<p>&#8211; you realize that time is running out &#8212; and become aware of synthetic biology (peptides, genetic alteration of children)</p>\n<p>&#8211; you end up getting involved in police state investments, gooning investments, or crypto &#8212; and view it as non optional to take the gloves off bc everyone around you is doing the same thing</p>\n<p>&#8211; you&#8217;re on a permanent hedonic treadmill and you can&#8217;t ever get off or go back to where you were before bc after doing all of the things you&#8217;ve done you can&#8217;t possibly ever relate to normal humans</p>\n<p>&#8211; you get involved with politics or Catholicism or other Lindy cults to try and get off the treadmill</p>\n<p>&#8211; of course it won&#8217;t work and you bring all the weird baggage directly into politics or religion and poison those wells too</p>\n<p>the current configuration of economics/ wealth distribution is pretty solidly optimized to drive the wealthiest people in society batshit insane, which &#8211; to some extent &#8211; explains a lot of things you see around you</p>\n<p>w this framework you can understand:</p>\n<p>* Thiel Antichrist obsession</p>\n<p>* Kanye getting into Hitler and launching a coin</p>\n<p>* Trump memeing himself into becoming President then running again to escape imprisonment</p>\n<p>* Elon generating Ani goon slop on the TL</p>\n<p>* A16z wilding out</p>\n<p>Eliezer Yudkowsky: &#8211; supposed &#8220;AI safety&#8221; guys (outside MIRI) founding AI companies, some of whom got billions for betraying Good and Law.</p>\n<p>I have felt a little pressure to feel insane about that, but it is small compared to all the other antisanity pressures I&#8217;ve resisted routinely.</p>\n<p><a href=\"https://x.com/davidmanheim/status/1964601397493805546\">David Manheim</a>: This is definitely not wrong, even though it&#8217;s incomplete:</p>\n<p>&#8220;the current configuration of economics/ wealth distribution is pretty solidly optimized to drive the wealthiest people in society batshit insane, which &#8211; to some extent &#8211; explains a lot of things you see around you&#8221;</p></blockquote>\n<p>Speaking from experience, it is quite the trip to be in regular contact and debates with various billionaires. It can definitely make one feel like a failure or like it’s time to make more money, even though I have enough money to not worry about money, especially when you think you definitely could have joined them by making different life choices, and there’s a chance I still could. Whereas, when in prior phases of life I was not in such contact, it was easy not to care about any of that.</p>\n<p>It helps to remind myself periodically that if I had a billion dollars, I could make the world a better place, but except insofar as I prevented us all from dying my own life would, I anticipate, not actually be better as a result. At that level, there isn’t that much more utility to buy, whereas <a href=\"https://www.youtube.com/watch?v=yYzrSGRzttk&amp;pp=ygUYbW9yZSBtb25leSBtb3JlIHByb2JsZW1z\">more money, more problems.</a></p>\n\n\n<h4 class=\"wp-block-heading\">Artful Dodge</h4>\n\n\n<p>It’s not easy buying art.</p>\n<blockquote><p><a href=\"https://x.com/coldhealing/status/1956730079163060612\">cold</a>: Bro you make $500k at OpenAI you can go to the art fair and buy a little $10,000 painting to hang up in your SF apartment&#8217;s living room</p>\n<p>You tell them this and then they&#8217;ll be like &#8220;I&#8217;m sorry <img alt=\"🥺\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f97a.png\" style=\"height: 1em;\" /> do you think a $15,000 desert meditation retreat will fix me so I&#8217;m not like this anymore??&#8221;</p>\n<p><a href=\"https://x.com/paulg/status/1956851810167308464\">Daniel</a>: The lack of personal art purchasing in SF is insane. A $3000 oil on canvas can change your whole living room and they won’t do it.</p>\n<p>I know people who earn much more than $500k at openai and their living rooms are making them depressed.</p>\n<p>Paul Graham: The main reason rich people in SV don&#8217;t buy art is that it does actually take some expertise to do it well. And since the kind of people who get rich in SV hate to do things badly, and don&#8217;t have time to learn about art now, they do nothing.</p>\n<p>diffTTT: Rich SV people need an expert to tell them what kind of art they like?</p>\n<p><a href=\"https://x.com/paulg/status/1956851810167308464\">Paul Graham</a>: In a way. They need to learn how not to be fooled by meretricious art, how to avoid the immense influence of hype and fashion, etc. Most people have to figure this out for themselves or from books, but a truly competent expert could help.</p></blockquote>\n<p>If it takes some expertise to buy art well, that is a real problem with buying art. The thing is, if you do not buy art well, you will lose most of the money you spent on art, and also you will look like a fool, and also the art will not make you feel better or much improve your living room.</p>\n<p>That leaves four options.</p>\n<ol>\n<li>The one these people and I have taken, which is to not buy art.</li>\n<li>Buy cheap art that you don’t mind looking at. Safe, but still annoying to do, and then you have to look at it, does it actually make you feel better?</li>\n<li>Spend a lot of time figuring out how to buy expensive art properly. Yeah, no. I understand that Paul Graham can be in renaissance man mode, but if you are coding at OpenAI at $500k+ per year the cost of this is very, very high, and also you probably don’t expect the skill to stay relevant for long.</li>\n<li>Find someone you trust to do it for you? Not cheap, not all that easy or quick to do either, and you are still the one who has to look at the damn thing.</li>\n</ol>\n<p>Besides, who is to say that a constant piece of artwork actually helps, especially if it doesn’t hold particular meaning to you? I mean, yeah, in theory yeah we should get some artwork here, I suppose, but no one wants to do the work involved, also it should definitely be cheap art. At one point I bought some Magic: The Gathering prints for this but we never got around to hanging them.</p>\n<p>Also at one point I tried to buy the original art for Horn of Greed, which at the time would have cost like $3k. I say tried because my wife wouldn’t let me, but if anyone wants to buy me a gift at some point, that or another original Magic art I’d look back on fondly seems great.</p>\n\n\n<h4 class=\"wp-block-heading\">Whether Weather</h4>\n\n\n<p>If there is one thing to learn from rationality: Peter Wildeford is 100% right here.</p>\n<blockquote><p><a href=\"https://en.wikipedia.org/wiki/Wet_bias\">Wikipedia (Wet Bias)</a>: <strong>Wet bias</strong> is the phenomenon whereby some <a href=\"https://en.wikipedia.org/wiki/Weather_forecasting\">weather forecasters</a> report an overestimated and exaggerated probability of <a href=\"https://en.wikipedia.org/wiki/Precipitation\">precipitation</a> to increase the usefulness and actionability of their forecast.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/The_Weather_Channel\">The Weather Channel</a> has been empirically shown, and has also admitted, to having a wet bias in the case of low probability of precipitation (for instance, a 5% probability may be reported as a 20% probability) but not at high probabilities of precipitation (so a 60% probability will be reported as a 60% probability).</p>\n<p>Some local television stations have been shown as having significantly greater wet bias, often reporting a 100% probability of precipitation in cases where it rains only 70% of the time.</p>\n<p><a href=\"https://x.com/peterwildeford/status/1960327378808307911\">Colin Fraser</a>: If you believe it will rain with probability P, and getting caught in the rain without an umbrella is X times worse than getting caught in the sun with an umbrella, then it&#8217;s optimal to predict rain whenever P ≥ 1/(1+X). So e.g. for X=2 you should predict rain at P ≥ 1/3.</p>\n<p>Peter Wildeford: I think you should only predict rain according to the correct p(rain), but you can change your behavior around umbrella carrying at lower values of p(rain).</p></blockquote>\n<p>Colin Fraser is right if you effectively can only predict 0% or 100% rain, and the only purpose of predicting rain is that you take an umbrella if and only if you predict rain.</p>\n<p>Peter Wildeford is right that you can say ‘it will rain 40% of the time, therefore I should take an umbrella, even though more than half the time I will look foolish.’</p>\n<p>The weather reports are assuming that people have a typical bias, that people respect 40% chance or more, but not 30%. Thus, there is a huge jump (AIUI, and Claude confirms). If the Google weather app says 30%, treat that as at most 10%, but the app doesn’t want to get blamed so it hedges. Whereas if it says 40%? That’s pretty much 40%, act accordingly.</p>\n<p>If you don’t know the way the conversion works, and you don’t have the typical biases, you’ll respond in crazy wrong fashion. The bias and nonlinearity become self-perpetuating.</p>\n<p>The right rule in practice really is to take the umbrella at 40% and not at 30%, almost no matter what the cost-benefit tradeoff is for the umbrella, since it is obviously wise at 40% and obviously unwise at 10%.</p>\n<p>The ‘predict 100% instead of 70%’ thing that other sources do is especially maddening. This means both that you can’t tell the difference between 70% and 100%, and that on the regular you notice things that were predicted as Can’t Happen actually happening. The weather forecaster is consigned to Bayes Hell and you can’t trust them at all.</p>\n\n\n<h4 class=\"wp-block-heading\">If You’re So Smart, Why Aren’t You Happy?</h4>\n\n\n<p>As Bryan Caplan notes, this is frequently a better question than ‘if you’re so smart, why aren’t you rich?’ It is a very good question.</p>\n<p>His rejections of various responses are less convincing, with many being highly oversimplifying and dismissive of many things people often care about deeply. He presents answers as if they were easy and obvious when they are neither of those things.</p>\n<p>I endorse rejection of the objection ‘the world is so awful that you have to be stupid to be happy.’ I don’t endorse his reasoning for doing so. I do agree with him that the world is in a great spot right now (aside from existential risks), but I don’t think that’s the point. The point is that it isn’t improving your life or anyone else’s to let your view of the world’s overall state make you indefinitely unhappy. If you think you ‘have’ to be stupid not to be perpetually unhappy for whatever external reason, you’re wrong.</p>\n<p>I also agree with him that one good reason to not be happy is that you are prioritizing something else. He retorts that few people are extreme Effective Altruists, but this is not required. You don’t have to be some fanatic, to use his example, to miserably stay together for the kids. What you care about can be anything, including personal achievements other than happiness. Who says you have to care about happy? Indeed, I see a lot of people not prioritizing happiness enough, and I see a lot of other people prioritizing it far too much.</p>\n<p>There’s also another answer, which is that some people have low happiness set points or chemical imbalances or other forms of mental problems that make it extremely difficult for them to be happy. That’s one of the ways in which one can have what Bryan calls ‘extraordinary bad luck’ that you can’t overcome, but there are other obvious ways as well.</p>\n\n\n<h4 class=\"wp-block-heading\">While I Cannot Condone This</h4>\n\n\n<p><a href=\"https://x.com/metzgov/status/1962923853971169663\">‘Digital Content Creators’ joins the list of professions</a> <a href=\"https://t.co/aPGwe6esWq\">that officially face</a> ‘no tax on tips.’ Influencers and podcasters are explicitly getting a tax break.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!WUQk!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2f0e1fd2-e628-48c2-98bf-1850cae465bd_1200x574.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>From a public choice standpoint I suppose this was inevitable. However, this phases out at higher income levels, which means that none of the prominent people you are thinking of likely can benefit from this. As in, Republicans proudly embraced progressive taxation to partially offset regressive tariffs? So yes, I do accept tips, and very much appreciate them along with subscriptions, but alas after consulting with my tax lawyer (GPT-5 Pro) I have concluded that I cannot benefit from this policy.</p>\n<p>Did men dress better and therefore look better in the past? <a href=\"https://x.com/dieworkwear/status/1955756224030630264\">Derek Guy makes the case that they did and attempts to explain why and what he means by better</a>.</p>\n<p>I think I agree that in a purely aesthetic sense people did dress ‘better,’ but that is because people in the past put massive investment into this. They spent a huge percentage of their income on clothes, they spent a large percentage of their time and attention on understanding, creating and maintaining those clothes, and they were willing to suffer a lot of discomfort. And they faced huge social and status pressures to devote such efforts, with large punishments for not measuring up to norms.</p>\n<p>Derek notes our reduced tolerance for discomfort and lack of effort, but skips over all the extra money and time and cognitive investments, seems to lack the ‘and this is good, actually’ that I would add. I think it’s pretty great that we have largely escaped from these obligations. The juice is not worth the squeeze.</p>\n<p><a href=\"https://www.statecraft.pub/p/how-to-be-a-good-intelligence-analyst\">Santi Ruiz interviews Dr. Rob Johnston on the intelligence community</a> and how to get good intelligence and make good use of it. There’s lots of signs of a lot of deep competence and dedication, but clearly the part where they deliver the information and then people use it is not going great. Also not going great is getting ready for AI.</p>\n<p><a href=\"https://www.natesilver.net/p/what-is-blueskyism\">Nate Silver explains what Blueskyism is</a>, as in the attitude that is pervasive on Bluesky, and why it is not a winning strategy in any sense.</p>\n<p><a href=\"https://x.com/Sassafrass_84/status/1959454171578466345\">Texas becomes the seventh state to ban lab grown meat</a>. <a href=\"https://x.com/TPCarney/status/1960485668225777678\">Tim Carney becomes the latest</a> person to be unable to understand there could be any reason other than cronyist protectionism to want this banned. Once again I reiterate that I don’t support these bans, but it seems disingenuous to prevent not to understand the reasons they are happening. <a href=\"https://x.com/JimDMiller/status/1960505289356058921\">James Miller</a> offers a refresher of the explanation, if you need one, except that the demands wouldn’t stop with what Miller wants.</p>\n<p><a href=\"https://www.benlandautaylor.com/p/no-the-black-death-was-not-good-for\">No, the Black Death was not good for the economy</a>, things were improving steadily for centuries for other reasons. As opposed to every other pass famine or plague ever, where no one looks back and says ‘oh this was excellent for economic conditions.’</p>\n\n\n<h4 class=\"wp-block-heading\">Only The Rich Are Poisoned</h4>\n\n\n<p><a href=\"https://x.com/tszzl/status/1960954726461407411\">It is relatively easy to stay rich</a> once already rich. It is not easy to get rich, or to be ‘good at’ being rich. It is also hard to be rich effectively, including in terms of turning that extra money into better lived experiences, and ‘use the money to change the world’ is even harder.</p>\n<blockquote><p>Roon: its amazing how little the post-economic people i know spend. many people are bad at being rich. you should teach them how to do it.</p>\n<p>i think this is often why the children of the mega-rich are the ones who even get close to squandering their parents&#8217; fortunes. when you get rich later into life you often don&#8217;t think with enough 0s in terms of personal consumption, donations, having a lavish household staff etc.</p>\n<p>Eliezer Yudkowsky: In their defense, once you&#8217;ve already got your personal chef, volcano lair with trampoline, and a harem that covers all your kinks, there&#8217;s just not much else Earth offers for converting money to hedons.</p>\n<p>Zvi Mowshowitz: It is remarkably difficult (and time consuming!) to spend large amounts of money in ways that actually make your life better, if you&#8217;re not into related status games.</p></blockquote>\n<p>I got into a number of arguments in the comments, including with people who thought a remarkably small amount of money was a ‘large amount.’ Certainly you can usefully spend substantially more than most people are able to spend and still see gains.</p>\n<p>Reasonably quickly you hit a wall, and the Andy Warhol ‘everyone gets the same Diet Coke’ problem, and to do better you have to spend obscene amounts for not that much improvement. Are you actually going to be that much happier with a giant yacht or a private jet? What good is that private chef compared to Caviar or going to restaurants? Do you actually want to live farther away in some mansion? Does expensive art do anything for you cheap art doesn’t? And so on.</p>\n<p>Even in the ways that would be good to spend more, you still need to know how to spend more and get value from what you paid, and how to do it without it taking up a ton of your time, attention or stress. Again, this is harder than it sounds.</p>\n\n\n<h4 class=\"wp-block-heading\">China Has Declining Marginal Product Of Capital</h4>\n\n\n<p>We talk constantly about ‘losing to China’ whereas in China there are reasons to worry that China is losing, not to an outside force but rather in general, and this is on top of a fertility rate that is 1.1 or below and an already declining population:</p>\n<blockquote><p><a href=\"https://x.com/Birdyword/status/1963556276455014901\">Mike Bird</a>: Useful chart from @andrewbatson here covering one of the most under-discussed and useful macro metrics around. China&#8217;s capital productivity has been in consistent, marked decline even as panic over Chinese industrial prowess has reached fever pitch</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!_jGU!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0fb69ff9-e1d3-4253-acb5-289858f9b2fc_700x424.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Indeed as of 2019-2023 China&#8217;s marginal product of capital (basically how much output you&#8217;re getting from another unit of capital) was only very slightly higher than that of the US, though the US is at the frontier of GDP per capita and China nowhere near.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!HGQC!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d5f9e14-70b5-4f14-b741-049597748d26_757x481.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Clearly both things can be true &#8211; that some of China&#8217;s leading industrial firms are incredibly impressive, world-leading, and that in the aggregate they&#8217;re not enough to offset the misallocation and inefficiency elsewhere.</p></blockquote>\n<p>He quotes that the manufacturing share of GDP in China, for all our worries about Chinese manufacturing, declined 2-3 percent between 2021 and 2025, with the sector now having narrower margins, lower profits and more losses.</p>\n<p>All of this is more reason not to give them opportunity to invest more in AI, and also reason not to catastrophize.</p>\n\n\n<h4 class=\"wp-block-heading\">Good News, Everyone</h4>\n\n\n<p>Cate Hall thanks you for coming to her TED talk, ‘<a href=\"https://www.youtube.com/watch?v=gN07gbipMoY&amp;ab_channel=TED\">A Practical Guide To Taking Control of Your Life</a>.’ Which is indeed the Cate Hall TED Talk you would expect, focusing on cultivating personal agency.</p>\n<p>In my startup roundups I muse about why don’t startups offered TMM (too much money, here presumably also at too high a valuation) take the money and then set expectations accordingly? <a href=\"https://www.buzzfeednews.com/article/williamalden/slack-is-swept-up-in-silicon-valleys-gold-rush\">A commenter pointed out that Stripe did do a version of this</a>, although it is not a perfect fit.</p>\n<p><a href=\"https://x.com/ZyMazza/status/1965054215157346739\">Motivation and overcoming fear are tricky</a>. You can get people comfortable with public speaking with complements. You can also do it by having people starting with you come up and give intentionally terrible speeches while they get crumpled papers thrown at them, to show that nothing actually bad happens.</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/08/is-it-possible-to-raise-national-happiness.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=is-it-possible-to-raise-national-happiness\">Can national-level happiness be raised or are we doomed to a hedonic treadmill</a>?</p>\n<p>When people rate their happiness, are they rating on an absolute scale that reflects a real treadmill effect, or are people simply asking if they are happy compared to what they know?</p>\n<p>It seems obviously possible to raise national happiness. One existence proof is that there are very clearly regimes, policies and circumstances that make people very unhappy, and you can do the opposite of those things, at least dodging them.</p>\n<p>Also there are things that consistently raise happiness and that vary in frequency greatly over time, for example being married and having grandchildren.</p>\n<p>In any case, <a href=\"https://marginalrevolution.com/marginalrevolution/2025/08/is-it-possible-to-raise-national-happiness.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=is-it-possible-to-raise-national-happiness\">via MR</a> <a href=\"https://www.nationalaffairs.com/blog/detail/findings-a-daily-roundup/welcoming-the-input\">(via Kevin Lewis</a>) we have <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5339511\">a new paper.</a></p>\n<blockquote><p>Abstract: We revisit the famous Easterlin paradox by considering that life evaluation scales refer to a changing context, hence they are regularly reinterpreted.</p>\n<p>We propose a simple model of rescaling based on both retrospective and current life evaluations, and apply it to unexploited archival data from the USA.</p>\n<p>When correcting for rescaling, we find that the well-being of Americans has substantially increased, on par with GDP, health, education, and liberal democracy, from the 1950s to the early 2000s.</p>\n<p>Using several datasets, we shed light on other happiness puzzles, including the apparent stability of life evaluations during COVID-19, why Ukrainians report similar levels of life satisfaction today as before the war, and the absence of parental happiness.</p>\n<p>Tyler Cowen: To give some intuition, the authors provide evidence that people are more likely engaging in rescaling than being stuck on a hedonic treadmill. I think they are mostly right.</p></blockquote>\n<p>This makes tons of sense to me. You get revolutions of rising expectations. There are definitely positional effects and treadmill effects and baseline happiness set points and all that to deal with, but the Easterlin Paradox is a paradox for a reason and things other than income vary as well.</p>\n<p>That doesn’t mean life is getting better or people are getting happier. It can also go the other way, and I am very open to the idea that happiness could be declining (or not) in the smartphone era with kids not allowed to breathe outside, and everything else that causes people to feel bad these days both for good and bad reasons. But yeah, from the 1950s to the 1990s things seem like they very clearly got better (you could also say from the 1500s to 1990s, with notably brief exceptions, or earlier, and I’d still agree).</p>\n<p><a href=\"https://www.wsj.com/style/adult-sleepaway-camp-social-getaway-98e47886\">Camp Social is part of a category of offerings where adults go to sleepaway camp</a> with a focus on making friends, complete with bunk beds and color wars and in one case a claimed 75% return rate, although also with staying up until 1:30 getting drunk. The camp counselors are concierges and facilitators. Cost is $884 for two nights and three days, which seems rather quick for what you want to accomplish?</p>\n<p>I do buy that this is a good idea.</p>\n<p>Radiation is dangerous, but it is a lot less dangerous than people make it out to be, and we treat this risk with orders of magnitude more paranoia than things like ordinary air pollution that are far more deadly.</p>\n<blockquote><p><a href=\"https://x.com/bswud/status/1956004924493357181\">Ben Southwood</a>: The life expectancy of someone hit with 2,250 millisieverts of radiation in Hiroshima or Nagasaki was longer than the average Briton or American born in the same year. Today in Britain we spend billions controlling radiation levels more than 100,000 times smaller than this.</p>\n<p>2,250 millisieverts is a lot of radiation, like getting 225 full-body CT scans in one go. I don&#8217;t think anyone would recommend it. But it shows how ridiculous it is that we spend so much time, effort, and money on radiation levels of 1msv or 0.1 msv per year.</p></blockquote>\n<p><a href=\"https://x.com/AndrewHammel1/status/1957018808272515560\">Andrew Hammel reports that the Germans are finally on the verge</a> of losing their War on Air Conditioning, as in allowing ordinary people to buy one, because normies actually experienced air conditioning and are not idiots. The standard ‘urban haute bourgeoisie’ are holding out on principle, because they think life is about atoning for our sins and because they associate things like air conditioning with wasteful Americans. As you would expect, the alternative ‘solutions’ to heat wind up being exponentially more expensive than using AC.</p>\n<p>I do note that they have a point on this one:</p>\n<blockquote><p>Andrew Hammel: First of all, *every one* of these people has a story about visiting the USA and nearly freezing to death in an over air-conditioned store or office. Every. Damn. One. I can predict exactly when they will wheel out this traumatic tale, I just let it unfold naturally.</p></blockquote>\n<p>I mean, I have that too, to the point that it is a serious problem. This happens constantly in Florida. Even in New York’s hotter summer days, I have the problem that there is nothing I can wear outside while walking to the restaurant, that I also want to be wearing once I sit down at the restaurant. It is crazy how often Americans will use the AC to make places actively too cold. We could stand to turn it down a notch.</p>\n<p><a href=\"https://elizabethvannostrand.substack.com/p/church-planting\">Or rather, ‘the’ good news</a>, as Elizabeth Van Nostrand lays out how Church Planting works and finds it very similar to Silicon Valley startups.</p>\n<p><a href=\"https://grimoiremanor.substack.com/p/no-conscientiousness-hasnt-collaped\">A counterargument to last month’s claim about rapidly declining conscientiousness</a>. Conscientiousness has declined far more modestly, the decline here is still seems meaningful but is very is not be a crisis. What John did to create the original graph turns out to have been pretty weird, which was show a decline in relative percentile terms that came out looking like a Really Big Deal.</p>\n<p><a href=\"https://x.com/CartoonsHateHer/status/1960657158892142841\">Cartoons Hate Her!</a> <a href=\"https://t.co/xEd9Htil8y\">is on point</a> that germs are very obviously real and cause disease but quite a lot of people’s specific worries about vectors for being exposed germs and the associated rituals are deeply silly if you stop to think about physics, especially compared to other things the same people disregard.</p>\n\n\n<h4 class=\"wp-block-heading\">For Your Entertainment</h4>\n\n\n<p><a href=\"https://x.com/sesamestreet/status/1963602962703683996\">Sesame Street will give its largest library to YouTube as of January 2026</a> featuring hundreds of episodes. It is not a perfect program, but this is vastly better than what so many children end up watching. I echo that it would be even better if we included classic episodes as well.</p>\n<p>Indeed, we should be putting all the old PBS kids shows on YouTube, and everything else that it would be good for kids to be watching on the margin. The cost is low, the benefits are high. There are low quality versions of the shows of my extreme youth available (such as Letter People and Square One TV) but ancient-VHS quality is a dealbreaker for actually getting kids to watch.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re The Worst</h4>\n\n\n<p><a href=\"https://x.com/TheCinesthetic/status/1955789215783878811\">What TV show had the worst ending</a>? There are lots of great answers but the consensus is (in my opinion correctly) Game of Thrones at #1 and Lost at #2.</p>\n<p>After that it gets more fractured, and the other frequent picks here I am in position to evaluate were mostly bad endings (HIMYM, Killing Eve, Enterprise, Battlestar Galactica) but not competitive for the top spot. Dexter came up a lot but I never watched. Supernatural came up a bunch, and I’m currently early in its final and 15th season and is it weird this makes me want to get to the end more not less? Better a truly awful end than a whimper?</p>\n<p>To be the true worst ending, it has to not only be awful but take what could have been true greatness and actively ruin the previous experience. You need to be in the running for Tier 1 and then blow it so badly you have to think about whether it even stays in Tier 2 because they poisoned everything. That’s why Game of Thrones and Lost have to be so high.</p>\n<p>Indeed those two are so bad that they substantially hurt our willingness to invest in similar other shows, especially Lost-likes, which is enforcing the good discipline of forcing for example Severance to assure us they have everything mapped out.</p>\n<p>(Briefly on the others: While at the time I thought HIMYM’s ending was as bad as everyone thinks, on reflection it has grown on me and I think it is actually fine, maybe even correct. Killing Eve’s ending wasn’t good exactly, but I didn’t feel it ruined anything, it was more that all of season 4 was a substantial decline in quality. Battlestar Galactica was rage inducing but I understand why they did what they did and that mostly made it okay, again mostly the show started fantastic and was dropping off in quality generally. Enterprise ended bad, but again not historically bad, whereas the show wasn’t getting bad, and mostly the frustration was we weren’t done.</p>\n<p>I heard the claim recently that Lost’s ending is aging well, as it suffered from the writers assuring us that they wouldn’t do the thing they did, whereas now looking back no one much cares. There’s that, but I still find it unsatisfying, they said they wouldn’t do it that way for a reason, and the worse offense was the total failure to tie up loose ends and answer questions.</p>\n\n\n<h4 class=\"wp-block-heading\">The Golden Age of Cinema</h4>\n\n\n<p><a href=\"https://scottsumner.substack.com/p/peak-cinema?utm_source=post-email-title&amp;publication_id=2934833&amp;post_id=167961768&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3o9&amp;triedRedirect=true&amp;utm_medium=email\">Scott Sumner claims the greatest age of cinema was 1958-1963</a>.</p>\n<blockquote><p><a href=\"https://scottsumner.substack.com/p/peak-cinema/comment/146047596\">Scott Sumner</a>: The public prefers 1980-2015, as you say. The movie experts say the 1920s-1970s were the best.</p></blockquote>\n<p>This highlighted the ways in which our preferences strongly diverge.</p>\n<p>Another big hint is that Sumner and the experts claim an extremely high correlation of director with quality of movie. Great directors are great, but so many other things matter too.</p>\n<p>As an example, recently <a href=\"https://letterboxd.com/thezvi/film/mulholland-drive/\">I watched Mulholland Drive</a> for the first time, which Sumner says might be his favorite film. I appreciated many aspects of it, and ended up giving it 4/5 stars because it was in many senses ‘objectively’ excellent, but I did not actually enjoy the experience, and had to read an explainer afterwards from Film Colossus to make sense of a lot of it, and even after understanding it a lot of what it was trying to do and say left me cold, so I didn’t feel I could say I ‘liked’ it.</p>\n<p>From what I can tell, the public is right and the ‘experts’ are wrong. Also I strongly suspect that We’re So Back after a pause of timidity and sequilitius and superheroes.</p>\n<blockquote><p>Scott Sumner: There are two films that should never, ever be watched on TV. One is 2001 and the other is Lawrence of Arabia. If you saw them on anything other than a very big movie theatre screen, then you’ve never actually seen them.</p></blockquote>\n<p>I haven’t seen 2001 regardless, but on Lawrence of Arabia I can’t argue, because I attempted to watch it on a TV, and this indeed did not result in me seeing Lawrence of Arabia, because after half an hour I was absolutely bored to tears and could not make myself continue. There was a scene in which they literally just stood there in the sand for about a minute with actual nothing happening and I get what they were trying to do with that but it was one thing after another and I couldn’t even, I was out.</p>\n<p>What I am confused by is how it would have improved things to make the screen bigger, unless it would be so one would feel forced to continue watching?</p>\n<p>Here are his 13 suggestions for films to watch, although I have no idea how one would watch Lawrence of Arabia given it has to be on a big screen?</p>\n<blockquote><p>Vertigo, The Man Who Shot Liberty Valance, Touch of Evil, Some Like It Hot, Breathless, Jules and Jim, Last Year in Marienbad, High and Low, The End of Summer, 8 1/2, L’Avventura, The Music Room, Lawrence of Arabia.</p></blockquote>\n<p>I tried to watch High and Low, and got an hour in but increasingly had the same sense I got from The Seven Samurai, which is ‘this is in some objective senses a great movie and I get that but I have to force myself to keep watching it as outside of moment-to-moment it is not holding my interest’ except with more idiot plot &#8211; and yes I realize some of that is cultural differences and noticing them is the most interesting thing so far but I’m going to stick with idiot plot anyway. In addition to the idiot aspects, it really bothers me that ‘pay or pretend to pay the ransom’ is considered the obviously moral action. It isn’t, that is terrible decision theory. The moral action is to say no, yet there is not even a moment’s consideration of this question by anyone.</p>\n<p>If the above paragraph is still there when you read this, it means I was unable to motivate myself to keep watching.</p>\n\n\n<h4 class=\"wp-block-heading\">Not What We Are Looking For</h4>\n\n\n<p><a href=\"https://www.washingtonpost.com/opinions/2025/08/27/ne-zha-2-box-office-chinese-mythology/\">Jeff Yang explains some of the reasons Chinese movies tend to bomb in America</a>, in particular the global hit Ne Zha 2. Big Chinese movies tend to be based on super complex Chinese traditional epic stories that Chinese audiences already know whereas Americans haven’t even seen Ne Zha 1. American stories have clear structure, understandable plots, payoffs for their events, central characters, and a moral vision that believes in progress or that things can be better. And they try to be comprehensible and to maintain a tonal theme and target market. Chinese movies, Yang reports, don’t do any of that. Effectively, they assume the audience already knows the story, which is the only way they could possibly follow it.</p>\n<p>It’s as if Marvel movies were the big hits, and they didn’t try to be comprehensible to anyone who didn’t already know the characters and comics extensively? Certainly there are some advantages. It might be cool to see the ‘advanced’ directors cuts where it was assumed everyone had already either read the comics extensively or watched the normal version of the film?</p>\n<p>As Jeff says, if they can make money in China, then sure, why not do all this stuff that the Chinese audiences like even if it alienates us Westerners. There are enough movies for everyone. It does still feel like we’re mostly right about this?</p>\n<p>Like everyone else I think Hollywood movies are too formulaic and similar, and too constrained by various rules, and thus too predictable, but those rules exist for a reason. When older movies or foreign movies break those rules, or decide they are not in any kind of hurry whatsoever, it comes at a cost. I don’t think critics respect those costs enough.</p>\n<p>I strongly agree with Alea here and I am one of the ones who want to stay away:</p>\n<blockquote><p><a href=\"https://x.com/noncanonicAleae/status/1960488229531984112\">Alea</a>: Novels with an empty mystery box should be explicitly tagged so I can avoid them. 110% of the joy of reading comes from uncovering all the deep lore and tying up every loose end. Some people get off on vague worlds and unfinished plots, and they should stay the fuck away.</p></blockquote>\n<p>I don’t especially want to go into deep lore in my spare time, but if you are going to convince me to read a novel then even more than with television you absolutely owe it to me to deliver the goods, in a way (with notably rare exceptions) that I actually understand when reading it.</p>\n<p>As in: I know it’s a great book but if as is famously said, ‘you don’t read Ulysses, you reread Ulysses’ then you had me at ‘you don’t read Ulysses.’</p>\n<p>And you definitely don’t read Game of Thrones until I see A Dream of Spring.</p>\n<p>True facts about the whole ‘fleeing Earth’ style of story:</p>\n<blockquote><p><a href=\"https://x.com/bendreyfuss/status/1962953463010361633\">Ben Dreyfuss:</a> The stupidest part of INTERSTELLAR is that the blight starts killing all the crops and after just a few decades they go “ah well, guess it won! Better leave earth. Hope we solve this magic gravity equation with the help of 5 dimensional beings and wormholes.”</p>\n<p>“We can’t make okra anymore. Better go explore this all water planet where one hour is 7 years of time and this ice planet where water is alkaline and the air is full of ammonia.”</p>\n<p>Pretty sure you can’t make okra there either, buddy.</p>\n<p><a href=\"https://x.com/KelseyTuoc/status/1962979295703228791\">Kelsey Piper</a>: every single movie about people fleeing Earth involves displaying a mastery of technology which would obviously be more than sufficient to solve the problem they are fleeing Earth about</p>\n<p>climate change is not going to make Earth less habitable than Mars so you can&#8217;t have people fleeing to Mars because of climate change, you just can&#8217;t.</p>\n<p>&#8216;there&#8217;s a supervolcano/asteroid induced ice age&#8217; oh boy I have some news for you about Mars.</p>\n<p>Daniel Eth: Just once I want a movie about people fleeing Earth to have the premise “there are trillions of people, and we have a per capita energy consumption of 100,000 kWh/yr, which is straining Earth’s ability to radiate the waste heat. We must now go to space to expand capacity”</p>\n<p>Movie could have a real frontier vibe (space cowboys?) &#8211; “of course back in the old world (Earth), population and energy per capita are subject to bureaucratic regulations to prevent total ecosystem collapse; but in new worlds we can freely expand anew”</p></blockquote>\n<p>A recent different case of ‘I can’t help but notice this makes no sense’ <a href=\"https://letterboxd.com/myglesias/film/weapons-2025/\">was Weapons</a>. The link goes to a review from Matthew Yglesias that I agree with, it does cool things with nonlinearity and the performances and cinematography are good except when you put it together in the second half the resulting actual plot, while consistent and straightforward, makes no sense.</p>\n<blockquote><p><a href=\"https://letterboxd.com/thezvi/film/weapons-2025/reviews/\">Zvi Mowshowitz reviews Weapons</a> while avoiding spoilers: When you&#8217;re in, writing or deciding to go to a horror movie, you make dumb decisions. It&#8217;s what you do.</p></blockquote>\n<p>The difference is to him this adds up to 3.5 stars, and to me it means 2.5 stars, once the holes and idiot balls became too glaring, I stopped being able to enjoy the film.</p>\n<p>My other problem with Weapons was that the first two acts made me care about various characters and relationships that were rich and detailed and well-executed and acted, and then the third act didn’t care at all about those things, only about the main plot that did not make any sense. There might actually be a pretty great movie here in which the missing kids are a tragedy that never gets explained or solved because what matters is a different third act that focuses on how people react to it.</p>\n\n\n<h4 class=\"wp-block-heading\">Know When To Fold Em</h4>\n\n\n<p><a href=\"https://next.io/news/regulation/new-jersey-bill-seeks-ban-micro-bets/\">New Jersey looks to ban ‘micro bets,’ meaning sports bets about individual plays</a>.</p>\n<blockquote><p>Erik Gibbs: The bill’s language defines a micro bet as any live proposition bet placed during an event that pertains specifically to the outcome of the next discrete play or action.</p></blockquote>\n<p>This restriction seems clearly good. I don’t know where the line should be drawn, but I am confident that ‘ball or strike’ bets are over the line.</p>\n<p>It is a very light restriction &#8211; you can’t bet on a ball or strike or pass or run under this rule, but you can still bet on the outcome of an inning or drive. Bets on the next play have all the worst gambling attributes. They cost a lot individually, they resolve and compound super quickly, they are especially prone to addictive behavior.</p>\n\n\n<h4 class=\"wp-block-heading\">Gamers Gonna Game Game Game Game Game</h4>\n\n\n<p>Clair Obscur Expedition 33 finishes at Tier 2. It does a lot of things very right and I am very happy to have played it, despite some obvious issues, including some serious balance problems in Act 3.</p>\n<p>If someone suddenly buys up the contract on Taylor Swift and Travis Kelce getting engaged from 20% to 40%, <a href=\"https://x.com/Domahhhh/status/1960394729176105077\">and you’re selling into it</a>, yeah, good chance they know. Also this means yes, someone knew and traded on the information in advance. Cool. Oh, and congratulations to both of them, of course.</p>\n<p><a href=\"https://open.spotify.com/episode/7e4oBEEy8shskcjJnpfThr?si=RoUVVmLgQzaYsIxLi-sZ0g&amp;nd=1&amp;dlsi=181395b9abb94c6d\">Sam Black has a new podcast about cEDH</a>.</p>\n<p>I don’t understand why <a href=\"https://x.com/bkowal23/status/1961900870448116075\">Wizards of the Coast continues to be so slow on the banhammer in situations like Cauldron</a>. We saw repeatedly exactly the broken format pattern, such as here where Cauldron starts out at 30% and then goes to 56% after six rounds, then a much larger majority of the top 8s. This continued long past the point where there was reasonable hope it would be fixed by innovation.</p>\n<blockquote><p><a href=\"https://x.com/LangeMason/status/1962544726260768986\">Mason Iange:</a> Doesn&#8217;t it make sense that in a rotating format like standard, wotc wants people to have confidence in buying product and building decks? Literally no one is going to play standard if the best decks just get banned every 2 month.</p>\n<p>Saffron Olive: The way I see is it there are two paths: you design cards conservatively and don&#8217;t need to ban anything, or you design cards aggressively and need to ban cards fairly often. Wizards is trying to design cards aggressively and never ban anything, which I don&#8217;t think is actually possible.</p>\n<p>Patrick Sullivan: What you’re saying is true/relevant, but there are other considerations; the current state of affairs would clearly not be tolerated absent the stuff you’re mentioning. That’s why I think they should allow themselves to be as agile as possible regardless of what they decide to do.</p>\n<p><a href=\"https://x.com/bkowal23/status/1962576540828303451\">Brian Kowal</a>: The opposite of how I feel about rotating formats. I want it dynamic. I’d rather they make a balanced format. With a rotating format I want to feel like I can innovate. If it is solved I quickly lose interest. There are many formats that never rotate to protect investment.</p></blockquote>\n<p>I think ‘mix it up every time it is solved’ is going too far given how quickly we now solve formats, but the solution has to not be ‘play this deck or else.’ Yes, banning the best deck every two months would make you reluctant to invest in Standard, but effectively banning all but the best deck for months on end, or having to face an endless stream of the same overpowered nonsense even if you’re willing to sacrifice win rate to go rogue, is even worse.</p>\n<p><a href=\"https://magic.wizards.com/en/news/announcements/standard-and-moving-ban-announcement\">They came out with an explanation and update on the 9th</a>. A big part of this is that they screwed up timing the ban windows, and have a crazy high bar for doing “emergency” bans versus bans on announcement days. They are mitigating this going forward by adding more windows next year, one every major set release.</p>\n<p>That points out how crazy the situation was. You’re going to release a set, and then not have a ban opportunity until after releasing the next set? That’s crazy.</p>\n<p>Based on past experiences, I believe Brian Kowal is correct that an extended period of a miserable format, with bans that everybody knows have to happen but are extensively delayed, creates a point of no return, where permanent damage to the format and the game begins to accumulate.</p>\n<blockquote><p><a href=\"https://x.com/bkowal23/status/1965960671046017403\">Brian Kowal</a>: There should be room in the ban policy for emergency bans. Perception has hit the point of no return. A significant portion of players do not want to touch Standard now. Rotation should be when we are creating players for the next year and this rotation lasts until January 2027! (I’m 80% on this. Somebody let me know if I’m wrong) Players are quitting Standard again to look for other games and formats. New players are choosing not to invest in it.</p>\n<p>When format perception hits this state everybody knows something is getting a ban. So a lot of die hard competitives are even taking a break rather than buying 4 copies of the two most expensive cards in Standard.</p>\n<p>The best way to go imo is to just suck it up and ban Cauldron immediately. Again, we all know it is happening anyway. Not taking action over and over again and just letting everybody suffer months of a bad format makes WOTC look like they don’t care.</p>\n<p><a href=\"https://x.com/LizardJenny/status/1965480611281600917\">Jenny</a>: WotC took HOW long to decide to do nothing and ruin another Spotlight Series and RCQ season? Using the Arena ladder meta to judge the health of the format is *insane*</p>\n<p><a href=\"https://x.com/Jenn_the_Judge/status/1965820187585949838\">Pactdoll Terror</a>: My 2-slot RCQ this Saturday in NYC sold 8 spots. I usually do 50. Someone who built Vivi to grind RCQs would be annoyed that it got banned, but Standard is DEAD locally. Weeklies aren&#8217;t launching, RCQs struggle to make money. Holding bans is bad for everyone except Vivi players.</p></blockquote>\n<p>Instead they’re going to do a strange compromise, and move up their next announcement date from November 24 to November 10, which still leaves two full months of this.</p>\n<p>We should never have more than a month ‘in limbo’ where things are miserable and we know what is coming. Even if you decide to keep playing you are in an impossible position.</p>\n<p>They say ‘Standard has not yet reached its final form’ but they are grasping at straws.</p>\n<p>They say the Arena ladder is looking less awful. The Arena ladder is not real life, not only because the play level is low but also there’s nothing forcing the players to play the best deck. I learned that the hard way during the Oko era.</p>\n<p>I get Carmen’s argument here that we ran the experiment and when you don’t have ban windows, you get constant speculation about potential bans and a lot of uncertainty, And That’s Terrible. You can’t fully embrace The Unexpected Banning. There needs to be a substantially higher bar outside of a fixed set of days.</p>\n<p>The current situation was still ludicrous. While insufficiently competitive play is not as lopsided, that’s largely about card access and players wanting to have fun and of course not wanting to do this into a future ban. This ban would not be ‘from under players in a surprise move’ even if no formal warning was given. The idea that ‘we won’t make a move based on competitive play, only on non-competitive play, you competitors don’t much matter’ is definitely giving me even less desire to come back.</p>\n<p>Which of course I get. Magic is not made for me. I’m just deeply sad about it.</p>\n<p>I see the argument this isn’t a pure ‘do it today or else’ situation but it is an emergency. If I was Wizards, the moment it was clear we probably had a problem I would have created a new announcement date much closer in the future than two months, with the clear statement that at that time they would choose whether to ban Vivi, Caldron, both or neither. And then done it by now.</p>\n<p><a href=\"https://x.com/SamuelHBlack/status/1957268152930156600\">Pro Tour levels of cEDH (competitive commander) are an awesome thing to have exist, but seem to have a rather severe draw problem</a>, because everyone knows how to play politics and how to force draws. Sam Black suggests making draws zero points, which I worry could create even more intense politics and feel bad moments but <a href=\"https://x.com/CalebDragonborn/status/1957272707625558079\">when 1-0-6 is a ‘great record’</a> then maybe it is time and it seems like the elimination rounds work fine?</p>\n<blockquote><p>Sam Black: The house games are more fun when we don’t play for draws. Similarly games in top 16 are more fun.</p></blockquote>\n<p>Ultimately, I don’t think any solution would satisfy me, since it is going to come down to pure politics and kingmaker decisions. One potential approach is to say that wins are 10, draws are 1, and we pair people accordingly, so taking the draw is not obviously good for you, it might be wiser to lose and get paired against others who aren’t playing for draws. In the 0-0-4 bracket I don’t like your winning chances, and you have to win at some point to make the cut.</p>\n<p><a href=\"https://x.com/SamuelHBlack/status/1963254095168278879\">Sam Black talks about the role of</a> <a href=\"https://t.co/S7uFdYrVHs\">mediocre synergistic cards</a>. <a href=\"https://www.youtube.com/watch?app=desktop&amp;v=Ut3n8GdvkIM&amp;ab_channel=DanaFischerMTG\">You start with strong cards, and pick up the bad cards that work for you for free at the end</a>. If the bad cards vanish, the lane is not open, go a different way. Only prioritize cards that have a high ceiling, and (almost) never take a consistently bad card in your colors that can’t make your deck much better when a pack contains a good card. Similarly, trying to read signals explicitly is overrated relative to taking good cards, which is underrated and serves the same purpose.</p>\n<p>The exception (he seems to assumes in the modern era this won’t ever happen, which seems wrong to me) is if you are in danger of not having a deck, because you lack either enough cards or a key component, such that taking a usually bad card actually does provide substantial improvement.</p>\n<p>Some cards that look bad, and have bad win rates, are instead good in the sense that they have high upside, but are being used badly by people who use them without the upside case. Sam’s example is a card that defaults to being a bad Divination but enables never running out of cards, so you can build your entire strategy around this, but if you put in your deck as a bad Divination then it will be bad.</p>\n\n\n<h4 class=\"wp-block-heading\">I Was Promised Flying Self-Driving Cars</h4>\n\n\n\n<h4 class=\"wp-block-heading\">Waymo employees are doing rider-only mode on freeways in San Francisco (including US 101), Phoenix and Los Angeles. It’s employees only for now but presumably that won’t last. They are now cleared for San Jose Airport but no word on SFO.</h4>\n\n\n<p><a href=\"https://techcrunch.com/2025/09/02/waymo-expands-to-denver-and-seattle-with-its-zeekr-made-vans/\">Waymo is now offering service in Denver</a> a<a href=\"https://x.com/binarybits/status/1963244268673245456\">nd is ready for Seattle as soon as they are permitted to do so</a>. They’re doing experiments in Denver now with humans behind the wheel of about a dozen cars and <a href=\"https://x.com/GovofCO/status/1963427852797321430\">Governor Polis is here for it</a>. Planned cities include Dallas, Miami and Washington D.C. next year, and scouting ‘road trips’ have gone to Philadelphia and there are plans to go to Las Vegas, San Diego, Houston, Orlando and San Antonio.</p>\n<p>Service in Denver will quickly reveal exactly how well Waymos can actually handle cold weather including snow. <a href=\"https://manifold.markets/ZviMowshowitz/waymo-handles-denver-snow\">My prediction is it will go well, bet if you disagree</a>. Hopefully it will help <a href=\"https://www.slowboring.com/p/denver-piece\">compensate for Denver’s struggling restaurants</a> and its very high minimum wage.</p>\n<p>As of the start of September, there are still only 2,000 Waymos: 800 in the San Francisco Bay Area, 500 in Los Angeles, 400 in Phoenix, 100 in Austin and ‘dozens’ in Atlanta.</p>\n<p>As a point of comparison, San Francisco has ~1,800 taxi medallions, and an estimated 45,000 registered rideshare drivers, with Claude estimating there are typically 5,000 available rideshares at any given time, peaking in prime hours around 10,000.</p>\n<p><a href=\"https://x.com/daylenyang/status/1958915381021876380\">Supervised Waymo diving has begun in NYC</a>, where they have a permit to do so.</p>\n<p>This continues the recent trend of noticing that holding back self-driving means tens of thousands of people a year will die that didn’t have to.</p>\n<blockquote><p><a href=\"https://x.com/emollick/status/1959249518194528292\">Ethan Mollick</a>: It seems like there is not enough of a policy response to the fact that, with 57M miles of data, Waymo’s autonomous vehicles experience 85% less serious injuries &amp; 79% less injuries overall than cars with human drivers.</p>\n<p><a href=\"https://t.co/9M8iRR1hoe\">2.4 million are injured &amp; 40k killed in US accidents a year</a>.</p>\n<p>Think of EV policy and do long-term support: subsidies for R&amp;D to bring down costs, incentives for including self-driving features, regulatory changes to make it easier to deploy, building infrastructure for autonomous-only vehicles (eg HOV lanes), independent testing.</p>\n<p>Takes time.</p></blockquote>\n<p>There are many problems with this approach, including that it causes fixation on the lives saved versus cost and similar calculations, and also you sound like you are coming for people’s ability to drive. Whereas if you sell this purely as ‘Waymos are awesome and convenient and efficient and improve life greatly and also happen to be actually safe on top it’ then I think that’s way better than ‘you are killing people by getting in the way of this.’</p>\n<blockquote><p><a href=\"https://x.com/AliceFromQueens/status/1959371689583583504\">Alice From Queens</a>: Self-driving cars are like the new weight loss drugs.</p>\n<p>Their value is so large, so obvious, and so scalable, that we can confidently predict their triumph regardless of knee-jerk cultural resistance and their wildly exaggerated downsides.</p>\n<p>Yes, I&#8217;ve been saying the same thing for years. Because it still needs saying!</p></blockquote>\n<p>I mean, they totally are killing people by getting in the way, but you don’t need that.</p>\n<p>Mostly you need to make people believe that self-driving is real and is spectacular.</p>\n<blockquote><p><a href=\"https://x.com/mattyglesias/status/1959388911395828015\">Matthew Yglesias</a>: I keep meeting people who are skeptical self-driving cars will ever happen.</p>\n<p>I tell them I took one to the airport in Phoenix several months ago, did a test ride in DC, they’re currently all over San Francisco, etc and it’s blank stares like I’m telling them about Santa.</p></blockquote>\n<p>My model of what is holding things back for Waymo in particular right now is that mainly we have a bottleneck in car manufacturing, and there’s plenty of room to deploy a lot more cars in a bunch of places happy to have them.</p>\n<p>Longer term, we also have to overcome regulatory problems in various places, especially foolish blue cities like New York and Boston, but I find it hard to believe they can hold out once the exponential gets going and everyone knows what they are missing. Right now with only a few hundred thousand rides a week, it’s easy to shrug it off.</p>\n<p>Thus I think PoliMath might be onto something here:</p>\n<blockquote><p><a href=\"https://x.com/politicalmath/status/1959785354015433116\">PoliMath</a>: I suspect Waymo doesn&#8217;t *want* there to be a policy response to this data b/c it will inevitably end with the left demanding we ban human drivers and there will be a huge backlash that damages Waymo&#8217;s business in a serious way.</p></blockquote>\n<p>Waymo is steadily winning, as in expanding its operations. The more it expands, the better its case, the more it will be seen as inevitable. Why pick a premature fight?</p>\n<p>The fight is out there. <a href=\"https://x.com/sladesr/status/1963615286529003893\">Senator Josh Hawley is suddenly saying ‘only humans out to drive cars and trucks</a>’ as part of his quest to ‘reign in’ AI, which is the Platonic worst intervention to reign in AI.</p>\n<p>Waymos are wonderful already, <a href=\"https://x.com/ESYudkowsky/status/1964566638076056037\">but they also offer much room for improvement</a>.</p>\n<blockquote><p>Roon: It is pretty telling that when you ride in a Waymo, you cannot give instructions to Gemini to play a song, change your destination, or drive differently. When one of the great gilded tech monopolies of the world does not yet have a cohesive AI picture, what hope has the broader economy?</p>\n<p>Eliezer Yudkowsky: AI companies are often so catastrophically stupid that I worry that Gemini might in some way be connected to the actual car. Oh wait, you explicitly want to be able to request that the car drive differently?</p></blockquote>\n<p>I do not want Gemini to be controlling the vehicle or how it drives, but there are other things that would be nice features for integration, and there are other quality of life improvements one could make as well. For now, we keep it clean and simple.</p>\n\n\n<h4 class=\"wp-block-heading\">Sports Go Sports</h4>\n\n\n<p><a href=\"https://t.co/kBDlcOK6ge\">The Seth Burn 2025 Football Preview is here</a>, along with <a href=\"https://t.co/ivczstEnxv\">the podcast discussion</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">Opportunity Knocks</h4>\n\n\n<p>If you must hire a PR agency, <a href=\"https://www.getflack.com/p/should-you-hire-a-pr-agency\">this from Lulu Cheng Meservey</a> strikes me as good basic advice on doing so.</p>\n<p><a href=\"https://x.com/PaulSkallas/status/1958452437448016181\">Should you consider retiring to places like Italy</a>, perhaps under <a href=\"https://x.com/thealepalombo/status/1958103876151734486\">a deal to go to a small town to get a 7% flat tax regime for 10 years</a>? Is there a good deal to be struck where American retirees help fund what remains of Europe, especially given that translation is rapidly becoming seamless and these places are indeed very nice by all accounts? Paul Skallas here describes Southern Europe as ‘dirt cheap,’ citing this chart:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!3Jp-!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fabe6acbe-751b-4196-a068-4555f4e99440_673x900.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>I am deeply skeptical that the discounts are this large, and my AI sanity check confirmed the savings are real but relatively modest. Also consider what ‘comfortable retirement’ means in places that (for example) won’t let you buy an air conditioner. But yeah, if you only have modest savings it seems like a good thing to consider.</p>\n\n\n<h4 class=\"wp-block-heading\">Antisocial Media</h4>\n\n\n<p><a href=\"https://x.com/MaxLobovsky/status/1961864054969868657\">YouTube Premium is an ideal product</a>. For $10 a month you get no ads, creators get paid, and the variety of content is phenomenal. Yes, you could use AdBlock to get around it in many cases, and many will do that, but this is what the internet is supposed to look like.</p>\n<blockquote><p>Maxim Lobovsky: Not only is YouTube Premium great, it&#8217;s one of the few major ad-supported businesses offering a paid alternative. Paid social media is one of the only plausible solutions to the algorithm-driven polarization/rage-baiting/lowest-common-denominator content death spiral.</p></blockquote>\n<p>The problem is that you can’t then subscribe individually to everything else, because that adds up fast. Give me a unified YouTube Premium style subscription, please.</p>\n<p><a href=\"https://x.com/SonnyBunch/status/1966900203799409066\">Yes, the failure to shut down TikTok</a> despite a law making it illegal that was upheld by the Supreme Court 9-0 is rather insane. Trump is flat out refusing to enforce the ban and extending the deadline indefinitely, you can speculate as to why.</p>\n<p><a href=\"https://x.com/IsaacKing314/status/1962211633151029725\">Downvotes, in some form</a>, are a vital part of any social platform that has upvotes, both to maintain civility and maintain good incentives. If you can easily express pleasure there needs to also be an easy way to express displeasure. Dan Luu gives one reason, which is that otherwise people will write nasty comments as a substitute. The other reason is that otherwise maximizing for toxoplasma of rage and extreme reactions to get engagement wins and crowds other actions out. If you are going to do rankings, the rankings on LessWrong and also Reddit mostly seem quite good, and those are the only places where somewhat algorithmic feeds seem to do well.</p>\n<blockquote><p>Emmett Shear: The belief that downvotes are “uncivil” was one of the most common delusions I have encountered while working in social media.</p>\n<p>Oliver Habryka: Yep, one of the things I always considered most crucial to maintain with LW 2.0. When I was shopping around for forum software alternatives when we started building LW 2.0 this ruled out like 80% of the options on the market.</p></blockquote>\n<p><a href=\"https://x.com/cremieuxrecueil/status/1955849238094426233\">Cremieux reports he was suspended from Twitter for a day</a> for saying that Tea app had been hacked, which was called ‘posting other people&#8217;s private information without their express authorization and permission,’ except he did not do this or link to anyone who did do it (he said ‘you can go download 59.3 GB of user selfies right now’), whereas people who do expose such info often get ignored. He went warpath, citing various laws he asserts Twitter is breaking around the world.</p>\n<p>(The link in the screenshot below takes you back to the post itself.)</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!lzho!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9d8bd808-0bd6-4a36-accd-d42b342d3732_728x1280.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>Lewis: meanwhile post doxxing [someone’s] address was never removed. 2.5M views. reported it and DM’d Nikita, never heard back on either.</p>\n<p>Sin: My contribution [which is literally a map containing the location with a giant arrow pointing to it saying it is where this person lives].</p></blockquote>\n<p>I saw this over a week later. Still there.</p>\n<p>Elon Musk made a lot of mistakes with Twitter, but also did make some very good changes. <a href=\"https://x.com/SamoBurja/status/1961096061776265521\">One of them is that likes are now private</a>. This damages an outsider’s ability to read and evaluate interactions, but it takes away the threat of the gotcha when someone is caught liking (or even not liking!) the wrong tweet and the general worry about perception, freeing people up to use them in various ways including to acknowledge that you’ve seen something, and to offer private approval.</p>\n<p>It’s very freeing. When likes were public, which also means it was public what you didn’t like, I decided the only solution to this was to essentially not use the like button. Which worked, but is a big degrading of usefulness of Twitter.</p>\n<blockquote><p>Redaction: It really is insane how simply Hiding Likes On Twitter meaningfully shifted the overton window of the American political landscape</p>\n<p><a href=\"https://x.com/SamoBurja/status/1961096061776265521\">Samo Burja</a>: I underestimated the impact change at the time. I think I thought preference falsification was much less pervasive than it was.</p></blockquote>\n<p>Meanwhile, in other contexts, it is still very much a thing to talk about who has liked which Instagram posts. This is exactly as insufferable as it sounds.</p>\n<p>Every time Nikita tries to make me feel better about Twitter I end up feeling worse.</p>\n<blockquote><p><a href=\"https://x.com/nikitabier/status/1961869502569959816\">Nikita Bier</a> (Twitter): The first step to eliminating spam is eliminating the incentive.</p>\n<p>So over the last week, I have gone deep down the rabbit hole of X spam:</p>\n<p>I am now in 3 WhatsApp groups for financial scams. I have become their friends. I know about their families. I cannot blow my cover yet.</p></blockquote>\n<p>What is the goal exactly? How would befriending them help? We already all know exactly how to identify these scams and roughly how they work. Understanding more details will not help Nikita or anyone else do anything. You think you’re going to do enough real world takedowns and arrests that people are scared to do scams, or something? How about instead we do basic filtering work?</p>\n<p>Or, when he posts this:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!TO_8!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4aa1e74a-336c-49e7-b13c-57c8561f48d4_930x697.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Or this:</p>\n<blockquote><p>Eli: Twitter should include 3 schizophrenic reply guys and 1 egirl with Premium +</p>\n<p><a href=\"https://x.com/nikitabier/status/1961857056379719787\">Nikita Bier</a>: We did the math and that’s what retains a user.</p></blockquote>\n<p>He kids, but kid enough times in enough ways with enough detail and you’re not fully kidding. It is very clear that Twitter is doing a lot of the Goodhart’s Law thing, where short term feedback metrics are being chased without much eye on the overall experience. Over time, this goes to quite bad places.</p>\n<p>Also, yeah, this is not okay:</p>\n<blockquote><p><a href=\"https://x.com/micsolana/status/1962983145462259908\">Mike Solana</a>: I truly believe blocking is a right, and I would never go after someone for blocking me for any reason. but you should not then be able to unblock, comment on a post of mine, and immediately REBLOCK so I can&#8217;t respond. in this case, I deserve at least 24 hours to roast your ass.</p></blockquote>\n<p>There are any number of obviously acceptable solutions to this. I like the 24 hours, where if you do something that you couldn’t do while they are blocked, your reblock is delayed for a day.</p>\n<p><a href=\"https://x.com/vasumanmoza/status/1966264982905254343\">Local coffee shop sets up a bot farm with hundreds of phones</a> to amplify their messages on Instagram.</p>\n<blockquote><p>Vas: If a simple coffee shop has a bot farm with 100s of phones to amplify their message, please consider what a foreign agency or adversarial operator is running on your favorite social media platform.</p>\n<p>Especially today, please consider that the opinions you read, the calls to violence you hear, and the news you digest, are all an operation done to sow hatred in your mind and your soul.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Government Working</h4>\n\n\n<p><a href=\"https://www.econlib.org/sumner-final-econlog-post\">Scott Sumner uses his final EconLib post to remind us that almost everything is downstream of integrity</a>. Without informal norms of behavior our laws will erode until they mean almost nothing, and those informal norms are increasingly discarded. He cites many examples of ways things might (read: already did) go wrong.</p>\n<p>I may never stop finding it funny the extent to which Trump will seek out the one thing we know definitively is going badly, then and choose that to lie and brag about.</p>\n<p>As in, how is the DC crackdown going? I only as of writing this know for sure that restaurant reservations were down, although it turns out <a href=\"https://www.washingtonpost.com/opinions/2025/08/22/trump-smithsonian-washington-slavery/\">not down as much as initially reported once you control for restaurant week</a> but 7% is still a lot. So of course…</p>\n<blockquote><p><a href=\"https://x.com/MeidasTouch/status/1958940277890269402\">Donald Trump</a>: People are excited again. Going to restaurants again [in DC]. The restaurant business, you can&#8217;t get into a restaurant.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!8-9l!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9b72dc45-d34e-428a-a3ca-a477d8bbc570_1200x863.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p><a href=\"https://www.bloomberg.com/news/articles/2025-08-26/dollar-falls-with-treasuries-as-trump-seeks-to-oust-fed-s-cook?taid=68ad01f7f3b52800011c51a0&amp;utm_campaign=trueanthem&amp;utm_content=business&amp;utm_medium=social&amp;utm_source=twitter\">Trump attempted</a> to fire Federal Reserve Governor Lisa Cook ‘for cause,’ <a href=\"https://www.bloomberg.com/news/articles/2025-08-26/trump-removes-fed-governor-lisa-cook-effective-immediately\">setting up a legal fight</a>. Cook was not about to leave quietly.</p>\n<p>Initial market reaction was muted, the dollar only declined 0.3% and gold only rose 0.6%, likely because it was one escalation among many and it might fail, but this is a direct full assault on central bank independence, and central bank independence is a really big deal.</p>\n<blockquote><p>Jonnelle Marte and Myles Miller (Bloomberg): While a president has never removed a Fed governor from office, one can do so for cause. Laws that describe “for cause” generally define the term as encompassing three possibilities: inefficiency; neglect of duty; and malfeasance, meaning wrongdoing, in office.</p></blockquote>\n<p>What was this ‘cause’?</p>\n<blockquote><p>Trump had earlier called for Cook’s resignation after <a href=\"https://www.bloomberg.com/quote/3218437Z:US\">Federal Housing Finance Agency</a> Director Bill Pulte alleged she lied on loan applications for two properties — one in Michigan and one in Georgia — claiming she would use each property as her primary residence to secure more favorable loan terms.</p>\n<p>Trump said it was “inconceivable” that Cook was not aware of requirements in two separate mortgage applications taken out in the same year requiring her to maintain each property as her primary residence.</p></blockquote>\n<p>That’s it. There are no additional claims. Only the claim that she claimed one place would be a primary residence, and then claimed a different primary residence.</p>\n<blockquote><p>Pulte, in a statement posted to social media, thanked Trump for removing Cook. “If you commit mortgage fraud in America, we will come after you, no matter who you are,” he wrote.</p></blockquote>\n<p>What about if you are President of the United States and have recently had a nine figure judgment against your ‘Trump’ organization entered against you for lying on mortgage applications? Are we coming for you?</p>\n<p><a href=\"https://x.com/Fritschner/status/1966619302880034821\">Oh, and what if it turned out,</a> as it has, that the claim against Cook simply isn’t true?</p>\n<blockquote><p>Aaron Fritschner: The mortgage fraud claim against Lisa Cook is false, per documents obtained by Reuters. Bill Pulte&#8217;s accusation, the sole pretext Trump used to fire her from the Fed, was that she claimed two homes as primary residence. <a href=\"https://www.reuters.com/world/us/fed-governor-cook-declared-her-atlanta-property-vacation-home-documents-show-2025-09-13/\">These docs show she did not</a>.</p>\n<p>“The document, dated May 28, 2021, was issued to Cook by her credit union in the weeks before she completed the purchase and shows that she had told the lender that the Atlanta property wouldn’t be her primary residence.”</p>\n<p>“documentation reviewed by Reuters for the Atlanta home filed with a court in Georgia’s Fulton County, clearly says the stipulation exists “unless Lender otherwise agrees in writing.” The loan estimate, a document prepared by the credit union, states “Property Use: Vacation Home”</p>\n<p>Lisa Cook also didn’t claim a tax credit for primary residence on the second home and declared it as a second home on official federal government documents when she was being considered for a role on the Fed. A real master criminal.</p></blockquote>\n<p>Also her mortgage rate was 3.5%, modestly higher than the going rate at the time.</p>\n<p>If you are going to try and fire a Federal Reserve President for cause, something that has not happened (checks notes, by which I mean GPT-5) ever, thus endangering faith in Fed independence and the entire financial system, you might want to follow due process, or at least confirm that your accusation is true? As opposed to demonstrably false?</p>\n<p>A lot of people are understandably highly outraged about this, <a href=\"https://adamtooze.substack.com/p/chartbook-406-trump-v-the-fed-or?utm_campaign=email-half-post&amp;r=h8n&amp;utm_source=substack&amp;utm_medium=email\">as Adam Tooze partly covered</a> right after the attempted firing. This comes on the heels of firing the head of the Bureau of Labor Statistics because Trump didn’t like the statistics.</p>\n<p>A reminder that yes, there is at least one clear prior case of a crazy person destroying a nation’s health that parallels RFK Jr, <a href=\"https://x.com/decunningham2/status/1961103959860654494\">as in South Africa where their President denied drugs to AIDS patients</a>.</p>\n<p><a href=\"https://www.theargumentmag.com/p/the-honesty-tax?triedRedirect=true\">Yes, all the various ‘honesty taxes’ our government imposes</a> (<a href=\"https://x.com/KelseyTuoc/status/1963276743738786269\">also see this highlighted comment</a>) are extremely pernicious and do a lot more damage than people realize. We teach people they have to lie in order to get food stamps, and they (just like LLMs!) learn to generalize this, everything impacts everything, our society is saying lying is okay and lying to the government is mandatory, you can’t isolate that. You don’t get a high trust society that way, although we are remarkably high trust in some ways despite this.</p>\n<p>Most of the time, the correct answer is not to enforce the rules as written even if we could do so, instead the correct answer is to remove or heavily modify the rule. Our rules are tuned to the idea they won’t be enforced, so it is likely enforcing them would not go well. Then there are exceptions, such as primary residence mortgage fraud.</p>\n<blockquote><p>Aaron Bergman: I think ethics- and integrity-pilled people need to have a better theory of when it’s cool to lie to *institutions*</p>\n<p>The “lying to a human” vs “lying to institution” distinction is real and important btw, the bar for the latter is much lower</p>\n<p><a href=\"https://x.com/ohabryka/status/1963308358175457385\">Oliver Habryka</a>: Yeah, I agree with this. I think lying to institutions is frequently fine, often roughly proportional to how big they are, though there are also other important factors.</p></blockquote>\n<p>I don’t have a great answer to exactly when this all makes it okay to lie to corporations or governments and on forms. My guess is it is roughly ‘do not break the social contract.’ But if this is something where is no longer (or never was) a social contract, and no one would look at you funny if you were doing it in the open, then fine.</p>\n<p>If you notice you are very clearly expected to lie (including by omission) or do a fake version of something, that the system is designed that way, then you have little choice, especially if you are also forced to deal with such institutions in order to get vital goods or services.</p>\n<p><a href=\"https://x.com/ByMikeBaker/status/1962890986528571818\">Idaho suicide hotline is forced to ask teens who call to get parental consent</a> <a href=\"https://idahocapitalsun.com/2025/08/29/idahos-parental-consent-law-impedes-988-suicide-crisis-hotline-access-for-some-youth/\">due to a law passed last year</a> requiring consent for almost all medical treatments for minors. As you would expect, most of them hang up.</p>\n<p>Are Trump’s tariffs helping domestic manufacturing? <a href=\"https://x.com/JustinWolfers/status/1962883669665743167\">What do the domestic manufacturers say about this?</a></p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!QjZY!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb0d73938-c872-424a-a7fe-701db0874944_1240x1630.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/prestonjbyrne/status/1962846706854236518\">UK arrests comedian for speech, where the speech was done on American soil.</a></p>\n<p>I try to keep a high threshold for criticism but it does seem like <a href=\"https://x.com/rgoodlaw/status/1963356695695954274\">Trump ordered a bunch of people murdered</a> (some might use the term ‘war crime’ but I prefer plain language and also there was no war involved, the ‘war on drugs’ is not a war) on the high seas with absolutely no legal basis for doing so? He ran the plot of Clear And Present Danger straight up in the open? You didn’t know there were drugs involved, and even if you did you can’t go around blowing up boats purely because there were drugs involved?</p>\n<p>Especially when you had the power to interdict and instead decided to ‘send a message’ as per Secretary of State Marco Rubio by blowing up the boat with no warning because the boat (that you could have interdicted) posed an ‘immediate threat to the United States’? <a href=\"https://x.com/hissgoescobra/status/1964468240173977982\">And a letter from the White House to Senators Mike Johnson and Chuck Grassley that confirms</a>, yep, straight up murder and likely we will murder again? <a href=\"https://x.com/hissgoescobra/status/1964370950209863832\">And JD Vance seems to confirm that this is straight up murder</a>?</p>\n<blockquote><p>JD Vance: Killing cartel members who poison our fellow citizens is the highest and best use of our military.</p>\n<p><a href=\"https://x.com/RandPaul/status/1964494191783714933\">Rand Paul</a>: JD “I don’t give a shit” Vance says killing people he accuses of a crime is the “highest and best use of the military.”</p>\n<p>Did he ever read To Kill a Mockingbird?</p>\n<p>Did he ever wonder what might happen if the accused were immediately executed without trial or representation??</p>\n<p>What a despicable and thoughtless sentiment it is to glorify killing someone without a trial.</p></blockquote>\n<p>I’m sincerely and deeply confused what makes this not straight up murder and have not seen any serious arguments for why it would be anything else, as opposed to ‘yes it is murder and I really like murder for us here, yay this murder.’ It also seems, to the extent such points are relevant in 2025, like a very clear ‘high crime and misdemeanor.’</p>\n\n\n<h4 class=\"wp-block-heading\">Technology Advances</h4>\n\n\n<p><a href=\"https://stratechery.com/2025/iphones-17-and-the-sugar-water-trap/\">Apple’s new iPhone 17 Pro Max</a> seems like a substantial improvement over the iPhone 16 Pro Max. You get 50% more ram, at least twice as many camera pixels, better cooling, a substantially better battery, and a new faster chip with GPUs ‘designed for AI workloads.’ I’m going to stick with my Pixel 9 Fold, the only feature on iPhones that is compelling to me at all is avoiding anti-Android discrimination, hell of a business model, but those are nice upgrades.</p>\n<p><a href=\"https://www.wsj.com/articles/apples-vision-pro-gaining-traction-in-some-niches-of-business-16d3c74e?mod=cio-journal_lead_story\">Apple Vision Pro is making small inroads</a> in specialized workplaces that can exploit spatial computing, including things like exploring potential new kitchens or training airline pilots. It is expensive, but if it is the best tool, it can still be worth it. The rest of us will be waiting until it is lighter, better, faster and cheaper.</p>\n<p><a href=\"https://www.washingtonpost.com/investigations/2025/09/08/meta-research-child-safety-virtual-reality/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU3MzA0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU4Njg2Mzk5LCJpYXQiOjE3NTczMDQwMDAsImp0aSI6ImI0YjE3MmQ4LTcxOTUtNDYzNC1iMzg5LWE4MTRiNjZjMjRjMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzA5LzA4L21ldGEtcmVzZWFyY2gtY2hpbGQtc2FmZXR5LXZpcnR1YWwtcmVhbGl0eS8ifQ._vi7EHRF-9pQzsvuiYpSAyyZO_efra56gs61WZBihvE\">Meta had some issues with child safety when using its smart glasses</a>, so whistleblowers report that they tried to bury it or shield it from public disclosure in various ways. This continues the pattern where:</p>\n<ol>\n<li>Meta has a safety problem.</li>\n<li>When Meta tries to have internal clarity and do research on the dangers of its products, people leak that information to the press, details get taken out of context and they get hauled before Congress.</li>\n<li>When Meta responds to this by avoiding clarity, and suppressing the research or ignoring the problem, they get blamed for that too.</li>\n</ol>\n<p>I mean, yes, why not simply actually deal with your safety problems is a valid response, but the incentives here are pretty nasty.</p>\n<p>The central accusation is that the company’s lawyers intervened to shape research into risks from virtual reality, but I mean it would be insane for Meta not to loop the lawyers in on that research. If we are going to make Meta blameworthy, including legally, for doing the research, then yes they are going to run the research by the lawyers. This is a failure of public policy and public choice.</p>\n<p>That doesn’t make the actual problems any less terrible, but it sounds like they are very standard. Kids were bypassing age restrictions, and when interacting with others they would get propositioned. It seems like the accusation is literally ‘Meta let its users interact with each other, and sometimes those users said or did bad things.’</p>\n<blockquote><p>Experts have long warned that virtual reality can endanger children by potentially <a href=\"https://www.washingtonpost.com/technology/2022/02/07/facebook-metaverse-horizon-worlds-kids-safety/\">exposing them</a> to direct, real-time contact with adult predators.</p></blockquote>\n<p>It is remarkable how consistently even the selected examples don’t involve VR features beyond allowing users to talk? I’m not saying you don’t need to have safeguards for this, but it all sounds very similar to the paranoia and statistical illiteracy where we don’t let children participate in physical spaces anymore.</p>\n<p>I love this report of a major problem running the other way, to which, I mean, fair:</p>\n<blockquote><p>In a January 2022 post to a private internal message board, a Meta employee flagged the presence of children in “Horizon Worlds,” which was at the time supposed to be used only by adults 18 and over. The employee wrote that an analysis of app reviews indicated many were being driven off the app because of child users.</p></blockquote>\n<p>I’m not saying Meta handled any of this perfectly or even handled it well. But there’s no smoking gun here, and no indication that they aren’t taking reasonable steps.</p>\n<p><a href=\"https://www.washingtonpost.com/technology/2025/09/08/meta-whatsapp-security-privacy/\">Meta is also being sued and accused of violating and FTC agreement on WhatsApp privacy</a> and account protection, claiming 500,000 WhatsApp accounts are stolen daily.</p>\n\n\n<h4 class=\"wp-block-heading\">For Science!</h4>\n\n\n<p>Matthew served, and Nate served back, so now it’s on.</p>\n<blockquote><p><a href=\"https://x.com/NateSilver538/status/1957229666609041652\">Nate Silver</a>: Academic journals might be a lost cause but they&#8217;d probably be better if you had some non-academic practitioners serving as reviewers. Journalists have their problems too but they have much better bullshit detectors, for instance.</p>\n<p>The most important research paper of the past 10 years is the Google transformer paper (&#8220;Attention Is All You Need&#8221;) and it was written by non-academics and published in an open-access journal.</p>\n<p>You ran some cool regression analysis OK great. Make some nice graphics and put it on a Substack. Engaging headline, 1500-2500 well-written words. That&#8217;s literally 100x faster than trying to publish in a journal and it&#8217;s better peer review anyway.</p>\n<p><a href=\"https://x.com/MatthewSitman/status/1957223526215331933\">Matthew Sitman</a>: Very, very occasionally an exceptional generalist intellectual or particularly well-informed journalist might be able to see a problem with a paper that an academic close to the subject doesn&#8217;t, but this radically underestimates the uses of expertise/familiarity with a literature.</p>\n<p>As someone who&#8217;s been an academic and now talks/writes about ideas for non-specialists, a difference is that academics, ideally, know what they don&#8217;t know, are aware of questions asked/answered previously, etc; if that can produce tunnel vision, well, they&#8217;re trying to dig deep.</p>\n<p><a href=\"https://x.com/NateSilver538/status/1957229666609041652\">Nate Silver</a>: Well, I know a lot about statistical inference, have been doing it for 25 years, have faced a lot of public scrutiny, and in the fields where I also have a lot of domain knowledge, probably half of published papers have obvious fatal flaws that render them unfit for publication.</p>\n<p>Maybe I&#8217;m a weird outlier, but the peer review process is obviously broken. Maybe it&#8217;s better in the fields I *don&#8217;t* know well. But I&#8217;d be surprised if that&#8217;s true.</p>\n<p><a href=\"https://x.com/Aella_Girl/status/1957482879891698032\">Aella</a>: People don&#8217;t understand how much of a joke the current state of peer review is. It&#8217;s extremely bad.</p>\n<p>It&#8217;s bad enough that at one point I was suggesting to someone &#8220;why don&#8217;t you just deliberately insert mistakes so they can feel satisfied about finding those and don&#8217;t end up fucking with the rest of the paper&#8221;</p>\n<p>St. Motweb: This is actually a strategy that many academics use.</p>\n<p>SolDad: I unironically do this in my papers, sort of. Not inserting new stuff, but leaving fairly-obvious but not super important work undone as “low hanging fruit” for the reviewers to notice and ask for.</p></blockquote>\n<p>This suggests a wager.</p>\n<p>Select a field. A neutral party (or an LLM with an agreed upon prompt) selects 10 recent papers that meet some criteria for being Proper Papers In Good Journals and that assert some statistical finding and thus could in theory be flawed.</p>\n<p>If Nate Silver can find a fatal flaw in at least 2 of the 10 papers, as evaluated by an agreed neutral judge, then he wins. If not, he loses. This should cover both sides: Two is enough that the system is obviously fatally flawed, and Nate says he can average five.</p>\n<p>This is not a statement that the first best solution to peer review involved outsiders like Nate Silver reviewing papers. That seems obviously wrong. It is a claim that the current solution is so utterly terrible that outsider review would be a big improvement.</p>\n<p>Indeed, ‘put your ideas out on the internet and let people critique them’ is the actual essence of true peer review, and far superior in practice to the formal version in 2025.</p>\n<p><a href=\"https://thezvi.substack.com/p/analyzing-a-critique-of-the-ai-2027?utm_source=publication-search\">I am reminded of when I wrote a detailed response to a detailed response to AI 2027.</a> Titotal accused AI 2027 of not having gone through ‘peer review’ and then proceeded to do peer review of AI 2027. Which was great, we thank Titotal for his service here, and I in turn then also contributed.</p>\n<p>As I said then:</p>\n<blockquote><p>This is the peer! This is the review! That is how all of this works! This is it working!</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Variously Effective Altruism</h4>\n\n\n<p>Rob Bensinger is latest to note that <a href=\"https://x.com/robbensinger/status/1956096160952922326\">we could do way better on a wide array of problems if we could improve discourse norms</a>, and this could be a high impact play. That doesn’t mean we know how to pull it off. As he notes, prediction markets have been somewhat helpful, but seem unlikely to be the full game changer we need. Also as he notes, this would be great to pull off but there’s an attractor that causes this to look more relatively doable than it is, which can trick people into focusing on it more than they should relative to other interventions.</p>\n<p>Kelsey Piper provides her overview of the findings that <a href=\"https://www.theargumentmag.com/p/giving-people-money-helped-less-than\">Giving People Money on a monthly basis in America does not seem to improve most outcomes</a>, including child outcomes. They’re not ‘blowing’ the money on vices, but people give back a lot of it by working less, and while they tell stories about how great things are, most of the statistics don’t improve.</p>\n<p>She then points us to a <a href=\"https://thecausalfallacy.com/p/rossis-revenge\">conservative critique of her analysis by Charles Lehman</a>. I agree with Charles that the criticism ‘maybe the gains don’t show up in the measurements’ is rather silly, unless you can point to a specific policy aim that isn’t being measured, and explain why you have hope for that one despite the others not showing up.</p>\n<p>I also appreciated Charles saying that for American purposes, a study of a social intervention in Africa should be treated similarly to when biologists say something ‘works in vitro,’ as conditions are so radically different. The synthesis would be that ‘give people money’ is highly useful at improving various outcomes when those people have so little money that they risk starvation, but not that far beyond that, and existing interventions here already take us above the threshold.</p>\n<p>We definitely need to reconcile our model of how this works with not only the null results in these studies, but also the other null results from many other programs.</p>\n<p>One reason to be suspicious of ‘policy mostly can’t help’ is that if you propose ‘policy mostly can’t hurt’ or even ‘getting rid of existing policies and enforcement mostly can’t hurt’ then most people will disagree with you. So at minimum, you can help by not hurting, and you should find the extreme asymmetry suspicious.</p>\n<p>I do have one policy objective that I am confident this does help with if it is reliable and sustained, which is fertility. I’m sticking by the estimate that for every ~$270k in value (which need not be cash) you transfer to parents, you get one additional birth. This is one area where anticipation of money, or rather anticipation of having the necessary resources of all types, definitely changes behavior.</p>\n<p>I concur with the consensus view that <a href=\"https://substack.com/@honestsignals/p-168898025\">this post from Lennox about trying to sell Marx to EAs backfiring spectacularly</a> is a gem of a read. You get such fun as Lennox encountering the Socialist Calculation Debate in its purest form:</p>\n<blockquote><p>Lennox: But when I looked at what the EAs were actually doing, and the methods they were using to evaluate charities, it quickly became clear that this was not going to work. One look at a GiveWell spreadsheet filled my heart with dread. They were creating insanely detailed cost effectiveness estimates of different interventions, using probabilistic models that tried to account for every possible empirical and philosophical assumption you could think of.</p>\n<p>It would be great to analyse policies that fundamentally transform the economy at this level of detail, but there were a couple of problems. First, it&#8217;s impossible to create a useful model at that level of detail for transformative economic policies. Second, even if it were possible, there&#8217;s no way I could do it.</p>\n<p>Fine. Lesson learned.</p></blockquote>\n<p>Except, of course, lesson not learned, because he didn’t then think ‘oh that is exactly why the socialist ideas I am advocating for won’t work.’ So he continues, and asks his sociological experts who love socialism. The same result happens again:</p>\n<blockquote><p>This was&#8230; disappointing to say the least. Here was a group of serious academics who had spent decades trying to make a rigorous case for socialism, and this is what they ended up concluding? That we don&#8217;t have the social technology to make it work, but maybe one day we will get there.</p></blockquote>\n<p>He then does the ‘finds smoking causes cancer, quits reading’ move, saying this means analytical Marxists had undermined themselves so maybe look at critical theory. Because, of course:</p>\n<blockquote><p>I&#8217;d assumed that if you want to solve a systemic problem like global poverty, you need to understand the root cause, and the root cause of poverty was, of course, capitalism.</p>\n<p>…</p>\n<p>However, understanding the root cause of something doesn&#8217;t automatically help you solve it.</p></blockquote>\n<p>The main mistake, of course, is that the root cause was not capitalism but instead the human condition. This had not yet entered Lennox’s hypothesis space. The other mistake was, yes, knowing the root cause of something does not always help solve it.</p>\n<p>The evidence continued to mount.</p>\n<blockquote><p>Throughout undergrad, I would read sociological theorists and often find their arguments vague, opaque, and at times just poorly argued. Then I would read work by EAs and find it crystal clear, carefully argued, and generally well calibrated to the evidence.</p>\n<p>…</p>\n<p>The final nail in the coffin came while reading Scott Alexander&#8217;s essay<a href=\"https://slatestarcodex.com/2014/07/30/meditations-on-moloch/\"> <em>Meditations on Moloch</em></a>.</p>\n<p>..</p>\n<p>Looking back, I could have saved myself a lot of time. These fundamental problems with the project were probably obvious to many in the EA community and they would have told me the project was unlikely to be useful, if I&#8217;d had the courage to ask. But I avoided getting their feedback, partly because I figured they were ideologically blinded and would just dismiss anything critical of their movement.</p></blockquote>\n<p>That last line really is wonderful. Socialist refuses to get feedback from target audience because they are worried audience is ideologically blinded. Love it.</p>\n<p>After that he is then able to do some self-reflection, also fun but less fun. Then in conclusion he comes around and notes that if you accept that the world is a swirling mess of misaligned incentives and coordination problems, then this completely undermines the Marxist political project.</p>\n<p>That is indeed how the world works, so yes. Thank you. Well done, sir. Also, well done, sir, at the end:</p>\n<blockquote><p>Anyway, a couple of years after this happened I fell in love, and it was everything the poets and songwriters said it would be. So I guess the moral of the story is: if you find yourself tempted to construct elaborate ideological arguments in a vain attempt to make yourself feel smart and important, consider falling in love instead.</p></blockquote>"
            ],
            "link": "https://thezvi.wordpress.com/2025/09/15/monthly-roundup-34-september-2025/",
            "publishedAt": "2025-09-15",
            "source": "TheZvi",
            "summary": "All the news that’s fit to print, but has nowhere to go. Important Rules Reminder This important rule is a special case of an even more important rule: Dirty Hexas Hedge: One of the old unwritten WASP rules of civilization &#8230; <a href=\"https://thezvi.wordpress.com/2025/09/15/monthly-roundup-34-september-2025/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Monthly Roundup #34: September 2025"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3142/",
            "publishedAt": "2025-09-15",
            "source": "XKCD",
            "summary": "<img alt=\"If you want to see true audacity, do an image search for 'Altoona-style pizza.'\" src=\"https://imgs.xkcd.com/comics/city_style_pizza.png\" title=\"If you want to see true audacity, do an image search for 'Altoona-style pizza.'\" />",
            "title": "-Style Pizza"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-09-15"
}