{
    "articles": [
        {
            "content": [
                "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff849360f-e369-473d-9bf0-9e614f6d7904_864x558.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"558\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff849360f-e369-473d-9bf0-9e614f6d7904_864x558.jpeg\" width=\"864\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><h6>Set design for <em>Bayou</em> (1953), Dorothea Tanning</h6><p></p><p>No one else knows what you need.</p><p>You can keep asking around. You can demand that your smartest friends or your father or your girlfriend or your spouse tell you what you should do next. You can check your horoscope repeatedly. You can keep following the plan you made at age 19, even though it feels wrong now. &#8230;</p>\n      <p>\n          <a href=\"https://www.ask-polly.com/p/digging-for-your-buried-needs\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.ask-polly.com/p/digging-for-your-buried-needs",
            "publishedAt": "2025-02-17",
            "source": "Ask Polly",
            "summary": "Do you encourage yourself to wander, experiment, and try new things? Or does every single thing you do need to look productive and useful - to you *and* others?",
            "title": "Digging For Your Buried Needs"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Trump is doing Europe a favor by revealing the true cost of <a href=\"https://world.hey.com/dhh/europe-s-impotent-rage-7edae302\">its impotency</a>. Because, in many ways, he has the manners and the honesty of a child. A kid will just blurt out in the supermarket \"why is that lady so fat, mommy?\". That's not a polite thing to ask within earshot of said lady, but it might well be a fair question and a true observation! Trump is just as blunt when he essentially asks: \"Why is Europe so weak?\".<br /><br /></div><div>Because Europe <em>is</em> weak, spiritually and militarily, in the face of Russia. It's that inherent weakness that's breeding the delusion that Russia is at once both on its last legs, about to lose the war against Ukraine any second now, and also the all-potent superpower that could take over all of Europe, if we don't start World Word III to counter it. This is not a coherent position.<br /><br /></div><div>If you want peace, <a href=\"https://www.youtube.com/watch?v=-gYpCIbZjUQ\">you must be strong</a>.<br /><br />The big cats in the international jungle don't stick to a rules-based order purely out of higher principles, but out of self-preservation. And they can smell weakness like a tiger smells blood. This goes for Europe too. All too happy to lecture weaker countries they do not fear on high-minded ideals of democracy and <a href=\"https://www.youtube.com/watch?v=-bMzFDpfDwc\">free speech</a>, while standing aghast and <a href=\"https://x.com/dhh/status/1891450868123287845\">weeping powerlessly</a> when someone stronger returns the favor.<br /><br /></div><div>I'm not saying that this is right, in some abstract moral sense. I like the idea of a rules-based order. I like the idea of territorial sovereignty. I even like the idea that the normal exchanges between countries isn't as blunt and honest as those of a child in the supermarket. But what I like and \"what is\" need separating.<br /><br /></div><div>Europe simply can't have it both ways. Be weak militarily, utterly dependent on an American security guarantee, and also <a href=\"https://apnews.com/article/trump-ukraine-russia-war-putin-zelenskyy-europe-7940f9c5828fc46431928bc073170bc2\">expect a seat at the big-cat table</a>. These positions are incompatible. You either get your peace dividend -- and the freedom to squander it on net-zero nonsense -- or you get to have a say in how the world around you is organized.</div><div><br />Which brings us back to Trump doing Europe a favor. For all his bluster and bullying, America is still a benign force in its relation to Europe. We're being punked by someone from our own alliance. That's a cheap way of learning the lesson that weakness, impotence, and peace-dividend thinking is a short-term strategy. Russia could teach Europe a far more costly lesson. So too China.<br /><br /></div><div>All that to say is that Europe must heed the rude awakening from our cowboy friends across the Atlantic. They may be crude, they may be curt, but by golly, they do have a point.<br /><br /></div><div>Get jacked, Europe, and you'll no longer get punked. Stay feeble, Europe, and the indignities won't stop with being snubbed in Saudi Arabia.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/europe-must-become-dangerous-again-13413d78",
            "publishedAt": "2025-02-19",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Trump is doing Europe a favor by revealing the true cost of <a href=\"https://world.hey.com/dhh/europe-s-impotent-rage-7edae302\">its impotency</a>. Because, in many ways, he has the manners and the honesty of a child. A kid will just blurt out in the supermarket \"why is that lady so fat, mommy?\". That's not a polite thing to ask within earshot of said lady, but it might well be a fair question and a true observation! Trump is just as blunt when he essentially asks: \"Why is Europe so weak?\".<br /><br /></div><div>Because Europe <em>is</em> weak, spiritually and militarily, in the face of Russia. It's that inherent weakness that's breeding the delusion that Russia is at once both on its last legs, about to lose the war against Ukraine any second now, and also the all-potent superpower that could take over all of Europe, if we don't start World Word III to counter it. This is not a coherent position.<br /><br /></div><div>If you want peace, <a href=\"https://www.youtube.com/watch?v=-gYpCIbZjUQ\">you must be strong</a>.<br /><br />The big cats in the international jungle don't stick to a rules-based order purely out of higher principles, but out of self-preservation. And they can smell weakness like a tiger smells blood. This goes for",
            "title": "Europe must become dangerous again"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Europe has become a third-rate power economically, politically, and militarily, and the price for this slowly building predicament is now due all at once.</div><div><br />First, America is seeking to negotiate peace in Ukraine directly with Russia, <a href=\"https://www.msn.com/en-us/politics/international-relations/us-to-mediate-russia-ukraine-peace-talks-without-europe-but-demands-plans-on-post-war-support/ar-AA1z8007\">without even inviting Europe to the table</a>. Decades of underfunding the European military has lead us here. The never-ending ridicule of America, for spending the supposedly \"absurd sum\" of 3.4% of its GDP to maintain its might, coming home to roost.<br /><br /></div><div>Second, mass immigration in Europe has become the central political theme driving the surge of right-wing parties in countries across the continent. Decades of blind adherence to a naive multi-cultural ideology has produced <a href=\"https://world.hey.com/dhh/failed-integration-and-the-fall-of-multiculturalism-77296314\">an abject failure to assimilate culturally-incompatible migrants</a>. Rather than respond to this growing public discontent, mainstream parties all over Europe run the same playbook of calling anyone with legitimate concerns \"racist\", and attempting to disparage or even ban political parties advancing these topics.<br /><br /></div><div>Third, the decline of entrepreneurship in Europe has lead to <a href=\"https://www.linkedin.com/pulse/great-divide-comparing-us-eu-companies-founded-last-50-magarian-gcuae/\">a death of new major companies</a>, and an accelerated brain drain to America. The European economy lost parity with the American after 2008, and now the net-zero nonsense has lead Europe's old manufacturing powerhouse, Germany, to commit financial harakiri. Shutting its nuclear power plants, over-investing in solar and wind, and rendering its prized car industry noncompetitive on the global market. The latter leading European bureaucrats in the unenviable position of having to both denounce Trump on his proposed tariffs while <a href=\"https://apnews.com/article/eu-tariffs-china-evs-24e19ab4277e61d624df2d3c75c15bc5\">imposing their own on the Chinese</a>.<br /><br /></div><div>A single failure in any of these three crucial realms would have been painful to deal with. But failure in all three at the same time is a disaster, and it's one of Europe's own making. Worse still is that Europeans at large still appear to be stuck in <a href=\"https://en.wikipedia.org/wiki/Five_stages_of_grief\">the early stages of grief</a>. Somewhere between \"anger\" and \"bargaining\". Leaving us with \"depression\" before we arrive at \"acceptance\".<br /><br /></div><div>Except this isn't destiny. Europe is not doomed to <a href=\"https://world.hey.com/dhh/europeans-don-t-have-or-understand-free-speech-c7c406e8\">impotent outrage</a> or <a href=\"https://world.hey.com/dhh/leave-it-to-the-germans-94dd4bbe\">repressive anger</a>. Europe has the people, the talent, and the capital to choose a different path. What it currently lacks is the will.<br /><br /></div><div>I'm a Dane. Therefore, I'm a European. I don't summarize the sad state of Europe out of spite or ill will or from a lack of standing. I don't want Europe to become American. But I want Europe to be strong, confident, and successful. Right now it's anything but.<br /><br /></div><div>The best time for Europe to make a change was twenty years ago. The next best time is right now. Forza Europe! Viva Europe!</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/europe-s-impotent-rage-7edae302",
            "publishedAt": "2025-02-17",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Europe has become a third-rate power economically, politically, and militarily, and the price for this slowly building predicament is now due all at once.</div><div><br />First, America is seeking to negotiate peace in Ukraine directly with Russia, <a href=\"https://www.msn.com/en-us/politics/international-relations/us-to-mediate-russia-ukraine-peace-talks-without-europe-but-demands-plans-on-post-war-support/ar-AA1z8007\">without even inviting Europe to the table</a>. Decades of underfunding the European military has lead us here. The never-ending ridicule of America, for spending the supposedly \"absurd sum\" of 3.4% of its GDP to maintain its might, coming home to roost.<br /><br /></div><div>Second, mass immigration in Europe has become the central political theme driving the surge of right-wing parties in countries across the continent. Decades of blind adherence to a naive multi-cultural ideology has produced <a href=\"https://world.hey.com/dhh/failed-integration-and-the-fall-of-multiculturalism-77296314\">an abject failure to assimilate culturally-incompatible migrants</a>. Rather than respond to this growing public discontent, mainstream parties all over Europe run the same playbook of calling anyone with legitimate concerns \"racist\", and attempting to disparage or even ban political parties advancing these topics.<br /><br /></div><div>Third, the decline of entrepreneurship in Europe has lead to <a href=\"https://www.linkedin.com/pulse/great-divide-comparing-us-eu-companies-founded-last-50-magarian-gcuae/\">a death of new major companies</a>, and an accelerated brain drain to America. The European economy lost parity with the American after 2008, and now the net-zero nonsense has lead",
            "title": "Europe's impotent rage"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>Just a day after <a href=\"https://world.hey.com/dhh/europeans-don-t-have-or-understand-free-speech-c7c406e8\">JD Vance's remarkable speech</a> in Munich, 60 Minutes validates his worst accusations in <a href=\"https://x.com/EndWokeness/status/1891302425190863347\">a chilling segment on the totalitarian German crackdown on free speech</a>. You couldn't have scripted this development for more irony or drama!<br /><br /></div><div>This isn't 60 Minutes finding a smoking gun in some secret government archive, detailing a plot to prosecute free speech under some fishy pretext. No, this is German prosecutors telling an American journalist in an open interview that insulting people online is a crime and retweeting a \"lie\" will get you in trouble with the law. No hidden cameras! All out in the open!</div><div><br />Nor is this just some rogue prosecutorial theory. 60 Minutes goes along for the ride with German police, as they conduct a <a href=\"https://www.youtube.com/watch?v=cIIEMMEElZI\">raid at dawn with six armed officers</a> to confiscate the laptop and a phone of a German citizen suspected of posting a racist cartoon. Even typing out this description of what happens sounds like insane hyperbole, but you can just watch the clip for yourself.</div><div><br />And this morning raid was just one of fifty that day. Fifty raids in a day! For wrong speech, spicy memes, online insults of politicians, and other utterances by German citizens critical of their government or policies! Is this is the kind of hallowed democracy that Germans are supposed to defend against the supposed threat of AfD?<br /><br /></div><div>As I <a href=\"https://world.hey.com/dhh/europeans-don-t-have-or-understand-free-speech-c7c406e8\">noted</a> yesterday, even Denmark has some draconian laws on the books limiting free speech. And they've been used in anger too. Although I've yet to see the kind of grotesque enforcement -- six armed officers at dawn coming to confiscate a laptop! -- but the trend is none the less worrying all across Europe, not just in Germany.</div><div><br />I suppose this is why European leaders are in such shock over Vance's wagging finger. Because they know he's dead on, but they're not used to getting called out like this. On the world stage, while they just had to sit there. I can see how that's humiliating.<br /><br /></div><div>But the humiliation of the European people is infinitely greater as they're gaslit about their right to free speech. That Vance doesn't know what he's talking about. Oh, and what about the Gulf of America?? It's pathetic.<br /><br /></div><div>So too is the apparent deep support from many parts of Europe for this totalitarian insanity. I keep hearing from Europeans who with a straight face will claim that of course they have free speech, but that doesn't mean you can insult people, hurt their feelings, or post statistics that might cast certain groups in a bad light.<br /><br />Madness.</div><div><br /></div><blockquote>\"The party told you to reject the evidence of your eyes and ears. It was their final, most essential command.\"<br />-- Orwell, 1949</blockquote>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/leave-it-to-the-germans-94dd4bbe",
            "publishedAt": "2025-02-17",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>Just a day after <a href=\"https://world.hey.com/dhh/europeans-don-t-have-or-understand-free-speech-c7c406e8\">JD Vance's remarkable speech</a> in Munich, 60 Minutes validates his worst accusations in <a href=\"https://x.com/EndWokeness/status/1891302425190863347\">a chilling segment on the totalitarian German crackdown on free speech</a>. You couldn't have scripted this development for more irony or drama!<br /><br /></div><div>This isn't 60 Minutes finding a smoking gun in some secret government archive, detailing a plot to prosecute free speech under some fishy pretext. No, this is German prosecutors telling an American journalist in an open interview that insulting people online is a crime and retweeting a \"lie\" will get you in trouble with the law. No hidden cameras! All out in the open!</div><div><br />Nor is this just some rogue prosecutorial theory. 60 Minutes goes along for the ride with German police, as they conduct a <a href=\"https://www.youtube.com/watch?v=cIIEMMEElZI\">raid at dawn with six armed officers</a> to confiscate the laptop and a phone of a German citizen suspected of posting a racist cartoon. Even typing out this description of what happens sounds like insane hyperbole, but you can just watch the clip for yourself.</div><div><br />And this morning raid was just one of fifty that day. Fifty raids in a day! For wrong speech, spicy memes, online insults of",
            "title": "Leave it to the Germans"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>The new American vice president JD Vance just gave <a href=\"https://www.youtube.com/watch?v=pCOsgfINdKg\">a remarkable talk</a> at the Munich Security Conference on free speech and mass immigration. It did not go over well with many European politicians, some of which immediately proved Vance's point, and labeled the speech <a href=\"https://x.com/disclosetv/status/1890431994992996736\">\"not acceptable\"</a>. All because Vance dared poke at two of the holiest taboos in European politics.<br /><br /></div><div>Let's start with his points on free speech, because they're the foundation for understanding how Europe got into such a mess on mass immigration. See, Europeans by and large simply do not understand \"free speech\" as a concept the way Americans do. There is no first amendment-style guarantee in Europe, yet the European mind desperately wants to believe it has the same kind of free speech as the US, despite endless evidence to the contrary.</div><div><br />It's quite like how every dictator around the world pretends to believe in democracy. Sure, they may repress the opposition and rig their elections, but they still crave the imprimatur of the concept. So too \"free speech\" and the Europeans.</div><div><br />Vance illustrated his point with several examples from the UK. A country that pursues <a href=\"https://www.youtube.com/watch?v=0r7GRx8Sl-s\">thousands of yearly wrong-speech cases</a>, <a href=\"https://www.youtube.com/watch?v=ruPSgK6UuBU\">threatens foreigners with repercussions should they dare say too much online</a>, and has no qualms about handing down <a href=\"https://www.youtube.com/watch?v=zWB2W_ADasc\">draconian sentences for online utterances</a>. It's completely totalitarian and completely nuts.<br /><br /></div><div>Germany is not much better. It's illegal to insult elected officials, and if you say the wrong thing, or post the wrong meme, you may well <a href=\"https://www.ft.com/content/27626fa8-3379-4b69-891d-379401675942\">find yourself the subject of a raid at dawn</a>. Just crazy stuff.</div><div><br />I'd love to say that Denmark is different, but sadly it is not. You can be put in <a href=\"https://danskelove.dk/straffeloven/266b\">prison for up to two years</a> for mocking or degrading someone on the basis on their race. It recently become <a href=\"https://politiken.dk/danmark/politik/art10258823/Hummelgaard-nikker-ja-til-at-Paludan-og-hans-partner-fors%C3%B8ges-straffet-for-brud-p%C3%A5-koranloven\">illegal to burn the Quran</a> (which sadly only serves to legitimize crazy Muslims <a href=\"https://www.bbc.com/news/articles/cpdx2wqpg7zo\">killing</a> or <a href=\"https://x.com/ArchRose90/status/1890421519777505610\">stabbing</a> those who do). And you may face <a href=\"https://danskelove.dk/straffeloven/136\">up to three years in prison</a> for <a href=\"https://politiken.dk/danmark/art10276977/Det-var-ikke-selve-kommentaren-men-hashtagget-der-fik-den-42-%C3%A5rige-d%C3%B8mt\">posting online</a> in a way that can be construed as morally supporting terrorism.</div><div><br />But despite all of these examples and laws, I'm <a href=\"https://x.com/dhh/status/1890729990670499876\">constantly arguing with Europeans</a> who cling to the idea that they do have free speech like Americans. Many of them mistakenly think that \"hate speech\" is illegal in the US, for example. It is not.</div><div><br />America really takes the first amendment quite seriously. Even when it comes to hate speech. Famously, the Jewish lawyers of the (<a href=\"https://www.wsj.com/articles/does-the-aclu-want-to-ban-my-book-11605475898\">now unrecognizable</a>) <a href=\"https://en.m.wikipedia.org/wiki/National_Socialist_Party_of_America_v._Village_of_Skokie\">ACLU defended the right of literal, actual Nazis to march for their hateful ideology</a> in the streets of Skokie, Illinois in 1979 and won.</div><div><br />Another common misconception is that \"misinformation\" is illegal over there too. It also is not. That's why the <a href=\"https://twitterfiles.substack.com/p/1-thread-the-twitter-files\">Twitter Files</a> proved to be so scandalous. Because it showed the US government under Biden laundering an illegal censorship regime -- in grave violation of the first amendment -- through private parties, like the social media networks.<br /><br /></div><div>In America, your speech is free to be wrong, free to be hateful, free to insult religions and celebrities alike. All because the founding fathers correctly saw that asserting the power to determine otherwise leads to a totalitarian darkness.<br /><br /></div><div>We've seen vivid illustrations of both in recent years. At the height of the trans mania, questioning whether <a href=\"https://en.wikipedia.org/wiki/Gender_self-identification\">men who said they were women</a> should be allowed in women's sports or bathrooms or prisons was frequently labeled \"hate speech\".</div><div><br />During the pandemic, questioning whether the virus might have escaped from a lab instead of a wet market got labeled <a href=\"https://www.vox.com/2020/3/4/21156607/how-did-the-coronavirus-get-started-china-wuhan-lab\">\"misinformation\"</a>. So too did any questions about the vaccine's inability to stop spread or infection. Or whether surgical masks or lock downs were effective interventions.<br /><br /></div><div>Now we know that having a public debate about all of these topics was of course completely legitimate. Covid escaping from a lab is currently <a href=\"https://apnews.com/article/covid-cia-trump-china-pandemic-lab-leak-9ab7e84c626fed68ca13c8d2e453dde1\">the most likely explanation</a>, according to American intelligence services, and many European countries, <a href=\"https://www.gov.uk/government/news/ban-on-puberty-blockers-to-be-made-indefinite-on-experts-advice\">including the UK</a>, have stopped allowing puberty blockers for children.</div><div><br />Which brings us to that last bugaboo: Mass immigration. Vance identified it as one of the key threats to Europe at the moment, and I have to agree. So should anyone who've been paying attention to the <a href=\"https://x.com/dhh/status/1884153318320009431\">statistics</a> <a href=\"https://x.com/visegrad24/status/1890164105744703908\">showing</a> <a href=\"https://x.com/RMistereggen/status/1889246613895328155\">the abject failure</a> of this thirty-year policy utopia of a multi-cultural Europe. The fast changing winds in European politics suggest that's exactly what's happening.</div><div><br />These are not separate issues. It's the lack of free speech, and a catastrophically narrow Overton window, which has led Europe into such a mess with mass immigration in the first place. In Denmark, the first popular political party that dared to question the wisdom of importing massive numbers of culturally-incompatible foreigners were frequently charged with claims of racism back in the 90s. The same \"that's racist!\" playbook is now being run on political parties across Europe who dare challenge the mass immigration taboo.</div><div><br />But making plain observations that some groups of immigrants really do <a href=\"https://x.com/dhh/status/1884153318320009431\">commit vastly more crime</a> and <a href=\"https://x.com/jonatanpallesen/status/1879634729756135736\">contribute vastly less economically</a> to society is not racist. It wasn't racist when the Danish Folkparty did it in Denmark in the 1990s, and it isn't racist now when the mainstream center-left parties have followed suit.</div><div><br />I've drawn the contrast to Sweden many times, and I'll do it again here. Unlike Denmark, Sweden kept its Overton window shut on the consequences of mass immigration all the way up through the 90s, 00s, and 10s. As a prize, it now has <a href=\"https://www.express.co.uk/news/world/2007829/panic-sweden-31-bombings-rock\">bombs going off daily</a>, <a href=\"https://bra.se/english/statistics/shootings-and-violence?utm_source=chatgpt.com\">the European record in gun homicides</a>, and a <a href=\"https://www.euractiv.com/section/politics/news/no-control-sweden-grapples-with-bomb-violence-wave/\">government that admits that the immigrant violence is out of control</a>.</div><div><br />The state of Sweden today is a direct consequence of suppressing any talk of the downsides to mass immigration for decades. And while that taboo has <a href=\"https://www.nytimes.com/2022/09/14/world/europe/sweden-elections-right.html\">recently been broken</a>, it may well be decades more before the problems are tackled at their root. It's tragic beyond belief.<br /><br />The rest of Europe should look to Sweden as a cautionary tale, and the Danish alternative as a precautionary one. It's never too late to fix tomorrow. You can't fix today, but you can always fix tomorrow.</div><div><br />So Vance was right to wag his finger at all this nonsense. The lack of free speech and the problems with mass immigration. He was right to assert that America and Europe has a shared civilization to advance and protect. Whether the current politicians of Europe wants to hear it or not, I'm convinced that average Europeans actually are listening.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/europeans-don-t-have-or-understand-free-speech-c7c406e8",
            "publishedAt": "2025-02-15",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>The new American vice president JD Vance just gave <a href=\"https://www.youtube.com/watch?v=pCOsgfINdKg\">a remarkable talk</a> at the Munich Security Conference on free speech and mass immigration. It did not go over well with many European politicians, some of which immediately proved Vance's point, and labeled the speech <a href=\"https://x.com/disclosetv/status/1890431994992996736\">\"not acceptable\"</a>. All because Vance dared poke at two of the holiest taboos in European politics.<br /><br /></div><div>Let's start with his points on free speech, because they're the foundation for understanding how Europe got into such a mess on mass immigration. See, Europeans by and large simply do not understand \"free speech\" as a concept the way Americans do. There is no first amendment-style guarantee in Europe, yet the European mind desperately wants to believe it has the same kind of free speech as the US, despite endless evidence to the contrary.</div><div><br />It's quite like how every dictator around the world pretends to believe in democracy. Sure, they may repress the opposition and rig their elections, but they still crave the imprimatur of the concept. So too \"free speech\" and the Europeans.</div><div><br />Vance illustrated his point with several examples from the UK. A country that pursues <a href=\"https://www.youtube.com/watch?v=0r7GRx8Sl-s\">thousands of yearly wrong-speech cases</a>,",
            "title": "Europeans don't have or understand free speech"
        },
        {
            "content": [
                "<p>Some of my favorite internet people sometimes organize little community experiments. Like, let’s eat <a href=\"https://slimemoldtimemold.com/2022/04/29/potato-diet-community-trial-sign-up-now-lol/\">potatoes</a> and see if we lose weight. Or, let’s take some supplements and see if <a href=\"https://slatestarcodex.com/2018/10/11/anxiety-sampler-kits/\">anxiety</a> goes down. I’ve toyed with doing one myself, to see if <a href=\"https://en.wikipedia.org/wiki/Theanine\">theanine</a> (a chemical in tea) really helps with stress.</p>\n\n<p>But sometimes, when everyone is having fun, some very mean very bad people show up and say, “HEY! YOU CAN’T DO THAT! THAT’S HUMAN SUBJECTS RESEARCH! YOU NEED TO GET APPROVAL FROM AN INSTITUTIONAL REVIEW BOARD!”</p>\n\n<p>So I wondered—is that right? Who <em>exactly</em> actually needs to get approval from an institutional review board (IRB)? More than a year later, I’m now convinced that:</p>\n\n<ol>\n  <li>No single source on the internet actually answers that question.</li>\n  <li>The answer is absurdly complex.</li>\n  <li>The reason it’s so complex is that IRB rules are an illegible mishmash of things, some of which <em>themselves</em> have near-fractal complexity.</li>\n  <li>If you stare at this long enough, it’s impossible not to question the degree to which we actually have “laws”.</li>\n</ol>\n\n<p>In this post, I’ll give the answer and then explain—in maddening detail—why I think that answer is right. But first I want to tell a little story.</p>\n\n<p>I used to live in an apartment with an extremely steep driveway. When I had visitors, I’d tell them, “At the bottom of the driveway you must slow to ⅒ of normal speed or your car will scrape the ground. I tell this to everyone and they only slow to ½ of normal speed and scrape their car on the ground. Don’t do that!” Then they’d only slow to ½ of normal speed and scrape their car on the ground.</p>\n\n<p>Why? I think because my visitors simply couldn’t believe my driveway was as stupid as it was. When I explained the rules of safe driveway usage, they mentally substituted the closest version of those rules that would be correct in a sane universe, one without driveways that form sudden 30° angles with the road. I suspect this is a general cognitive bias.</p>\n\n<p>So, who exactly needs IRB approval?  Here are some myths:</p>\n\n<ul>\n  <li><strong>Myth:</strong> IRB approval is only needed for medical research.</li>\n  <li><strong>Myth:</strong> IRB approval is only needed for federally funded research.</li>\n  <li><strong>Myth:</strong> IRB approval is only needed for research at “institutions”.</li>\n  <li><strong>Myth:</strong> IRB approval is only needed if you want to publish in a journal.</li>\n</ul>\n\n<p>Wrong. But this is also a myth:</p>\n\n<ul>\n  <li><strong>Myth:</strong> IRB approval is needed for all research involving human subjects.</li>\n</ul>\n\n<p>Also wrong. As far as I can tell, after months of research, here is how it works:</p>\n\n<p><a href=\"https://dynomight.net/img/irb/irb.pdf\"><img alt=\"irb chart\" src=\"https://dynomight.net/img/irb/irb.svg\" /></a></p>\n\n<p>Now, I know what you’re thinking: “That can’t be right! The government can’t possibly claim to regulate what me and my roommates eat at home! That would be stupid!” Yes, it <em>would</em> be stupid. But who says the world makes sense?</p>\n\n<p>Now, would you actually be <em>prosecuted</em> for violating those rules? Unlikely. If a prosecutor went after you and you fought them in court, you might even be able to get some of these rules declared unconstitutional. But those are the rules as written.</p>\n\n<p><em>Caution</em>: I estimate a 85% chance that this post contains at least one minor error and a 40% chance of a significant error. I’ve gone to insane lengths to try to get things right—I regret ever becoming interested in this topic—but this stuff is insanely convoluted. (Past experience says that someone reading this will know more than I do. If that’s you, get in touch.)</p>\n\n<h2 id=\"reminder-of-how-law-works-in-the-us\">Reminder of how law works in the US</h2>\n\n<p>If you’re a sane person, and you want to know when IRB approval is needed, you might think something like, “I know! I’ll go find the IRB law and read it. Then I’ll know what’s legal and what isn’t. Yay!”</p>\n\n<p>Hahaha, no. This won’t work, for several reasons.</p>\n\n<p>For one, few federal rules actually come from <em>laws</em>. Usually politicians pass some broad law that says, “Human research is hereby regulated, details to come!” And then government employees write <em>regulations</em> that contain all the details, and those regulations have the power of law. And then the government employees issue “clarifications” that supposedly don’t change anything, but everyone treats like new laws.</p>\n\n<p>Also, the US constitution theoretically imposes severe limits on the power of the federal government. <a href=\"https://constitution.congress.gov/browse/article-1/section-8/\">Article 1 section 8</a> says the federal government has the power to (1) tax and spend, (2) regulate commerce, (3) control citizenship, (4) create post offices, (5) protect IP, (6) make treaties, and (7) do war. And the <a href=\"https://en.wikipedia.org/wiki/Tenth_Amendment_to_the_United_States_Constitution\">10th amendment</a> says that’s <em>it</em>: everything else is left to the states.</p>\n\n<p>The federal government doesn’t like those limits, so it evades them in various ways. The classic trick is to declare that everything is related to commerce and therefore almost anything can be considered “regulating commerce”. For example, it’s OK to make growing and eating wheat on your own property illegal, because <a href=\"https://en.wikipedia.org/wiki/Wickard_v._Filburn\">growing and eating wheat is “commerce”</a>. Another trick is to write rules that sort of say, “If your state/organization wants back any of the money it’s paying in taxes, then you must create and enforce the following rules: […]”. For example, in 1984, the US government decreed that all states must raise the legal age to buy alcohol to 21 or they would <a href=\"https://en.wikipedia.org/wiki/National_Minimum_Drinking_Age_Act\">lose federal funding for highways</a>.</p>\n\n<p>Finally, the limits of federal power are only clarified when someone fights them in court. Did you know that at some point, bureaucrats decided that your boss must <a href=\"https://dynomight.net/2021/01/15/eeo/\">guess your race and report it to the government</a>? Is that an illegal overreach? Is it “regulating commerce” to make personal consumption of cannabis illegal in states that have legalized it? The way you find out is you break the rules, get prosecuted, and spend millions fighting in court. (For cannabis, the answer is <a href=\"https://en.wikipedia.org/wiki/Gonzales_v._Raich\">yes</a>, that <em>is</em> regulating commerce.) If you win, OK, no refunds on your legal fees. If you lose, you pay massive fines or go to prison. Also, courts have constantly changing judges and opinions.</p>\n\n<p>So what happens in practice is politicians write a vague law. Bureaucrats turn that law into very detailed (but often still vague) specific rules. Those rules might or might not be “legal”, but nobody want to risk fighting them in court. If the regulations are particularly ridiculous or likely to be overturned if challenged, prosecutors may quietly stop bringing cases. But the regulations still sit there on the books. And people still usually pay attention to them, because why risk it?</p>\n\n<p>OK! Where do IRB regulations come from?</p>\n\n<h2 id=\"the-common-rule\">The Common Rule</h2>\n\n<p>In 1932, the United States government and Tuskegee University began studying 600 poor black sharecroppers in Macon Country Alabama, ⅔ of whom had latent syphilis. The idea was to observe the progression of the disease if left untreated. By the late 1940s, syphilis was easily treatable with penicillin, but the men were never informed of their condition, never treated, and were even given fake treatments and diagnoses.</p>\n\n<p>In 1965, <a href=\"https://en.wikipedia.org/wiki/Peter_Buxtun\">Peter Buxton</a> joined the Public Health service and soon learned of the experiment. He was horrified and filed several official protests, but all were all rejected. Finally, in 1972, Buxton leaked the details to Jean Heller of the Associated Press which led to this <a href=\"https://www.nytimes.com/1972/07/26/archives/syphilis-victims-in-us-study-went-untreated-for-40-years-syphilis.html\">front-page article</a> on July 26, 1972.</p>\n\n<p><img alt=\"NYT article\" src=\"https://dynomight.net/img/irb/NYT.jpg\" /></p>\n\n<p>This led to widespread outrage and cancellation of the study. By this time, dozens of the men had died from syphilis and many of their wives and children had also become infected.</p>\n\n<p>It also led, in early 1973, to a series of congressional hearings led by <a href=\"https://en.wikipedia.org/wiki/Ted_Kennedy\">Ted Kennedy</a> of Massachusetts. These hearings eventually produced the <a href=\"https://en.wikipedia.org/wiki/National_Research_Act\">National Research Act</a>. Several people voted for <a href=\"https://www.govtrack.us/congress/votes/93-1973/s382\">the first version</a> of this bill and then against the <a href=\"https://www.govtrack.us/congress/votes/93-1974/s865\">second version</a>, including one Joseph Biden of Delaware, though I can’t find any record of why. Anyway, it was signed into law by Richard Nixon on July 12, 1974.</p>\n\n<p>Formally speaking, what the National Research Act did was create a <a href=\"https://en.wikipedia.org/wiki/National_Commission_for_the_Protection_of_Human_Subjects_of_Biomedical_and_Behavioral_Research\">commission</a>  to develop guidelines for ethical research in human subjects, including how IRBs should work. But in reality, it also sent a message that federal agencies should use their <em>existing</em> authority to regulate research. Even before the Act was passed, the Department of Health and Human Services had started <a href=\"https://www.govinfo.gov/content/pkg/FR-1974-05-30/pdf/FR-1974-05-30.pdf#page=70\">amending</a> the federal code to regulate human research. In 1978, the commission issued a <a href=\"https://videocast.nih.gov/pdf/ohrp_institutional_review_boards.pdf\">report</a> on IRBs:</p>\n\n<blockquote>\n  <p>The Commission believes that the rights of subjects should be protected by local review committees operating pursuant to federal regulations and located in institutions where research involving human subjects is conducted.</p>\n\n  <p>[…]</p>\n\n  <p>The Commission further believes that institutions receiving federal support for the conduct of research involving human subjects should be governed by uniform federal regulations applicable to the review of all such research, whether it is supported by one federal department or another, or is not federally supported.</p>\n</blockquote>\n\n<p>Informed by this report, lots of different agencies issued different regulations. This continued until 1991, when 15 federal agencies harmonized on what is known as the <a href=\"https://en.wikipedia.org/wiki/Common_Rule\">Common Rule</a>, because it is “common” to different federal agencies. This is now codified as <a href=\"https://www.hhs.gov/ohrp/regulations-and-policy/regulations/45-cfr-46/index.html\">Title 45 Part 46</a> of the federal code.</p>\n\n<p>Since 1991, this has been continuously updated and various other agencies have joined, notably the department of Labor. There are still a couple holdouts including the Nuclear Regulatory Commission and the National Endowment for the Humanities. The CIA is an odd case—they never issued any formal regulations, but supposedly apply the Common Rule because of a cryptic <a href=\"https://www.federalregister.gov/executive-order/12333\">executive order</a> from 1981. The FDA hasn’t joined because they have their own regulatory structure.</p>\n\n<p>So what does the Common Rule say? In principle, you can go <a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-A/part-46\">here</a> and read it. Good luck with that. It’s exactly as readable as “a series of regulations amended by many agencies over many decades” <em>sounds</em> like it would be. But basically: (1) It requires informed consent. (2) It requires that risks are reasonable in relation to expected benefits, <em>not</em> including any long-range benefits from new knowledge. (3) It requires participants are selected fairly and equitably (e.g. not all poor black sharecroppers) (4) It requires that federally funded research with human subjects is reviewed by an IRB.</p>\n\n<p>Now, that might sound simple, but what exactly is “research”? This is defined by <a href=\"https://www.ecfr.gov/current/title-45/part-46#p-46.102(l)\">45 CFR 46.102(l)</a> to be a “systematic investigation designed to develop or contribute to generalizable knowledge.” It’s best to understand this with an example. Say you’re a teacher and you want to test if the cognitive bias of <a href=\"https://en.wikipedia.org/wiki/Anchoring_effect\">anchoring</a> applies to your class. Is this research? If you’re doing it as part of normal “teaching stuff”, to demonstrate the effect to your students, then no. But if you’re doing it in hope of <em>learning</em> if the anchoring bias is real, then that <em>is</em> research. To some degree, the truth lies in your heart.</p>\n\n<p>(The definition of a “human subject” is also somewhat convoluted: What if you’re using data someone else gathered? What if you’re just using some human tissue samples or nonviable human embryos? But never mind.)</p>\n\n<p>Note that this applies to <em>all</em> research. The people who made these rules were almost all medical researchers thinking about serious medical risks. But they wrote the rules to apply to <em>all</em> research, including research where you might just ask people some questions.</p>\n\n<p>There are some narrow categories of research that are “exempt” from IRB review, e.g. research on <a href=\"https://www.ecfr.gov/on/2018-07-19/title-45/part-46#p-46.104(d)(1)\">standard educational methods</a> or <a href=\"https://www.ecfr.gov/on/2018-07-19/title-45/part-46#p-46.104(d)(6)\">food taste evaluations</a>, or certain <a href=\"https://www.ecfr.gov/on/2018-07-19/title-45/part-46#p-46.104(d)(3)\">benign behavioral interventions</a> . Theoretically, an institution <a href=\"https://www.hhs.gov/ohrp/regulations-and-policy/guidance/faq/exempt-research-determination/index.html#4109\">could</a> allow investigators to decide for themselves if they are exempt, but this is not recommended, and in practice, essentially all institutions require you to apply for a determination of exemption. In reality, <em>no</em> research is really exempt, it’s just that certain categories of research have a somewhat more lightweight application process. To get a feel for how much friction this adds, here’s <a href=\"https://hrpp.umich.edu/wp-content/uploads/sites/4/2024/10/brief_protocol_for_exempt_research_projects_5.15.2020_4.docx\">U. Michigan’s application for exemption</a>.</p>\n\n<p>Up until the 1990s, IRBs at universities tended to be staffed with faculty “volunteers”. These were sympathetic to the needs of their colleagues, had little interest in reading (unreadable) federal regulations, and probably just wanted to get back to teaching and research. So IRBs were often pretty loose. But in 1996, Hoiyan Wan died after taking part of an experiment on the effects of smoking and air pollution the University of Rochester. And in 1999, <a href=\"https://en.wikipedia.org/wiki/Jesse_Gelsinger\">Jesse Gelsinger</a> died after taking an experimental gene therapy at the University Of Pennsylvania. Federal agencies cracked down and sent out hundreds of enforcement letters. Universities nervously responded with “hypercompliance”, leading to the IRB process everyone loves today.</p>\n\n<h2 id=\"why-is-the-common-rule-so-common\">Why is the Common Rule so common?</h2>\n\n<p>The 1978 commission recommended that any institution accepting federal funding must apply IRB rules to all research, regardless of funding source. But the written regulations did not follow that recommendation. Theoretically, a university could accept federal funding for some research and still allow other research on human subjects without any IRB approval. But in practice, no university ever does that. Why?</p>\n\n<p>Well, before giving any federal funding to an institution, the government requires the institution to file a “<a href=\"https://www.hhs.gov/ohrp/register-irbs-and-obtain-fwas/forms/fwa-instructions/index.html\">Federalwide Assurance</a>”. In this, the institution must promise to obey some “statement of ethical principles”. Supposedly this could be anything, but it appears that the only correct answer is <a href=\"https://en.wikipedia.org/wiki/Belmont_Report\">“The Belmont Report”</a>, an ethics statement issued by the same commission from 1978. Then there is a section where the institution may “optionally” promise to apply the common rule to all research, regardless of funding source.</p>\n\n<p>The government has a <a href=\"https://ohrp.cit.nih.gov/search/fwasearch.aspx\">database</a> of these “assurances”, but you can’t actually read them. Still, I found that a few prominent institutions that had published theirs. They <em>all</em> promised to abide by the Belmont report. Some (<a href=\"https://www.nyu.edu/content/dam/nyu/research/documents/IRB/FWA.pdf\">NYU</a>, <a href=\"https://research.uci.edu/wp-content/uploads/1-Institutional-Oversight-of-Assurance.pdf\">U. C. Irvine</a>) promised to apply the Common Rule to all research, but most (<a href=\"https://www.mayo.edu/research/documents/mayo-clinic-federalwide-assurance/doc-20144006\">Mayo Clinic</a>, <a href=\"https://irb.ufl.edu/wp-content/uploads/University-of-Florida-FWA-Exp.-07-06-2028.pdf\">U. Florida</a>, <a href=\"https://irb.emory.edu/_includes/documents/sections/fwa-latest-copy.pdf\">Emory</a>, <a href=\"https://research-compliance.umich.edu/sites/default/files/resource-download/um-fwa.pdf\">U. Michigan</a>, <a href=\"https://ras.mit.edu/document/federalwide-assurance-protection-human-subjects\">MIT</a>) do not.</p>\n\n<p>So if you’re a researcher at MIT, can you do non-federally funded research without an IRB? Nope. <a href=\"https://couhes.mit.edu/researchers/frequently-asked-questions\">MIT rules</a> still say you need an IRB for <em>all</em> research with human subjects.  So do the <a href=\"https://www.mayo.edu/research/documents/1-inst-commitment-and-authoritypdf/doc-10027286\">Mayo Clinic’s</a>. So do <a href=\"https://irb.ufl.edu/\">U. Florida’s rules</a>. So do <a href=\"https://irb.emory.edu/_includes/documents/sections/pyramid-guidance.pdf\">Emory’s rules</a>. So do <a href=\"https://hrpp.umich.edu/irb-health-sciences-and-behavioral-sciences-hsbs/irb-review-process/\">U. Michigan’s rules</a>.</p>\n\n<p>What’s going on here? Throughout the 1970s, there was a debate about if IRB rules should apply to social science at all. The <a href=\"https://www.hhs.gov/ohrp/index.html\">OHRP</a> (which oversees the Common Rule) gradually asserted <a href=\"https://willyreads.substack.com/p/ethical-imperialism-irbs-and-the\">more and more broad IRB requirements</a>. <a href=\"https://en.wikipedia.org/wiki/Ithiel_de_Sola_Pool\">Ithiel de Sola Pool</a>, a professor at MIT, protested this growing power. Apparently, a colleague had sought IRB approval to interview Boston anti-busing activists, and been rejected because this research could be used against them. Pool <a href=\"https://www.jstor.org/stable/3556121\">argued</a> that much of social science should be exempt and got support from professional societies.</p>\n\n<p>But no matter. Here’s Charles McCarthy, director of the OHRP from 1977 to 1993, bragging about subverting the Carter and the Reagan administrations to add more regulations during the transition in 1980:</p>\n\n<blockquote>\n  <p>But we were trying to decide when is the appropriate time to get the Secretary to sign off on the new regulations?  They had already been proposed, we had got comments from the public.  We’d incorporated the comments.  We wrote the preamble, it was ready to go.  And then when is the best time, ‘cause Harris could care less whether they every got published.  So we talked to the transition team, and they said Reagan will never allow new regulations to see the light of day, so if you’re going to get those out at all, you’d better get them out before he takes over.</p>\n\n  <p>So we’re struggling with this problem, and the way we worked it out was that’s when we wrote, overnight one night–brilliant inspiration–we wrote–everybody stayed in the office, and we worked all night long, and we wrote the exemptions to the regulations, and we also wrote expedited review neither of which had ever been addressed by the Commission.  And that’s where they came from.</p>\n\n  <p>Then we went to the transition team, and we said would the transition team endorse regulations that are less stringent than the previous regulations?  And, of course, they weren’t, but they looked like they were because we wrote some exceptions.  And so when we sent the package down to Harris, we said “Diminished Regulations for the Protection of Human Subjects.”  And that was the title.  And, of course, we knew nobody down there in the last weeks of the Harris administration getting ready to leave office would actually read it.  So they didn’t know what all that was about, but they could read the title.</p>\n\n  <p>And so Secretary Harris signed that at her farewell party.  She put down her glass of champagne and signed the regulations on January 19, 1980, and went out of office on the 20th.  So we squeaked by.  Those were some of the adventures we had that were kind of harrowing for regulators, and that’s why some of the language in those exemptions is so convoluted because it was really a first draft.  But it survived and it’s still in there.  And it makes some sense, but if we could rewrite the regulations, we would run that through three or four more drafts and make them crystal clear.  They’re less than elegant writing, whereas if you read the rest of the regulation, I think you’ll find sub-part A is very well-written if you leave out the part about the exemptions.</p>\n</blockquote>\n\n<p>That’s a real quote that you can go read on the <a href=\"https://www.hhs.gov/ohrp/education-and-outreach/luminaries-lecture-series/belmont-report-25th-anniversary-interview-cmccarthy/index.html#:~:text=But%20we%20were%20trying\"><code class=\"language-plaintext highlighter-rouge\">hhs.gov</code> website</a> today.</p>\n\n<p>The OHRP sent out “non-binding guidance” that suggested all research should be subject to IRB review. According to <a href=\"https://scholarship.law.columbia.edu/faculty_scholarship/487/\">Hamburger (2007)</a>, in the 1990s, the Federalwide Assurance form implied that institutions <em>had</em> to apply the Common Rule to all research, despite the fact that no federal regulation to this effect existed. I can’t find the old form, but according to “persons who were in a position to know”, at one point all but about five institutions in the entire country had made this promise.</p>\n\n<p>By 2000-2005, the form made clear that promising to apply the Common Rule (and thus IRBs) to non federally-funded research was optional, and many institutions decline to do this. But they are only declining <em>to make this assurance</em>. Apparently, after years of applying the Common Rule to all research, it had risen to legally qualify as the <a href=\"https://en.wikipedia.org/wiki/Standard_of_care\">“standard of care”</a>, meaning that anyone that failed to apply it risked being legally <a href=\"https://en.wikipedia.org/wiki/Negligence\">“negligent “</a> under state law. So, having established the Common Rule as standard through questionably legal tactics, the government could now relax and rely on state tort laws.</p>\n\n<p>Now, say you’re affiliated with a university. Federal funded research without IRB approval is out. <em>Any</em> research at the university is out. But say you want to do research in your spare time, at home, without using any university resources. Is that OK?</p>\n\n<p>Policies here seem to vary. Some are clear that this is <em>not</em> OK. <a href=\"https://irb.ucsf.edu/research-needing-irb-review#who\">U.C. San Francisco</a> says:</p>\n\n<blockquote>\n  <p>UCSF faculty, staff, or students or researchers at UCSF-affiliated institutions conducting human subjects research require IRB approval before initiating the study. IRB approval is required <strong>regardless of the site of the study or the source of funding</strong> (if there is funding).</p>\n</blockquote>\n\n<p>Others are a bit ambiguous. <a href=\"https://couhes.mit.edu/researchers/frequently-asked-questions#who_apply\">MIT</a> says:</p>\n\n<blockquote>\n  <p>Any faculty member, employee or student at MIT who conducts human subjects research must apply [to the IRB] if the research involves any form of MIT involvement or support, including funding, <strong>personnel</strong>, facilities, academic credit or access to experimental subjects.</p>\n</blockquote>\n\n<p>But how could a MIT <em>employee</em> do research without involving MIT <em>personnel</em>, when they themselves are personnel? The closest I can find to anyone saying it’s OK to do independent research without an IRB is <a href=\"https://research.columbia.edu/sites/default/files/content/HRPO/IRB_SOP_v5.2_2.12.19_TOC_CUIMC.176a.9.12.19.pdf\">Columbia University</a> which says an IRB is needed if:</p>\n\n<blockquote>\n  <p>the research is conducted by or under the direction of any employee or agent (faculty/student/staff) of Columbia, in connection with his or her institutional responsibilities</p>\n</blockquote>\n\n<p>What exactly constitutes a “connection”? I guess you get to argue about the meaning of that term if/when you’re investigated for research misconduct.</p>\n\n<h2 id=\"journals\">Journals</h2>\n\n<p>OK! So if you’re doing any research at any federally funded institution, you need an IRB. If you work at such an institution, you could <em>maybe</em> do research at home, as long as it’s unrelated to your job and you’re willing to live dangerously.</p>\n\n<p>But suppose you’re not affiliated with any institution. Can you do research without an IRB?</p>\n\n<p>One additional barrier is that if you want to <em>publish</em> your results in a journal, almost all journals that publish human subjects research require IRB approval. For example, all <a href=\"https://www.nature.com/nature-portfolio/editorial-policies/ethics-and-biosecurity#:~:text=identify%20the%20ethics\">Nature journals</a>, <a href=\"https://www.springer.com/gp/authors-editors/journal-author/journal-author-helpdesk/before-you-start#:~:text=reference%20number\">Springer journals</a> , and <a href=\"https://authorservices.taylorandfrancis.com/editorial-policies/research-ethics-guidelines-for-stem-journals/#:~:text=reference\">Taylor and Francis</a>  journals require you to identify the ethics committee and give a reference number. <a href=\"https://www.science.org/content/page/science-journals-editorial-policies#:~:text=human%20subjects%20research\">Science</a> journals require IRB approval, but don’t seem to require details unless an editor requests them. (Those are publisher requirements. Specific journals can add additional restrictions.)</p>\n\n<p>Now, I’m not sure how carefully these journals actually <em>check</em>. My impression is that some do and some don’t. Maybe you could lie and get away with it, but papers do in fact <a href=\"https://retractionwatch.com/category/by-reason-for-retraction/lack-of-irb-approval/\">retracted</a> when a lack of IRB approval is revealed.</p>\n\n<h2 id=\"state-laws\">State laws</h2>\n\n<p>Another barrier is that some states have their own laws. In 1975, <a href=\"https://www.nysenate.gov/legislation/laws/PBH/2444\">New York</a> passed a law that required IRB approval for <em>all</em> human subjects research:</p>\n\n<blockquote>\n  <p>Each person engaged in the conduct of human research or proposing to conduct human research shall affiliate himself with an institution or agency having a human research review committee, and such human research as he conducts or proposes to conduct shall be subject to review by such committee in the manner set forth in this section.</p>\n</blockquote>\n\n<p><a href=\"https://law.lis.virginia.gov/vacode/title32.1/chapter5.1/section32.1-162.19/\">Virginia</a> passed a very similar law in 1979. These go further than requiring IRB approval. They make independent human subjects research fully illegal! (Read that quote!) In most states, a random person could submit their research plan to an independent IRB. Not in New York or Virginia.</p>\n\n<p>In 2002, Maryland passed <a href=\"https://mgaleg.maryland.gov/2002rs/billfile/hb0917.htm\">house bill 917</a>. I find this text extremely confusing, but <a href=\"https://www.marylandattorneygeneral.gov/Pages/HealthPolicy/humansubject.aspx\">everyone seems to agree</a> that that it means that all human subjects research requires IRB approval.</p>\n\n<p>I’ve seen many people claim that California also requires IRB approval for all human subjects research. While it’s true that California has some <a href=\"https://leginfo.legislature.ca.gov/faces/codes_displayText.xhtml?lawCode=HSC&amp;division=20.&amp;title&amp;part&amp;chapter=1.3.&amp;article\">extra regulations</a>, as far as I can tell none of these require IRB approval.</p>\n\n<h2 id=\"fda-regulations\">FDA regulations</h2>\n\n<p>Have you found all this to be too simple? Too straightforward and legible?</p>\n\n<p>The FDA is here to help. They have an <em>independent</em> set of IRB regulations. While the Common Rule IRB regulations are in <a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-A/part-46\">Title 45 Part 46</a> (45 CFR 46), the FDA IRB regulations are in <a href=\"https://www.ecfr.gov/current/title-21/chapter-I/subchapter-A/part-56\">21 CFR 56</a> and also <a href=\"https://www.ecfr.gov/current/title-21/part-50\">21 CFR 50</a>.</p>\n\n<p>Whereas the Common Rule derives its constitutional authority from the idea that the government can decide how it wants to give out <em>money</em>, the FDA regulations seem derive their constitutional authority from the idea that it is <em>regulating commerce</em>. So FDA regulations apply regardless of where you work or how you’ve gotten funding. The FDA operates according to the <a href=\"https://en.wikipedia.org/wiki/Federal_Food,_Drug,_and_Cosmetic_Act_of_1938\">1938 Food, Drug, and Cosmetics Act</a> and its many amendments, most notably the <a href=\"https://en.wikipedia.org/wiki/Dietary_Supplement_Health_and_Education_Act_of_1994\">1994 Dietary Supplement Health and Education Act</a>.</p>\n\n<p>So what do the FDA regulations say? I found them to be much more painful to read than the (already extremely painful) Common Rule regulations. But after much thrashing and screaming, I think the core regulation is <a href=\"https://www.ecfr.gov/current/title-21/part-56/section-56.103#p-56.103(a)\">21 CFR 56.103(a)</a>:</p>\n\n<blockquote>\n  <p>[…] any clinical investigation which must meet the requirements for prior submission (as required in parts <a href=\"https://www.ecfr.gov/current/title-21/chapter-I/subchapter-D/part-312\">312</a>, 812, and 813) […] shall not be initiated unless that investigation has been reviewed […] by an IRB meeting the requirements of this part.</p>\n</blockquote>\n\n<details>\n  \n(Click here for details)\n\n  <ul>\n    <li>\n      <p>21 CFR § 56.103 gives a two cases where you’re exempt from the above rule, but these aren’t much help.</p>\n\n      <p>The first (<a href=\"https://www.ecfr.gov/current/title-21/chapter-I/subchapter-A/part-56/subpart-A/section-56.104\">21 CFR § 56.104</a>) is that you’re exempt if you meet the conditions of which basically are that (1) you started your investigation in 1981 or earlier (2) it’s an emergency and you get IRB approval within 5 days, or (3) “taste and food quality evaluations and consumer acceptance studies if wholesome foods without additives are consumed or if a food is consumed that contains a food ingredient at or below the level and for a use found to be safe”.</p>\n\n      <p>The second (<a href=\"https://www.ecfr.gov/current/title-21/chapter-I/subchapter-A/part-56/subpart-A/section-56.105\">21 CFR § 56.105</a>) is that you’re exempt if you apply to the FDA to be exempt and they waive the requirements. Good luck with that.</p>\n    </li>\n    <li>\n      <p><a href=\"https://www.ecfr.gov/current/title-21/part-56/section-56.103#p-56.103(b)\">21 CFR § 56.103 (b)</a> says that if you apply to the FDA to get a drug approved, they may ignore your data if you should have gotten an IRB but you didn’t. But this an <em>additional</em>  thing to worry about, not a waiver to do whatever you want if you don’t care about FDA approval.</p>\n    </li>\n  </ul>\n</details>\n\n<p>So what does this mean?</p>\n\n<p>Well, a “clinical investigation” is defined by <a href=\"https://www.ecfr.gov/current/title-21/part-56#p-56.102(c)\">21 CFR 56.102(c)</a> to be anything involving human subjects and a “test article”. And a “test article” which is defined in turn by <a href=\"https://www.ecfr.gov/current/title-21/part-56#p-56.102(l)\">21 CFR 56.102(l)</a> to be any “drug” for human use. So if you’re doing anything with a “drug” that requires “prior submission”, then you need an IRB. What do <em>those</em> terms mean? <a href=\"https://www.ecfr.gov/current/title-21/part-312\">21 CFR Part 312</a> makes clear that “prior submission” is referring to an investigational new drug (IND) application to the FDA.</p>\n\n<p>(Caution: An “IRB” and an “IND” are totally different things. An IRB is what this article is about. An <a href=\"https://en.wikipedia.org/wiki/Investigational_New_Drug\">IND</a> is the kind of application that pharmaceutical companies make to the FDA before they can start clinical trials.)</p>\n\n<p>So, at first, this seems like good news: As long as you don’t need to do a (gigantic, extremely expensive) IND application to the FDA before starting your research, then FDA regulations don’t force you to use an IRB. Whew! Except… When are you supposed to submit an IND? Surely that’s not some incredibly broad set of circumstances that could apply to almost anyone doing almost anything, is it?</p>\n\n<p>Behold:</p>\n\n<p><a href=\"https://www.fda.gov/media/79386/download\"><img alt=\"Guidance for Clinical Investigators, Sponsors, and IRBs Investigational New Drug Applications (INDs) — Determining Whether Human Research Studies Can Be Conducted Without an IND\" src=\"https://dynomight.net/img/irb/FDA.png\" /></a></p>\n\n<p>This is a supposedly “nonbinding” document that just explains old rules. <em>Supposedly</em>, the FDA is just publishing this as a helpful service to all the mouth-breathers who can’t understand federal regulations. But everyone in industry behaves as if it’s a new law. Which is understandable, since the written regulations are so confusing and ambiguous.</p>\n\n<p>If you read this guidance, you will discover that an IND is needed if:</p>\n\n<ol>\n  <li>The research involves a “drug”</li>\n  <li>The research is a “clinical investigation”</li>\n  <li>The research is not exempt.</li>\n</ol>\n\n<p>If you want to avoid an IND, then (2) and (3) are little help. A “clinical investigation” is <a href=\"https://www.ecfr.gov/current/title-21/part-312/section-312.3#p-312.3(Clinical%20investigation)\">defined</a> as anything where a “drug” is given to human subjects. And the exemptions are extremely narrow: They are only for <em>marketed</em> drugs where the drug is being used for the labeled purpose as directed. Testing something already approved for a new disease? Not exempt. Testing if normal food helps with some new disease? Not exempt. You’re only exempt if you’re doing research on something the FDA has already accepted to be true.</p>\n\n<details>\n  \n(Click here for details)\n\n\n  <p>“Do I need an IND if I use a lawfully marketed drug for an unlabeled indication?\nIf you are a health care provider and you prescribe a marketed drug to treat a patient for an\nunlabeled indication (also referred to as off-label use), an IND is not required because this use is\nconsidered to be within the scope of medical practice and not a clinical investigation. However,\nif you use the marketed drug for the same purpose in a clinical investigation intended to evaluate\nthe drug’s ability to treat a disease or condition, an IND is required under part 312 unless the\nclinical investigation meets the criteria for an exemption for studies of lawfully marketed drugs\n(see 21 CFR 312.2(b) and section IV.A of this guidance.”</p>\n\n  <p>“If a product containing substances generally recognized as safe (GRAS) for use in food is\nadministered to subjects in a study intended to evaluate the effect of the substance on the\npathogenesis of a human disease, is an IND required?\nSubstances designated as GRAS for use in food are generally not approved as drug products. A\nclinical investigation of a GRAS substance that is intended to evaluate the product’s ability to\ndiagnose, cure, mitigate, treat, or prevent disease requires an IND under part 312, unless the\nsubstance to be studied is also a lawfully marketed drug and the clinical investigation meets the\ncriteria for exemption under 21 CFR 312.2(b).”</p>\n</details>\n\n<p>If you want to avoid an IND, your best hope is that your research doesn’t involve a “drug”. Unfortunately, the term “drug” is defined extremely broadly, way beyond the colloquial meaning of  “drug” in English. A drug is defined to include:</p>\n\n<blockquote>\n  <p>articles intended for use in the diagnosis, cure, mitigation, treatment, or prevention of disease</p>\n</blockquote>\n\n<p>It also includes:</p>\n\n<blockquote>\n  <p>articles (other than food) intended to affect the structure or any function of the body</p>\n</blockquote>\n\n<p>Get that? Here’s a little picture:</p>\n\n<p><a href=\"https://dynomight.net/img/irb/drug.pdf\"><img alt=\"drug chart\" src=\"https://dynomight.net/img/irb/drug.svg\" /></a></p>\n\n<p>Now, I know what you’re thinking. “That can’t be right! That would mean that if I wanted to study if some normal food reduced the odds of, say, diabetes, then I wouldn’t just need IRB approval, I would also need to submit a freaking <em>IND</em>! That would be stupid!”</p>\n\n<p>But the FDA is quite clear that this <em>is</em> right:</p>\n\n<blockquote>\n  <p>As is the case for a dietary supplement, a food is considered to be a drug if it is “intended for use in the diagnosis, cure, mitigation, treatment, or prevention of disease,” except that a food may bear an authorized health claim about reducing the risk of a disease without becoming a drug (see section VI.D.3). Therefore, a clinical investigation intended to evaluate the effect of a food on a disease would require an IND under part 312. For example, a clinical investigation intended to evaluate the effect of a food on the signs and symptoms of Crohn’s disease would require an IND.</p>\n</blockquote>\n\n<p>FDA <a href=\"https://www.fda.gov/regulatory-information/search-fda-guidance-documents/institutional-review-boards-frequently-asked-questions#:~:text=54.\">also says</a>:</p>\n\n<blockquote>\n  <p><strong>Does a physician, in private practice, conducting research with an FDA regulated product, need to obtain IRB approval?</strong></p>\n\n  <p>Yes. The FDA regulations require IRB review and approval of regulated clinical investigations, whether or not the study involves institutionalized subjects. FDA has included non-institutionalized subjects because it is inappropriate to apply a double standard for the protection of research subjects based on whether or not they are institutionalized.</p>\n\n  <p>An investigator should be able to obtain IRB review by submitting the research proposal to a community hospital, a university/medical school, an independent IRB, a local or state government health agency or other organizations.</p>\n</blockquote>\n\n<p>At first, I thought this couldn’t possibly be true. In 2017, it apparently cost $619,200 to submit an IND application to the FDA. However, in practice it appears that there are <a href=\"https://www.fda.gov/media/72340/download\">many exceptions</a> and that there are <a href=\"https://academicentrepreneurship.pubpub.org/pub/aan4seyc/release/4\">two categories</a> of INDs: Commercial and research. I assume the FDA doesn’t actually try to charge researchers $619,200 to review their research projects, but I don’t really know.</p>\n\n<p>The FDA’s IND application page is <a href=\"https://www.fda.gov/drugs/investigational-new-drug-ind-application/ind-application-procedures-overview\">here</a>. Have fun.</p>\n\n<p>I’m not sure how seriously people take these FDA regulations in practice. People <em>do</em> seem to get IND approval for research on actual (chemical) drugs. But does anyone actually seek IND approval if they want to study if diet influences obesity? Do they carefully avoid talking about disease, so they can fall under the looser “structure and function of the body”? It’s hard to say.</p>\n\n<h2 id=\"what-ive-learned\">What I’ve learned</h2>\n\n<p>Mostly I’ve learned that the set of abstractions I was using to think about the world were wrong. I assumed that there were “laws” that someone had written, and that someone could read to understand what is legal and what isn’t.</p>\n\n<p>But in reality, politicians write vague laws, and then agencies write vague sprawling regulations, and then those agencies issue vague “clarifications”. Sometimes these might be unconstitutional or illegal, but no one knows unless they want to fight things in court. But courts are unpredictable, and even going to court is ruinously expensive. Trying to comply with the the written law is like trying to comply with a giant mound of potatoes.</p>\n\n<p>So people basically operate as if the law doesn’t exist. The “law” is what the people who enforce the law choose to enforce. If you need to live in this world, that’s what you pay attention to. The law is what you can get away with.</p>\n\n<h2 id=\"what-i-would-change\">What I would change</h2>\n\n<p>All the IRB rules were designed by medical doctors to regulate the research of other medical doctors, thinking about incidents like the Tuskegee syphilis study.</p>\n\n<p>But here’s an opinion: Needing to submit an application before you can ask people to fill out some simple online survey is stupid. Needing to submit an application before you can interview a bunch of people is stupid.</p>\n\n<p>I like incremental change, so why don’t we start by making “exempt” research <em>actually exempt</em>? For example, <a href=\"https://www.ecfr.gov/on/2018-07-19/title-45/part-46#p-46.104(d)(3)(ii)\">45 CFR 46.104(d)(3)(ii)</a> exempts “benign behavioral interventions” from IRB review. But you still need to <em>apply</em> to prove you’re exempt. Why?</p>\n\n<p>As an analogy, driving a car is dangerous. Whenever I drive, I could easily kill someone. But the government doesn’t force me to submit a driving plan any time I want to go somewhere. Instead, if I misbehave, I am punished <em>in retrospect</em>. Why don’t we apply the same policy to research?</p>\n\n<h2 id=\"notes\">Notes</h2>\n\n<ol>\n  <li>\n    <p>I found AI to be completely useless at parsing all these federal regulations. Maybe you need AI that’s specifically trained to be good at parsing legal text?</p>\n  </li>\n  <li>\n    <p>Say I want to feed potatoes to my friends and see if that reduces diabetes. Maybe that’s dumb. Fine. But the FDA seems to be claiming that it is constitutionally permitted to regulate this because by doing this I would be engaging in “interstate commerce”. Really?</p>\n  </li>\n  <li>\n    <p>Maybe the <a href=\"https://en.wikipedia.org/wiki/Chevron_U.S.A.,_Inc._v._Natural_Resources_Defense_Council,_Inc.\"><em>Chevron</em> decision</a> might have some implications for all this?</p>\n  </li>\n  <li>\n    <p>As far as I can tell, no one has ever been prosecuted for failure to comply with IRB requirements. It’s not even clear what the penalty would be. In practice, rules are enforced on <em>institutions</em>—if one failed to comply, then their “assurance” might be cancelled, meaning they couldn’t take any federal funding for research. Or, if they wanted to sell something, the FDA might refuse to approve it for sale.</p>\n  </li>\n  <li>\n    <p>Are you chaotic good? Then you may find it interesting that it seems to be relatively easy to form a new IRB. (<a href=\"https://www.hhs.gov/ohrp/register-irbs-and-obtain-fwas/irb-registration/irb-registration-faq/index.html\">HHS rules</a> / <a href=\"https://www.fda.gov/media/77059/download\">FDA rules</a>). And that while all federally funded institutions require IRB approval for all research, only some require approval from <em>their</em> IRB. You can probably see where this is going.</p>\n  </li>\n</ol>\n\n<h2 id=\"further-reading\">Further reading</h2>\n\n<p>Philip Hamburger:</p>\n\n<ul>\n  <li><a href=\"https://scholarship.law.columbia.edu/faculty_scholarship/487/\">Getting Permission (2007)</a></li>\n  <li><a href=\"https://scholarship.law.columbia.edu/faculty_scholarship/4311/\">IRB Licensing (2015)</a></li>\n</ul>\n\n<p>My Bookshelf Runneth Over:</p>\n\n<ul>\n  <li><a href=\"https://willyreads.substack.com/p/a-history-of-us-irbs\">A history of US IRBs</a></li>\n  <li><a href=\"https://willyreads.substack.com/p/ethical-imperialism-irbs-and-the\">Ethical Imperialism: IRBs and the Social Sciences, 1965–2009</a></li>\n</ul>\n\n<p>United States Government Accountability Office</p>\n\n<ul>\n  <li><a href=\"https://dynomight.net/img/irb/gao-23-104721.pdf\">Institutional Review Boards: Actions Needed to Improve Oversight and Examine Effectiveness</a> / <a href=\"https://dynomight.net/img/irb/gao-23-104721-highlights.pdf\">(Highlights)</a></li>\n</ul>\n\n<p><em>Many</em> thanks to <a href=\"https://willyreads.substack.com/\">Willy Chertman</a>.</p>"
            ],
            "link": "https://dynomight.net/irb/",
            "publishedAt": "2025-02-13",
            "source": "Dynomight",
            "summary": "<p>Some of my favorite internet people sometimes organize little community experiments. Like, let’s eat <a href=\"https://slimemoldtimemold.com/2022/04/29/potato-diet-community-trial-sign-up-now-lol/\">potatoes</a> and see if we lose weight. Or, let’s take some supplements and see if <a href=\"https://slatestarcodex.com/2018/10/11/anxiety-sampler-kits/\">anxiety</a> goes down. I’ve toyed with doing one myself, to see if <a href=\"https://en.wikipedia.org/wiki/Theanine\">theanine</a> (a chemical in tea) really helps with stress.</p> <p>But sometimes, when everyone is having fun, some very mean very bad people show up and say, “HEY! YOU CAN’T DO THAT! THAT’S HUMAN SUBJECTS RESEARCH! YOU NEED TO GET APPROVAL FROM AN INSTITUTIONAL REVIEW BOARD!”</p> <p>So I wondered—is that right? Who <em>exactly</em> actually needs to get approval from an institutional review board (IRB)? More than a year later, I’m now convinced that:</p> <ol> <li>No single source on the internet actually answers that question.</li> <li>The answer is absurdly complex.</li> <li>The reason it’s so complex is that IRB rules are an illegible mishmash of things, some of which <em>themselves</em> have near-fractal complexity.</li> <li>If you stare at this long enough, it’s impossible not to question the degree to which we actually have “laws”.</li> </ol> <p>In this post, I’ll give the answer and then explain—in maddening detail—why I think that answer is right. But first I want to tell a",
            "title": "Do you need permission from the government to do independent research?"
        },
        {
            "content": [],
            "link": "https://harper.blog/2025/02/16/my-llm-codegen-workflow-atm/",
            "publishedAt": "2025-02-16",
            "source": "Harper Reed",
            "summary": "<p><em>tl:dr; Brainstorm spec, then plan a plan, then execute using LLM codegen. Discrete loops. Then magic. ✩₊˚.⋆☾⋆⁺₊✧</em></p> <p>I have been building so many small products using LLMs. It has been fun, and useful. However, there are pitfalls that can waste so much time. A while back a friend asked me how I was using LLMs to write software. I thought &ldquo;oh boy. how much time do you have!&rdquo; and thus this post.</p> <p>(p.s. if you are an AI hater - scroll to the end)</p> <p>I talk to many dev friends about this, and we all have a similar approach with various tweaks in either direction.</p> <p>Here is my workflow. It is built upon my own work, conversations with friends (thx <a href=\"https://www.nikete.com/\">Nikete</a>, <a href=\"https://nocruft.com/\">Kanno</a>, <a href=\"https://fsck.com/\">Obra</a>, <a href=\"https://github.com/KristopherKubicki\">Kris</a>, and <a href=\"https://thinks.lol/\">Erik</a>), and following many best practices shared on the various terrible internet <a href=\"https://news.ycombinator.com/\">bad</a> <a href=\"https://twitter.com\">places</a>.</p> <p>This is working well <strong>NOW</strong>, it will probably not work in 2 weeks, or it will work twice as well. ¯\\_(ツ)_/¯</p> <h2 id=\"lets-go\">Let’s go</h2> <figure class=\"\"> <img alt=\"Juggalo Robot\" class=\"img \" height=\"\" src=\"https://harper.blog/images/posts/llm-coding-robot.webp\" title=\"\" width=\"\" /> <figcaption id=\"caption-I always find these AI-generated images to be suspect. Say hi to my juggalo coding robot angel!\">",
            "title": "My LLM codegen workflow atm"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2025-02-14_13a8cf7a58ec_this-is-a-wonderful-article-ab/",
            "publishedAt": "2025-02-15",
            "source": "Harper Reed",
            "summary": "<p>This is a wonderful article about my friend Christine Sun Kim.</p> <p><a href=\"https://www.nytimes.com/2025/02/14/arts/design/christine-sun-kim-artist.html?unlocked_article_code=1.w04.Np0G.eP4JjhWSIfqw&amp;smid=nytcore-ios-share&amp;referringSource=articleShare&amp;fbclid=PAZXh0bgNhZW0CMTEAAaZSXSosYa7H2zwjCrClBEw5uAxqs5bRidMrhvB4a9HuQ-n8dhjrfNQya6o_aem_vuTSwaOGcy4lspg6XhnbDw\">www.nytimes.com/2025/02/1…</a></p> <p>Go check out her show.</p> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #180"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/five-kinds-of-nondeterminism/",
            "publishedAt": "2025-02-19",
            "source": "Hillel Wayne",
            "summary": "<p>No newsletter next week, I'm teaching a TLA+ workshop.</p> <p>Speaking of which: I spend a lot of time thinking about formal methods (and TLA+ specifically) because it's where the source of almost all my revenue. But I don't share most of the details because 90% of my readers don't use FM and never will. I think it's more interesting to talk about ideas <em>from</em> FM that would be useful to people outside that field. For example, the idea of \"property strength\" translates to the <a href=\"https://buttondown.com/hillelwayne/archive/some-tests-are-stronger-than-others/\" target=\"_blank\">idea that some tests are stronger than others</a>. </p> <p>Another possible export is how FM approaches nondeterminism. A <strong>nondeterministic</strong> algorithm is one that, from the same starting conditions, has multiple possible outputs. This is nondeterministic:</p> <div class=\"codehilite\"><pre><span></span><code># Pseudocode def f() { return rand()+1; } </code></pre></div> <p>When specifying systems, I may not <em>encounter</em> nondeterminism more often than in real systems, but I am definitely more aware of its presence. Modeling nondeterminism is a core part of formal specification. I mentally categorize nondeterminism into five buckets. Caveat, this is specifically about nondeterminism from the perspective of <em>system modeling</em>, not computer science as a whole. If I tried to include stuff on NFAs and amb operations this",
            "title": "Five Kinds of Nondeterminism"
        },
        {
            "content": [
                "<blockquote><p>WE MUST BUILD ON A CLEAR SITE. The city of to-day is dying because it is not constructed geometrically. To build on a clear site is to replace the 'accidental' layout of the ground, the only one that exists today, by a formal layout. Otherwise nothing can save us.<br /><em>(Le Corbusier, 1929, \"The City of Tomorrow\")</em></p></blockquote><p><a href=\"https://newsletter.squishy.computer/i/65395829/redecentralizing-the-web\">Why did the web centralize</a>? <a href=\"https://www.stubbornella.org/2009/03/27/reflows-repaints-css-performance-making-your-javascript-slow/\">Why is it slow</a>? <a href=\"https://wiki.python.org/moin/GlobalInterpreterLock\">Why can&#8217;t CPython be parallelized</a>? <a href=\"https://2ality.com/2013/10/typeof-null.html\">Why is null both an object and not an object</a>? <a href=\"https://www.infoq.com/presentations/Null-References-The-Billion-Dollar-Mistake-Tony-Hoare/\">Why is null at all</a>? Most of our software has been shaped by chance decisions made in haste by people who could not have predicted how the system would end up being used today. Some chance decisions become structural problems. They constrain the system, make it inefficient, hacky, slow.</p><p>If we could start over, and rebuild the system, knowing what we know now? We could fix these mistakes, swap out the security model, alter that layout algorithm, make the object threadsafe, avoid the billion dollar mistake. It would be fast, beautiful, elegant. Except&#8230;</p><h3>You can&#8217;t rebuild an ecosystem</h3><p>You <em>can</em> rebuild software. Software is just a machine. <a href=\"https://newsletter.squishy.computer/i/52021619/what-is-modularity\">Swapping out modules</a> and replacing code is no problem. We do it all the time. The impulse, then, is to use this engineering toolkit to fix the ecosystem.</p><p>We could scrape away the old system, the old city, with its layers of ugly history and compromised infrastructure, and replace it with clean geometric lines and rational choices. The city will continue, of course, just as before, only better, more efficient. People will come and go, work, sleep, shop, except these people will be happier, healthier, more beautiful. Like in this architectural model we made. See the little plastic people walking around the plaza?</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb959212b-6efc-459b-bdbd-b824539601e4_805x604.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Le Corbusier's Plan Voisin for Paris - Business Insider\" class=\"sizing-normal\" height=\"604\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb959212b-6efc-459b-bdbd-b824539601e4_805x604.jpeg\" title=\"Le Corbusier's Plan Voisin for Paris - Business Insider\" width=\"805\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">&#8220;A house is a machine for living in.&#8221; <a href=\"https://en.wikipedia.org/wiki/Plan_Voisin\">Le Corbusier&#8217;s Paris Plan</a> (1925) to level a large part of central Paris and replace it with a grid of high-rise apartment blocks.</figcaption></figure></div><p><a href=\"https://newsletter.squishy.computer/p/soulbinding-like-a-state\">Somehow this fantasy never quite works out</a>, in cities or in software ecosystems.</p><p>Software can be rebuilt, because software is a machine. But a software <em>ecosystem</em> is not a machine. It is a living system. When we attempt to rebuild the <em>ecosystem</em>, we&#8217;re making a category error. We&#8217;re confusing the software for the ecological process unfolding around it.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://unurth.com/Ersilia-Berlin\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"566\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6a30b7e3-2595-4cef-a6bc-7095b568c7e8_850x566.jpeg\" title=\"\" width=\"850\" /><div></div></div></a><figcaption class=\"image-caption\">Artists: a <a href=\"https://unurth.com/Ersilia-Berlin\">collaboration</a> between <a href=\"https://franciscodelavega-franciscodelavega.blogspot.com/\">Delavega</a>, <a href=\"https://sehrephemer.blogspot.com/\">Ephemera</a>, <a href=\"https://lascarr.blogspot.com/\">Lascarr</a>. Berlin, Germany.</figcaption></figure></div><blockquote><p>In Ersilia, to establish the relationships that sustain the city's life, the inhabitants stretch strings from the corners of the houses, white or black or gray or black-and-white according to whether they mark a relationship of blood, of trade, authority, agency. When the strings become so numerous that you can no longer pass among them, the inhabitants leave: the houses are dismantled; only the strings and their supports remain. From a mountainside, camping with their household goods, Ersilia's refugees look at the labyrinth of taut strings and poles that rise in the plain. That is the city of Ersilia still, and they are nothing.<br /><em>(Italo Calvino, 1972, Invisible Cities)</em></p></blockquote><p>You can&#8217;t rebuild an ecosystem, just like you can&#8217;t rebuild the Amazon rainforest. You can only grow with it, or bulldoze it and start over from zero.</p><h3>Forking Like a State</h3><p>And that&#8217;s exactly what happens when you try to rebuild an ecosystem. Fixing structural issues means breaking changes. Breaking changes mean forking, and forking has costs:</p><p><em>When you fork an ecosystem, you kill the existing ecosystem's momentum, and start from zero on a new ecosystem.</em></p><p>This doesn&#8217;t stop us from trying. Software history is littered with attempts to fix past mistakes in our ecosystems:</p><ul><li><p><strong>Python3</strong> forked the ecosystem by making breaking changes to fix a number of longstanding mistakes. Strings became unicode by default, print went from being a statement to a function, functions switched from using lists to generators. Good stuff! Yet these longstanding mistakes turned out to be structural, and the fixes difficult to adopt. Keystone frameworks like <a href=\"https://docs.djangoproject.com/en/1.11/topics/python3/\">Django</a> and <a href=\"https://numpy.org/neps/nep-0014-dropping-python2.7-proposal.html\">NumPy</a> lagged several years behind in adoption. It took even longer for adoption to propagate through the long tail of the ecosystem. Many developers remained stuck on Python2 due to dependency lock-in. Things remained bifurcated until Python2 was EOL&#8217;d in 2020, forcing a migration. The ecosystem finally caught up <a href=\"https://stackoverflow.blog/2019/11/14/why-is-the-migration-to-python-3-taking-so-long/#h2-a4811b5655860\">12 years after Python3 was released</a>.</p></li><li><p><strong>JavaScript</strong> forked the ecosystem by introducing a syntax-breaking module system, <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Modules\">ES modules</a> (import/export). ES modules made significant improvements on Node&#8217;s grassroots module system, <a href=\"https://en.wikipedia.org/wiki/CommonJS\">CommonJS modules</a> (require()). Bindings in the new module system became static, making <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/Tree_shaking\">tree shaking</a> possible. The breaking syntax change was also <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Strict_mode#strict_mode_for_modules\">used as a wedge to upgrade the language in other ways</a>. Nevertheless, it took years for browsers to widely support ES module syntax. Node.js took even longer. Build tooling became necessary for shipping code to the browser. Keystone NPM packages continue to use CommonJS, creating practical difficulties with code re-use. ES Modules are widely supported in browsers today, and Node has patched up <a href=\"https://nodejs.org/en/blog/release/v23.0.0#requireesm-is-now-enabled-by-default\">most of the compatibility issues</a>, but has taken about 10 years, and build tools have become entrenched as a permanent feature of using the language.</p></li><li><p><strong>Deno</strong> forked the ecosystem by ditching node_modules and package.json. Deno aimed to simplify by shedding Node&#8217;s increasingly complex legacy baggage. They ditched build tooling and config by supporting TypeScript, ES Modules, <a href=\"https://deno.com/blog/http-imports\">URL-based imports</a>, web standard APIs, and a sandboxed runtime. However, the lack of support for Node&#8217;s massive <a href=\"https://www.npmjs.com/\">NPM ecosystem</a> hindered adoption. Then <a href=\"https://bun.sh/\">Bun</a> launched with full NPM compatibility, and focused on selling performance. <a href=\"https://star-history.com/#nodejs/node&amp;denoland/deno&amp;oven-sh/bun&amp;Timeline\">It rapidly gained traction</a>. Now Deno finds itself playing catch-up. Deno 2 <a href=\"https://deno.com/blog/v2.0\">introduced full NPM compatibility</a>. It also <a href=\"https://deno.com/blog/http-imports\">launched JSR</a>, a new <a href=\"https://deno.com/blog/jsr_open_beta#help-us-level-up-the-javascript-ecosystem\">open source and decentralizable module registry</a>. This is wonderful, but it forks Deno&#8217;s ecosystem yet again, since developers now face a choice between NPM and JSR.</p></li></ul><p>I&#8217;ve also attempted to fork, and for sillier reasons!</p><ul><li><p><strong><a href=\"https://github.com/subconsciousnetwork/subtext\">Subtext</a></strong> rationalized Markdown as a simple block-based syntax, side-stepping syntax ambiguities, and making it easier to parse into useful data structures. Then, a few months later, ChatGPT happened, and Markdown was their lingua franca. Rationalizing Markdown became a pointless exercise. LLMs are trained on and will generate Markdown for eternity. It&#8217;s immortal. I should have just gone with Markdown.</p></li></ul><p>What can we learn from all this? Python, ES Modules, Deno, JSR all feel like justified forks to me. They attempt to move the status quo forward in significant ways. And yet every fork is justified. They all happen for good reasons. This doesn&#8217;t change the fact that the costs of forking are high, very high.</p><p>It seems to take about a decade for an ecosystem to recover from a fork. Even so, a lot of shrapnel remains. When the ecosystem finally pieces itself back together, it seldom looks the way we envisioned.</p><p>These examples are comparative successes. More often, our schemes to fix ecosystems simply fail. <a href=\"https://newsletter.squishy.computer/i/145470133/draft-off-of-ecosystem-tailwinds\">Forks turn ecosystem tailwinds into headwinds</a>. You find yourself pushing against the ecosystem, trying to halt its natural momentum so you can point it in a new direction. Even if you you succeed in slowing it down, you&#8217;ll have to keep pushing to get it going again. <a href=\"https://newsletter.squishy.computer/p/soulbinding-like-a-state\">We may rationalize the ecosystem, and kill it in the process</a>.</p><h3>Living systems layer</h3><p>So, if not fix the ecosystem, then what? Add more layers!</p><ul><li><p>Layer stuff on top</p></li><li><p>Let things live side-by-side</p></li><li><p>Allow opt-in</p></li></ul><p>Rich Hickey has a nice bit about this: &#8220;Don&#8217;t be afraid of <code>foo2()</code>&#8221;.</p><div class=\"youtube-wrap\" id=\"youtube2-oyLBGkS5ICk\"><div class=\"youtube-inner\"></div></div><p><code>foo2()</code>?! Preposterous! But then again&#8230; is it? <code>foo2()</code> means <code>foo()</code> doesn&#8217;t have to break. They can live side-by-side. You can opt-in.</p><p>We have to resist the urge to remove the legacy <code>foo()</code>. Carrying forward old baggage offends our sense of aesthetics, but hey, that&#8217;s how evolved systems work. <a href=\"https://www.npr.org/2006/02/23/5230538/study-of-chicken-teeth-sheds-light-on-evolution\">Chickens still carry around the gene for dinosaur teeth</a>. This is because living systems have to be viable at every evolutionary stage. They can never pause, reset, or make breaking changes. <a href=\"https://newsletter.squishy.computer/p/evolution-adjacent-possible\">The path of evolution is always through the adjacent possible</a>.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd92d5e08-48cd-4092-9b67-7be84c84a8cf_591x452.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"452\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd92d5e08-48cd-4092-9b67-7be84c84a8cf_591x452.png\" width=\"591\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a></figure></div><p>Maintaining viability is another reason that systems tend to evolve into <a href=\"https://newsletter.squishy.computer/i/53901934/layering-allows-evolution-to-proceed-at-multiple-speeds\">pace layers</a>. Newer layers can be stacked on top of older ones without breaking them. Promises on top of callbacks, async/await on top of promises. Older, slow-moving code can remain in its layer, unbothered. Lizard brain, limbic system, neocortex. Layer on layer.</p><p>For a long time I worked on browsers&#8212;Firefox and Chrome&#8212;and people who work on these kinds of things have a saying: <strong><a href=\"https://developer.mozilla.org/en-US/docs/Learn_web_development/Getting_started/Web_standards/The_web_standards_model#web_standards_key_principles:~:text=They-,don%27t%20break%20the%20web,-.\">Don&#8217;t Break The Web</a></strong>.</p><p>Don&#8217;t Break The Web is the reason we have <code>&lt;marquee&gt;</code> and <a href=\"https://en.wikipedia.org/wiki/Quirks_mode\">quirks mode</a>. It is also why you can visit <a href=\"https://www.spacejam.com/1996/\">spacejam.com/1996</a>, and it still works today.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F217f4122-a254-4931-a49b-564136ffcdd8_600x554.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"668.4933333333333\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F217f4122-a254-4931-a49b-564136ffcdd8_600x554.jpeg\" title=\"\" width=\"724\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><div class=\"pencraft pc-reset icon-container restack-image\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></div><div class=\"pencraft pc-reset icon-container view-image\"><svg class=\"lucide lucide-maximize2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></div></div></div></div></a><figcaption class=\"image-caption\">Earthball. Don&#8217;t let it fall! <a href=\"http://www.fogbanking.com/the-new-games-movement/\">New Games</a>.</figcaption></figure></div><p>We&#8217;ve been playing Don&#8217;t Break The Web for 30 years. We based it on another game called Don&#8217;t Break The Internet, which has been going on even longer.</p><p>Don&#8217;t Break is an <a href=\"https://newsletter.squishy.computer/p/open-ended-tools-for-infinite-games\">infinite game</a>. We win by keeping the game going, and we&#8217;re still going. <a href=\"https://newsletter.squishy.computer/p/weblike-things\">Let's build more things like that</a>.</p><h3>Don&#8217;t fork the ecosystem</h3><p>An ecosystem is the most valuable thing in the world. If you have an ecosystem, you have <a href=\"https://newsletter.squishy.computer/i/145470133/draft-off-of-ecosystem-tailwinds\">tailwinds behind everything you do</a>. That&#8217;s because ecosystems are nonlinear systems. They refuse to fall into equilibrium. <a href=\"https://newsletter.squishy.computer/p/coevolution-creates-living-complexity\">Living systems want to spiral upwards</a>.</p><blockquote><p>Life improves the closed system's capacity to sustain life. Life&#8212;all life&#8212;is in the service of life. Necessary nutrients are made available to life by life in greater and greater richness as the diversity of life increases.<br /><em>(Frank Herbert, Dune)</em></p></blockquote><p>Ecosystems are rare. They don&#8217;t emerge very often. Our ecosystem, the one on this planet&#8212;<em>life</em>&#8212;arose just once, <a href=\"https://en.wikipedia.org/wiki/Last_universal_common_ancestor\">as far as we know</a>.</p><blockquote><p>Evolution is no linear family tree, but change in the single multidimensional being that has grown to cover the entire surface of Earth. <em>(Lynn Margulis)</em></p></blockquote><p>So, when a living ecosystem does emerge, we have to cherish it, foster it, despite shortcomings, inelegance, ugliness. All living systems are ugly and a little bit eldritch&#8230; <a href=\"https://newsletter.squishy.computer/p/subconscious-is-squishy-computer\">squishy</a>. That&#8217;s how it is.</p>"
            ],
            "link": "https://newsletter.squishy.computer/p/dont-fork-the-ecosystem",
            "publishedAt": "2025-02-16",
            "source": "Squishy Computer",
            "summary": "Software can be rebuilt, because software is a machine. But a software ecosystem is not a machine. It is a living system.",
            "title": "Don't fork the ecosystem"
        }
    ],
    "lookbackDays": 7,
    "publishDate": "2025-02-19"
}