{
    "articles": [
        {
            "content": [
                "<p>Amid today&#8217;s AI boom, it&#8217;s disconcerting that we still don&#8217;t know how to measure how smart, creative, or empathetic these systems are. Our tests for these traits, never great in the first place, were made for humans, not AI. <a href=\"https://ai-analytics.wharton.upenn.edu/generative-ai-labs/research-and-technical-reports/tech-report-prompt-engineering-is-complicated-and-contingent/\">Plus, our recent paper testing prompting techniques</a> finds that AI test scores can change dramatically based simply on how questions are phrased. Even famous challenges like the Turing Test, where humans try to differentiate between an AI and another person in a text conversation, were designed as thought experiments at a time when such tasks seemed impossible. But now that <a href=\"https://arxiv.org/pdf/2503.23674\">a new paper shows that AI passes the Turing Test</a>, we need to admit that we really don&#8217;t know what that actually means. </p><p>So, it should come as little surprise that one of the most important milestones in AI development, Artificial General Intelligence, or AGI, is badly defined and much debated. Everyone agrees that it has something to do with the ability of AIs to perform human-level tasks, though no one agrees whether this means expert or average human performance, or how many tasks and which kinds an AI would need to master to qualify. Given the definitional morass surrounding AGI, illustrating its nuances and history from its precursors to its initial coining by Shane Legg, Ben Goertzel and Peter Voss to today is challenging. As an experiment in both substance and form (and speaking of potentially intelligent machines) I delegated the work entirely to AI. I had Google Deep Research put together a <a href=\"https://docs.google.com/document/d/1VJ-OzBRJUChgUB0L0--dbdNjU2e-14PXnoTqNFYgXNQ/edit?tab=t.0\">really solid 26 page summary on the topic</a>. I then had HeyGen turn it into a video podcast discussion between a twitchy AI-generated version of me and an AI-generated host. It&#8217;s not actually a bad discussion (though I don&#8217;t fully agree with AI-me), but every part of it, from the research to the video to the voices is 100% AI generated.</p><div class=\"native-video-embed\"></div><p>Given all this, it was interesting to see <a href=\"https://marginalrevolution.com/marginalrevolution/2025/04/o3-and-agi-is-april-16th-agi-day.html\">this post </a>by influential economist and close AI observer Tyler Cowen declaring that o3 is AGI. Why might he think that?</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F47409a3c-004a-47f4-903a-adb6807684ae_1320x1316.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"368.8787878787879\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F47409a3c-004a-47f4-903a-adb6807684ae_1320x1316.jpeg\" width=\"370\" /><div class=\"image-link-expand\"></div></div></a></figure></div><h1>Feeling the AGI</h1><p>First, a little context. Over the past couple of weeks, two new AI models, Gemini 2.5 Pro from Google and o3 from OpenAI were released. These models, along with a set of slightly less capable but faster and cheaper models (Gemini 2.5 Flash, o4-mini, and Grok-3-mini), represent a pretty<a href=\"https://epoch.ai/data/ai-benchmarking-dashboard\"> large leap in benchmarks</a>. But benchmarks aren&#8217;t everything, as Tyler pointed out. For a real-world example of how much better these models have gotten, we can turn to <a href=\"https://a.co/d/2qRbAxA\">my book</a>. To illustrate a chapter on how AIs can generate ideas, a little over a year ago I asked ChatGPT-4 to come up with marketing slogans for a new cheese shop:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa0b89b3d-85f2-426d-89be-424e88aebabf_651x510.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"304.7465437788018\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa0b89b3d-85f2-426d-89be-424e88aebabf_651x510.png\" title=\"\" width=\"389\" /><div class=\"image-link-expand\"></div></div></a></figure></div><p>Today I gave the latest successor to GPT-4, o3, an <em>ever so slightly</em> more involved version of the same prompt: &#8220;<strong>Come up with 20 clever ideas for marketing slogans for a new mail-order cheese shop. Develop criteria and select the best one. Then build a financial and marketing plan for the shop, revising as needed and analyzing competition. Then generate an appropriate logo using image generator and build a website for the shop as a mockup, making sure to carry 5-10 cheeses that fit the marketing plan.&#8221; </strong>With that single prompt, in less than two minutes, the AI not only provided a list of slogans, but ranked and selected an option, did web research, developed a logo, built marketing and financial plans, and launched a demo website for me to react to. The fact that my instructions were vague, and that common sense was required to make decisions about how to address them, was not a barrier.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2b4aa8b2-65fb-479e-8776-5e552195f88b_4390x2179.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"723\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2b4aa8b2-65fb-479e-8776-5e552195f88b_4390x2179.png\" title=\"\" width=\"1456\" /><div class=\"image-link-expand\"></div></div></a></figure></div><p>In addition to being, presumably, a larger model than GPT-4, o3 also works as a <a href=\"https://www.oneusefulthing.org/p/a-new-generation-of-ais-claude-37\">Reasoner </a>- you can see its &#8220;thinking&#8221; in the initial response. It also is an agentic model, one that can use tools and decide how to accomplish complex goals. You can see how it took multiple actions with multiple tools, including web searches and coding, to come up with the extensive results that it did.</p><p>And this isn&#8217;t the only extraordinary examples, o3 can also do an impressive job guessing locations from photos if you just give it an image and prompt <strong>&#8220;be a geo-guesser&#8221;</strong> (with some quite profound privacy implications). Again, you can see the agentic nature of this model at work, as it zooms into parts of the picture, adds web searches, and does multi-step processes to get the right answer.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe91fa6e3-cf1d-4d85-bc99-564d5fc18fea_2062x1707.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"434.4951923076923\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe91fa6e3-cf1d-4d85-bc99-564d5fc18fea_2062x1707.png\" title=\"\" width=\"525\" /><div class=\"image-link-expand\"></div></div></a></figure></div><p>Or I gave o3 a large dataset of historical machine learning systems as a spreadsheet and asked <strong>&#8220;figure out what this is and generate a report examining the implications statistically and give me a well-formatted PDF with graphs and details&#8221;</strong> and got a full analysis with a single prompt. (I did give it some feedback to make the PDF better, though, as you can see).</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23e01ecd-26b6-4569-b5d2-86798bdc1102_3529x1622.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"669\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23e01ecd-26b6-4569-b5d2-86798bdc1102_3529x1622.png\" width=\"1456\" /><div class=\"image-link-expand\"></div></div></a></figure></div><p>This is all pretty impressive stuff and you should experiment with these models on your own. <a href=\"https://gemini.google.com/u/1/app\">Gemini 2.5 Pro</a> is free to use and as &#8220;smart&#8221; as o3, though it lacks the same full agentic ability. If you haven&#8217;t tried it or o3, take a few minutes to do it now. Try <a href=\"https://x.com/emollick/status/1910534521998487709\">giving Gemini an academic paper and asking it to turn the paper into a game</a> or have it brainstorm with you for startup ideas, or just ask for the AI<a href=\"https://g.co/gemini/share/b2ce16d04017\"> to impress you</a> (and then keep saying &#8220;more impressive&#8221;). Ask the Deep Research option to do a research report on your industry, or to research a purchase you are considering, or to <a href=\"https://bsky.app/profile/emollick.bsky.social/post/3lmdminw4m22o\">develop a marketing plan for a new product</a>.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F43be9304-5824-4995-ae0d-1ea1514090ff_759x514.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"253.2753623188406\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F43be9304-5824-4995-ae0d-1ea1514090ff_759x514.png\" width=\"374\" /><div class=\"image-link-expand\"></div></div></a></figure></div><p>You might find yourself &#8220;feeling the AGI&#8221; as well. Or maybe not. Maybe the AI failed you, even when you gave it the exact same prompt I used. If so, you just encountered the jagged frontier.</p><h1>On &#8220;Jagged AGI&#8221;</h1><p><a href=\"https://www.oneusefulthing.org/p/centaurs-and-cyborgs-on-the-jagged\">My co-authors and I coined the term &#8220;Jagged Frontier&#8221;</a> to describe the fact that AI has surprisingly uneven abilities. An AI may succeed at a task that would challenge a human expert but fail at something incredibly mundane. For example, consider this puzzle, a variation on a classic old brainteaser (a concept first explored by <a href=\"https://x.com/colin_fraser\">Colin Fraser</a> and expanded by <a href=\"https://x.com/goodside/status/1790912819442974900\">Riley Goodside</a>): <em>\"A young boy who has been in a car accident is rushed to the emergency room. Upon seeing him, the surgeon says, \"I can operate on this boy!\" How is this possible?\"</em></p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa0b6c099-fc6c-42c2-b78b-380972895420_945x985.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"461.75132275132273\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa0b6c099-fc6c-42c2-b78b-380972895420_945x985.png\" width=\"443\" /><div class=\"image-link-expand\"></div></div></a></figure></div><p> o3 insists the answer is &#8220;the surgeon is the boy&#8217;s mother,&#8221; which is wrong, as a careful reading of the brainteaser will show. Why does the AI come up with this incorrect answer? Because that is the answer to the classic version of the riddle, meant to expose unconscious bias: <em>&#8220;A father and son are in a car crash, the father dies, and the son is rushed to the hospital. The surgeon says, 'I can't operate, that boy is my son,' who is the surgeon?&#8221;</em> The AI has &#8220;seen&#8221; this riddle in its training data so much that even the smart o3 model fails to generalize to the new problem, at least initially. And this is just one example of the kinds of issues and hallucinations that even advanced AIs can fall prey to, showing how jagged the frontier can be.</p><p>But the fact that the AI often messes up on this particular brainteaser does not take away from the fact that it can <a href=\"https://scale.com/leaderboard/enigma_eval\">solve much harder brainteasers</a>, or that it can do the other impressive feats I have demonstrated above. That is the nature of the Jagged Frontier. In some tasks, AI is unreliable. In others, it is superhuman. You could, of course, say the same thing about calculators, but it is also clear that AI is different. It is already demonstrating general capabilities and performing a wide range of intellectual tasks, including those that it is not specifically trained on. Does that mean that o3 and Gemini 2.5 are AGI? Given the definitional problems, I really don&#8217;t know, but I do think they can be credibly seen as a form of &#8220;Jagged AGI&#8221; - superhuman in enough areas to result in real changes to how we work and live, but also unreliable enough that human expertise is often needed to figure out where AI works and where it doesn&#8217;t. Of course, models are likely to become smarter, and a good enough Jagged AGI may still beat humans at every task, including in ones the AI is weak in.</p><h1>Does it matter?</h1><p>Returning to Tyler&#8217;s post, you will notice that, despite thinking we have achieved AGI, he doesn&#8217;t think that threshold <a href=\"https://marginalrevolution.com/marginalrevolution/2025/02/why-i-think-ai-take-off-is-relatively-slow.html\">matters much to our lives in the near term</a>. That is because, as many people have pointed out, technologies do not instantly change the world, no matter how compelling or powerful they are. Social and organizational structures change much more slowly than technology, and technology itself takes time to diffuse. Even if we have AGI today, we have years of trying to figure out how to integrate it into our existing human world.</p><p>Of course, that assumes that AI acts like <a href=\"https://knightcolumbia.org/content/ai-as-normal-technology\">a normal technology</a>, and one whose jaggedness will never be completely solved. There is the possibility that this may not be true. The agentic capabilities we're seeing in models like o3, like the ability to decompose complex goals, use tools, and execute multi-step plans independently, might actually accelerate diffusion dramatically compared to previous technologies. If and when AI can effectively navigate human systems on its own, rather than requiring integration, we might hit adoption thresholds much faster than historical precedent would suggest.</p><p>And there's a deeper uncertainty here: are there capability thresholds that, once crossed, fundamentally change how these systems integrate into society? Or is it all just gradual improvement? Or will models stop improving in the future as LLMs hit a wall? The honest answer is we don't know.</p><p>What's clear is that we continue to be in uncharted territory. The latest models represent something qualitatively different from what came before, whether or not we call it AGI. Their agentic properties, combined with their jagged capabilities, create a genuinely novel situation with few clear analogues. It may be that history continues to be the best guide, and that figuring out how to successfully apply AI in a way that shows up in the economic statistics may be a process measured in decades. Or it might be that we are on the edge of some sort of <a href=\"https://www.nytimes.com/2025/04/03/technology/ai-futures-project-ai-2027.html\">faster take-off</a>, where AI-driven change sweeps our world suddenly. Either way, those who learn to navigate this jagged landscape now will be best positioned for what comes next&#8230; whatever that is.</p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/subscribe\"><span>Subscribe now</span></a></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/p/on-jagged-agi-o3-gemini-25-and-everything?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share\"><span>Share</span></a></p><p></p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fafdef6bb-e268-4abe-a2ed-53ae3a68d4f1_1376x864.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"219.13953488372093\" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fafdef6bb-e268-4abe-a2ed-53ae3a68d4f1_1376x864.png\" width=\"349\" /><div></div></div></a></figure></div><p></p>"
            ],
            "link": "https://www.oneusefulthing.org/p/on-jagged-agi-o3-gemini-25-and-everything",
            "publishedAt": "2025-04-20",
            "source": "Ethan Mollick",
            "summary": "<p>Amid today&#8217;s AI boom, it&#8217;s disconcerting that we still don&#8217;t know how to measure how smart, creative, or empathetic these systems are. Our tests for these traits, never great in the first place, were made for humans, not AI. <a href=\"https://ai-analytics.wharton.upenn.edu/generative-ai-labs/research-and-technical-reports/tech-report-prompt-engineering-is-complicated-and-contingent/\">Plus, our recent paper testing prompting techniques</a> finds that AI test scores can change dramatically based simply on how questions are phrased. Even famous challenges like the Turing Test, where humans try to differentiate between an AI and another person in a text conversation, were designed as thought experiments at a time when such tasks seemed impossible. But now that <a href=\"https://arxiv.org/pdf/2503.23674\">a new paper shows that AI passes the Turing Test</a>, we need to admit that we really don&#8217;t know what that actually means. </p><p>So, it should come as little surprise that one of the most important milestones in AI development, Artificial General Intelligence, or AGI, is badly defined and much debated. Everyone agrees that it has something to do with the ability of AIs to perform human-level tasks, though no one agrees whether this means expert or average human performance, or how many tasks and which kinds an AI would need to master to qualify. Given the definitional morass",
            "title": "On Jagged AGI: o3, Gemini 2.5, and everything after"
        },
        {
            "content": [],
            "link": "https://eugeneyan.com//writing/eval-process/",
            "publishedAt": "2025-04-20",
            "source": "Eugene Yan",
            "summary": "Applying the scientific method, building via eval-driven development, and monitoring AI output.",
            "title": "An LLM‑as‑Judge Won't Save Your Product—Fixing Your Process Will"
        },
        {
            "content": [],
            "link": "https://lethain.com/staffeng-site-refresh/",
            "publishedAt": "2025-04-20",
            "source": "Will Larson",
            "summary": "<p>Ahead of announcing the title and publisher of my <a href=\"https://lethain.com/tags/eng-strategy-book/\">thus-far-untitled book on engineering strategy</a> in the next week or two, I put together a website for its content. That site is pretty much the same format as this blog, but with some improvements like better mobile rendering on <code>/</code> than this blog has historically had.</p> <p>After finishing that work, I ported the improvements back to <code>lethain.com</code>, but also decided to bring them to <a href=\"https://staffeng.com\">staffeng.com</a>. That was slightly trickier because, unlike this blog, StaffEng was historically a Gatsby app. (Why a Gatsby app? Because Calm was using Gatsby for our web frontend and I wanted to get some experience with it.)</p> <p>Over the weekend, I took some time to migrate to Hugo and apply the same enhancements. which you can now see in the <a href=\"https://github.com/lethain/staff-eng\"><code>lethain:staff-eng</code></a> repository or on <a href=\"https://staffeng.com/\">staffeng.com</a>.</p> <p>Here&rsquo;s a screenshot of the old version.</p> <p><img alt=\"Here&rsquo;s a screenshot of the old version.\" src=\"https://lethain.com/static/blog/2025/se-old.png\" /></p> <p>Then here&rsquo;s a screenshot of the updated version.</p> <p><img alt=\"Then here&rsquo;s a screenshot of the updated version.\" src=\"https://lethain.com/static/blog/2025/se-new.png\" /></p> <p>Overall, I think it&rsquo;s <em>slightly</em> easier to read, and I took it as a chance to update the various links. For example,",
            "title": "Refreshed StaffEng.com and a few other sites"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-04-20"
}