{
    "articles": [
        {
            "content": [
                "<header>\n  <h1>Readonly Characters Are a Big Deal</h1>\n  <time class=\"meta\" datetime=\"2025-11-10\">Nov 10, 2025</time>\n</header>\n<p>I like Emacs UX as exemplified by <a href=\"https://magit.vc\">Magit</a>. I consider it to be a user interface\nparadigm on the same footing as UNIX pipes:\n<a class=\"display\" href=\"https://matklad.github.io/2023/03/08/an-engine-for-an-editor.html\"><em>An Engine for an Editor</em></a></p>\n<p>Pipes give you 1D read-only streams of characters which excel at batch processing.\nEmacs is all about interactive mutable 2D buffers of attributed text.</p>\n<p>Today I realized that an important feature of Emacs text buffers is read-only characters\n(<a href=\"https://www.gnu.org/software/emacs/manual/html_node/elisp/Special-Properties.html#:~:text=read-only\">manual</a>).</p>\n<p>Like in any editor, you can mark an entire Emacs buffer as read-only. But you also can mark\nindividual substrings read-only, so that you can edit anywhere except specific ranges</p>\n<figure>\n\n</figure>\n<p>This is a useful feature for bidirectional interaction. Consider the\n<a href=\"https://matklad.github.io/2025/08/31/vibe-coding-terminal-editor.html\">in-editor terminal</a>\nI am using currently, which looks like this:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">./zig/zig build fuzz -- message_bus</span>\n<span class=\"line\"></span>\n<span class=\"line hl-line\">= time: 3s =</span>\n<span class=\"line\"></span>\n<span class=\"line\">info(fuzz): Fuzz seed = 2355780251053186744</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: reserved = 0</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: ping = 0</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: pong = 0</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: ping_client = 0</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: pong_client = 0</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: request = 0</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: prepare = 37</span>\n<span class=\"line\">info(message_bus_fuzz): command weight: prepare_ok = 0</span></code></pre>\n\n</figure>\n<p>The first line is the command to execute, this is typed by me manually, and then I hit a “submit”\nshortcut to actually run the command. Then goes the status line, which shows how long the command\nhas been running so far and the exit code (when the command terminates). The status line is\ndetermined by the “terminal” itself. Finally, there’s output of the command itself, updated live.</p>\n<p>In this sort of the interface, command is modifiable by the user, but is read-only for the editor.\nStatus is the opposite — the editor updates it every second, but the user should be prevented from\ntouching it. And the output can be CRDT-style edited by both parties (I often find it useful to edit\nthe output in place before pasting it elsewhere).</p>\n<p>Sadly, in VS Code I can’t prevent the user from editing the status, so my implementation is a bit\njanky, and this, I think, goes to the core of why I don’t see VS Code as a great platform for the kind\nof interactive tools I want to write.</p>\n<p>Read-only ranges are hard to implement! <a href=\"https://lord.io/text-editing-hates-you-too/\">Text editing hates\nyou</a> as is, but this feature requires tracking text\nattributes in an intelligent way under modifications (see <a href=\"https://www.gnu.org/software/emacs/manual/html_node/elisp/Sticky-Properties.html\">sticky\nproperties</a>), and\n<em>also</em> feeds back into modifications themselves! No wonder Monaco, the editor engine underlying VS\nCode, <a href=\"https://github.com/microsoft/monaco-editor/issues/874\">lost this ability</a> at some point.</p>\n<p>Still, I feel like “does it support sticky read-only attribute?” is a good litmus test to\ncheck if an editor can support interactive applications a-la Magit seamlessly.</p>"
            ],
            "link": "https://matklad.github.io/2025/11/10/readonly-characters.html",
            "publishedAt": "2025-11-10",
            "source": "Alex Kladov",
            "summary": "I like Emacs UX as exemplified by Magit. I consider it to be a user interface paradigm on the same footing as UNIX pipes: An Engine for an Editor",
            "title": "Readonly Characters Are a Big Deal"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/get-logic-for-programmers-50-off-support-chicago/",
            "publishedAt": "2025-11-10",
            "source": "Hillel Wayne",
            "summary": "<p>From now until the end of the month, you can get <a href=\"https://leanpub.com/logic/c/feedchicago\" target=\"_blank\">Logic for Programmers at half price</a> with the coupon <code>feedchicago</code>. All royalties from that coupon will go to the <a href=\"https://www.chicagosfoodbank.org/\" target=\"_blank\">Greater Chicago Food Depository</a>. Thank you!</p>",
            "title": "Get Logic for Programmers 50% off & Support Chicago Foodbanks"
        },
        {
            "content": [
                "<p>In game development you collaborate on visual, structured content: levels filled with platforms and enemies, UI screens with arranged buttons, 3D environments with placed props.</p>\n<p>Current version control tools like Git only see this content as plain text, stripping away spatial layout and hierarchical structure. When merge conflicts occur, developers have to resolve them line-by-line, looking just at the text representation.</p>\n<p>In project <a href=\"https://inkandswitch.com/project/beckett\">Beckett</a>, we are building a version control system for scene files in the Godot game engine that preserves these meaningful spatial and structural relationships.</p>\n<h2 id=\"spatial-scenes-reduced-to-sequential-text\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#spatial-scenes-reduced-to-sequential-text\">Spatial scenes reduced to sequential text</a></h2>\n<p>Games built with Godot are made up of “scenes”, which are stored as text files to allow version control with Git and other typical version control tools. A scene is composed of nodes—the engine’s smallest building blocks—arranged into trees. Each node has spatial properties (position, rotation, scale) and a place in the hierarchy. Here’s what a change to a scene file looks like in Git.</p>\n<p><img alt=\"\" src=\"https://www.inkandswitch.com/project/beckett/notebook/01/textual-diff.webp\" /></p>\n<p>The visual properties are reduced to numeric parameters scattered across the file. The tree structure is flattened into a linear list. When reviewing changes, a developer must mentally reconstruct both the spatial layout and hierarchical relationships to understand what changed.</p>\n<p>When two developers modify the same scene, Git may report a conflict even when changes are semantically independent. One developer adds platforms at the top of a level while another adds coins at the bottom, but if these touch adjacent lines in the text file, Git sees a conflict. The resulting file contains conflict markers and won’t load in Godot. Only once all conflicts are resolved can the scene be loaded again.</p>\n<h2 id=\"version-control-inside-the-spatial-editor\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#version-control-inside-the-spatial-editor\">Version control inside the spatial editor</a></h2>\n<p>Our plugin for Godot shows changes in two distinct ways. In the viewport at the center, you see changed objects clearly highlighted. In the right sidebar, there is a complete list of all changes, which is important when changing non-visual properties like the player’s speed. These two views reinforce each other — when you hover over a changed property in the sidebar, the corresponding element lights up in the viewport.</p>\n<p><img alt=\"\" src=\"https://www.inkandswitch.com/project/beckett/notebook/01/diff-view.webp\" /></p>\n<p>When using Git with Godot, it’s unfortunately easy to corrupt scene files when merging, rendering them unable to load. We’ve heard that this leads game developers to isolate their work to avoid conflicts — one developer works on assets, another on layout — instead of collaborating freely. Since our plugin was designed to work with the proper structure of scene files, we can guarantee that you always get a loadable scene when merging. This doesn’t mean that all changes can be combined automatically — conflicts are still possible, as we’ll see in a moment. But we believe it’s better to have a project you can open and work on within the editor than a project that won’t open until you fix a bunch of conflicts in the abstract text representation.</p>\n<p><img alt=\"\" src=\"https://www.inkandswitch.com/project/beckett/notebook/01/merge-preview.webp\" /></p>\n<p>Visualizing diffs within a visual editor, like a game editor viewport, is a tricky affair — you have no idea what the art style of the game will be, so simply highlighting diffs in green is unlikely to work in many cases. Our current approach is to grey-out all non-highlighted elements, giving the changed objects stark contrast with their surroundings.</p>\n<p><img alt=\"\" src=\"https://www.inkandswitch.com/project/beckett/notebook/01/diff-highlight-in-scene.webp\" /></p>\n<h2 id=\"open-questions-and-next-steps\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#open-questions-and-next-steps\">Open questions and next steps</a></h2>\n<p>Our exploration of native version control within Godot is ongoing, and we have many ideas and open questions to drive further work. Here are three.</p>\n<p><strong>Handling conflicts.</strong> <a href=\"https://automerge.org\">Automerge</a>, which powers our version control plugin, will detect when multiple changes are made concurrently to the same property, resulting in a conflict. By default it selects one change as the “winner”, but the other changes are remembered and can be accessed. We’d like to explore various ways of surfacing these conflicting changes within Godot. [Ed: it’d be nice to add one example of how this might work.]</p>\n<p><strong>Conflicts for spatial data.</strong> Spatial and structural data, like the scene files used by Godot, are subject to a variety of conflicts that require resolution strategies specific to their domain. For instance, if two developers move the same node to different positions, that’s a conflict — but it’s the sort of conflict you’d experience in any domain where a property can only have a single value. But what if one developer moves a node while another deletes it? Or if both add a child to the same parent? While these conflicts can occur in other domains, it’s likely that the way to correctly resolve them in the context of a Godot scene requires special handling to preserve the invariants Godot and game developers expect to be upheld.</p>\n<p><strong>Other spatial / structural domains.</strong> The problems we’ve encountered when merging spatial data, displaying visual diffs, and preserving hierarchical structure apply beyond Godot and game development. 3D modeling tools, vector graphics editors, and visual programming environments face similar challenges. We’ve reviewed a variety of existing approaches to solving these problems in these other domains, and we’re keen to continue exploring the space.</p>"
            ],
            "link": "https://www.inkandswitch.com/project/beckett/notebook/01/",
            "publishedAt": "2025-11-10",
            "source": "Ink & Switch",
            "summary": "<p>In game development you collaborate on visual, structured content: levels filled with platforms and enemies, UI screens with arranged buttons, 3D environments with placed props.</p> <p>Current version control tools like Git only see this content as plain text, stripping away spatial layout and hierarchical structure. When merge conflicts occur, developers have to resolve them line-by-line, looking just at the text representation.</p> <p>In project <a href=\"https://inkandswitch.com/project/beckett\">Beckett</a>, we are building a version control system for scene files in the Godot game engine that preserves these meaningful spatial and structural relationships.</p> <h2 id=\"spatial-scenes-reduced-to-sequential-text\"><a class=\"plain\" href=\"https://www.inkandswitch.com/index.xml#spatial-scenes-reduced-to-sequential-text\">Spatial scenes reduced to sequential text</a></h2> <p>Games built with Godot are made up of “scenes”, which are stored as text files to allow version control with Git and other typical version control tools. A scene is composed of nodes—the engine’s smallest building blocks—arranged into trees. Each node has spatial properties (position, rotation, scale) and a place in the hierarchy. Here’s what a change to a scene file looks like in Git.</p> <p><img alt=\"\" src=\"https://www.inkandswitch.com/project/beckett/notebook/01/textual-diff.webp\" /></p> <p>The visual properties are reduced to numeric parameters scattered across the file. The tree structure is flattened into a linear list. When reviewing changes, a developer must mentally reconstruct both the spatial layout and",
            "title": "Beckett 01 · Version Control for Space and Structure"
        },
        {
            "content": [
                "<p>It&#8217;s been eight months since I released my last story, so you could be forgiven for thinking that I&#8217;d given up on writing fiction. In fact, it&#8217;s the opposite. I&#8217;m excited to announce that I&#8217;m releasing my first fiction collection&#8212;<em><a href=\"https://tully.encour.co/books/the-gentle-romance\">The Gentle Romance: Stories of AI and Humanity</a></em>&#8212;with Encour Press in mid-December!</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!B0FM!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8fb0c276-de23-4ca4-88cb-89a3c2bec38d_625x1000.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"1000\" src=\"https://substackcdn.com/image/fetch/$s_!B0FM!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8fb0c276-de23-4ca4-88cb-89a3c2bec38d_625x1000.jpeg\" width=\"625\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-refresh-cw\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M3 12a9 9 0 0 1 9-9 9.75 9.75 0 0 1 6.74 2.74L21 8\"></path><path d=\"M21 3v5h-5\"></path><path d=\"M21 12a9 9 0 0 1-9 9 9.75 9.75 0 0 1-6.74-2.74L3 16\"></path><path d=\"M8 16H3v5\"></path></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>(Cover design by <a href=\"https://substack.com/@bookcoverdesign\">Bar&#305;&#351; &#350;ehri</a>)</p><p>It contains 22 stories, most of which are revised versions of the best stories I&#8217;ve posted online. The thread that connects them is the struggle to hold onto our identities in the face of radical technological change&#8212;the same thread that winds through many of our own lives.</p><p>&#8288;&#8288;I&#8217;ve also written three new stories for the collection, which are some of my favorites:</p><ul><li><p><em>Lentando</em> is set in a future inspired by Charles Stross&#8217; masterpiece <em><a href=\"https://www.antipope.org/charlie/blog-static/fiction/accelerando/accelerando.html\">Accelerando</a></em>. Through it we follow Liza, a zero-knowledge consultant whose soon-to-be-deleted copies struggle to hold the world together.</p></li><li><p><em>The Biggest Short</em> is the story of two traders who make a fortune buying and selling reputations while struggling to preserve their own.</p></li><li><p><em>Kuhn&#8217;s Ladder</em> is about a simulated utopia that starts experiencing inexplicable glitches which seem designed to remain hidden.</p></li></ul><p><a href=\"https://www.amazon.com/Gentle-Romance-Stories-AI-humanity/dp/176428030X\">You can preorder the physical book here</a>, and <a href=\"https://www.amazon.com/dp/B0G1R7SRM2\">the ebook here</a>.</p><p>Looking forward, it&#8217;s hard to say how much writing I&#8217;ll be doing over the next few years. I have a sense that static text will soon no longer be the best way to tell stories, so I want to try to figure out what the successor format to the short story will be. But I still have a few more stories in the pipeline, including one that&#8217;s my most ambitious effort so far&#8212;all of which I&#8217;ll post here when they&#8217;re finished.</p><p>Lastly, some thanks are in order. To Jessy Wu and Marlene Baquiran at Encour Press, whose efforts produced a much better version of this book (and made it possible at all). To Madeleine, who uplifts and inspires me. And to all of you who have read or commented on my writing over the last few years. I&#8217;m grateful for the encouragement that moved me to create <em>The Gentle Romance</em>, and I hope that you will enjoy it!</p>"
            ],
            "link": "https://www.narrativeark.xyz/p/book-announcement",
            "publishedAt": "2025-11-10",
            "source": "Narrative Ark",
            "summary": "It&#8217;s been eight months since I released my last story, so you could be forgiven for thinking that I&#8217;d given up on writing fiction.",
            "title": "Book Announcement"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>I experimented with a paywall on the <a href=\"https://www.astralcodexten.com/p/my-antichrist-lecture\">My Antichrist Lecture</a> post. I&#8217;ve decided not to keep using paywalls and to continue having paid posts be invisible to nonsubscribers. As a side effect of the switch back, the Antichrist post disappeared for nonsubscribers. You can read an archived copy <a href=\"https://archive.is/1w2bs\">here</a>.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-407",
            "publishedAt": "2025-11-10",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>I experimented with a paywall on the <a href=\"https://www.astralcodexten.com/p/my-antichrist-lecture\">My Antichrist Lecture</a> post. I&#8217;ve decided not to keep using paywalls and to continue having paid posts be invisible to nonsubscribers. As a side effect of the switch back, the Antichrist post disappeared for nonsubscribers. You can read an archived copy <a href=\"https://archive.is/1w2bs\">here</a>.</p>",
            "title": "Open Thread 407"
        },
        {
            "content": [
                "This post is a roundup of various things related to philanthropy, as you often find in the full monthly roundup.\n\n\n<h4 class=\"wp-block-heading\">Preventing Value Drift</h4>\nPeter Thiel warned Elon Musk to ditch donating to The Giving Pledge because Bill Gates will give his wealth away ‘to left-wing nonprofits.’\n\n<a href=\"https://x.com/JohnArnoldFndtn/status/1978093571413577961\">As John Arnold points out, this seems highly confused</a>. The Giving Pledge is a promise to give away your money, not a promise to let Bill Gates give away your money. The core concern, that your money ends up going to causes one does not believe in (and probably highly inefficiently at that) seems real, once you send money into a foundation ecosystem it by default gets captured by foundation style people.\n<div> <span id=\"more-24843\"></span> </div>\nAs he points out, ‘let my children handle it’ is not a great answer, and would be especially poor for Musk given the likely disagreements over values, especially if you don’t actually give those children that much free and clear (and thus, are being relatively uncooperative, so why should they honor your preferences?). There are no easy answers.\n\n\n<h4 class=\"wp-block-heading\">Maximizing Good Makes People Look Bad</h4>\nA new paper goes Full Hanson with the question <a href=\"https://journals.sagepub.com/doi/abs/10.1177/01461672251361210\">Does Maximizing Good Make People Look Bad?</a> They answer yes, if you give deliberately rather than empathetically and seek to maximize impact this is viewed as less moral and you are seen as a less desirable social partner, and donors estimate this effect roughly correctly. Which makes sense if you consider that one advantage of being a social partner is that you can direct your partners with social and emotional appeals, and thereby extract their resources. As with so many other things, you can be someone or do something, and if you focus on one you have to sacrifice some of the other.\n\nThis is one place where the core idea of Effective Altruism is pretty great. You create a community of people where it is socially desirable to be deliberative, and scorn is put on those who are empathic instead. If that was all EA did, without trying to drum up more resources or direct how people deliberated? That alone is a big win.\n\n\n<h4 class=\"wp-block-heading\">No We Have No Tuition</h4>\n<a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/uatx-is-ending-tuition-forever.html\">UATX eliminates tuition forever as the result of a $100 million gift from Jeff Yass</a>. Well, hopefully. This gift alone doesn’t fund that, they’re counting on future donations from grateful students, so they might have to back out of this the way Rice had to in 1965. One could ask, given schools like Harvard, Yale and Stanford make such bets and have wildly successful graduates who give lots of money, and still charge tuition, what is the difference?\n\nIn general giving to your Alma Mater or another university is highly ineffective altruism. One can plausibly argue that fully paying for everyone’s tuition, with an agreement to that effect, is a lot better than giving to the general university fund, especially if you’re hoping for a cascade effect. It would be a highly positive cultural shift if selective colleges stopped charging tuition. Is that the best use of $100 million? I mean, obviously not even close, but it’s not clear that it is up against the better uses.\n\n\n<h4 class=\"wp-block-heading\">Will MacAskill and the Dangers of PR Focus</h4>\n<a href=\"https://forum.effectivealtruism.org/posts/R8AAG4QBZi5puvogR/effective-altruism-in-the-age-of-agi\">Will MacAskill asks what Effective Altruism</a> should do now that AI is making rapid progress and there is a large distinct AI safety movement. He argues EA should embrace the mission of making the transition to a post-AGI society go well.\n<blockquote>Will MacAskill: This third way will require a lot of intellectual nimbleness and willingness to change our minds. Post-FTX, much of EA adopted a “PR mentality” that I think has lingered and is counterproductive.\n\nEA is intrinsically controversial because we say things that aren’t popular — and given recent events, we’ll be controversial regardless. This is liberating: we can focus on making arguments we think are true and important, with bravery and honesty, rather than constraining ourselves with excessive caution.</blockquote>\nHe does not mention until later the obvious objection, which is that the Effective Altruist brand is toxic, to the point that the label is used as a political accusation.\n\nNo, this isn’t primarily because EA is ‘inherently controversial’ for the things it advocates. It is primarily because, as I understand things:\n<ol>\n \t<li>EA tells those who don’t agree with EA, and who don’t allocate substantial resources to EA causes, that they are bad, and that they should feel bad.</li>\n \t<li>EA (long before FTX) <a href=\"https://benjaminrosshoffman.com/effective-altruism-is-self-recommending/\">adopted in a broad range of ways</a> the ‘PR mentality’ MacAskill rightfully criticizes, and other hostile actions it has taken, also FTX.</li>\n \t<li>FTX, which was severely mishandled.</li>\n \t<li>Active intentional scapegoating and fear mongering campaigns.</li>\n \t<li>Yes, the things it advocates for, and the extent to which it and components of it have pushed for them, but this is one of many elements.</li>\n</ol>\nThus, I think that the things strictly labeled EA should strive to stay away from the areas in which being politically toxic is a problem, and consider the risks of further negative polarization. It also needs to address the core reasons EA got into the ‘PR mentality.’\n\nHere are the causes he thinks this new EA should have in its portfolio (with unequal weight that is not specified):\n<blockquote>\n<ul>\n \t<li>global health &amp; development</li>\n \t<li>factory farming</li>\n \t<li>AI safety</li>\n \t<li>AI character<sup>[5]</sup></li>\n \t<li>AI welfare / digital minds</li>\n \t<li>the economic and political rights of AIs</li>\n \t<li>AI-driven persuasion and epistemic disruption</li>\n \t<li>AI for better reasoning, decision-making and coordination</li>\n \t<li>the risk of (AI-enabled) human coups</li>\n \t<li>democracy preservation</li>\n \t<li>gradual disempowerment</li>\n \t<li>biorisk</li>\n \t<li>space governance</li>\n \t<li>s-risks</li>\n \t<li>macrostrategy</li>\n \t<li>meta</li>\n</ul>\n</blockquote>\nThere are some strange flexes in there, but given the historical origins, okay, sure, not bad. Mostly these are good enough to be ‘some of you should do one thing, and some of you should do the other’ depending on one’s preferences and talents. I strongly agree with Will’s emphasis that his shift into AI is an affirmation of the core EA principles worth preserving, of finding the important thing and focusing there.\n\nI am glad to see Will discuss the problem of ‘PR focus.’\n<blockquote>By “PR mentality” I mean thinking about communications through the lens of “what is good for EA’s brand?” instead of focusing on questions like “what ideas are true, interesting, important, under-appreciated, and how can we get those ideas out there?</blockquote>\nI also appreciate Will’s noticing that the PR focus hasn’t worked even on its own terms, that EA discourse is withering. I would add that EA’s brand and PR position is terrible in large part exactly because EA has often acted, for a long period, in this PR-focused, uncooperative and fundamentally hostile way, that comes across as highly calculated because it was, along with a lack of being straight with people, and eventually people learn the pattern.\n\nThis laid the groundwork, when combined with FTX and an intentional series of attacks from a16z and related sources, to poison the well. It wouldn’t have worked otherwise to anything like the same extent.\n\nThis was very wise:\n<blockquote>And I think this mentality is corrosive to EA’s soul because as soon as you stop being ruthlessly focused on actually figuring out what’s true, then you’ll almost certainly believe the wrong things and focus on the wrong things, and lose out on most impact. Given fat-tailed distributions of impact, getting your focus a <em>bit</em> wrong can mean you do 10x less good than you could have done. Worse, you can easily end up having a negative rather than a positive effect.</blockquote>\nExcept I think this was a far broader issue than a post-FTX narrow PR focus.\n\nThus I see ‘PR focus’ as a broader problem than Will does. It is about this kind of communication, but also broader decision making and strategy and prioritization, and was woven into the DNA. It is the asking ‘what maximizes the inputs into EA brands’ question more broadly and centrally involves confusion of costs and benefits. The broader set of things all come from the same underlying mindset.\n\nAnd I think that mindset greatly predates FTX. Indeed, it is hard to not view the entire FTX incident, and why it went so wrong, as largely about the PR mindset.\n\nAs a clear example, he thinks ‘growing the inputs’ was a good focus of EA in the last year. He thinks the focus should now shift to improving the culture, but his justifications still fall into the ‘maximize inputs’ mindset.\n<blockquote>In the last year or two, there’s been a lot of focus on growing the inputs. I think this was important, in particular to get back a sense of momentum, and I’m glad that that effort has been pretty successful. I still think that growing EA is extremely valuable, and that some organisation (e.g. Giving What We Can) should focus squarely on growth.</blockquote>\nActively looking to grow the movement has obvious justification, but inputs are costs and not benefits, it is easy to confuse the two, and focus on growing inputs tends to cause severe PR mindset and hostile actions as you strive to capture resources, including people’s time and attention.\n\nAnother example I would cite was the response to <em>If Anyone Builds It, Everyone Dies </em>by the core EA people, including among others Will MacAskill himself and also the head of CEA. This was a very clear example of PR mindset, where quite frankly a decision was made that this was a bad EA look, the moves it proposes were unstrategic, and thus the book should be thrown overboard. If Will is sincere about this reckoning, he should be able to recognize that this is what happened.\n\nWhat should you do if your brand is widely distrusted and toxic?\n\nThe good news, I agree with Will, is that you can stop doing PR.\n<blockquote>But <em>this is a liberating fact</em>. It means we don’t <em>need </em>to constrain ourselves with PR mentality — we’ll be controversial whatever we do, so the costs of additional controversy are much lower. Instead, we can just focus on making arguments about things we think are true and important. Think Peter Singer! I also think the “vibe shift” is real, and mitigates much of the potential downsides from controversy.</blockquote>\nThe bad news is that this doesn’t raise the obvious question, which is why are you doubling down on this toxic brand, especially given the nature of many of the cause areas Will suggests EA enter?\n\n\n<h4 class=\"wp-block-heading\">Tag, You’re It</h4>\n<a href=\"https://x.com/danrothschild/status/1980409007534985723\">When you hold your conference, This Is The Way</a>:\n<blockquote>Daniel Rothchild: Many great things about the @rootsofprogress conference this weekend, but I want to take a moment to give a shout out to excellent execution of an oft-overlooked event items that most planners and organizers get wrong: the name badge.\n<div>\n<figure>\n<div>\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!7Pcl!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5dedf1d2-6057-41d8-9505-fa603737d243_1536x2048.jpeg\" /></figure>\n\n<div></div>\n</div></figure>\n</div>\nMight this the best conference name tag ever designed? Let’s go through its characteristics.\n<ol>\n \t<li>It’s double-sided. That might seem obvious, but a lot of conferences just print on one side. I guess that saves a few cents, but it means half the time the badge is useless.</li>\n \t<li>It’s on a lanyard that’s the right length. It came to mid-torso for most people, making it easy to see and catch a glimpse of without looking at people in a weird way.</li>\n \t<li>it’s a) attractive and b) not on a safety pin so people actually want to wear it.</li>\n \t<li>Most importantly, the most important bit of information&#8211;the wearer’s first name&#8211;is printed in a maximally large font across the top. You could easily see it from 10 feet away. Again, it might seem obvious&#8230; but I go to a lot of events with 14 point printed names.\n<ol>\n \t<li>The other information is fine to have in smaller fonts. Job title, organization, location&#8230; those are all secondary items. The most important thing is the wearer’s name, and the most important part of that is the first name.</li>\n</ol>\n</li>\n \t<li>After all of the utilitarian questions have been answered&#8230; it’s attractive. The color scheme and graphic branding is consistent with the rest of the conference. But I stress, this is the least important part of the badge.</li>\n</ol>\nWhy does all this matter? Because the best events are those that are designed to facilitate maximal interaction and introduction between people (and to meet IRL people you know online). That’s the case with unconferences, or events with a lot of social/semi-planned time.</blockquote>\nThere’s basically no reason for everyone not to outright copy this format, forever.\n\nIndeed, one wonders if you shouldn’t have such badges and wear them at parties.\n\n\n<h4 class=\"wp-block-heading\">Impact Philanthropy</h4>\n<a href=\"https://thenewfrontier.substack.com/p/unintuitive-things-about-impact-philanthropy\">Alex Shintaro Araki offers thoughts on Impact Philanthropy fundraising</a>, and <a href=\"https://x.com/s_r_constantin/status/1985734294283640969\">Sarah Constantin confirms this matches her experiences</a>. Impact philanthropy is ideally where you try to make cool new stuff happen, especially a scientific or technological cool new thing, although it can also be simply about ‘impact’ through things like carbon sequestration. This is a potentially highly effective approach, but also a tough road. Individual projects need $20 million to $100 million and most philanthropists are not interested. Sarah notes that many people temperamentally aren’t excited by cool new stuff, which is alien to me, that seems super exciting, but it’s true.\n\nOne key insight is that if you’re asking for $3 million you might as well ask for $30 million, provided you have a good pitch on what to do with it, and assuming you pitch people who have the money. If someone is a billionaire, they’re actively excited to be able to place large amounts of money.\n\nAnother is that there’s a lot of variance and luck, although he doesn’t call it that. You probably need a deep connection with your funder, but you also need to find your funder at the right time when things line up for them.\n\nFinally, it sounds weird, but it matches my experience that funders need good things to fund even more than founders need to find people to fund them, the same way this is also true in venture capital. They don’t see good opportunities and have limited time. So things like cold emails can actually work.\n\nExpect another philanthropy-related post later this month.\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2025/11/10/variously-effective-altruism/",
            "publishedAt": "2025-11-10",
            "source": "TheZvi",
            "summary": "This post is a roundup of various things related to philanthropy, as you often find in the full monthly roundup. Preventing Value Drift Peter Thiel warned Elon Musk to ditch donating to The Giving Pledge because Bill Gates will give &#8230; <a href=\"https://thezvi.wordpress.com/2025/11/10/variously-effective-altruism/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Variously Effective Altruism"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3166/",
            "publishedAt": "2025-11-10",
            "source": "XKCD",
            "summary": "<img alt=\"Are you the annoying spoon or the sleepy spoon?\" src=\"https://imgs.xkcd.com/comics/big_and_little_spoons.png\" title=\"Are you the annoying spoon or the sleepy spoon?\" />",
            "title": "Big and Little Spoons"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2025-11-10"
}