{
    "articles": [
        {
            "content": [],
            "link": "https://everythingstudies.com/2026/01/06/2025-the-final-final-year/",
            "publishedAt": "2026-01-06",
            "source": "Everything Studies",
            "summary": "I really mean it this time. For the last few years, these yearly summaries are the only things I&#8217;ve published on this once-much-more-active blog. I&#8217;m writing my book Competitive Sensemaking, which I got a grant to write back in 2022. Optimistically it looked like I could&#8217;ve finished it in 2023, I definitely feel I should&#8217;ve &#8230; <a class=\"more-link\" href=\"https://everythingstudies.com/2026/01/06/2025-the-final-final-year/\">Continue reading <span class=\"screen-reader-text\">2025: The Final Final&#160;Year</span></a>",
            "title": "2025: The Final Final Year"
        },
        {
            "content": [],
            "link": "https://harper.blog/now/2026-01-06/",
            "publishedAt": "2026-01-06",
            "source": "Harper Reed",
            "summary": "<h2 id=\"2389-rules\">2389 rules</h2> <ul> <li>This company is still going!</li> <li>We have pushed out a few things that people can use: <a href=\"https://jeff.ceo\">jeff.ceo</a> is my fav</li> <li>We made some hoodies and shirts.</li> <li>I am even <em>more</em> excited to be building things again.</li> <li>I can&rsquo;t wait to show you more what we are building.</li> <li>I no longer code. I just talk to a robot who codes. <strong>Management.</strong></li> <li>We are shipping so so much stuff.</li> <li>Come hang out at our cool and futuristic office!</li> </ul> <h3 id=\"the-weird--the-fear\">The weird / The Fear</h3> <ul> <li>I am feeling a deep sense of uncertainty.</li> <li>AI is coming for us faster than you think.</li> <li>I don&rsquo;t think people my age who are being laid off now are going to be able to find jobs equivalent to what they had before.</li> <li>The state of the US is very concerning at the moment.</li> <li>Boomers, man.</li> <li>I seem to be living in an occupied city. Weird.</li> <li>There is a sense of fear out here that is stresseful, and terrifying.</li> </ul> <figure class=\"video\"> <video controls=\"controls\" preload=\"metadata\" width=\"600\"> <source src=\"https://harper.blog/now/2026-01-06/its-gonna-get-way-worse.mp4\" type=\"video/mp4\" /> </video> </figure> <h3 id=\"the-normal\">The normal</h3> <ul> <li>Reading a <a href=\"https://harper.blog/media/books/grid/\">lot of books</a>. Send me your recs.</li> <li>Still taking a lot of",
            "title": "Now @ 01-06-2026"
        },
        {
            "content": [],
            "link": "https://harper.blog/notes/2026-01-05_c6e302b8c827_i-blogged-about-using-claude-c/",
            "publishedAt": "2026-01-06",
            "source": "Harper Reed",
            "summary": "<p>I blogged about using Claude Code on my phone</p> <p><a href=\"https://harper.blog/2026/01/05/claude-code-is-better-on-your-phone/\">harper.blog/2026/01/0…</a></p> <hr /> <p>Thank you for using RSS. I appreciate you. <a href=\"mailto:harper&#64;modest.com\">Email me</a></p>",
            "title": "Note #311"
        },
        {
            "content": [],
            "link": "https://harper.blog/2026/01/05/claude-code-is-better-on-your-phone/",
            "publishedAt": "2026-01-06",
            "source": "Harper Reed",
            "summary": "<p>So so many friends have asked me how I use Claude Code from my phone. I am always a bit surprised, because a lot of this type of work I have been doing for nearly 25 years (or more!) and I always forget that it is partially a lost art. This is how it used to be. We didn’t have fancy IDEs, and fancy magic to deploy stuff. We had to ssh (hah. Telnet!) into a machine and work with it through the terminal. It ruled. It was a total nightmare. It was also a lot of fun.</p> <blockquote> <p>One of my favorite parts of the early 2000s was hanging out in IRC channels and just participating in the most ridiculous community of tech workers. A very very fun time. #corporate on efnet!</p> </blockquote> <p>There is a lot of nostalgia for that time period - but for the most part the tooling sucked. The new IDEs, and magic deploy systems have made it so that you do not have to deal with a terminal to get shit done. And then&hellip; Claude Code sashays into the room and fucks up the vibe.</p> <p>Or creates a new vibe? Who knows. Anyway. We",
            "title": "Remote Claude Code: programing like it was the early 2000s"
        },
        {
            "content": [],
            "link": "https://buttondown.com/hillelwayne/archive/the-liskov-substitution-principle-does-more-than/",
            "publishedAt": "2026-01-06",
            "source": "Hillel Wayne",
            "summary": "<p class=\"empty-line\" style=\"height: 16px; margin: 0px !important;\"></p> <p>Happy New Year! I'm done with the newsletter hiatus and am going to try updating weekly again. To ease into things a bit, I'll try to keep posts a little more off the cuff and casual for a while, at least until <a href=\"https://leanpub.com/logic/\" target=\"_blank\"><em>Logic for Programmers</em></a> is done. Speaking of which, v0.13 should be out by the end of this month.</p> <p>So for this newsletter I want to talk about the <a href=\"https://en.wikipedia.org/wiki/Liskov_substitution_principle\" target=\"_blank\">Liskov Substitution Principle</a> (LSP). Last week I read <a href=\"https://loup-vaillant.fr/articles/solid-bull\" target=\"_blank\">A SOLID Load of Bull</a> by cryptographer Loupe Vaillant, where he argues the <a href=\"https://en.wikipedia.org/wiki/SOLID\" target=\"_blank\">SOLID</a> principles of OOP are not worth following. He makes an exception for LSP, but also claims that it's \"just subtyping\" and further:</p> <blockquote> <p>If I were trying really hard to be negative about the Liskov substitution principle, I would stress that <strong>it only applies when inheritance is involved</strong>, and inheritance is strongly discouraged anyway.</p> </blockquote> <p>LSP is more interesting than that! In the original paper, <a href=\"https://www.cs.cmu.edu/~wing/publications/LiskovWing94.pdf\" target=\"_blank\">A Behavioral Notion of Subtyping</a>, Barbara Liskov and Jeannette Wing start by defining a \"correct\" subtyping as follows:</p> <blockquote> <p>Subtype Requirement: Let ϕ(x) be a property",
            "title": "The Liskov Substitution Principle does more than you think"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>AI workflows are technically impressive, but there’s a deeper reason people are really amped about AI agents. This isn’t just new tech, it’s new psychology.<br /><br />Until now, very few people have known what it feels like to delegate to total competency.<br /><br />If you manage great people, or lead great teams, you know how it feels to put someone in charge who will get it done, get it done right, and get it done without drama. That kind of delegation — that depth of trust — is pure joy.<br /><br />Delegating to competency lets you forget about it completely. That’s real leverage.<br /><br />And now anyone can experience that. What was rare is now widely distributed. Everyone can feel it. And it feels fucking great. That’s a big reason why the excitement is real, and fully justified.<br /><br /></div><div>-Jason</div>\n</div>"
            ],
            "link": "https://world.hey.com/jason/the-joy-of-delegating-to-competence-55f50d4d",
            "publishedAt": "2026-01-06",
            "source": "Jason Fried",
            "summary": "<div class=\"trix-content\"> <div>AI workflows are technically impressive, but there’s a deeper reason people are really amped about AI agents. This isn’t just new tech, it’s new psychology.<br /><br />Until now, very few people have known what it feels like to delegate to total competency.<br /><br />If you manage great people, or lead great teams, you know how it feels to put someone in charge who will get it done, get it done right, and get it done without drama. That kind of delegation — that depth of trust — is pure joy.<br /><br />Delegating to competency lets you forget about it completely. That’s real leverage.<br /><br />And now anyone can experience that. What was rare is now widely distributed. Everyone can feel it. And it feels fucking great. That’s a big reason why the excitement is real, and fully justified.<br /><br /></div><div>-Jason</div> </div>",
            "title": "The joy of delegating to competence"
        },
        {
            "content": [
                "<p><em>[original post: <a href=\"https://www.astralcodexten.com/p/against-against-boomers\">Against Against Boomers</a>]</em></p><p>Before getting started:</p><p>First, I wish I&#8217;d been more careful to differentiate the following claims:</p><ol><li><p>Boomers had it much easier than later generations.</p></li><li><p>The political system unfairly prioritizes Boomers over other generations.</p></li><li><p>Boomers are uniquely bad on some axis like narcissism, selfishness, short-termism, or willingness to defect on the social contract.</p></li></ol><p>Anti-Boomerism conflates all three of these positions, and in arguing against it, I tried to argue against all three of these positions - I think with varying degrees of success. But these are separate claims that could stand or fall separately, and I think a true argument against anti-Boomerists would demand they declare explicitly which ones they support - rather than letting them switch among them as convenient - then arguing against whichever ones they say are key to their position.</p><p>Second, I wish I&#8217;d highlighted how much of this discussion centers around disagreements over which policies are natural/unmarked vs. unnatural/marked.</p><p>Nobody is passing laws that literally say &#8220;confiscate wealth from Generation A and give it to Generation B&#8221;. We&#8217;re mostly discussing tax policy, where Tax Policy 1 is more favorable to old people, and Tax Policy 2 is more favorable to young people. If you&#8217;re young, you might feel like Tax Policy 1 is a declaration of intergenerational warfare where the old are enriching themselves at young people&#8217;s expense. But if you&#8217;re old, you might feel like <em>reversing</em> Tax Policy 1 and switching to Tax Policy 2 would be intergenerational warfare confiscating your stuff. But in fact, they&#8217;re just two different tax policies and it&#8217;s not obvious which one a fair society with no &#8220;intergenerational warfare&#8221; would have, even assuming there was such a thing. We&#8217;ll see this most clearly in the section on housing, but I&#8217;ll try to highlight it whenever it comes up.</p><p>I&#8217;m in a fighty frame of mind here and probably defend the Boomers (and myself) in these responses more than I would in an ideal world.</p><p>Anyway, here are your comments.</p><p><strong>Table Of Contents:</strong></p><p><strong>1:</strong> Top comments I especially want to highlight<br /><strong>2:</strong> Comments about housing policy<br /><strong>3:</strong> ...about culture<br /><strong>4:</strong> ...about social security technicalities<br /><strong>5:</strong> What are we even doing here?<br /><strong>6:</strong> Other comments</p><p></p><h2>1: Top Comments I Especially Want To Highlight</h2><p>&#8230;</p><p><strong>Sokow <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189618111\">writes</a>:</strong></p><blockquote><p>[The anti-Boomer] take has been imported in part from the EU + the UK where the pension system is not the same. <a href=\"https://en.wikipedia.org/wiki/State_Pension_(United_Kingdom)#Pensions_Act_2007\">https://en.wikipedia.org/wiki/State_Pension_(United_Kingdom)#Pensions_Act_2007</a></p><p>There is a lot of similar things in France that I could dig up, such as all attempts to tax benefits being defeated.</p></blockquote><p>Many Europeans chimed in to say this, including people whose opinions I trust.</p><p>I find this pretty interesting. We all know stories of American opinions infecting Europeans, like how they&#8217;re obsessed about anti-black racism, but rarely worry about anti-Roma racism which is much more prevalent there. I&#8217;d never heard anyone argue the opposite - that the European discourse is infecting Americans with ideas that don&#8217;t apply to our context - but it makes sense that this should happen. I might write a post on this.</p><p><strong>Kevin Munger (</strong><a href=\"https://kevinmunger.substack.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">Never Met A Science</a><strong>) writes:</strong></p><blockquote><p>Hating Boomers (and talking about hating Boomers) is uninteresting and I agree morally dubious.</p><p>But it is *emphatically* false that &#8220;Boomers were a perfectly normal American generation&#8221;. They have served far more terms in Congress than any generation before or since (and we currently have the oldest average age of elected officials in a legislative body IN THE WORLD other than apparently Cambodia), they have dominated the presidency (look up the birthdate of every major party candidate since the 2000 presidential election...), they controlled the commanding heights of major companies, cultural institutions (especially academica).</p><p>They are a historically *unique* generation, for three intersecting reasons: 1. They are a uniquely large generation 2. they came of age as the country and its institutions were maturing 3. they are sticking around because of increased longevity. These are analytical facts, and they produce what I call &#8220;Boomer Ballast&#8221; -- a concentration of our societies resources in one, older generation that increases the tension we are experiencing from technological innovation. Our demography is pulling us towards the past, the internet is pulling us into the future, and this I think is the major source of the anti-Boomer frustration.</p><p>On the specifics of social security and why we might think Boomers have played things to their advantage (not bc they&#8217;re specifically evil but bc they have the political power to do so) -- the key thing is that they have prevented forward-thinking politicians from fixing the inevitable hole in social security that comes from our demographic pyramid. It would have been relatively painless to increase the rate or incidence of the social security payroll tax at any point in the past 25 years, the looming demographic cliff was obvious and the increased burden could&#8217;ve been shared more equally. Instead, they prevented reforms and all of the fiscal pain from demographic shifts will be borne by younger generations.</p></blockquote><p>I agree this is a strong argument, and part of why I think it&#8217;s helpful to separate the three points I mentioned at the beginning.</p><p><strong>RH <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/190374463\">writes</a>:</strong></p><blockquote><p>We [Boomers] <em>did</em> [vote for ourselves to pay higher taxes and get fewer benefits]. My lifetime SS benefits will be 20-25 percent less than they would have been under previous law, and I voted for that. My SS tax rate went up itself, and has been well over 15% since the changes took effect, and the cap on earned income subject to that went up a lot. And I voted to accept all that because it was projected to be sufficient.</p><p>Then the immigrant haters decided we needed fewer workers in the country, or at least fewer paying SS taxes, so they slowed legal immigration and pushed illegals into the underground economy, so they don&#8217;t pay taxes to support social security. And social security is going to get whacked again, plus the evils the SS system was intended to alleviate -- people too old to work and too poor to live -- will return.</p></blockquote><p>I think this says something profound about politics. The problem is less that there&#8217;s some group of people who don&#8217;t believe in fairness, but that fairness is very hard to calculate.</p><p>Suppose RH is right (I haven&#8217;t checked), and that Social Security would be sustainable with lots of immigration. Then whether Boomers are paying &#8220;their fair share&#8221; or not depends on whether immigration is good or bad (a hard question!), <em>and</em> on whether we think of high vs. low immigration as the natural unmarked state of the universe (such that immigration opponents must &#8220;own&#8221; closed borders and compensate the losers), <em>and</em> on what kind of compensation the losers from closed borders deserve.</p><p>Someone else commented by saying we could solve all of these problems without inconveniencing either the Boomers <em>or</em> the young by just increasing taxes on a few ultra-rich people. The ultra-rich could reasonably say they didn&#8217;t create this problem and it&#8217;s unfair to tax them for it. But so could the Boomers and the young! So whose &#8220;fair share&#8221; is it?</p><p></p><h2>2: Comments About Housing Policy</h2><p>&#8230;</p><p><strong>James (</strong><em><a href=\"https://enrichedjamsham.substack.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">Enriched Jam Sham</a></em><strong>) <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189618427\">writes</a>:</strong></p><blockquote><p>Probably most of this is true, but there is one point I would take issue with, concerning the idea of &#8220;sitting on assets not being used for market labor.&#8221; This kind of does seem like an issue, or something? And I agree one should not expropriate too many assets from boomers in order to impoverish them, or anything, but if there is a group of people with a large number of assets not being employed productively, there _is_ an issue there, right? (I think this belief is downstream of a lot of leftist anxiety about the superwealthy, though of course in general they are employing those assets productively). More of an issue if those with fewer assets are being taxed in order to provide &#8220;what is owed&#8221; in some abstract sense to those who are already not employing assets productively.</p><p>Were I old, I think it totally would be reasonable to say &#8220;You can live in a 5-bedroom house, but since you&#8217;re just a married couple these days, probably it&#8217;s better if you get by with a 3-bedroom, and probably it doesn&#8217;t need to be so central to the city, unless you can afford it. We are going to raise taxes higher.&#8221; And to means-test social security payments to some extent (phased in, over time)? Or is that going too far in my demagoguery?</p></blockquote><p>I answered that I agree there&#8217;s an argument for forced house downsizing. But I also think we&#8217;re the types of people who the Right calls rootless cosmopolitans, and that people with more attachments might not be so amenable.</p><p>My grandparents-in-law built significant parts of their house with their own hands, and lived in it for ~50 years. They planted saplings in the garden and lived to see them become trees. They know the neighbors and probably knew the neighbors&#8217; parents before them. Their daughter, my mother-in-law, lives a few blocks away. When I last visited, they could show me their son&#8217;s old bedroom, their daughter&#8217;s old bedroom, and the bedroom where their granddaughter (my wife) used to stay with them. Until recently, my grandfather-in-law was cognitively about 70% there, to the point where he could live on his own - but only through having a very predictable routine, knowing where everything was, and being in an ultra-friendly and familiar environment. Their area has now skyrocketed in cost. </p><p>I can see your side of the argument - but I also can&#8217;t blame them for being against some hypothetical policy that would force them to move to a strange apartment in the nearest affordable town 50 miles away far away from their only family/caretakers so that some striver DINK couple could turn their spare bedroom into a gym.</p><p><strong>James answered: </strong></p><blockquote><p>Sure, I mean it wouldn&#8217;t be some sort of forced movement, it&#8217;d be more like higher property taxes. If you can afford it then that&#8217;s fine, don&#8217;t think we should do some centralized planning boomer hatred. And it should hit everyone equally. It&#8217;s just about measuring productive use of houses. But it would end up falling hardest on boomers (fortunately or unfortunately, depending on one&#8217;s perspective).</p><p>But this is maybe more reasonable as a policy idea than &#8220;lynch the boomers&#8221; which is perhaps the bailey you&#8217;re arguing against. I don&#8217;t want to be the motte, just this is (I think?) an actually good policy.</p></blockquote><p>I responded that yeah, I understand it&#8217;s just higher property taxes, I&#8217;m saying there&#8217;s no way my retired and slightly-demented grandfather-in-law could afford normal property taxes on his house he bought in what was basically farmland in 1970 but which has now grown into a desirable California college town. He&#8217;s been coasting off whichever California proposition it was that says old people&#8217;s property taxes don&#8217;t go up while they own the home.</p><p>(although age has taken its toll and he now lives in a nursing home, so this is more of a hypothetical example drawing inspiration from a real situation)</p><p><strong>James answered:</strong></p><blockquote><p>I don't mean to sound heartless, but like, every policy has bad outcomes and good outcomes. Of course with housing policy the core issue is that bad outcomes for those already there are salient, and for those not already there they are much less so. I mean my grandparents have had similar issues, I agree there would be pain. It's just about finding the right balance on the margin. But individual stories shouldn't necessarily guide policy-making (I mean \"plural of anecdote\" etc etc, but you see what I mean?). I am sorry about your granddad in law though, dementia sucks.</p></blockquote><p>I said that I agree with this, and it still might be good on net, I just can&#8217;t bring myself to hate Boomers for opposing it.</p><p>I still think that instead of facing these tough tradeoffs, we should just build more housing, and that every person who we force to make these tradeoffs is in some sense a policy failure, even if we take the right side of them.</p><p>And I feel nervous because I&#8217;m neutralish on something where there&#8217;s basically a unanimous consensus of smart people (they all hate Prop 13), but to me it does seem to make sense that rising house values shouldn&#8217;t be able to make your current home unaffordable - both because as someone in a state where house values have pentupled in a generation this seems like a recipe for constant forced upheaval, stress, and destruction of families/community, and because it gives NIMBYs one more reason to oppose density (if someone upzones your area, that increases the value of your land, and therefore your property taxes, and might force you to leave your house - therefore, you should fight upzoning unless you want to be forced out).</p><p><strong>Chris <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189635436\">writes</a>:</strong></p><blockquote><p>A halfway house solution to this is to increase property taxes but make them payable on death/sale. It has less of an effect of actually forcing people out, so the allocation effect isn&#8217;t as strong, but it would encourage people to move at the margin. e.g. those who want to free up equity, without penalising the &#8220;asset rich, cash poor.&#8221; It&#8217;s just about the only wealth tax that works, and those gains are largely CGT exempt.</p><p>This is usually discussed in a UK context as we don&#8217;t have percentage property taxes, and this is a potential way of introducing them, given in some places nominal values have 10x&#8217;d.</p></blockquote><p>Huh, I hadn&#8217;t heard this before, and I like it!</p><p><strong>Mariana Trench <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189685776\">writes</a>:</strong></p><blockquote><p>I genuinely don&#8217;t want you to take this personally. When you or someone over on Slow Boring starts speculating about how I, a young boomer, should be forced out of my nice house that I bought with my own money, it truly makes me want to get a gun and shoot you. Scott, I&#8217;m not going to do that, so please don&#8217;t ban me. I&#8217;m explaining how murderously angry it makes me feel. So every other age group gets to have whatever goods and services are available at a market rate, but old people have to move to shitty apartments because we&#8217;re worth so much less than young people?</p><p>I will take every legal means at my disposal to prevent you from doing this. I will block you in the courts, I will vote for evil totalitarian bastards if they support my property rights, I will seriously do anything to keep you from patting me on the head and telling me to move on because I suddenly don&#8217;t have a right to my own house, because some younger person suddenly wants it.</p></blockquote><p>Several people made something like this argument, but I think it&#8217;s based on a (understandable) misunderstanding.</p><p>The policy that most people in James&#8217; camp are proposing is to repeal California Proposition 13 (or other jurisdictions&#8217; local variants) which lock property taxes to the value of a house when it was bought (rather than the value now). This benefits old people, who might have bought their houses 30 years ago when prices were much lower. Repealing it, and making everyone pay property taxes based on the current price of their house, would incentivize (in some cases, force) old people to move to cheaper houses.</p><p>If you treat the Proposition 13 regime as natural, then this is an attack on old people&#8217;s rights. But Proposition 13 was only passed in 1978, and plenty of states have no local equivalent. If you treat the pre-13 state of affairs as natural, then 13 is an attack on <em>young people&#8217;s </em>rights, and repealing it merely restores the proper fair state of the universe. This is another of those marked vs. unmarked things.</p><p>I agree that a lot of the talk around this sounds kind of ethnic-cleansing-adjacent, but nobody has the right to artificially-depressed property taxes.</p><p></p><h2>3: Comments About Culture</h2><p>&#8230;</p><p><strong>WoolyAI <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189631401\">writes</a>:</strong></p><blockquote><p>I think this oddly dodges the two big complaints about boomers.</p><p>One, not mine but it needs to be addressed, is housing. There&#8217;s no end of content online about boomers and housing, no need to reiterate, I&#8217;m just surprised not to see it referenced when it (to me) seems such a large part of the discourse.</p><p>The second is that the boomers engaged in a lot of...social transformations that were very good for them and had really bad effects on subsequent generations and the boomers refused any limiting factor.</p><p>The best example is probably dating and &#8220;sexual liberation&#8221;. The best of all dating worlds is to grow up in the 1950s, when everyone is strongly habituated to forming stable marriages, then be given the opportunity to defect out and have tons of &#8220;free love&#8221; in your 20s, then settle down in your late 20s into a stable relationship because, well, all your peers came from stable families with strong marriage norms and 3-7 years of &#8220;free love&#8221; isn&#8217;t going to overcome that cultural background. Once the next generation rolls around and gets raised in a &#8220;free love&#8221; culture, though, rather than the stable marriage norms of the 50s, marriage starts to break down. It doesn&#8217;t take much to notice how horrific modern dating is yet it&#8217;s worth noting that even by the 80s it was obvious that something was wrong; divorce was skyrocketing and Gen X got hit hard.</p></blockquote><p>This seems false to me. Divorce rates peaked in 1980. It wasn&#8217;t Generation X (people born in after 1970) who were getting divorced in 1980 - it was Boomers themselves.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!patk!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff057e747-401f-4f8f-93ae-249f2344d09d_800x600.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"US Marriage &amp; Divorce Rate\" class=\"sizing-normal\" height=\"463.5\" src=\"https://substackcdn.com/image/fetch/$s_!patk!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff057e747-401f-4f8f-93ae-249f2344d09d_800x600.png\" title=\"US Marriage &amp; Divorce Rate\" width=\"618\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>People tend to imagine the divorce trend as being about hedonist swingers trying lots of free love, but I think this is imaginary. My impression is that it&#8217;s more about moving from a regime of naively/romantically marrying your high school sweetheart, discovering later that he was emotionally unavailable and abusive and you hated him, but sticking around anyway &#8220;for the children&#8221; - to a new regime of unromantically optimizing for a compatible partner no matter how long it takes.</p><p>Boomers ended up right in the middle of the regime change - they married their high school sweethearts, then were told it was unacceptable to have an unhappy marriage - and so suffered very high divorce rates during the transition period. Everyone after them got the new regime from the beginning and never married their high school sweetheart in the first place (unless their high school sweetheart was unusually compatible with them).</p><p>I think that the people scorning the Boomers for their hedonistic free love ways wouldn&#8217;t like being married to an emotionally unavailable and abusive partner who they hated any more than the Boomers did. An alternative framing of this - not exactly correct, but I don&#8217;t think the anti-Boomer one is exactly correct either - is that we should be grateful to the Boomers for ripping off the Band-Aid in their generation and suffering the negative consequences, rather than kicking the can down the road and leaving us to be the ones who got the explosion of divorce.</p><p>In practice I doubt they had a choice either way - I think it was an artifact of changing economic conditions, especially women joining the workforce and getting more independence.</p><p><strong>Hal Johnson (</strong><em><a href=\"https://haljohnsonbooks.substack.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">Hal Johnson Books</a></em><strong>) <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189638500\">writes</a>:</strong></p><blockquote><p>It&#8217;s probably a bad idea to hate a whole generation, but I will say a couple of things against Boomers.</p><p>I once wrote a piece on Stand by Me pointing out that the movie is about a Boomer who went on a grand adventure and yet won&#8217;t let his own kid bike to the pool. Anyone growing up under a Boomer hegemony had to have been aware of this, the feeling that Boomers were pulling doors shut behind them and then celebrating the beforetimes, when the doors were open. &#8220;When I did drugs it was so cool, but you better not do drugs.&#8221; &#8220;I hitchhiked across America to see the country, but hitchhiking is bad and fortunately illegal now.&#8221; If you went to school at a certain time, or worked at a certain time, you were guaranteed to encounter a teacher or coworker who claimed to have been at Woodstock (ha!) and who expressed contempt at you, the young, for not having been at Woodstock. It was weird and also really grating!</p><p>Boomers suffered a tendency to self-mythologize, and it never ends! Remember that Boomer-centered bank ad from a few years ago: &#8220;A generation as unique as this deserves a bank etc.&#8221;? Boomers were the first generation to have and be an identity (broadly across the whole US at least). This isn&#8217;t even their fault, as the identity was invented by marketers to sell pop records, but Boomers fell in love with the idea.</p><p>It&#8217;s hard to hate the Greatest Generation, not because they were great (whatever) but because someone outside their generation declared them to be the Greatest. When Leonard Steinhorn wrote The GREATER Generation about how amazing Boomers were, he did it because he, a Boomer, wanted more credit. Look at me! Look at me! There have been so many years of Look at me!</p><p>I like to watch old sitcoms from the &#8216;80s, and it is hilarious how much Boomer indulgence goes on. Murphy Brown reminiscing about her time in &#8220;The Revolution.&#8221; Howard Hesseman on Head of the Class kicking Dan Schneider out fo class for making irreverent jokes about the &#8217;60s. Kate from Kate and Allie forbidding her daughter from dating a boy who didn&#8217;t support &#8217;60s peace protesters. Just watch the opening credits of Family Ties&#8212;it&#8217;s like a nightmare!</p><p>But I bet it was fun to be a Boomer.</p></blockquote><p><strong>Vijla Kainu <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189721134\">writes</a>:</strong></p><blockquote><p>You forgot to mention another transformation that hurt people who weren&#8217;t able to plan for it nor did they have time to pivot: the boomers shipped their parents off to old people&#8217;s homes and defected from the compact where your parents take care of you when you&#8217;re young and you do the same when they get old and frail. Boomer homes didn&#8217;t have olds hanging about. No time for wiping old people&#8217;s butts, there are films to see on the telly! My grandparents didn&#8217;t know this was coming and didn&#8217;t have any idea they&#8217;d need to save the money to pay strangers to do what family members had done for every single generation up to the boomers.</p></blockquote><p>I don&#8217;t know much about this part of history, so I&#8217;ll assume this is true.</p><p>So . . . since you&#8217;re so against this, you&#8217;re going to reverse it by taking great care of your own elderly parents, in your house, attending to their every need, right? </p><p>I think most people will wave this off with a &#8220;well, since the Boomers destroyed the social contract, now <em>I&#8217;m</em> no longer bound by it and this is totally fine, but it was still totally unjustifiable when <em>they</em> did it!&#8221;</p><p>This is a general worry I have with anti-Boomerism - in many cases, hating the Boomers for doing something is an excuse to do the same thing yourself, because you&#8217;re just &#8220;trapped in the equilibrium the Boomers created&#8221; or whatever. I think the real story is that the Boomers did the thing for the same reason you did. </p><p>In this case, that real story is about increasing longevity. It&#8217;s fine to care for a 70 year old in your house for a few years until they get felled by the flu, and harder to care for a 95 year old for 30 years until the Alzheimers finally gets them.</p><p><strong>Leah Libresco Sargent (</strong><em><a href=\"https://www.otherfeminisms.com/?utm_content=comment_metadata&amp;utm_source=substack-feed-item\">Other Feminisms</a></em><strong>) <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189773966\">writes</a>:</strong></p><blockquote><p>I think this Against Against Boomers leaves out a common line of complaint: that boomers benefited from traditions they received and chose not to hand on. I&#8217;ve got a bit from Michael Brendan Doughterty&#8217;s My Father Left Me Ireland in my review: <a href=\"https://www.the-american-interest.com/2019/05/16/your-roots-shall-make-ye-free/\">https://www.the-american-interest.com/2019/05/16/your-roots-shall-make-ye-free/</a></p><p>&#8220;Dougherty writes, &#8220;The adult world that I encountered was plainly terrified of having authority over children and tried to exercise as little of it as practicable. [&#8230;] The constant message of authority figures was that I should be true to myself. I should do what I loved, and I could love whatever I liked. I was the authority.&#8221;</p><p>He could write to his father, he could order Gaelic books, but there was no clear way to regain what had been given up by the generations that came before.&#8221;</p><p>This is also, in miniature, Patrick Deneen&#8217;s contention in Why Liberalism Failed: that, gradually, people dismantled the traditions they themselves had benefited from, because they saw them as cruft, not realizing they were load bearing.</p></blockquote><p>Leah gets a pass on this one, because she&#8217;s one of the tiny handful of people pumping against entropy and trying to rebuild old traditions. </p><p>For everyone else, I make the same accusation as above. <em>The Boomers</em> didn&#8217;t raise their children properly because they were evil people who hated the social fabric. <em>I </em>raise my children via a collection of nannies, daycares, and smartphone apps because the economy&#8217;s so tough these days that it&#8217;s unfair to ask me to do otherwise, plus everyone knows childcare is exploitative uncompensated emotional labor, plus the government should tax the ultra-rich to pay me a childcare allowance, and anyhow it&#8217;s the Boomers&#8217; fault for reminding me that I had the option!</p><p><strong>uugr <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189623570\">writes</a>:</strong></p><blockquote><p>It seems like you&#8217;re proposing the blame that&#8217;s currently directed at boomers is (in part?) the fault of population collapse. It&#8217;s not that the boomers are stealing on the wealth; they just have all the power because they&#8217;re so populous.</p><p>Could it be that this is a legitimate sort of boomer-hate, though? Not that they didn&#8217;t leave enough to their kids, but that they didn&#8217;t leave *enough kids* to leave things to? I&#8217;m not sure how one would check the age distribution for this; maybe Kids These Days should be blaming Gen X for that instead. But the older generations would take some responsibility for the shape of the age distribution.</p></blockquote><p>This is an interesting synthesis: most of people&#8217;s problems with &#8220;the Boomers&#8221; are really problems with an inverted demographic pyramid. Since the old outnumber the young, they have &#8220;too much&#8221; wealth, jobs, etc compared to people&#8217;s natural expectation, and previously-solvent benefits programs are falling apart.</p><p>Is this right? I actually wasn&#8217;t sure where our population pyramid was - I thought maybe the recent wave of immigrants would have righted it - but no, it looks like it&#8217;s <a href=\"https://www.huffpost.com/entry/americas-looming-demograp_b_3422807\">getting increasingly top-heavy</a>:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://www.huffpost.com/entry/americas-looming-demograp_b_3422807\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"2013-06-11-americadependencyratios.jpg\" class=\"sizing-normal\" height=\"423.75\" src=\"https://substackcdn.com/image/fetch/$s_!rx0B!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F63db7a12-a386-4751-96d0-e234fa03327e_960x720.jpeg\" title=\"2013-06-11-americadependencyratios.jpg\" width=\"565\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>I don&#8217;t think it&#8217;s especially worth &#8220;blaming&#8221; the Boomers for this. If you look at the secular trend . . . </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!3t5G!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffb7c33e2-2a8f-43f8-8aba-60f5b8f20159_799x638.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"439.17396745932416\" src=\"https://substackcdn.com/image/fetch/$s_!3t5G!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffb7c33e2-2a8f-43f8-8aba-60f5b8f20159_799x638.png\" width=\"550\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>&#8230;it long predates them, and they&#8217;re just reverting to the pre-Baby-Boom mean.</p><p>It&#8217;s pretty funny that a gigantic boom in robots is about to save us from this right when it starts becoming a noticeable problem.</p><p></p><h2>4: Comments About Social Security Technicalities</h2><p>&#8230;</p><p><strong>Matthew <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189648745\">writes</a>:</strong></p><blockquote><p><em>&gt; even when their benefits per capita per year are stable or declining</em></p><p>It looks very different if you look at it by the household level instead of individual</p><p>A meaningful share of the increase in total costs comes from composition.</p><p>As women shifted from spouse-only benefits to worker or dual entitlement, more households now receive two lifetime worker benefits rather than one worker plus a spousal benefit. Average household payouts rise as a result.</p><p>This creates bifurcated outcomes. Households with two lifetime earners receive higher total payments, while single earner and spousal benefit households account for a smaller share of distributions (and directly effected by cuts). Individual averages are skewed by survivorship and changing household structure.</p><p>The result is a shift in where Social Security dollars go. A larger share of total payouts now flows to higher lifetime earnings households, which also tend to have lower fertility on average, affecting the system wide distribution of a fixed payroll tax base.</p><p>Basically the ratio of working to pay not for your own parents but someone else&#8217;s parents who are quite possibly richer than your own has gone up quite a bit.</p></blockquote><p><strong>Tunnelguy <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189664838\">writes</a>:</strong></p><blockquote><p>Section III missed that the 2025 tax bill literally has a tax deduction for seniors <a href=\"https://en.wikipedia.org/wiki/One_Big_Beautiful_Bill_Act#Tax_credit_for_seniors\">https://en.wikipedia.org/wiki/One_Big_Beautiful_Bill_Act#Tax_credit_for_seniors</a> (often called &#8220;No Tax on Social Security&#8221;, but that&#8217;s not exactly accurate). Agree with the conclusion overall though</p></blockquote><p><strong>Andy G <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189644723\">writes</a>:</strong></p><blockquote><p>&#8220;Why do so many believe that old people have discovered a vote-themselves-infinite-benefits hack?&#8221;</p><p>I&#8217;m a tail-end Boomer myself, and I mostly agree with your overall take.</p><p>But the above quoted concern is actually valid when it comes to the old-age entitlements.</p><p>Congress changed SS in the 1970s to have ever-increasing benefits (going up with average wage growth, not merely with CPI) where they don&#8217;t have to vote each year on the benefits.</p><p>Medicare was never self-funding.</p><p>As the number of retirees has grown and there are ever fewer number of workers to pay into the Ponzi-like scheme that is SS, people correctly fear that the Boomers will get all of theirs, but then the Ponzi-scheme will likely end (Medicare is actually in far worse shape than SS (which could still be saved by eliminating that increase by average wage growth provision - would address 80% of the problem).</p></blockquote><p>This is a good point, but it also frames the problem a little <em>too</em> lucidly for its own good.</p><p>The problem with the Boomers is that they selfishly refuse to collapse the Social Security Ponzi scheme on themselves, because they selfishly feel like just because they paid into it, they should get benefits.</p><p>Why is it bad that the Boomers won&#8217;t collapse the Ponzi? Because then we, the Millennials and Zoomers, will soon be in the unfair position of having paid into it, but not receiving benefits!</p><p></p><h2>5: What Are We Even Doing Here?</h2><p>&#8230;</p><p><strong>Darwin <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189657013\">writes</a>:</strong></p><blockquote><p>Looking at some &#8216;wealth by generation over time&#8217; graphs, I have an intuition that there&#8217;s a stable and repeating pattern in the US of the elderly accumulating all the wealth and power while the young are struggling and disenfranchised. And that this creates a legitimate and perpetual intergenerational conflict where the old people really are hurting the young by keeping wealth away from them and passing policies that benefit themselves and their preferences. Plus probably the gerontocracy genuinely slows down progress and improvement by resisting new ideas and paradigm shifts for as long as physically possible.</p><p>(and yes, I&#8217;m saying this <em>despite</em> material conditions improving over time in general - this is a separate point about relative positions and interests at a given timepoint)</p><p>Assume that pattern is true, you <em>could</em> look at each generation noticing this dynamic with their parents/grandparents generation, blaming that older generation as particularly bad, and failing to notice and address the repeating pattern and the structural factors that cause it, and say they are being foolish and unfair and mistaken.</p><p>And you wouldn&#8217;t exactly be <em>wrong</em>, but, I still have two basic objections to this take.</p><p>The first is that it seems to hold people to a very high standard. At a societal level, I&#8217;m glad they even noticed the conflict and tried to take coordinated action to address it at all, a lot of problems never make it that far. And expecting people with no background in history to notice historical trends extending into times they weren&#8217;t alive for, especially ones going back before modern digital record-keeping that they can easily Google, is a lot to ask.</p><p>The second is that... well, imagine there&#8217;s a slave on a southern plantation being whipped. Yes, in a certain sense, the master holding the whip is not unusual from any other master holding any other whip on any other plantation, and the system of slavery implemented across all of those plantations is not unusual from many other systems of slavery that have existed across human history.</p><p>In a sense, yes, the slave&#8217;s <em>real</em> problem is with the institution of slavery itself, or the facets of human nature and economics that make it a recurring pattern across human societies. That&#8217;s the <em>real</em> villain, here.</p><p>But I don&#8217;t think he&#8217;s <em>wrong</em> to also hate, or to blame, the individual person holding the whip.</p><p>Even if the societal pattern is the overarching problem here, even if the master in questions wouldn&#8217;t even be holding a whip if they were born into a different system with different institutions and different incentives... I still think it&#8217;s right to hate and attack that person.</p></blockquote><p>I find this a useful framing too. Don&#8217;t hate the player, hate the game - but if the game is bad enough, hating the player is a natural human response.</p><p>This does, however, remind me of the following story, which I recently encountered on Twitter (h/t <a href=\"https://x.com/docneto/status/2004915274521460753\">@docneto</a>) and can&#8217;t stop thinking about:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!c1LL!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc97d4cf8-3828-45dd-943d-8c969c535d87_680x503.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Image\" class=\"sizing-normal\" height=\"443.8235294117647\" src=\"https://substackcdn.com/image/fetch/$s_!c1LL!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc97d4cf8-3828-45dd-943d-8c969c535d87_680x503.png\" title=\"Image\" width=\"600\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>Does Little Ephraim Robin John have the right to hate the hand that holds the whip? If he doesn&#8217;t, where&#8217;s the boundary between literally being him, vs. being the sort of person who would have been him if raised in his exact socioeconomic conditions (probably lots of people)?</p><p><strong>habu71 <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/191887619\">writes</a>:</strong></p><blockquote><p>I don&#8217;t think you get to hold the boomers blameless for shutting down nuclear simply because today their opinions have shifted and are more pro nuclear than they used to be.</p><p>It was their youthful indiscretion that resulted in the NRC being created and soon after turning into the terrible horrible no good destroyer of all things nuclear.</p></blockquote><p>Yeah, this gets into tough questions around blame and the three different things I asked people to disambiguate at the beginning of the post.</p><p>It also runs into the same question that darwin asked above: suppose that in 1970, every generation living at the time thought nuclear was bad. And today, every generation living now thinks nuclear is good. On some level, this isn&#8217;t the fault of any particular generation - it seems like the information environment in 1970s just wasn&#8217;t conductive to figuring this out (although of course you can question who created that information environment). Unless you&#8217;re a very special person, if you lived in 1970 then you would have been anti-nuclear too. So can we blame the real 1970ites for their anti-nuclear opinions? I guess in the same sense that we can blame slaveowners, but that&#8217;s not an answer.</p><p><strong>Richard Hanania <a href=\"https://substack.com/@richardhanania/note/c-189673029\">writes</a>:</strong></p><blockquote><p>There&#8217;s a lot to quibble with in this piece, but on this part I&#8217;ll repost here what I recently told Scott via email:</p><p>Is anti-old a particularly terrible form of prejudice? Here&#8217;s where I disagree the most. How many genocides and mass killings in history have been penetrated based on age? People seem much more willing to commit atrocities in the name of oppressing a rival class, religion, or race. Oppression based on sex has been almost ubiquitous. But being anti-old people goes against the grain of human nature. That&#8217;s a feature, not a bug. We all have old relatives, and we&#8217;ll all be old. You seem to worry that this will lead to self-loathing and negative stereotypes that we&#8217;ll all suffer from in the future. But I&#8217;m concerned more about the immediate problems of housing prices, the coming entitlements crisis, and finding an alternative to right- and left-wing forms of populism, which have the wind at their backs. Criticisms based on age never causes as much psychic damage to people as those based on race, sex, and sexual orientation.</p><p>The Boomers themselves I think showed how relatively benign prejudice against the old is. in the 1960s and 1970s, they talked about being oppressed by older generations. It never led to mass killings, or systematic discrimination or anything like that. In fact, the old continued to acquire more money and resources and the welfare state has been expanding with more and more money going to them. My hope is that ageism can be strong and compelling enough to motivate some budgetary and housing reforms, while being too weak to lead to the downsides we see in other forms of identity politics.</p></blockquote><p>I think (based on other things, including Hanania&#8217;s email) that he is interested in anti-old-ism as a useful political project that can potentially build a coalition to achieve the things he really wants, like economic dynamism. If he could get those things more easily by making people hate the young, he would recommend hating the young.</p><p>I can only plead that I&#8217;m still <a href=\"https://www.astralcodexten.com/p/less-utilitarian-than-thou\">Less Utilitarian Than Thou</a>. My post was meant to argue that Boomers don&#8217;t deserve hatred. If your objection is that they may not <em>deserve</em> hatred, but that hating them will have good consequences, and so you recommend it anyway - then this seems like the sort of thing that often goes badly, even if you can&#8217;t predict exactly how.</p><p>Hanania argues that nobody will genocide the old, and I agree. But it brings to mind some of the arguments around the beginning of wokeness, where people justified anti-white rhetoric by saying it was basically harmless - <em>obviously</em> in a 65% white country where white people hold most positions of power, nobody will genocide the whites. This was true as far as it goes, but making anti-whiteness a state ideology for ten years sure did manage to have lots of hard-to-predict bad consequences (and I count the backlash against it as a consequence). </p><p>In any case, I&#8217;m not using this blog to design a propaganda project or build a coalition. I just like saying things that I think are true.</p><p></p><h2>6: Other Comments</h2><p>&#8230;</p><p><strong>Joe and Seth <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189617100\">write</a>:</strong></p><blockquote><p>It&#8217;s... simplistic, to say this is about hate. It&#8217;s a shifting equilibrium, and while the greatest/boomers built most of what we would call the modern world, it is not difficult to recognize that they&#8217;re operating on shorter time frames than most of the rest of us have to, and this drives some of their politics as a bloc.</p><p>I see this as the same argument against (overwhelmingly the low-skilled segment of) immigration: WEIRD societies tend to be cooperative and trusting and think in longer time frames. This is a fragile equilibrium and is threatened by a demographic shift towards those who are more opportunistic and think in short time frames. Look at trust studies across countries. Yes, there&#8217;s significant impact based on the government and support structures in place, but there&#8217;s population-level effects too. Age is just a very obvious indicator of the same kinds of prioritization.</p></blockquote><p>I&#8217;ll reiterate the point I made in <a href=\"https://www.astralcodexten.com/p/why-i-am-not-a-conflict-theorist\">Why I Am Not A Conflict Theorist</a> - although it makes intuitive sense that Boomers, being older, would be more short-termist, these kinds of intuitive stories about how people vote in their self-interest are false.</p><p>Federal deficit spending is the clearest possible example of trading off long-term prosperity for short-term gain, but <a href=\"https://jscholarship.library.jhu.edu/server/api/core/bitstreams/e9cb5948-d8db-4a41-a2fe-8b6740dedc59/content\">the young are more likely to support it than the old</a>. Climate change is another place where people are being asked to sacrifice now to prevent future disaster, and <a href=\"https://climatecommunication.yale.edu/publications/do-younger-generations-care-more-about-global-warming/\">the generation gap is miniscule</a>.</p><p>I don&#8217;t blame people for not knowing this, because most polls try really hard to show the opposite - for example, the first thing you&#8217;ll find if you look up opinions on deficit spending separated by generation is questions about &#8220;should we decrease deficit spending, which will probably involve cutting entitlements to the old?&#8221;, and naturally old people are more likely to be against this framing. But you can prove anything by changing poll framing: if you asked &#8220;should we decrease deficit spending, which will probably also involve cutting entitlements to the young?&#8221;, probably young people would be more against it. When you don&#8217;t hold the respondent&#8217;s hand and guide them to the answer you want, the young are more pro-deficit-spending.</p><p>I think there&#8217;s an effect where media wants to tell an exciting story about selfishness and conflict, so they really play up the stories where polls suggest groups are acting in their own selfish interest. But when you try to cut through this, the effect is miniscule, and swamped by whether the group is more Democrat or Republican. Until recently, old people have been more Republican, so they were more likely to want to cut the deficit.</p><p><strong>Daniel Kang <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189627405\">writes</a>:</strong></p><blockquote><p>I have no thoughts on Boomers in general, but the Schrodinger&#8217;s Immigrant / Schrodinger&#8217;s Boomer fall flat to me. A steelman of this argument is:</p><p>- There are many immigrants. Some of them are on welfare and others of them are taking jobs</p><p>- There are many Boomers. Some Boomers pushed too hard to neoliberalism in some aspects of the economy and others focused on over-regulating the environment in other parts of the economy</p><p>I also have no particular thoughts on whether or not this argument is correct, but I think it would be better to present actual steelman arguments.</p></blockquote><p>I responded by saying that when you levy an accusation against a group, you&#8217;re arguing not just that <a href=\"https://slatestarcodex.com/2015/09/16/cardiologists-and-chinese-robbers/\">some members of the group do X</a>, but that the group has a <em>disproportionate</em> tendency toward X. Daniel and other commenters were not satisfied, and you can read the full discussion <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189634214\">here</a>.</p><p><strong>Ben Smith <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189622080\">writes</a>:</strong></p><blockquote><p>Not to be a punisher reader but this article treats the 1946 generation as if they&#8217;re representative of the boomers. In reality boomers are 1946-1964. Only the very oldest of them were sent to Vietnam <em>or</em> were responsible for Woodstock etc. Boomers should be weighed and measured by the youth culture of the late sixties to mid 80s (less so). So Woodstock is fairly theirs, but so is the inward individualist turn on the 1970s.</p></blockquote><p>I appreciate this clarification.</p><p><strong>Kamateur <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189677064\">writes</a>:</strong></p><blockquote><p>This is also a vibes thing. It&#8217;s certainly turned malignant, but most of the millennial contempt I see for boomers at least started out as simple frustration over boomers not recognizing that they had lived in a period where it was relatively easy to accumulate wealth in the form of property and pensions and stable jobs. Essentially its a form of envy, and envy is always the worst when the people you envy act like everything they've achieved is the result of a normal process, as opposed to a confluence of timing and opportunity. The stereotypical boomer, under this model, is your parent who tells you they don't understand why you are still living in a crummy little apartment, not realizing that a mortgage where you live costs four times what you pay in rent.</p></blockquote><p>I kind of want to disagree with this by reiterating the graph showing that Millennials are richer than Boomers (at the same age), but I&#8217;m not sure that works. My memories of these sorts of conversations are that even when I&#8217;m doing well relative to older people, their advice still grates. Like, yes, I eventually got a great job and am very happy, but no, it was not correct to ask why I didn&#8217;t have a job yet at time X, or to ask why I hadn&#8217;t solved this problem yet by walking into an office in a nice suit, giving someone a firm handshake, and depositing my resume on their desk.</p><p><strong>Mackenzie <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189650581\">writes</a>:</strong></p><blockquote><p>There is one aspect of the Boomer generation vis-&#224;-vis institutional power that I don&#8217;t see touched upon is this essay that I see as another force driving anit-Boomer sentiment. It&#8217;s that Boomers as a cohort have remained in leadership roles for an exceptionally long time in Congress, as executives, etc whereas other generations were faster to transition leadership to others.</p><p>This Boomers vs Millennials framing is explained very well in this email exchange between Peter Thiel and Mark Zuckerberg, I recommend the whole email exchange but I&#8217;ll heavily quote <a href=\"https://www.techemails.com/p/mark-zuckerberg-peter-thiel-millennials\">this reply from Thiel</a>.</p><p><em>&#187; &#8220;What I would add to Mark&#8217;s summary is that, in a healthier society, the handover from the Boomers to the younger generations should have started some time ago (maybe as early as the 1990s for Gen X), and that for a whole variety of reasons, this generational transition has been delayed as the Boomers have maintained an iron grip on many US institutions. When the handover finally happens in the 2020s, it will therefore happen more suddenly and perhaps more dramatically than people expect or than such generational transitions have happened in the past. And that&#8217;s why it&#8217;s especially important for us to think about these issues and try and get ahead of them.</em></p><p><em>One example of such an &#8220;iron grip&#8221; from my colleague Eric Weinstein: Of the 67 top research universities in the US, 62 have Baby Boomer presidents (three are Silent Generation and only two are Generation X). Today, the median age of these 67 university presidents is 65 years-old... And this is very different from the recent past. Only thirty years ago, in 1990, the median age of these same university presidents was a much lower 52-years old; the older generation did not completely refuse to give up power; and therefore much greater generational diversity was to be found in university leadership.&#8221;</em></p><p>Given historical trends you would expect to see much more Gen X leaders in Congress, as presidents, or even as business owners than you do today.</p></blockquote><p>So do we want affirmative action for the young? Why is this better than other forms of affirmative action?</p><p>It doesn&#8217;t seem like a mystery why institutions would hire older leaders: they have more experience. Probably in the past this was kept in check by the tendency of old people to die (or forcibly retire due to poor health) at a young age, plus a shortage of old people since each generation was larger than the last.</p><p>People have this sense that Boomers are being evil and selfish by not retiring so that young people can get more of the good jobs. Why is this a more natural way to think of things than white people being evil and selfish by not voluntarily underemploying themselves so black people can get more of the good jobs?</p><p>Much of anti-Boomerism seems to be about how Boomers are selfish because they&#8217;re taking up resources, and those resources could go to young people instead. But every group is taking up resources that could go to other groups! This only justifies anti-Boomerism if you start with the assumption that old people are less worthy of having good things than young people, and so if you can&#8217;t redistribute old people&#8217;s resources to young people, then this is <em>prima facie</em> unfair.</p><p>I think there are some weak arguments for why it&#8217;s better for young people to have resources than old people, but these don&#8217;t seem strong enough to justify the level of Boomer hatred, and I&#8217;d like to see people make them explicit.</p><p><strong>Charles UF <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189706615\">writes</a>:</strong></p><blockquote><p>This is weapons grade overthinking, and a byproduct of the constant demands for evidence and sources that are a strong norm in certain discussion circles. For better insight, read the twitter link from the OP again: <a href=\"https://x.com/search?q=%22you%20don%27t%20hate%20boomers%20enough%22&amp;src=typed_query\">https://x.com/search?q=%22you%20don%27t%20hate%20boomers%20enough%22&amp;src=typed_query</a></p><p>I didn&#8217;t scroll for hours on this link, but I didn&#8217;t see any charts or stats like this post focuses on, and only a few references to economics. What I did see was a tremendous amount of Boomer&#8217;s own words and behaviors, often directly from the person themselves as a tweet, email, or text. These posts, I think speak for themselves and conform to the personal experiences a lot of people have had with their own boomer parents.</p><p>Even if they can be statistically proven to be no different than any subsequent generation from a metrics point of view, that doesn&#8217;t mean they aren&#8217;t assholes. I apologize for the profanity but it&#8217;s the most succinct term I think.</p><p>I&#8217;m GenX, born in the 70s. My parents were boomers; their parents, my grandparents, were the greatest generation. We in GenX and some of the oldest Millennials had a front row seat for the generational transition from the Greatest to the Boomers. I think a lot of the hatred stems from our experiences during this time, and I honestly think many of the boomers deserve worse.</p><p>My greatest grandparents loved their children and went out of their way to help them as adults any way they could: money, childcare, advice, a place to land when you lost your job. I knew that I could go to my grandparents&#8217; house at any time, **which I could walk to**, and I&#8217;d be welcomed with love. And fed. They didn&#8217;t move away even though they could afford it; their families were too important. They lived for their grandkids. They really were a great generation.</p><p>Now, it&#8217;s the boomer&#8217;s turn to the grandparents. Cool, they had some great role models. How did that turn out? For the most part they not only do they never help their kids as adults, but they also blame them for everything that has turned out less than ideal in their lives. They don&#8217;t offer loving or even useful guidance, they are supremely disinterested in their grandchildren beyond new photos every year for their condo in Florida. Did I mention they moved away as fast as they could and absolutely will not return to where they left their kids (who can&#8217;t afford to leave) and grandkids, nor are their families welcome to visit them at their home, which is &#8220;too nice&#8221; for little kids to ever enter. They&#8217;re nasty, anti-social parasites. If it is in fact the case that they haven&#8217;t hoarded most of our culture&#8217;s wealth, it&#8217;s not from lack of motivation to do so.</p><p>This is not a universal description obviously, but it&#8217;s very close to the experience of a large fraction of the children and grandchildren of boomers. It&#8217;s not about charts and graphs and economics or even demography.</p><p>They&#8217;re assholes. And we knew, and deeply loved, their parents. We were there, and we saw it happen.</p></blockquote><p>This hasn&#8217;t been my experience; I&#8217;m curious whether it&#8217;s Charles or I who is the atypical one. I don&#8217;t know how you&#8217;d even start investigating this though.</p><p><strong>Chance Johnson <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/189798983\">writes</a>:</strong></p><blockquote><p>Any discussion of Boomers will inevitably devolve into a debate about NIMBYism, the Great American Rent Crisis, etc. Indulge me while I bite that bullet through a detour into the Horn of Africa.</p><p>Ethiopia was an economic basket case in the early 80s. Thanks to warfare, their economy is again doing poorly. But in between, they had a miraculous recovery. I read that the catalyst for their resurgence was radical land distribution quickly followed by the return of a capitalist government. A government that enforced free markets and relatively strong rule of law, but refused to undo the redistribution of their Marxist forebears.</p><p>This combination of redistribution plus free markets was an accident of history, of course. No Marxist ideologue would admit that a one-time redistribution was the only necessary Marxist policy. Nor would a capitalist ideologue initiate even a one-time redistribution, or admit that the benefits of such a program would outweigh its moral hazards.</p><p>So recreating the Ethiopian miracle would be a tall order. But dammit, I wish we could try it here. I really believe that if everyone had an affordable place to live where they didn&#8217;t have to worry about getting evicted for purely financial reasons, this security would enable them to be more effective in our capitalist system. Didn&#8217;t we do something like this more than once in American history, when the Feds issued sweeping amnesties for squatters on public land?</p><p>The key concept here is &#8220;security of tenure,&#8221; or the stability of knowing you will be able keep the roof over your head, come what may. Even if you lose your job with negligible savings, and it takes you a 6-12 months to get back on track. This security is oblique to the question of ownership vs. renting, and it deserves much more consideration.</p></blockquote><p>I realize this is almost totally unrelated to Boomers, but I&#8217;m signal-boosting it anyway to make sure Richard Hanania sees it, since it supports my side of an email argument we had a few weeks ago.</p><p><strong>specifics <a href=\"https://www.astralcodexten.com/p/against-against-boomers/comment/190584099\">writes</a>:</strong></p><blockquote><p>But didn&#8217;t the Boomers themselves arguably invent this strain of intergenerational warfare? &#8220;Don&#8217;t trust anyone over 30,&#8221; etc. You could argue that this is just deserts: They created the midcentury cultural conditions in which youth is worshipped, old age and authority are held in contempt, politics are governed by resentment, and money ultimately matters above all else.</p><p>I do not see it that way myself. I think every generation is the victim of their progenitors and the perpetrator of crimes upon their descendants, and the Boomers clearly inherited a fallen world themselves.</p></blockquote><p>I&#8217;m not sure who invented it. I just think this seems like a good time to stop.</p><p></p><h2>7: Updates / Conclusions</h2><p>The most important thing I got from these interactions was learning about the proposal to keep property taxes high, but delay them until death/sale of property. This relieves some of my tension around Prop 13 and related issues.</p><p>But Darwin&#8217;s comment, and a few others along the same lines, also made me worry that I&#8217;m trying to exonerate Boomers through some manuever like &#8220;Well, their actions were just the inevitable product of the social/cultural/economic stresses they were under&#8221;. Even if this is true, it&#8217;s probably true of everyone, including slaveowners and Nazis. It doesn&#8217;t seem entirely correct either to blame them <em>or</em> to not blame them under these circumstances, but I should probably think more about whether I&#8217;m exonerating Boomers harder than I would exonerate other groups with this same excuse.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/highlights-from-the-comments-on-boomers",
            "publishedAt": "2026-01-06",
            "source": "SlateStarCodex",
            "summary": "<p><em>[original post: <a href=\"https://www.astralcodexten.com/p/against-against-boomers\">Against Against Boomers</a>]</em></p><p>Before getting started:</p><p>First, I wish I&#8217;d been more careful to differentiate the following claims:</p><ol><li><p>Boomers had it much easier than later generations.</p></li><li><p>The political system unfairly prioritizes Boomers over other generations.</p></li><li><p>Boomers are uniquely bad on some axis like narcissism, selfishness, short-termism, or willingness to defect on the social contract.</p></li></ol><p>Anti-Boomerism conflates all three of these positions, and in arguing against it, I tried to argue against all three of these positions - I think with varying degrees of success. But these are separate claims that could stand or fall separately, and I think a true argument against anti-Boomerists would demand they declare explicitly which ones they support - rather than letting them switch among them as convenient - then arguing against whichever ones they say are key to their position.</p><p>Second, I wish I&#8217;d highlighted how much of this discussion centers around disagreements over which policies are natural/unmarked vs. unnatural/marked.</p><p>Nobody is passing laws that literally say &#8220;confiscate wealth from Generation A and give it to Generation B&#8221;. We&#8217;re mostly discussing tax policy, where Tax Policy 1 is more favorable to old people, and Tax Policy 2 is more favorable to young people. If you&#8217;re young, you might feel like",
            "title": "Highlights From The Comments On Boomers"
        },
        {
            "content": [
                "<p>The central message of the fertility roundups has always been that we have a choice.</p>\n<p>If we do want to raise fertility, we can do that. People respond to incentives. That means money, especially if paid up front, and it also means time, lifestyle and respect.</p>\n<p>If we do it purely with cash, it would be expensive, but a well-designed version of this would still be net profitable to the state. On the order of $300k per additional live birth would get this done in the United States, depending on how you structure it. This is not money spent, it is money transferred, and it helps the kids quite a lot.</p>\n<div>\n\n\n<span id=\"more-25008\"></span>\n\n\n</div>\n<p>If we do it by dealing with the Revolution of Rising Requirements, by providing non-cash advantages or changing the culture, that’s a more complex intervention, but we have options that let us do far better.</p>\n<p>Those who disagree have tried almost nothing, and are all out of ideas.</p>\n\n\n<h4 class=\"wp-block-heading\">Selection</h4>\n\n\n<blockquote><p><a href=\"https://x.com/AlexTISYoung/status/1986464228262486314\">Alex Strudwick Young</a>: Today parents can, for the first time, access polygenic embryo testing for IQ and many diseases through a routine test (PGT-A) done worldwide and in 60% of US IVF cycles.</p>\n<p>… In many jurisdictions you have a legal right to your PGT-A data under regulations such as HIPAA in the USA and GDPR in the EU.</p>\n<p>Herasight has a lot of experience dealing with these bureaucratic processes and gatekeepers. <a href=\"https://t.co/uyI4fR2pIL\">Contact us for help</a>.</p>\n<p>Couples with PGT-A data can now access Herasight’s polygenic predictors for IQ and many diseases, including the most powerful predictors for Alzheimer’s, schizophrenia, and cancers.</p>\n<p>Selection on our IQ predictor, CogPGT, can boost offspring IQ by up to 9 points.</p></blockquote>\n<p>Selection will be awesome, it is crazy that we are trying to slow it down rather than encourage it. Yes, this was predictable and we know why people do it, that doesn’t make it not crazy.</p>\n<p>Saying ‘up to 9 points’ is weasel wording, but it seems plausible to me to see ~10 IQ point average bumps from selection even at current tech levels.</p>\n\n\n<h4 class=\"wp-block-heading\">Surrogacy</h4>\n\n\n<p><a href=\"https://x.com/Aella_Girl/status/1869905913248919805\">Random responses in a Facebook surrogacy group after giving birth</a> are reported to be highly positive, link goes to fully unselected comments.</p>\n<p>This aligns with everything I know about such things. You should absolutely presume that surrogacy is a win-win-win deal for everyone involved, so long as neither adult party is out to intentionally abuse the other.</p>\n\n\n<h4 class=\"wp-block-heading\">IVF</h4>\n\n\n<p><a href=\"https://x.com/McCormackJohn/status/1891976641989181514\">Trump’s executive order tasks the Assistant for Domestic Policy</a> to create recommendations for protecting IVF access and reducing out-of-pocket and health plan costs for IVF. This is an excellent, highly cost-effective thing to do. IVF often doesn’t happen because of lack of capital. The best way to subsidize children is out of the gate at birth, but the even better way is to make it cheaper to try. That also removes worries about distortions or adverse selection from big cash payments.</p>\n<p>The hope is that in the future, we will be able to take IVF to the next level. We have the technologies in sight to do at least the first two steps within 5-10 years, and there are projects aiming at the next two in that time frame as well:</p>\n<blockquote><p><a href=\"https://x.com/brian_armstrong/status/1907190962125938734\">Brian Armstrong</a>: The IVF clinic of the future will combine a handful of technologies (the Gattaca stack):</p>\n<p>1. In vitro gametogenesis (IvG) &#8211; make eggs from skin or blood cells (much less invasive)</p>\n<p>2. Preimplantation genetic testing (PGT) &#8211; choose the embryo that best matches what you want, ideally from thousands or more (see #1)</p>\n<p>3. Embryo editing &#8211; make further edits for disease prevention, or enhancement</p>\n<p>4. Artificial Wombs &#8211; removes the risk/burden of pregnancy</p>\n<p>Lots of work to get there, but this may help with the decline in birth rates. And it would start to accelerate evolution (which, by natural selection, is a very slow process, and only optimizes for survival and replication).</p>\n<p><a href=\"https://x.com/AmandaAskell/status/1902397364205482465\">Amanda Askell</a>: It&#8217;s bizarre when relatively techno-utopian people are asked about how to solve declining fertility and instead of talking about artificial wombs, extended fertility spans, AI-assisted childcare, UBI, etc. they&#8217;re suddenly like &#8220;well we just need to return to the 50s&#8221;.</p>\n<p><a href=\"https://x.com/peterwildeford/status/1902727578898530744\">Peter Wildeford:</a> We are so close to technologies that make life better for so many people.</p></blockquote>\n<p>If AI doesn’t fully upend the game board and we fail to make at least the first three happen and probably all four, it will be a policy choice. It will mean humanity has chosen not to better itself and its experience, instead choosing to go quietly into the night. We need to not allow this.</p>\n<p>I do understand why one would worry about making IVF Plan A rather than Plan B. But that’s largely because right now the technology, given what our laws allow, is not good enough to be a clear Plan A for most people. That will change.</p>\n<blockquote><p>Noor Siddiqui: When I was in elementary school, my mom started going blind. Retinitis pigmentosa. No family history. No treatments. No cure.</p>\n<p>I got lucky. She didn’t. It led me to build @OrchidInc so my baby —and everyone else&#8217;s—gets to win the genetic lottery—avoid blindness— and hundreds of severe genetic diseases.</p>\n<p>Today, the New York Times covered the tech we’ve spent years building:</p>\n<p>Whole genome embryo screening for *hundreds* of diseases.</p>\n<p>Not in theory. Not in mice. In humans. In IVF centers. Right now.</p>\n<p>If you could prevent your child from going blind — would you? From getting pediatric cancer at 5? From heart defects? Schizophrenia at 22? From living a life radically altered by pure genetic bad luck?</p>\n<p>This is a choice parents are now able to make.</p>\n<p>Sex is for fun. Embryo screening is for babies.</p>\n<p>I said that in a video.</p>\n<p>People freaked out.</p>\n<p>But it’s true. And it will only get more true as the tech improves.</p>\n<p>We screen for what matters. And nothing matters more than health.</p>\n<p>…</p>\n<p>Genomics is moving fast and society is scrambling to catch up. But make no mistake: In 10 years, not screening your embryos will feel like not buckling your seatbelt.</p>\n<p><a href=\"https://x.com/s_r_constantin/status/1907381230355567038\">Sarah Constantin</a>: IVF is wonderful and so is embryo screening, but I&#8217;m leery of using IVF instead of &#8220;the old-fashioned way&#8221; when you don&#8217;t have a medical reason (like infertility or carrying a genetic disease.)</p>\n<p>Why?</p>\n<p>IVF still has a high failure rate (though it&#8217;s getting better). And it requires hormone treatments. Basically every woman I know who went through IVF and/or egg freezing had a nasty mood reaction to the hormones. Worth it for some &#8212; but not for everyone.</p></blockquote>\n<p>Right now you should definitely be wary of using IVF as plan A. The screening benefits are not that strong yet, and it is expensive and painful and time consuming and unfun. So yes, worth it for some, but not for everyone.</p>\n<p>In 10 years, if the technology develops in good ways, it should be a clear Plan A, at least in wealthy countries. Even if selection is purely to avoid negative health conditions the cost-benefit analysis will be overwhelming.</p>\n\n\n<h4 class=\"wp-block-heading\">Technological Versus Social Solutions</h4>\n\n\n<blockquote><p>Pop Tingz: For the first time in U.S. history, more women over 40 are giving birth than teenagers.</p>\n<p><a href=\"https://x.com/_glorianas/status/1977820614846206460\">eva</a>: anyone who wants the birth rate to go back up is going to have to get involved or loudly support scientific research to allow women over 40 who still want to be mothers, that’s the way forward</p>\n<p><a href=\"https://x.com/zdch/status/1978092525823914342\">Zac Hill</a>: A huge tell is how every group wants their opponents to solve problems socially, conveniently nudging society towards their preferred vision, when in fact the solution to almost all existential challenges is typically technological-institutional.</p></blockquote>\n<p>Why not both is usually the correct response. Technological solutions are great, and advancing them or getting rid of bottlenecks, especially regulatory and ‘medical ethics’ or approval bottlenecks, is a big game, up to and including artificial wombs and the creation of embryos from arbitrary cells. But culture and social (and institutional) questions matter a ton as well.</p>\n<p>The stupid form of the mistake is saying ‘why don’t you all agree, without any change in institutions or incentives,’ to do some good thing [X]. We can agree that this approach mostly doesn’t work, but that’s why you change the institutions and incentives, in ways that among other things shift culture. And to do that, you often want to create cultural desire for change first.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">Dakka</h4>\n\n\n<p>In the context of fertility, Dakka is my term for Paying Parents Money.</p>\n<p><a href=\"https://x.com/StefWKight/status/1868834292400635994\">Senator Howley proposes bumping the child tax credit from $2k to $5k</a>. <a href=\"https://www.axios.com/2024/12/17/josh-hawley-child-tax-credit-trump\">That would certainly help</a>. It would be starting to be a substantial fraction of what kids cost (at least if you are living in a cheap area on a low budget). As usual, you’d actually do better if you paid up front, but that’s a harder sell politically, so here we are.</p>\n<p><a href=\"https://x.com/SwipeWright/status/1882897121395069303\">Colin Wright asks for Dakka</a>.</p>\n<p>Here’s some deeply silly supposed Dakka (and yes <a href=\"https://x.com/whereisbre/status/1885078938013053093\">he was called a Nazi for it</a>):</p>\n<blockquote><p><a href=\"https://x.com/kenklippenstein/status/1885070288573845735\">Ken Klippenstein</a>: Trump&#8217;s Transportation Secretary Sean Duffy just sent out a memo directing staff to &#8220;give preference to communities with marriage and birth rates higher than the national average.&#8221;</p></blockquote>\n<p>This is how that would distribute funds:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!tBzp!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F06f64007-04a4-4bf5-8606-102b3e8b9bd7_1200x910.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This definitely wouldn’t ‘work’ to raise fertility, because the incentives here are all way too diffused from the decision making on having kids, and there isn’t a long term reward here to get communities to alter policies even if they could. It’s just weird.</p>\n\n\n<h4 class=\"wp-block-heading\">All The Dakka</h4>\n\n\n<p><a href=\"https://x.com/DavidSHolz/status/1894433973767708757\">David Holz pulls out More Dakka for real</a>.</p>\n<blockquote><p>David Holz: crazy question&#8230; how many kids would you be willing to have in exchange for paying zero taxes?</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!IWmG!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F872e26e5-4d14-439d-839c-4d7e34d9116f_1024x276.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>It’s not as easy as he makes it out to be, because you can only use this gun once. So if you say ‘you need to have 5 kids’ you lose the people who would have 3, and the people who would have had 10 only have 5, and not everyone who wants to hit 5 gets to hit 5, plans don’t always work out, liquidity will be a big issue since the tax exemption only hits later and biology is not always kind.</p>\n<p>So even if we decided it was worthwhile, it definitely isn’t that easy. And this is a rather inefficient way to get where you want to go. But yes, it shows that at the limit, 73% of people answered they can absolutely be bribed. Usually people overestimate their responses, but it’s still striking.</p>\n<p>A lot of the problem, in practice, has been everyone’s aversion to things that someone might call ‘eugenics’ or that impact some groups more than others.</p>\n<p>People don’t want to use incentives that mostly work on poor people. They also recoil in horror if you suggest shaping the incentives so they work equally well or better for rich people. That rules out all of the possible incentives.</p>\n\n\n<h4 class=\"wp-block-heading\">Insufficient Dakka Works Insufficiently</h4>\n\n\n<p><a href=\"https://x.com/robinhanson/status/1905317692124414277\">As usual, we’ve tried almost nothing, and we’re all out of ideas</a>.</p>\n<blockquote><p>Scott Greer: To hammer home a point, government policy likely can’t reverse declining marriage rates.</p>\n<p>Robin Hanson: There are in fact larger dollar amounts than $14K.</p>\n<p>Patrick McKenzie: As, for example, thoroughly understood by governments when the behavior change they want to incentivize is “Please work for us for a year.”</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!0HAL!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F453fe742-b2cb-42ff-9fb3-7bee5a160024_750x771.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Americans often face a dramatic marriage penalty, that can be much bigger than this. The cost of divorce, or marrying the wrong person, is very high.</p>\n<p>A one time $14,000 transfer is not all that much. For many, it won’t even cover the wedding! It is certainly a good start, but you’ll need More Dakka to get people to marry for real that much more often.</p>\n<p>If you don’t think people will marry for money? Most of us know people who have married for health insurance. A marriage is whatever the people involved make of it. The worry with subsidizing marriage, especially with a lump sum, is that marriages are easy to fake, and the marginal financially motivated marriage doesn’t give you what you want.</p>\n<p>Whereas children are extremely difficult to fake, they either exist or they don’t.</p>\n<p>Thus, you want to ensure marriage isn’t penalized, but you can’t reward it that much unless you also condition on children, which risks prolonging deeply awful marriages.</p>\n<p>Peter Eduardo in WaPo similarly warned that ‘<a href=\"https://www.washingtonpost.com/opinions/2025/06/10/baby-bust-policy-failure-europe/\">no motherhood medal or baby bonus will fix what economic modernization broke</a>,’ saying even well-conceived policies have ‘mostly failed’ to lift fertility ‘for good’ but that is the wrong counterfactual, as usual the evidence that nothing works is that you tried nothing much and you’re all out of ideas. Or that because differences in subsidies don’t explain most differences in fertility, subsidies must not matter. That’s not how it works.</p>\n\n\n<h4 class=\"wp-block-heading\">The Effectiveness of Dakka</h4>\n\n\n<p><a href=\"https://x.com/lymanstoneky/status/1932536809591902553\">Lyman Store responds</a>.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ulcw!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1031d1f5-df10-44d0-b941-0e84cce69dcb_677x606.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>Ansel Lindner: Spending 100% GDP per capita for a 20% increase is &#8220;working&#8221;? How is that mathematically sustainable?</p>\n<p>US TFR 1.6 x 1.2 = 1.92</p>\n<p>100% GDP per capita =~$80,000 per child</p>\n<p>3.7 million × $80,000 = $296 billion/year</p>\n<p>10% of GDP to not reach replacement? Still gets worse every year.</p>\n<p>Lyman Stone: No, a present discounted value of 100% of GDP per capita. Not $80,000 in annual payments to family per kid, $80,000 in present discounted value of future annual payments. Assuming an 18-year child payment, that&#8217;s annual payments of about $6,000 more per kid.</p></blockquote>\n<p>That’s $80k for a 20% growth in fertility, which comes out to $400k in transfers per marginal child born. That’s modestly higher than my prior estimate of roughly $300k. The difference can be accounted for by the fact that this would be paid out over 18 years, whereas up front payments have much larger effects.</p>\n<p>So yes, I think this is the price tag, which scales roughly with GDP, and note that there is minimal deadweight loss or overall loss of wealth here.</p>\n<p>I do think we can get far more efficient mileage out of other changes first, that reduce the burdens and risks on parents, raise their status and make having children more appealing. But yes, we can absolutely solve this problem primarily with money.</p>\n<p>Talking price a bit, Anthony is definitely not correct at $5k but at $50k? Yes.</p>\n<blockquote><p><a href=\"https://x.com/JamesSurowiecki/status/1914843081037222103\">Anthony Pompliano</a>: If the government is handing out $5,000 bonuses to moms who have a baby, we are going to see a baby boom unlike anything America has ever seen.</p>\n<p>Michael Anotnelli: I’m gonna need you to break your streak of absolutely awful takes. You’re ice cold bro.</p>\n<p>James Surowiecki: No one who has kids would ever think that $5000 is going to make a difference to the decision to have a child or not.</p>\n<p><a href=\"https://x.com/j_jason_bell/status/1915442247199342885\">Jason Bell</a>: I’m reminded of @ATabarrok’s response when a free Krispy Kreme donut spurred people to get vaccinated: “there’s always someone at the margin”</p></blockquote>\n<p>My math says that a $50k baby bonus would result in about a 20% boost to fertility as a primary effect, and I would predict a secondary cultural wave that increases that further, so I would guess we’d sustainably get something like 30%, moving from 1.63 to 2.1, landing us at replacement level. That’s what it takes.</p>\n\n\n<h4 class=\"wp-block-heading\">The Wrong Dakka</h4>\n\n\n<p><a href=\"https://t.co/PhukN9lkdp\">Robin Hanson proposes More Dakka in the form of part of children’s tax payments</a>, because it would align incentives. But this is a rather terrible proposal, for two classes of reason.</p>\n<p>First, the parents will come under a ton of pressure to refund those payments. What kind of parent are you if you are taxing your children? The contract is not stable.</p>\n<p>Second, there’s a time mismatch. You are investing in children now in order to collect big payments down the line starting in 20 years. But the parents will have a liquidity issue, they need the money now, to raise the children, and expect to be much wealthier in the future already.</p>\n<p>Robin’s answer no doubt is that the parents can sell those tax claims to others, but that’s just not going to fly culturally even beyond how much the rest wouldn’t fly, and even if it did we run into major adverse selection issues.</p>\n<p>Third, people will find the whole thing to be an abomination on so many levels. It would be a supremely heavy lift compared to what you would get in return.</p>\n\n\n<h4 class=\"wp-block-heading\">Dakka Does Not Disproportionally Motivate The Poor</h4>\n\n\n<p>You would think that it would do this. We all assume they would do this. One of the objections to fixed payments for parents is that this could result mainly in poor people having more kids, since you would assume richer parents would respond a lot less.</p>\n<p>Lyman Stone checked the data. <a href=\"https://x.com/lymanstoneky/status/1964021239023825322\">The results in practice are not what we assumed?</a></p>\n<p>I don’t think this would hold if you scaled the amounts, but also I’m surprised by the result in the first place?</p>\n<blockquote><p>Lyman Stone: So I went back through all those studies to check and see if they reported heterogeneity tests. Spoiler: many did. In total, from 60 initial intervention estimates, I was able to find 23 estimates of effects specifically on low-income people, and 24 for middle/high.</p>\n<p>…</p>\n<p>So we use that standard cost estimate from my study in May, and we apply it symmetrically to lower- and higher-income treated groups alike? This is basically saying &#8220;For a fixed budgetary spend, which group boosts fertility more?&#8221;</p>\n<p>There&#8217;s basically no difference: if you give a middle/high earner $3,000 to have a kid, their odds of having a kid rise by essentially the identical amount as if you give a low earner $3,000 to have a kid.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!qMCj!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa298db9a-17c5-48d4-ae0c-e809d689f227_693x554.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>A lot of people have this mental model where effects should always scale with income, but this is obviously wrong for a lot of effect types! If I give somebody a $10 hamburger voucher, poor people will not by 4x as many hamburgers even though it&#8217;s 4x the share of their income.</p>\n<p>The reason is that it is a voucher for hamburgers and the price of hamburgers is relatively fixed with respect to income. Sure rich people may go to a bougier place and poor people a cheaper one, but by and large most people are going to purchase pretty similar hamburgers.</p>\n<p>Despite the cultural narratives purporting to tell you there are absolutely massive class differences in parenting, the actual fact of the matter is the economic costs associated with how people would prefer to parent are actually not that variable across most of the income spectrum.</p></blockquote>\n<p>There are obvious exceptions. Private schools, extra space and hired help are obvious ways in which richer people will spend a lot more money. Despite this, the differences are not that vast, and we get this very interesting result.</p>\n\n\n<h4 class=\"wp-block-heading\">Is That a Lot?</h4>\n\n\n<blockquote><p><a href=\"https://x.com/bpodgursky/status/1944542231047840018\">Ben Podgursky</a>: It&#8217;s frustrating that collapsing birthrates are treated as unfixable when the reality is that we could largely fix it if we treated it like treat healthcare — a problem, but something we can spend real money to fix.</p>\n<p>We spend ~$150,000 per cancer patient. Why less for a child?</p>\n<p>I&#8217;m unhappy about US taxes today because it goes straight into badly structured entitlement giveaways for old people. If you raised my taxes to 60% to pay for a subsidy that made it nearly free to raise a child age 0-18, I would be happy to pay it.</p>\n<p>The more I run these numbers the more upset I get. We could straight up give $150,000 cash for each child and it would only cost 1.6% of GDP, not even twice what we spend to treat cancer. Medicare is 3.7% of GDP.</p>\n<p>Lyman Stone: Right???? People see these price tags and they just simply do not realize what gobsmacking sums we spend on old people.</p>\n<p>The average worker (+their employer) paid $15-20,000 last year to provide subsidies and healthcare to retirees, valued at about $20-$50k/yr per retiree.</p>\n<p>But we surely couldn&#8217;t do $10k/year for a kid! That would be craaaaazy!</p></blockquote>\n<p>We could, in many school districts we already do in other ways, and we would be redistributing the money and wealth and purchasing power, not destroying it.</p>\n<p>If my calculations are correct, paying out the $150k would not only effectively lift almost all children out of poverty, it would raise the fertility rate to well above replacement.</p>\n<p>In the long term, this would make the debt more sustainable rather than less, even if we did it purely with borrowed money.</p>\n<p><a href=\"https://x.com/lymanstoneky/status/1944518013438525854\">If Lyman Stone’s model is correct,</a> that a 4% present-value benefit yields a ~1% TFR increase, then if we gave parents benefits with an NPV (net present value) of $150k, that would be about 181% of GDP, so a 45% boost, which is a similar result of a TFR of 2.4, which would be enough buffer to cover substantial decreases from other sources.</p>\n<p>We could also supplement that with cultural and other changes, and get that result vastly cheaper.</p>\n<p>Also note that what matters is the net difference, so if you are taxing those without children to pay for the benefit, the benefit can be smaller and still fully work.</p>\n<p>As always, how you do it matters too. The more up front and locked-in and salient the payment, the more impact it will have. We are not doing a good job with this.</p>\n<p>In some senses obviously this is a lot of money, but in context I think this is not actually a lot of money, and again it pays for itself over time.</p>\n<blockquote><p><a href=\"https://x.com/mmjukic/status/1944418686149763425\">Marko Jukic</a>: If a tech CEO revealed he could manufacture self-replicating fully autonomous universally adaptable humaniform AGIs that stayed in good working condition for ~60 years for $450k each, he would be hailed as a hero and the U.S. government would order $10 trillion worth of them.</p>\n<p>At $450k per child, we could double the U.S. birth rate and reach well above replacement fertility for the price of just $1.6 trillion. That is just 23% of annual federal spending and less than Social Security + Medicare. It&#8217;s literally a steal!</p>\n<p>Boomers just hate children and believe as a matter of selfish dogmatic faith they should not only cost $0 and raise themselves, but actually pay Boomers for the privilege of being born. There is no other explanation for this plain economic irrationality.</p></blockquote>\n<p>This doesn’t fail because we can’t do it. It fails because we don’t want to do it.</p>\n\n\n<h4 class=\"wp-block-heading\">Alternative Dakka</h4>\n\n\n<p>As stated this is of course rather silly but Zac Hill nails it.</p>\n<blockquote><p>John Arnold: Convinced the one and only way to increase the birth rate in the US is a federal cap on hours per week allowed for organized youth sports. That&#8217;s the binding constraint.</p>\n<p>Cam Hardaway: This is so good… I’m with you. We traipse our 4 sons all over the place playing youth sports.</p>\n<p><a href=\"https://x.com/zdch/status/1936450257292071343\">Zac Hill</a>: The thrust of this is prolly directionally accurate tbh.</p></blockquote>\n<p>What if the cap was only on family presence or participation in youth sports?</p>\n<p>I don’t fully understand how parents were convinced to devote so many hours and dollars for organized youth sports, but the combination of pressure to do the sports and the ways they impose time costs on parents is by all reports really nasty.</p>\n<p>Youth sports are a good thing if you can free the parents from these burdens.</p>\n<p>This is a special case of the Revolution of Rising Requirements. The problem is not the sports, or even that they are organized. The problem is the supervision, and perhaps the associated fees that go to various luxury features.</p>\n\n\n<h4 class=\"wp-block-heading\">The Housing Theory of Everything Is Undefeated</h4>\n\n\n<p><a href=\"https://x.com/florianederer/status/1876465625188716997\">We found something that</a> looks like it works even better than Give Parents Money.</p>\n<p>Instead, what if we <a href=\"https://t.co/NCs1j7UYmz\">Give Prospective Parents Housing</a>?</p>\n<p>The situation they’re studying is a house lottery rather than a benefit program, which is a little weird. As I understand it, the lottery has everyone paying the same fixed amount from the start into the pool, then every month at least one person gets money from that pool to go buy a house outright. So it’s a weird forced saving program, where you get the house at an uncertain random point.</p>\n<p>Which gives us an RCT.</p>\n<blockquote><p>Dimas Fazio, Tarun Ramadorai, Janis Skrastins and Bernardus Doornik:</p>\n<p>Abstract: This paper examines the impact of access to housing on fertility rates using random variation from housing credit lotteries in Brazil.</p>\n<p>We find that obtaining housing increases the average probability of having a child by 3.8% and the number of children by 3.2%. For 20-25-year-olds, the corresponding effects are 32% and 33%, with no increase in fertility for people above age 40. The lifetime fertility increase for a 20-year old is twice as large from obtaining housing immediately relative to obtaining it at age 30.</p>\n<p>The increase in fertility is stronger for households in areas with lower quality housing, greater rental expenses relative to income, and those with lower household income and lower female income share. These results suggest that alleviating housing credit and physical space constraints can significantly increase fertility.</p></blockquote>\n<p>This downplays the effect on 20-25 year olds:</p>\n<blockquote><p>More importantly, we find that the effects of housing credit are far stronger for 20 to 25 year-olds in their peak child-bearing years, who exhibit a 32 percent increase in the probability of child-bearing and a 33 percent increase in the number of children relative to the base-rate.</p>\n<p>…</p>\n<p>Our estimates reveal that for an individual who wishes to obtain housing between ages 20-24 but obtains it ten years later (30-34), total lifetime fertility is half that from receiving housing access immediately upon joining.</p></blockquote>\n<p>Directionally none of this was in doubt. The question is efficiency of the transfer.</p>\n<p>The value of the house was $87,000. Looking at some charts, that was roughly the media house price in Brazil at that time, so let’s assume to get the same effect you need to enable buying roughly the median house.</p>\n<p>In America today, the median house price is about $420,000.</p>\n<p>Suppose we had a rule that any married couple between the ages of 20 and 25 could request make a one-time request from the Federal government, usable only to go buy a house anywhere in America with a size minimum. They would then have to pay off the mortgage, so the effective subsidy was identical to the Brazil program relative to the cost of housing. If the couple pays off the mortgage, they keep the house at the end. If not the bank sells the house and gives the government the proceeds.</p>\n<p>The base financial cost of this program is $130k for the subsidy (assuming a 3.5% NPV discount rate), plus some extra for adverse selection, administration and fraud. Claude thinks maybe $170k all-in.</p>\n<p>The couple gets the house right away, and their mortgage payments would be substantially lower than typical rent payments on a matching property. They get housing security, and eliminate marginal cost of housing when having children, have a huge future wealth effect, and net save on cash flow versus renting.</p>\n<p>In terms of politics, the exact age range thing makes things tricky, but ‘first time home buyer subsidy’ is already a big Democratic platform thing. Seems super doable relative to other proposals on fertility. This is just… a lot bigger than the existing proposed housing subsidies, and better structured.</p>\n<p>Remember what happened in Brazil? The lifetime fertility rate roughly doubled between the winners versus the losers. Participants probably start out with higher than average fertility because they paired up young, and let’s not consider various other positive splash-on effects from cultural shifts and convincing people to marry earlier that might also be very large. And there are various other ways we can do better &#8211; this isn’t meant to be the actual form of the proposal, yet.</p>\n<p>The flip side is that losing the lottery probably is very bad for fertility versus baseline, so this is likely an overestimation in that way, if you can’t give this to everyone. And the participants in the study typically had informal (but lucrative) employment, which could change things in other ways. Both could lead to this being a large overestimate.</p>\n<p>The biggest downside, other than potentially hurting people’s mobility, is presumably that this raises housing prices, and yes that is a cost not a benefit. We would very much need to build more housing, especially 3+ bedroom family housing. But it is a benefit to existing homeowners, so you could perhaps pair this rather aggressive YIMBY changes, for a win-win. Imagine if the subsidy only applied to areas that successfully built enough 3+ bedroom housing, and of course people in areas that miss out could move to areas that didn’t miss.</p>\n<p>Our previous estimate of the typical cost-per-birth from subsidies in America is $270k. Here, if we get 100% of the effect in the Brazil study, it would be $100k, and you can increase the cost as you discount the efficiency from there, with the transfer having other positive knock-on effects.</p>\n<p>If you really wanted to supercharge the effectiveness and efficiency of this program, of course, you could offer it only for couples with at least one child, especially if the chances of winning the lottery were high once a couple was eligible.</p>\n<p>You also get a ton of other benefits. It’s all crazy enough to work.</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/housing-costs-and-fertility.html\">We also have</a> a <a href=\"https://drive.google.com/file/d/1BK6jNy9jqCXS0c7PYakrkSqoFxJY2XCS/view\">job market paper from Benjamin Couillard</a> as an observational study. It finds the Housing Theory of Half Of Everything, in this case.</p>\n<blockquote><p>Housing choice estimates confirm a Becker quantity-quality model’s predictions: large families are more cost-sensitive, and so rising housing costs disincentivize fertility.</p>\n<p>To study the causal effect of rising housing costs on fertility, I vary them directly within the model, finding that rising costs since 1990 are responsible for 11% fewer children, 51% of the total fertility rate decline between the 2000s and 2010s, and 7 percentage points fewer young families in the 2010s. Policy counterfactuals indicate that a supply shift for large units generates 2.3 times more births than an equal-cost shift for small units: family-friendly housing is the more important policy lever.</p></blockquote>\n<p>That strongly points to a cost burden explanation of fertility declines. If half the decline is rising housing costs, then if you add in other new requirements on families, especially in terms of child supervision, you can plausibly explain most of the decline, or perhaps more than all of it.</p>\n<p>The problem with trying to fix this via traditional YIMBY approaches is that creating lots of smaller housing units doesn’t provide the multi-bedroom housing large families need. The response to this is that a lowering tide lowers all boats. If you create more smaller units, then that reduces rent on smaller units and demand for larger units, so larger units drop in price. You can also combine multiple smaller units.</p>\n<p>There is still a risk that if you ‘lock people into’ smaller units, especially if they buy them, that this can be quite bad for fertility. It would be reasonable to try and encourage those in smaller units to mostly rent.</p>\n<p>The better solution than that is to directly build more larger units. Some YIMBY policies are directly about smaller units, but most are about building more square feet of housing on the same amount of land, or the same house on less land.</p>\n<p>The best solution is to differentially support larger apartments and houses, giving them various cost benefits, on top of allowing smaller units for 1-2 person households.</p>\n<p>There is no conflict here. A 22 year old out of college that only wants an SRO or a small studio apartment should get to save money, while saving that extra room for a family that needs it.</p>\n<p>The other part of the problem is Rising Expectations. Houses and apartments are much bigger not only because they are required to be but because people demand it. Couples looking at having children will insist upon a lot more house than they did in the past. Ideally they would relax this requirement a bit, but whether or not they do we can make it a lot easier to afford whatever they do eventually end up with.</p>\n<p><a href=\"https://x.com/KelseyTuoc/status/1892337574091641311\">I strongly endorse this proposal</a>, the rest of the thread’s proposals are good too.</p>\n<blockquote><p>Kelsey Piper: Every part of every American city should pass the toddler test: you feel safe walking through it with two toddlers who will try to eat cigarette butts and needles if there are any around to be eaten. If you have to use the subway, the elevators work and fit the stroller.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Happiness</h4>\n\n\n<p>Here’s some great news, all you have to do to raise births is… make people happy?</p>\n<p>Hopefully we wanted to do that anyway.</p>\n<blockquote><p><a href=\"https://x.com/CartoonsHateHer/status/1955615303968206909\">Cartoons Hate Her!</a>: Why have people decided the birth rate is some kind of proxy for overall happiness? Do you think people procreate specifically bc they’re happy? Which country do you think is happiest rn?</p>\n<p><a href=\"https://x.com/lymanstoneky/status/1955643291883729261\">Lyman Stone</a>: Actually yes, the BEST predictor of fertility is &#8220;Do you intend to have children in the next year?&#8221; The second-best is a vector of marital and contraceptive status.</p>\n<p>But 3rd best is just asking people &#8220;How happy are you?&#8221;</p>\n<p>Live birth odds scale pseudo-linearly with happiness!</p>\n<p>And it&#8217;s additive! If you do a model of Intentions + Marital Status + Contraceptive Status + Happiness, each one matters separately and together!</p>\n<p>There&#8217;s also a pretty straightforward interaction term between Marital Status and Contraceptive Status.</p></blockquote>\n<p>If you’re holding roughly constant the general wealth and education levels, then yeah. Your goal is in large part to make people happy, and also make them married and get them into relationships, which also tends to make people happy.</p>\n\n\n<h4 class=\"wp-block-heading\">Negative Dakka</h4>\n\n\n<p><a href=\"https://www.nber.org/papers/w33741#fromrss\">New paper claims</a> that while China’s One Child Policy initially had very little impact on fertility, that was because at first it was not enforced. When the ‘One Vote Veto’ policy caused it to actually be enforced in the early 1990s, then it had a big impact, accounting for 46% of China’s fertility decline that decade. I’m not going to dive into the data but that explanation makes sense to me.</p>\n<p><a href=\"https://x.com/JayCarraway_/status/1942297491946295604\">Tariffs are making things more expensive for parents</a>.</p>\n<blockquote><p>Jay Carraway: The Wirecutter’s top car seat is $230 up from $160 earlier this year. <a href=\"https://www.marketplace.org/story/2025/06/17/five-top-baby-items-cost-24-more-since-trump-tariffs-hit\">Some of the most popular strollers have gone up 20-30%</a>. The thing where Trump just randomly waived a wand and raised the price of a bunch of stuff on parents seems pretty unreported by the media.</p>\n<p>The media had absolutely reported that tariffs occurred as like a factual thing that happened. But the equivalent “Democrat did this” version would be human interest story after human interest story. And Trump directly did this! Unlike 2022 inflation.</p></blockquote>\n<p>These extra costs plunge families into financial problems and poverty, and will absolutely filter down into fertility decisions as prospective parents see them and adjust. Indeed, expect these changes to have oversized impact, as they are the kind of prices that are most salient.</p>\n\n\n<h4 class=\"wp-block-heading\">Mother’s Day</h4>\n\n\n<p>Dakka can come in many forms. Honor is often the most efficient and effective.</p>\n<blockquote><p><a href=\"https://x.com/ben_r_hoffman/status/1921725908311855258\">Robin Hanson</a>: How could we supercharge Mother’s Day, to make it a much bigger deal, in order to raise the status of Mothers?</p>\n<p>Benjamin Hoffman: Every year on Mothers’ Day, we do a land reform where plots are allocated to women on the basis of # children (maybe w diminishing marginal returns).</p>\n<p>Mothers vote on the national budget on Mothers Day, with legit authority to freeze govt operations until there’s a proposal they approve.</p>\n<p>Legal penalties for falsely claiming to be a mother (analogous to falsely claiming to be a physician), involving public humiliation on Mothers’ Day (e.g. stockading, tarring &amp; feathering).</p>\n<p>The Purge but only for mothers.</p>\n<p>Thomas Drach: Monday off.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Status</h4>\n\n\n<p><a href=\"https://x.com/KTmBoyle/status/1883245658796081236\">If you were in charge of making motherhood high status again, where would you start</a>?</p>\n<blockquote><p>Katherine Boyle: You can change the status of something very quickly. Cringe can become cool in years, not decades. We’ve had a generation of women who were repeatedly told that motherhood is low status. We’re now seeing the culture turn hard on this, and it will continue to accelerate.</p>\n<p>Made in Cosmos: If you were in charge of making motherhood high status again, where would you start?</p>\n<p>This is a great question, but it starts in daily life. Here’s some super easy things states and companies could do to honor families.</p>\n<ol>\n<li>All airlines, TSA lines, and other forms of travel should allow families to board first, before priority and first class. Family lanes should be required.</li>\n<li>Carpool lanes on highways renamed family lanes. Florida should do this asap. @GovRonDeSantis</li>\n<li>every parking lot should be required by law to have family reserved parking, just like handicapped parking, for the safety of mothers and children.</li>\n<li>Family lanes at all stores for ease of checkout.</li>\n<li>Reserved seating for families at churches, houses of worship and other community spaces where children should be encouraged to go.</li>\n</ol>\n<p>In short, society should beat us over the head that families take priority above class, work and other forms of identity or protected groups, because family is the backbone of our civilization.</p>\n<p>The federal government should do a commission on the state of the American family, and make many recommendations to encourage businesses and communities to prioritize the family in daily life.</p>\n<p>These changes aren’t hard, and there are many more ideas to make reality.</p></blockquote>\n<p>This is some lame-ass stuff right there. We can surely do way better than that.</p>\n<p>Basic cringe stuff works. At every Mets game we stop to honor a veteran. You can honor a mother too, and do other similar things.</p>\n<p>I do think status in part goes hand in hand with the financial aspects. Offering good financial supports in various ways would do a lot, including in provision of health insurance. But that’s not the question here.</p>\n<p>Various legal protections would similarly be good but I don’t think it does much.</p>\n<p>Offering more community spaces and activities for kids would help. As would making it not allowed to bar kids from various activities or locations, and not okay to require kids to be on absurd standards of behavior in public spaces &#8211; if they’re not physically bothering you, it’s almost entirely not your problem.</p>\n<p>Media representations matter a lot, and could be targeted in various ways. In particular, we need to develop cultural norms of frowning on those who disdain having children, and also put large families into media more often &#8211; right now there are never more children than are strictly needed for the plot.</p>\n<p>There’s a toxic anti-child, anti-mother culture among much of the left, that feeds on itself, and does things like <a href=\"https://x.com/RachelBitecofer/status/1882909692231627042\">equate a desire for children with literal Nazis</a>.</p>\n<p>But the most important thing, I think, is lifestyle, childcare requirements and expectation setting about what is required to be a ‘good mother’ or to avoid potential legal hassles.</p>\n<p>Motherhood is low status in large part because it is associated with these absurd supervision requirements. If we Let Kids be Kids, the way we used to in let’s say the 1980s let alone the 1950s, in a world that is now vastly safer and where you can give the kid a phone with GPS, I think that gets us a huge portion of the way there.</p>\n<p>Which is another way of saying that, media portrayals and honors aside, mostly I think the way you raise the status of mothers is to… actually make their lives better.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>\n\n\n\n<h4 class=\"wp-block-heading\">Hungary</h4>\n\n\n<p><a href=\"https://x.com/Noahpinion/status/1916311568947810393\">Things are not going great, monthly fertility rate fell to 1.25 in March 2025.</a></p>\n<blockquote><p><a href=\"https://x.com/nsokolsky/status/1893824020312703150\">Nikita Sokolsky</a>: Just as with the previous Hungarian policy that applied to families with 4+ kids, the tax exemption is incorrectly reported and its scope is exaggerated.</p></blockquote>\n<p>Nikita was talking back at the beginning of 2025. They have now passed the new rules.</p>\n<p>As I understand the final version:</p>\n<ol>\n<li>If a mother has 3+ kids she is permanently immune to the 15% income tax.</li>\n<li>If a mother has 2+ kids she gets it phased in over time as a function of her current age (for 2026 it’s under 40) but by 2030 everyone gets this too.</li>\n<li>Increases in the monthly tax-base allowance that reduces taxable income, which can be applied to the father’s income, and which scales with family size. So one childs gets 100k HUF (~$300) per month, whereas for 3+ children it’s 330k HUF per child per month, so about $3000 per month.</li>\n</ol>\n<p>Adopted kids can count, which could lead to some very extreme incentive effects.</p>\n<p>It has always been a rather insane policy implementation to say that a mother pays no income tax, while her spouse pays income tax. You’re producing a gigantic distortion, where you’re pushing the mother to work and the father to stay home, what?</p>\n<p>The obvious reason is that you can’t verify who the father is and you otherwise open up the system to tax dodges by the wealthy, but you have to be able to patch that &#8211; you could require a marriage that predates the children, and perhaps cap the father’s immunity at some very high income threshold.</p>\n<p>The obvious simple solution is to use a fixed absolute subsidy, rather than a reduction in income taxes, because you don’t actually want to supercharge the incentive for market work onto mothers in particular.</p>\n<p>I would expect a substantial increase in fertility if this passes, but not as much as if it was designed better, or if it was more expansive as is often reported. I’d expect the expanded tax credit to be doing the far more efficient work here, I would have said expand the credit and perhaps scale it higher for larger families, and leave the income tax rates alone or find a way to lower them in general.</p>\n<p>I would also expect some unfortunate secondary effects, with the huge tax push towards stay-at-home fathers or full time hired caregivers.</p>\n<p><a href=\"https://x.com/TPCarney/status/1973180679962894506\">Tim Carney investigates Hungary’s problem</a>, <a href=\"https://www.washingtonexaminer.com/opinion/3367526/hungary-natalism-fundamental-law-family-marriage-babies/\">and finds the same issue,</a> that the current policy is nominally pro-natal but it’s also a work subsidy for mothers in particular, and they also make the classic housing mistake of subsidizing demand rather than addressing supply.</p>\n\n\n<h4 class=\"wp-block-heading\">Audio</h4>\n\n\n<p><a href=\"https://www.youtube.com/watch?v=XLvnJGN0A9A&amp;ab_channel=ArnoldKling\">Lyman Stone talks with Arnold Kling.</a></p>\n\n\n<h4 class=\"wp-block-heading\">NatalCon</h4>\n\n\n<p><a href=\"https://www.betonit.ai/p/reflections-on-natal-con\">Bryan Caplan offers a report</a>. He has great things to say about the attendees and speakers in general, not as nice things to say about the chosen lineup of speakers on opening night, which matters. And he regrets that the group was sufficiently right-wing that it likely will drive potential left-wing attendees further away, making the problem worse.</p>\n\n\n<h4 class=\"wp-block-heading\">Housing Discrimination</h4>\n\n\n<p>Technically when renting or selling housing you’re not allowed to discriminate against families with children, so of course everyone who still wants to discriminate anyway responds by doing it in ways that get tolerated, <a href=\"https://x.com/jdcmedlock/status/1960025257236218185\">like giving directions to make a left at Wally’s Liquor and if you see Tiny Tim’s Titty Club</a> you’ve gone too far.</p>\n<p>I don’t know how widespread such discrimination is even when renting. I suppose families in some ways are more trouble, although in others they are more reliable.</p>\n\n\n<h4 class=\"wp-block-heading\">Your Own Quest</h4>\n\n\n<blockquote><p><a href=\"https://x.com/sama/status/1958976273319174362\">Sam Altman</a>: i can&#8217;t think of a non-cliche way to say this, but everyone who says having a kid is the best thing in the world is both correct and still somehow understating it.</p></blockquote>\n<p>Good news <a href=\"https://x.com/nwilliams030/status/1961100398233829756\">it seems many single men actually do still want to have large families</a>, as in 5-10 children, and yes as the post says this is a good thing to want and quite the call to self improvement to make this possible. The fault is in our society for making the logistics of this idea seem impossible, and also for many people treating ‘I want a lot of kids’ as something toxic or wrong.</p>\n<p><a href=\"https://x.com/webdevMason/status/1961579285858369887\">Some obvious basic logistics for men if you are indeed going forward</a> and your woman is pregnant, basically planning for the fact that this is going to mess with her head and ensure that you can handle it and how to respond so as to make it through okay, and to be ready with her preferences for giving birth and practicing the route to the hospital and other neat stuff like that.</p>\n<p><a href=\"https://arnoldkling.substack.com/p/my-communist-vision?utm_campaign=posts-open-in-app&amp;triedRedirect=true\">Arnold Kling offers a vision of intentional communities for young families</a>, where you have to have a child under the age to 10 to move in, the mirror image of ‘senior communities’ where you have to be over 55, with services to help parents like community day-care but distinct households as per usual.</p>\n<p>This seems like an obviously good idea. Parents of young kids benefit from being around other parents of young kids and from the establishment of child-friendly norms. As usual, People Don’t Do Things, but you love to see it, the same way I previously discussed.</p>\n<p>This doesn’t have to be some huge production. A large friend group should work wonders.</p>\n<blockquote><p><a href=\"https://x.com/levin_phil/status/1944817946351821141\">Phil Levin</a>: I reckon that living near 20+ friends has doubled the fertility rate of our friend group.</p>\n<p>•Some had kids who wouldn’t have</p>\n<p>•Some had more kids than planned (inc. us)</p>\n<p>•Some had kids earlier</p>\n<p>[Shilling for the &#8220;housing theory of fertility&#8221;]</p>\n<p>12 kids born so far in the group &#8212; all under the age of 4.</p>\n<p>Turner Novak: Have Babies Near Friends.</p>\n<p>Phil Levin: Also: have friends near babies.</p></blockquote>\n<p><a href=\"https://supernuclear.substack.com/p/case-study-the-story-of-radish-81f3ca6b6616?s=w\">This is how they did it</a>, and assembled an 18-person compound in Oakland.</p>\n\n\n<h4 class=\"wp-block-heading\">Hope</h4>\n\n\n<p><a href=\"https://x.com/bennyjohnson/status/1862145986077839450\">It is weird that Apple releasing an ad</a> that basically says having a daughter is good and so buy Apple’s new AirPods now with hearing aids causes statements like this and that statement gets 7 million views (you can watch at the link):</p>\n<blockquote><p>Benny Johnson: I’m stunned. Apple just released the single greatest pro-parenting ad in the history of American advertising.</p>\n<p>The pro-family cultural revolution is here.</p>\n<p>Watch. Try not to cry…</p></blockquote>\n<p>I mean, great ad, but yeah, this really shouldn’t be news, this should be Tuesday.</p>\n<p><a href=\"https://x.com/recurrented/status/1903918458481660169\">What (some) girls are chatting about in the corner at a baby shower</a>.</p>\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2026/01/06/fertility-roundup-6-the-art-of-more-dakka/",
            "publishedAt": "2026-01-06",
            "source": "TheZvi",
            "summary": "The central message of the fertility roundups has always been that we have a choice. If we do want to raise fertility, we can do that. People respond to incentives. That means money, especially if paid up front, and it &#8230; <a href=\"https://thezvi.wordpress.com/2026/01/06/fertility-roundup-6-the-art-of-more-dakka/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Fertility Roundup #6: The Art of More Dakka"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-06"
}