{
    "articles": [
        {
            "content": [
                "<p>The promise of a <a href=\"https://en.wikipedia.org/wiki/Password_manager\">password manager</a> is that it remembers and autofills all of your passwords, so you only have to remember one – the password that unlocks your password manager.</p>\n\n<p>In practice, I have a handful passwords that I think worth memorising.\nIt’s still a short list, but I’m not convinced that a single password is either sensible or feasible.\nI generally trust my password manager, but I don’t want it to be a single point of failure for my entire digital life.</p>\n\n<h2 id=\"what-passwords-do-i-try-to-remember\">What passwords do I try to remember?</h2>\n\n<ol>\n  <li>\n    <p><strong>The login password for my computer.</strong>\nI configure my Mac to sleep after a few minutes of inactivity, then ask for my login password when I try to resume.\nAlthough I often use Touch ID to log in, I remember this password because I still have to enter it multiple times a day.</p>\n  </li>\n  <li>\n    <p><strong>The master password for my password manager.</strong>\nThis unlocks all of my other passwords.</p>\n  </li>\n  <li>\n    <p><strong>The login passcode for my phone.</strong>\nI use an alphanumeric password, and I remember it because I have to enter it multiple times a day.</p>\n  </li>\n  <li>\n    <p><strong>My email password.</strong>\nMy email account is the gateway to all my other digital accounts.\nIf I lost access to my password manager but could still receive email, I could reset my passwords and regain access to everything.</p>\n  </li>\n  <li>\n    <p><strong>My remote backup password.</strong>\nI have offsite backups of all of my computers with Backblaze.\nIf all of my devices were destroyed at once (for example, in a house fire), this would allow me to retrieve files from my backups, even without access to my password manager.</p>\n  </li>\n  <li>\n    <p><strong>The encryption password for my multi-factor authentication (MFA) recovery codes.</strong>\nI have an MFA app on my phone, protected by Face ID or my passcode – but in an emergency, I have single-use recovery codes I can use instead.\nThese are stored in <a href=\"https://alexwlchan.net/2026/recovery-codes/\">an encrypted disk image</a>.</p>\n  </li>\n  <li>\n    <p><strong>My Apple Account password.</strong>\nI’m heavily enmeshed in the Apple ecosystem, and this account has powerful access to my devices, including remote wiping and backups.</p>\n  </li>\n  <li>\n    <p><strong>The “memorable word” for my online banking.</strong>\nWhen I log in to my bank account, my password manager autofills a password, and then I have to fill in three characters of a longer “memorable word”.\nFor example, I might be asked to enter the 1st, 5th, and 8th characters.</p>\n\n    <p>I memorise this both for security and convenience.\nIf somebody compromises my password manager, my bank account is safe – and even if this was in my password manager, it can’t fill in single characters this way.</p>\n  </li>\n</ol>\n\n<p>All of these passwords are long, alphanumeric, and unique.</p>\n\n<p>I have a regular calendar reminder to review them, and make sure I still remember them correctly.\nThis would be a useful feature in a password manager – periodic tests on whether you still remember important passwords.</p>\n\n<h2 id=\"where-are-these-passwords-stored\">Where are these passwords stored?</h2>\n\n<p>Although I’ve memorised all eight passwords, there are some copies elsewhere.</p>\n\n<p>Five of them are stored in my password manager, because it’s convenient: my computer’s login password, my phone’s login passcode, my email password, my remote backup password, and my Apple account password.\n(My email and Apple account are protected by multi-factor authentication, and the codes aren’t in my password manager.)</p>\n\n<p>Two of them aren’t written down anywhere, but they might be soon: the master password for my password manager, and the encryption password for my MFA recovery codes.\nAt some point I’d like to change this, probably with a paper copy in a fire safe or similar.\nThis would allow my family to retrieve those passwords in an emergency.</p>\n\n<p>The “memorable word” for my online banking isn’t written down anywhere, and I doubt it ever will be.\nIf I lose access to my bank account and I’m really stuck, I can visit a physical branch.</p>\n\n<h2 id=\"how-would-i-regain-access-to-my-accounts\">How would I regain access to my accounts?</h2>\n\n<p>Here’s how I’d get back into my key accounts:</p>\n\n<ul>\n  <li>\n    <p><strong>Remote backups.</strong>\nMy Backblaze account is only protected with a password, not MFA.\nI have this memorised, so I could download files from my remote backups on any device.</p>\n  </li>\n  <li>\n    <p><strong>MFA recovery codes.</strong>\nThese are in an encrypted disk image in my remote backups.\nI’ve memorised the disk image password, so I could retrieve my MFA codes once I get to my remote backups.</p>\n  </li>\n  <li>\n    <p><strong>Email inbox.</strong>\nThis is protected by a password and MFA.\nI’ve memorised the password, and I could use an MFA recovery code to regain access to the account.</p>\n  </li>\n  <li>\n    <p><strong>Password manager.</strong>\n I use 1Password.\nLogging in on a new device needs two secrets: my Master Password and <a href=\"https://support.1password.com/secret-key/\">Secret Key</a>.</p>\n\n    <p>I remember the former, but the latter is a random UUID I don’t type in or see regularly.\nInstead, I have a 1Password <a href=\"https://support.1password.com/emergency-kit/\">Emergency Kit</a> which includes my Secret Key (but not my Master Password).\nI have a printed copy of this kit in my folder of important papers, and a digital copy in my disk image of MFA recovery codes.</p>\n\n    <p>If I can get a copy of the Emergency Kit, I can regain access to my password manager.</p>\n  </li>\n</ul>\n\n<h2 id=\"what-passwords-dont-i-remember\">What passwords don’t I remember?</h2>\n\n<p>There are a couple of important passwords you might expect me to memorise, but I don’t:</p>\n\n<ol>\n  <li>\n    <p><strong>The email password for my work email.</strong>\nThis password is stored in the password manager I use at work, and if I unexpectedly lost access, I’d contact the IT team for help.\nI don’t need self-service recovery for this account.</p>\n  </li>\n  <li>\n    <p><strong>The master password for my password manager at work.</strong>\nFor similar reasons to work email, I’d rely on the IT team to regain access in an emergency.</p>\n  </li>\n  <li>\n    <p><strong>My banking app username or password password.</strong>\nLogging into my bank requires three values: my username, the full-length password, and the “memorable information”.\nI’ve memorised the memorable information, but not the username or password.\nIf I need emergency access to my bank account, I can visit a high street branch.</p>\n  </li>\n</ol>\n\n<h2 id=\"what-scenario-am-i-trying-to-prevent\">What scenario am I trying to prevent?</h2>\n\n<p>Imagine you lost all of your devices.\nCould you regain access to your digital life?\nThat’s my worst-case scenario that I’m trying to avoid, and these memorised passwords should be enough to bootstrap everything.</p>\n\n<p>I can retrieve my MFA recovery codes from my remote backups, and then I can either log into my password manager and retrieve the current passwords, or log into my email inbox and reset all my passwords.\nEither way, I’m back into my accounts.</p>\n\n<p>This doesn’t cover the scenario where I lose access to both my email inbox and my password manager, but that would be a catastrophic digital disaster.</p>\n\n<p>It also doesn’t cover the scenario where I’m incapacitated and a family member needs emergency access to my digital accounts.\nThat’s something I’m planning to fix this year.\nMy plan is to purchase a fire safe that somebody else can open, in which I’d place printed instructions for access my password manager.\nInside my password manager, I’ll have a note that explains what the key accounts are, which I can update regularly without reopening the safe.</p>\n\n<p>I hope I can continue to rely on my password manager, and I never encounter one of these emergency scenarios – but I feel better knowing I’ve tried to prepare.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2026/memorised-passwords/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2026/memorised-passwords/?ref=rss",
            "publishedAt": "2026-01-10",
            "source": "Alex Chan",
            "summary": "Password managers promise you only need to remember one password, but I keep eight of them in my head to avoid a single point of failure.",
            "title": "The passwords I actually memorise"
        },
        {
            "content": [
                "<p>When I read advice about passwords and online accounts, it usually goes something like this:</p>\n\n<ol>\n  <li>Create unique passwords for each account, and store them in a password manager.</li>\n  <li>Enable <a href=\"https://en.wikipedia.org/wiki/Multi-factor_authentication\">multi-factor authentication (MFA)</a>, and use an authenticator app or hardware token as your second factor.</li>\n</ol>\n\n<p>But enabling MFA isn’t everything – what if you lose access to that second factor?\nFor example, I store my MFA codes in an app on my phone.\nWhat happens if my phone is broken or stolen?</p>\n\n<p>Most services that support MFA give me a set of recovery codes I can use in an emergency to regain access to my account, but don’t explain what to do with them.\nI’m advised to “store them securely”, but what does that mean in practice?</p>\n\n<p>I don’t want to store my recovery codes in my password manager, because that compresses multiple authentication factors back into one.\nSomebody who compromised my password manager would have access to everything.\n(That’s the same reason I don’t store my MFA codes in there.)</p>\n\n<p>Instead, I have an encrypted disk image on my Mac, which I created using Disk Utility.\nThe password is a long, unique password that I only use for this purpose, and I only keep the disk image mounted when I’m editing or using a recovery code.</p>\n\n<p>This disk image contains two files:</p>\n\n<ul>\n  <li>My 1Password <a href=\"https://support.1password.com/emergency-kit/\">Emergency Kit</a>, a PDF document that contains the details for my 1Password account – including a secret key that I don’t see or type on a day-to-day basis</li>\n  <li>An HTML file I write by hand, which has all my MFA recovery codes and notes on when I created them</li>\n</ul>\n\n<p>Here’s what the HTML file looks like (with fake data, obviously):</p>\n\n<source type=\"image/png\" /><img alt=\"A page with a couple of sections (headed 'Apple Account', 'Etsy', 'GitHub'). In each section is a bit of explanatory text, about when I saved the recovery codes and what account they're for, then the recovery codes in a monospaced font.\" class=\"screenshot\" src=\"https://alexwlchan.net/images/2026/recovery_codes_1x.png\" width=\"600\" />\n\n\n<p>You can <a href=\"https://alexwlchan.net/files/2026/recovery_codes.html\">download the HTML file</a> I use as a template.</p>\n\n<p>When I need to save some new recovery codes, I mount the disk image, edit the HTML file, then eject the disk image.\nWhen I need to use a recovery code, I mount the disk image, copy a code out of the HTML file, make a note that I’ve used it, then eject the disk image.\nThis is a plain text file that’s not dependent on proprietary software or cloud services.</p>\n\n<p>I have a second disk image on my work laptop, with a similar file, where I store recovery codes related to my work accounts.</p>\n\n<p>A malicious program could theoretically read the HTML file while the disk image is mounted, so I try to keep it mounted as little as possible.\nBut if a malicious program had long-running access to arbitrary files on my Mac, it can do more damage than just reading my recovery codes.</p>\n\n<p>This setup assumes I’ll always have access to this disk image, which is why I have offsite backups that include it (in encrypted form, of course).\nI’ve memorised the password for my offsite backups, which gives me a clear recovery path if I lose my phone and all my home devices:</p>\n\n<ol>\n  <li>Log into my offsite backup</li>\n  <li>Download the encrypted disk image</li>\n  <li>Mount the disk image</li>\n  <li>Retrieve my 1Password Secret Key and MFA recovery codes</li>\n</ol>\n\n<p>From there, I can get access to everything in my digital life.</p>\n\n<p>Later this year, I plan to get a fire safe where I can store important documents, and a paper copy of these codes will definitely be in there.\nThat’s why I include dates in the notes, and the current date at the top of the file – that way, I can see if the printed version is up-to-date.</p>\n\n<p>I’m fortunate that I’ve never had to use this system in a real emergency – and helpful as it could be, let’s hope I never have to.</p>\n\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2026/recovery-codes/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2026/recovery-codes/?ref=rss",
            "publishedAt": "2026-01-10",
            "source": "Alex Chan",
            "summary": "Most services give you MFA recovery codes but don't tell you where to store them. I use an encrypted disk image and a simple HTML file.",
            "title": "Where I store my multi-factor recovery codes"
        },
        {
            "content": [
                "<p>Claude Code has systematically begun to consume many of the SaaS apps I used to (or plan to) pay for.</p><p>Why pay a subscription when I can \"vibe code\" a personal MVP in twenty minutes? I don&#8217;t worry about maintenance or vendor lock-in because, frankly, the code is disposable. If I need a new feature tomorrow, I don&#8217;t refactor&#8212;I just rebuild it.<a class=\"footnote-anchor\" href=\"https://blog.sshh.io/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a></p><p><strong>Code is becoming just an ephemeral cache of my intent. </strong></p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!iXVk!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fec6cb8b0-21c1-448a-981d-bd653be24e4e_1024x559.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"337.365234375\" src=\"https://substackcdn.com/image/fetch/$s_!iXVk!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fec6cb8b0-21c1-448a-981d-bd653be24e4e_1024x559.jpeg\" width=\"618\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">Cartoon via Nano Banana.</figcaption></figure></div><p>In this model, the &#8216;Source Code&#8217; is the prompt and the context; the actual Python or Javascript that executes is just the binary. We still run the code because it&#8217;s thermodynamically efficient and deterministic, but we treat it as disposable. If the behavior needs to change, we don&#8217;t refactor the binary; we re-compile the intent.</p><p>This shift has made me intolerant of static interfaces. I have stopped caring about software that doesn&#8217;t let me dump massive amounts of context into Gemini or Claude to <em>just do the thing</em>. If a product forces me to click buttons to execute a process that an LLM could intuit from a prompt, that product is already legacy.</p><p>It forces us to question the permanence of the current model. We often make the mistake of assuming software&#8212;as we know it today&#8212;is a permanent fixture of human productivity. But if you zoom out, the era of SaaS is a blink of an eye in modern history. It is easy to overestimate how core it is to the future.</p><p>In this post, I want to extrapolate these thoughts a bit and write out what could be the final stages of software.</p><div class=\"subscription-widget-wrap-editor\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading Shrivu&#8217;s Substack! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input class=\"email-input\" name=\"email\" tabindex=\"-1\" type=\"email\" /><input class=\"button primary\" type=\"submit\" value=\"Subscribe\" /><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div><h2>Software Evolution</h2><p>The stages here might not necessarily be chronological or mutually exclusive. Instead, they are ordered from static to dynamic code generation &#8212; where more and more the <em>intent</em> of a customer is the software they use.</p><h3>Stage 1. Traditional SaaS</h3><p>This is the baseline where software is a static artifact sold as a service, built on the assumption that user problems are repetitive and predictable enough to be solved by rigid workflows. To the consumer, this looks like dashboards, CRUD forms, and hardcoded automations. The intelligence here is sourced mainly from the SaaS founder and hired domain experts, hard-coded into business logic years before the user ever logs in.</p><ul><li><p><strong>When:</strong> We recognized that distributing software via the cloud was more efficient than on-premise installations.</p></li><li><p><strong>Value Loop:</strong> Customer Problem &#8594; Product Manager writes PRD &#8594; Engineers write Static Code &#8594; Deploy &#8594; Customer adapts their workflow to the tool. <strong>(Time: Months to Years | Fit: Generic / One-size-fits-none)</strong></p></li></ul><h3>Stage 2. FDEs and AI Builders</h3><p>We are seeing this now with companies adopting the <a href=\"https://builders.ramp.com/post/forward-deployed-engineering\">Forward Deployed Engineering (FDE)</a>. In this stage, the SaaS company hires humans to manually use AI to build bespoke solutions for the client. For the consumer, this feels like a concierge service; they don&#8217;t get a login to a generic tool, they get a custom-built outcome delivered by a human who used AI to write the glue code. The intelligence is hybrid: the human provides the architecture, the AI writes the implementation code in weeks to days.</p><ul><li><p><strong>When:</strong> Companies realize AI allows their employees to build custom apps for clients faster than the clients can learn or adapt a generic tool.</p></li><li><p><strong>Value Loop:</strong> Customer Problem &#8594; SaaS Employee (FDE) Prompts AI &#8594; AI generates Custom Script/App &#8594; Employee Deploys for Customer. <strong>(Time: Days | Fit: High / Tailored to specific customer edge cases)</strong></p></li></ul><h3>Stage 3. AI Features (Product is Platform/Interface)</h3><p>This is the current &#8220;safe space&#8221; for most tech companies, where they bolt an LLM onto an existing application to handle unstructured data. Consumers experience this as a &#8220;Draft Email&#8221; button in their CRM or a &#8220;Chat&#8221; sidebar in their UI&#8212;the platform is still the main product, but AI is a feature that (hopefully) reduces friction and/or provides some extra functionality customization<a class=\"footnote-anchor\" href=\"https://blog.sshh.io/feed#footnote-2\" id=\"footnote-anchor-2\" target=\"_self\">2</a>. The intelligence comes from a constrained model of product design and LLM scaffolding, providing content within a structure still strictly dictated by the SaaS platform&#8217;s code.</p><ul><li><p><strong>When:</strong> People start to see AI is good at summarizing, generating content, or taking actions within existing workflows.</p></li><li><p><strong>Value Loop:</strong> Customer Problem &#8594; Static SaaS Interface AI Feature Text Box &#8594; Stochastic Result &#8594; Human Review. <strong>(Time: Minutes | Fit: Medium / Constrained by the platform&#8217;s UI)</strong></p></li></ul><h3>Stage 4. AI Products (Product is Data/Context)</h3><p>This is the tipping point where the software interface starts to disappear because the &#8220;interface&#8221; was just a way to collect context that the model can now ingest directly. Consumers move to a &#8220;Do this for me&#8221; interface where intent maps directly to an outcome rather than a button click, often realized as an agent calling a database or <a href=\"https://modelcontextprotocol.io/\">MCP servers</a><a class=\"footnote-anchor\" href=\"https://blog.sshh.io/feed#footnote-3\" id=\"footnote-anchor-3\" target=\"_self\">3</a>. The intelligence is the model and it&#8217;s engineered input context, relegating the SaaS role to in some sense providing clean proprietary data via an agent friendly interface. Software as a Service <em>for Agents</em>.</p><ul><li><p><strong>When:</strong> People start to see AI is good at orchestrating complex decisions and using tools&#8212;across SaaS platforms&#8212;autonomously.</p></li><li><p><strong>Value Loop:</strong> Customer Problem (Prompt as ~PRD) &#8594; Runtime Code Generation &#8594; Dynamic Outcome. <strong>(Time: Real-time | Fit: Very High / Dynamically generated for the specific context)</strong></p></li></ul><p>Critically, this doesn't mean the LLM acts as the CPU for every single user interaction (which would be latency-poor and energy-inefficient). Instead, the model almost acts as a Just-In-Time compiler. It generates the necessary code to execute the user&#8217;s intent, runs that code for the session, and then potentially discards it</p><h3>Stage 5. AI Training Environments</h3><p>This is the end game in some cases. If code is just a cache for intent, eventually we bypass the cache and bake the intuition directly into the model. To the consumer, the &#8220;tool&#8221; is invisible; the expert system simply exists and provides answers or actions without a login or workflow. The intelligence is in the model itself; the software platform exists solely as a distillation mechanism&#8212;a gym to train the vertical AI&#8212;and once the model learns the domain, the software is no longer needed. A company in this stage is not really even SaaS anymore, maybe more so a <em>AI-gyms-aaS</em> company.</p><ul><li><p><strong>When:</strong> People start to see AI is good at absorbing the entire vertical&#8217;s intuition.</p></li><li><p><strong>Value Loop:</strong> Raw Domain Data &#8594; Reinforcement Learning / Fine-Tuning &#8594; Model Weights. <strong>(Time: Instant / Pre-computed | Fit: Very High / Intuitive domain mastery)</strong></p></li></ul><p>This might feel unintuitive as a stage &#8212; like how could you bake some proprietary data lake into a model? How can our juicy data not be the moat? My conclusion is that most (but not all) data is a transformation of rawer upstream inputs and that these transformation (data pipelines, cross-tenant analysis, human research, etc.) are all &#8220;cache&#8221; that can be distilled into a more general model that operates on its intuition and upstream platform inputs.</p><h3>Rebuttals</h3><p><strong>&#8220;But can agents run a bank?&#8221;</strong> Reliability and safety comes down to distinguishing between guardrails (deterministic interfaces and scaffolding) and runtime execution (LLM code). For now, you don&#8217;t let the LLM invent the concept of a transaction ledger or rewrite the core banking loop on the fly. In XX years, maybe we do trust AI to write core transaction logic after all fail-able humans wrote the code for most mission critical software that exists today. The line between human-defined determinism and agent symbolic interfaces will gradually move of time. </p><p><strong>&#8220;But enterprise SaaS is actually super complex.&#8221;</strong> Yes, but that complexity is mostly just unresolved ambiguity. Your &#8220;deep enterprise understanding&#8221; is often a collection of thousands of edge cases&#8212;permissions, policy exceptions, region-specific rules&#8212;that humans had to manually hard-code into IF/ELSE statements over a decade. Distilled to the core, this complexity collapses. The model doesn&#8217;t need 500 hard-coded features; it needs the raw data and the intent. An app built for one can also make a lot of simplifications compared to one that acts as a platform.</p><p><strong>&#8220;Customers don&#8217;t want to prompt features.&#8221;</strong> I agree. I don&#8217;t think the future looks like a chatbot. &#8220;Chat&#8221; is a skeuomorphic bridge we use because we haven&#8217;t figured out the consistent native interface yet. It might be a UI that pre-emptively changes based on your role, or it might feel like hiring a really competent employee who just &#8220;takes care of it&#8221; without you needing to specify the <code>how</code>. Or, as we see in Stage 2, the user never prompts at all&#8212;an FDE does it for them, and the user just gets a bespoke app that works perfectly.</p><h2>Is SaaS Dead?</h2><p>Stage 1, where most companies are stuck today, definitely is.</p><p>Why? Because the sheer overhead of traditional SaaS&#8212;the learning curve, the rigid workflows, the \"click tax\" to get work done&#8212;is becoming unacceptable in a world where intent can be executed directly. It feels increasingly archaic when flexible solutions can be generated on demand.</p><p>The value is moving away from the workflow logic itself and toward two specific layers that sandwich it:</p><ol><li><p><strong>The Data Layer:</strong> Proprietary data, trust, and the &#8220;agentic scaffolding&#8221; that allows models to act safely within your domain. </p></li><li><p><strong>The Presentation Layer:</strong> Brand and UI. While I suspect trying to control the presentation layer long-term is futile (as users will eventually bring their own &#8220;interface agents&#8221; to interact with your data), for now, it remains a differentiator.</p></li></ol><p>We are going to see companies move through these tiers. The winners IMO will be the ones who realize that the \"Service\" part of SaaS is being replaced by model intelligence. The SaaS that remains will be the infrastructure of truth and the engine of agency.</p><h2>Conclusion</h2><p>We are transitioning from a world of static artifacts (code that persists for years) to dynamic generations (code that exists for milliseconds or for a single answer).</p><p>Of course, I could be wrong. Maybe AI capability plateaus before it can fully integrate into complex verticals. Maybe traditional SaaS holds the line at Stage 2 or 3, protecting its moat through sheer inertia. Maybe the world ends up more decentralized.</p><p>Some of my open questions:</p><ul><li><p><strong>Which stage should you work on today?</strong> Is there alpha in skipping straight to Stage 4, or do you need to build the Stage 2 &#8220;vibe coding&#8221; service to bootstrap for now?</p></li><li><p><strong>What are the interfaces of the future?</strong> Is it MCP, curated compute sandboxes, or a yet-to-be-defined agent-to-agent-to-human protocol? What interface wins out or does each company or consumer bring their own agentic worker?</p></li><li><p><strong>How fast does this happen?</strong> Are we looking at a multi-decade-long transition, or do companies today rapidly start dropping lower stage SaaS tools?</p></li><li><p><strong>Does AI have a similar impact beyond software?</strong> does medicine move from &#8220;static protocols&#8221; to &#8220;on-demand, patient-specific treatments&#8221;?</p></li></ul><div class=\"subscription-widget-wrap-editor\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading Shrivu&#8217;s Substack! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input class=\"email-input\" name=\"email\" tabindex=\"-1\" type=\"email\" /><input class=\"button primary\" type=\"submit\" value=\"Subscribe\" /><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://blog.sshh.io/feed#footnote-anchor-1\" id=\"footnote-1\" target=\"_self\">1</a><div class=\"footnote-content\"><p>Even more so than me you can see Geoffrey Huntley&#8217;s <a href=\"https://x.com/GeoffreyHuntley/status/2009927487925694830\">ralph-powered rampage of GitHub and many other tools</a>.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://blog.sshh.io/feed#footnote-anchor-2\" id=\"footnote-2\" target=\"_self\">2</a><div class=\"footnote-content\"><p>I liked this tweet by Harj Taggar, <a href=\"https://x.com/harjtaggar/status/1986487708890636585\">&#8220;moved away from the FDE playbook that&#8217;s become the default for fast growing AI startups. Instead they&#8217;ve built AI to covert plain English from the customer into Python code to make the product work for their use cases&#8221;</a>.</p></div></div><div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://blog.sshh.io/feed#footnote-anchor-3\" id=\"footnote-3\" target=\"_self\">3</a><div class=\"footnote-content\"><p>Similar to Karpathy&#8217;s <a href=\"https://x.com/karpathy/status/1707437820045062561?lang=en\">&#8220;LLMs not as a chatbot, but the kernel process of a new Operating System&#8221;</a> (2023)</p><p></p></div></div>"
            ],
            "link": "https://blog.sshh.io/p/most-code-is-just-cache",
            "publishedAt": "2026-01-10",
            "source": "Shrivu Shankar",
            "summary": "<p>Claude Code has systematically begun to consume many of the SaaS apps I used to (or plan to) pay for.</p><p>Why pay a subscription when I can \"vibe code\" a personal MVP in twenty minutes? I don&#8217;t worry about maintenance or vendor lock-in because, frankly, the code is disposable. If I need a new feature tomorrow, I don&#8217;t refactor&#8212;I just rebuild it.<a class=\"footnote-anchor\" href=\"https://blog.sshh.io/feed#footnote-1\" id=\"footnote-anchor-1\" target=\"_self\">1</a></p><p><strong>Code is becoming just an ephemeral cache of my intent. </strong></p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!iXVk!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fec6cb8b0-21c1-448a-981d-bd653be24e4e_1024x559.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"337.365234375\" src=\"https://substackcdn.com/image/fetch/$s_!iXVk!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fec6cb8b0-21c1-448a-981d-bd653be24e4e_1024x559.jpeg\" width=\"618\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">Cartoon via Nano Banana.</figcaption></figure></div><p>In this model, the &#8216;Source Code&#8217; is the",
            "title": "Most Code is Just Cache"
        },
        {
            "content": [],
            "link": "https://lethain.com/sharing-claude-transcripts/",
            "publishedAt": "2026-01-10",
            "source": "Will Larson",
            "summary": "<p>One of my central premises for supporting <a href=\"https://lethain.com/company-ai-adoption/\">internal adoption of LLMs</a> is that adoption depends on easy discovery of what&rsquo;s possible and what&rsquo;s good. That is why our internal prompts driving agents are stored in a shared Notion database, but it also begged the question: our most advanced prompting and interactions are happening in Claude Code, which are hard to see.</p> <p>Thankfully, Simon Willison previously wrote <a href=\"https://simonwillison.net/2025/Dec/25/claude-code-transcripts/\">a tool to extract transcripts from Claude Code</a> called <a href=\"https://github.com/simonw/claude-code-transcripts\"><code>claude-code-transcripts</code></a>, which we were able to wire together into an internal repository of Claude Code sessions and a viewer on Cloudflare pages (and behind Cloudflare authentication into our SSO).</p> <p>There are three components here. First, an index of all the pages.</p> <div class=\"ba b--light-gray\"> <p><img alt=\"Claude Sessions index showing transcript archive with contributors and sessions\" src=\"https://lethain.com/static/blog/2026/claude-sessions-index.png\" /></p> </div> <p>That page links into the transcripts generated by Simon&rsquo;s tool.</p> <div class=\"ba b--light-gray\"> <p><img alt=\"Claude Code transcript detail view showing prompts, messages, and tool calls\" src=\"https://lethain.com/static/blog/2026/claude-transcript-detail.png\" /></p> </div> <p>Finally, we have an internal CLI named <code>imp</code> that is available on every laptop, which now has an additional tool <code>imp claude share-session</code> that will open <code>claude-code-transcripts</code>, allow you to select a session of choice, and",
            "title": "Sharing Claude transcripts."
        },
        {
            "content": [],
            "link": "https://lethain.com/newsletter-mailchimp-to-buttondown/",
            "publishedAt": "2026-01-10",
            "source": "Will Larson",
            "summary": "<p>In preparation for the release of <em>An Elegant Puzzle</em>, I set up the page to <a href=\"https://lethain.com/newsletter/\">subscribe to my newsletter on January 20th, 2019</a>, heavily inspired by <a href=\"https://jvns.ca/blog/2017/12/28/making-a-weekly-newsletter/\">Julia Evans&rsquo;s approach</a>. I didn&rsquo;t know anything about releasing a book, but <a href=\"https://www.briewolfson.com/\">Brie Wolfson</a> coached me through it, and having a newsletter to tell folks about the book seemed like a good idea. My blog had already had an RSS feed for ~12 years at that point, but RSS usage has steadily declined since the golden era of the 2000s.</p> <p>Following Julia&rsquo;s post, I set up my newsletter to run on Mailchimp, and that has mostly worked well for me over the following six years. (Looking at Julia&rsquo;s website, it looks like she subsequently moved to Convertkit at some point.) However, over time I kept running into issues with Mailchimp. Those frustrations slowly mounted:</p> <ol> <li>I could not find the &ldquo;welcome to this newsletter&rdquo; template to change the recommended posts. I think this might have been related to them rewriting their UX entirely at some point, but I didn&rsquo;t really want to become a Mailchimp expert just to update this</li> <li>Every time I changed jobs, someone would tell me that I",
            "title": "Moved newsletter from Mailchimp to Buttondown."
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-10"
}