{
    "articles": [
        {
            "content": [],
            "link": "https://olano.dev/blog/stranger-things",
            "publishedAt": "2026-01-02",
            "source": "Facundo Olano",
            "summary": "Stranger Things es un artefacto de su tiempo, nos habla menos de los ‘80 y los ‘90 que de la sensibilidad estética que teníamos en el 2016. El estertor de un orden que empezó con la caída del muro de Berlín y se terminó con el Covid.",
            "title": "Contenido derivativo sobre Stranger Things"
        },
        {
            "content": [
                "<p>I entered the new year holding an inconsolable, shrieking baby while London set off an armageddon of fireworks around us. So goes parenthood. The baby is fine, just congested and teething. I am as “fine” as anyone can be after months of chronic sickness, broken sleep, and parental troubleshooting. I am very tired and full of stoic perspective, but still savouring the baby babble sounds, tiny fingers on my face, and three-teeth grins. I'm certain I'll soon yearn for these early morning hours, curled up with a tiny, snoring infant on my chest.</p>\n<p>Parenthood is a predictable source of exhaustion. But there's a second, far less expected source in my life right now. And it doesn't come with a cornucopia of adorable noises to take the edge off.</p>\n<p><strong>Agents</strong>. AI agents are all I can see, read, build, and think about. Coding agents. Research agents. Planning agents. Sub-agents. Multi-agent swarms. Orchestrator agents. Agentic memory. Agentic context management.</p>\n<p>This immersion is almost entirely voluntary and specific to my situation. I started a new job at <a href=\"https://githubnext.com/\">Github Next</a> at the beginning of October; a team tasked with researching and building the next generation of tools for software developers. Which at this point in history unquestionably means agents.</p>\n<p>It's hard to think of historical parallels where a field changed this rapidly in such an unrelenting and distributed way. Even Andrej Karpathy <a href=\"https://x.com/karpathy/status/2004607146781278521?s=20\">feels behind</a></p>\n<p>I am not trying to add to the hype and FOMO here. Only to be honest about what it feels like inside my particular information bubble. I am becoming a product of my X feed, which is unintentionally finely tuned to show an infinite stream of developer-flavoured AI panic anxiety that looks something like this:</p>\n<p>You might suggest that I spend less time on X, but I'm not inclined to look away just as the train gets up to full speed. Sure it's a distorted reality, but it points to real ground truth: even if progress on language models slows this year, we are still far behind in using what already exists to reshape software design and engineering.</p>\n<p>To be clear, I am tired, but thrilled by the capabilities overhang. No one has the full context of what is happening around us. Pick any piece of it to work on in earnest and you'll find bushels of low hanging fruit.</p>\n<p>I am not a resolutions person, but it's hard to enter a new year without stopping to take stock and strategise a bit. My policy for the first year of my kid's life is that I get a free pass at everything; eating too many chocolate Hobnobs? Free pass. Not reading enough books? Free pass. Haven't cleared out that pile of crap in the hallway? Free pass. This excuses me from most new-years-shaped personal improvement goals.</p>\n<p>But the one thing I've lost over the last nine months that I urgently need to find again is my belief that anything I write matters. It's been hard to know what to say with a landscape changing this fast. It's hard to gather my thoughts in a resource depleted state. It's hard to believe my opinions have any legitimacy compared to the people working inside the foundation labs, while I scramble together information in between 3am feeds and nursery runs. I've lost a little of my confidence as a researcher and contributor to The Discourse. My intention for this year is to take my own advice and pick some low hanging fruit.</p>"
            ],
            "link": "https://maggieappleton.com/now-2026-01/",
            "publishedAt": "2026-01-02",
            "source": "Maggie Appleton",
            "summary": "<p>I entered the new year holding an inconsolable, shrieking baby while London set off an armageddon of fireworks around us. So goes parenthood. The baby is fine, just congested and teething. I am as “fine” as anyone can be after months of chronic sickness, broken sleep, and parental troubleshooting. I am very tired and full of stoic perspective, but still savouring the baby babble sounds, tiny fingers on my face, and three-teeth grins. I'm certain I'll soon yearn for these early morning hours, curled up with a tiny, snoring infant on my chest.</p> <p>Parenthood is a predictable source of exhaustion. But there's a second, far less expected source in my life right now. And it doesn't come with a cornucopia of adorable noises to take the edge off.</p> <p><strong>Agents</strong>. AI agents are all I can see, read, build, and think about. Coding agents. Research agents. Planning agents. Sub-agents. Multi-agent swarms. Orchestrator agents. Agentic memory. Agentic context management.</p> <p>This immersion is almost entirely voluntary and specific to my situation. I started a new job at <a href=\"https://githubnext.com/\">Github Next</a> at the beginning of October; a team tasked with researching and building the next generation of tools for software developers. Which at this",
            "title": "January 2026"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2026/01/02/style/modern-love-my-mother-and-fathers-long-happy-gay-marriage.html",
            "publishedAt": "2026-01-02",
            "source": "Modern Love - NYT",
            "summary": "It took my mother getting Alzheimer’s for my siblings and me to learn the truth about our family and childhood.",
            "title": "My Mother’s Last, Best Gift Was an Astonishing Secret"
        },
        {
            "content": [
                "<p>\n          <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-4145\">\n              Read more\n          </a>\n      </p>"
            ],
            "link": "https://www.astralcodexten.com/p/hidden-open-thread-4145",
            "publishedAt": "2026-01-02",
            "source": "SlateStarCodex",
            "summary": "<p> <a href=\"https://www.astralcodexten.com/p/hidden-open-thread-4145\"> Read more </a> </p>",
            "title": "Hidden Open Thread 414.5"
        },
        {
            "content": [
                "<p>If you&#8217;re not familiar with &#8220;X years to escape the permanent underclass&#8221;, see <a href=\"https://www.newyorker.com/culture/infinite-scroll/will-ai-trap-you-in-the-permanent-underclass\">the New Yorker here</a>, or the <a href=\"https://www.nosetgauge.com/p/capital-agi-and-human-ambition\">Laine</a>, <a href=\"https://philosophybear.substack.com/p/capitalist-strategy-when-capital\">Bear</a>, and <a href=\"https://philiptrammell.substack.com/p/capital-in-the-22nd-century\">Trammell/Dwarkesh</a> articles that inspired it.</p><p>The &#8220;permanent underclass&#8221; meme isn&#8217;t being spread by poor people - who are already part of the underclass, and generally not worrying too much about its permanence. It&#8217;s preying on neurotic well-off people in Silicon Valley, who fret about how they&#8217;re just <em>bourgeois</em> well-off rather than <em>future oligarch</em> well-off, and that only the true oligarchs will have a good time after the Singularity.</p><p>Between the vast ocean of total annihilation and the vast continent of infinite post-scarcity, there is, I admit, a tiny shoreline of possibilities that end in oligarch capture. Even if you end up there, you&#8217;ll be fine. Dario Amodei has taken the Giving What We Can Pledge (<a href=\"https://www.givingwhatwecan.org/about-us/members#lifetime-members-section\">#43 here</a>) to give 10% of his wealth to the less fortunate; your worst-case scenario is owning a terraformed moon in one of his galaxies. Now you can stop worrying about the permanent underclass and focus on more important things.</p><p>On that tiny shoreline of possible worlds, the ones where the next few years are your last chance to become rich, they&#8217;re also your last chance to make a mark on the world (proof: if you could change the world, you could find a way to make people pay you to do it, or to not do it, then become rich). And what a chance! The last few years of the human era will be wild. They&#8217;ll be like classical Greece and Rome: a sudden opening up of new possibilities, where the first people to take them will be remembered for millennia to come. What a waste of the privilege of living in Classical Athens to try to become the richest olive merchant or whatever. Even in Roman times, trying to become Crassus would be, well, crass. </p><p>In 2014, I wrote <a href=\"https://slatestarcodex.com/2014/10/20/in-the-future-everyone-will-be-famous-to-fifteen-people/\">In The Future Everyone Will Be Famous To Fifteen People</a>. The argument was: suppose humanity ends up occupying millions of galaxies. People will still remember Earth as a special time. The mountainous mass of future historians will press down upon a tiny speck of current people. There&#8217;s no reason the colony ships won&#8217;t contain flash-drives of the whole 2026-era Internet, so, rather than being limited to a few prominent figures, these historians can study the generation around the Singularity almost in its entirely.</p><p>In such a situation, greatness is pathetically easy. A random woman gave Jesus a washcloth to wipe his face on the way to his crucifixion. She is now known as St. Veronica, patroness of laundry workers, and one out of every 2,500 girls in America is named in her honor. She has an annual feast day, approximately one million beautiful Renaissance paintings, a chapel in Jerusalem, and lesser churches all around the world (including one here in San Francisco). The richest olive merchant in Jerusalem that year is long forgotten, but she endures.</p><p>St. Veronica isn&#8217;t unusual in her charity: any one of us might lend a rag to a person in need. She&#8217;s special because she happened to commit her random act of kindness at the crucial - fine, pun <em>sort of</em> intended - moment of religious history, when a tiny speck of recorded happenings must support trillions of person-years of later adoration. If you worry about the &#8220;permanent underclass&#8221; meme, then you already believe we&#8217;re not <em>not</em> at another crucial moment. I&#8217;m not asking you to give up your dreams of owning a bigger moon than everyone else in order to chase a tiny chance of becoming the future&#8217;s equivalent of Jesus. I&#8217;m suggesting you give them up in order to offer the future a washcloth, and see if it honors your memory.</p><p>You have only X years to escape being permanently boring when the weight of galactic humanity descends to scrutinize your life forever. Ten million years from now, do you want transhuman intelligences on a Niven Ring somewhere in Dario Amodei&#8217;s supercluster to briefly focus their deific gaze on your legacy and think &#8220;Yeah, he spent the whole hinge of history making B2B SAAS products because he was afraid of &#8216;joining the permanent underclass&#8217;, now he has a moon 20% bigger than the rest of us?&#8221; Or do you want them to think &#8220;She was one of the heroes who arose when the fate of humanity balanced on a knife&#8217;s edge, fought against the thousand forms of entropy that could have ended our paradise before it began, helped create a vision of broad-based prosperity that benefitted all humanity, and gets 0.000038501% of the credit for our current happy state. We grant her the rank of Forebear, and the Ancestor Veneration And Simulation Collective has built a megacathedral to her memory three star systems over&#8221;?</p><p>I&#8217;m not trying to push you in any direction, honest. If you get everything totally wrong, too bad, but you&#8217;ll still be remembered forever for trying. Even Pontius Pilate has immortality of a sort. Both Eliezer Yudkowsky and Beff Jezos have their page in the textbooks assured. If you&#8217;re a well-off Silicon Valley person, you&#8217;re already well-placed to join them. So participate in the discourse. Create some art. Donate to a cause you believe in. Make a prediction. Discover something interesting. </p><p>Have more fun than anyone has ever had before - after all, history remembers Aristippus! Start a cool group house - after all, history remembers Epicurus! Be extremely hot - history remembers Antinous too! Sell people the lowest-quality copper that has ever been sold, and live forever as a meme six thousand years later!</p><p>But don&#8217;t waste this amazing opportunity you&#8217;ve been given on a vapid attempt to &#8220;escape the permanent underclass&#8221;.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/you-have-only-x-years-to-escape-permanent",
            "publishedAt": "2026-01-02",
            "source": "SlateStarCodex",
            "summary": "<p>If you&#8217;re not familiar with &#8220;X years to escape the permanent underclass&#8221;, see <a href=\"https://www.newyorker.com/culture/infinite-scroll/will-ai-trap-you-in-the-permanent-underclass\">the New Yorker here</a>, or the <a href=\"https://www.nosetgauge.com/p/capital-agi-and-human-ambition\">Laine</a>, <a href=\"https://philosophybear.substack.com/p/capitalist-strategy-when-capital\">Bear</a>, and <a href=\"https://philiptrammell.substack.com/p/capital-in-the-22nd-century\">Trammell/Dwarkesh</a> articles that inspired it.</p><p>The &#8220;permanent underclass&#8221; meme isn&#8217;t being spread by poor people - who are already part of the underclass, and generally not worrying too much about its permanence. It&#8217;s preying on neurotic well-off people in Silicon Valley, who fret about how they&#8217;re just <em>bourgeois</em> well-off rather than <em>future oligarch</em> well-off, and that only the true oligarchs will have a good time after the Singularity.</p><p>Between the vast ocean of total annihilation and the vast continent of infinite post-scarcity, there is, I admit, a tiny shoreline of possibilities that end in oligarch capture. Even if you end up there, you&#8217;ll be fine. Dario Amodei has taken the Giving What We Can Pledge (<a href=\"https://www.givingwhatwecan.org/about-us/members#lifetime-members-section\">#43 here</a>) to give 10% of his wealth to the less fortunate; your worst-case scenario is owning a terraformed moon in one of his galaxies. Now you can stop worrying about the permanent underclass and focus on more important things.</p><p>On that tiny shoreline of possible worlds, the ones where the next few years are your last chance to become rich,",
            "title": "You Have Only X Years To Escape Permanent Moon Ownership"
        },
        {
            "content": [
                "<p>There are two sides of developments in fertility.</p>\n<ol>\n<li>How bad is it? What is causing the massive, catastrophic declines in fertility?</li>\n<li>What can we do to stabilize and reverse these trends to a sustainable level?</li>\n</ol>\n<p>Today I’m going to focus on news about what is happening and why, and next time I’ll ask what we’ve learned since last check-in about we could perhaps do about it.</p>\n<p>One could consider all this a supplement to my sequence on <a href=\"https://thezvi.substack.com/p/the-revolution-of-rising-expectations?r=67wny\">The Revolution of Rising Expectations</a>, and The Revolution of Rising Requirements. That’s the central dynamic.</p>\n\n\n<h4 class=\"wp-block-heading\">Household Composition</h4>\n\n\n<p>What is happening? <a href=\"https://x.com/Rainmaker1973/status/1859539164091363432\">A chart worth looking at every so often</a>.</p>\n<div>\n\n\n<span id=\"more-25002\"></span>\n\n\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!RQlu!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4189d372-15f3-4192-8ca4-b6854c100c5f_513x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Timing</h4>\n\n\n<blockquote><p><a href=\"https://x.com/MichaelAArouet/status/1891032076037628409\">Michael Arouet:</a> No way. WTF happened in 1971?</p></blockquote>\n<p>This is United States data:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!lkjh!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F89ace473-8f53-44ea-9370-4b86d2362cbe_1199x905.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The replies include a bunch of other graphs that also go in bad directions starting in 1971-73.</p>\n\n\n<h4 class=\"wp-block-heading\">Developmental Idealism</h4>\n\n\n<p>Lyman Stone, in his first Substack post, <a href=\"https://substack.com/home/post/p-154003374\">lays the blame for fertility drops in non-Western countries primarily on drops in desire for children, via individuals choosing Developmental Idealism</a>.</p>\n<blockquote><p>Lyman Stone: Five Basic Arguments for Understanding Fertility:</p>\n<ol>\n<li>Data has to be read “vertically” (longitudinally), not “sideways” (cross-sectionally)</li>\n<li>No variable comes anywhere close to “survey-reported fertility preferences” in terms of ability to explain national fertility trends in the long run</li>\n<li>People develop preferences through fairly well-understood processes related to expected life outcomes and social comparison</li>\n<li>The name for the theory which best stands to explain why preferences have fallen is “developmental idealism.”</li>\n<li>Countries with fertility falling considerably below desires are doing so primarily due to delayed marriage and coupling</li>\n<li>TANGENTIALLY RELATED BONUS: Education reduces fertility largely by serving as a vector for developmental idealism in various forms, not least by changing parenting culture.</li>\n</ol>\n</blockquote>\n<p>The central point of idea #1 is you have to look at changes over time, as in:</p>\n<blockquote><p>If you can tell Italy, “When countries build more low-density settlements, TFR rises,” that is orders of magnitude more informative than, “Countries with more low-density settlements have higher TFR.”</p>\n<p>The first statement is informing policymakers about an actual potentiality; the second is asking Italy to become Nepal.</p></blockquote>\n<p>The overall central thesis:</p>\n<blockquote><p>“Falling child mortality means people don’t need to have as many kids to hit their family goals, and those family goals are themselves simply falling over time.”</p>\n<p>…</p>\n<p>Both actual and desired fertility have fallen since 1960, but actual fertility has fallen much more. The biggest reason for this is actual fertility is also influenced by child mortality, which has fallen a lot since 1960.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!oyU5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7c55b765-6bf5-4d98-acd2-017dd1797b13_693x453.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>So in this model, the question becomes why are desired family sizes falling?</p>\n<p>Lyman thinks this mostly comes down to comparisons with others (he explicitly doesn’t want to use the word ‘status’ here).</p>\n<p>And his thesis is essentially that people around the world saw European wealth, found themselves ‘at the bottom’ of a brand-new social scale, and were told to fix this they had to Westernize, and Western culture causes the fertility decline.</p>\n<p>This doesn’t explain where the Western desire for smaller families came from.</p>\n<p>I also don’t think that this is why Western culture was adapted. I think Western culture is more attractive to people in various ways &#8211; it largely wins in the ‘marketplace of ideas’ when the decisions are up to individuals. Which I think is largely the level at which the decisions are made.</p>\n\n\n<h4 class=\"wp-block-heading\">Pessimism</h4>\n\n\n<p>People’s severe pessimism, and inability to understand how good we have it, is making all these issues a lot worse.</p>\n<blockquote><p><a href=\"https://x.com/benlandautaylor/status/1973451306926055934\">Ben Landau-Taylor</a>: Knowing a decent amount of history will cure lots of fashionable delusions, but none quite so hard as “How could anyone bring a child into a world as remarkably troubled and chaotic as the year 2025”.</p>\n<p>Matt McAteer: Historical periods with names like “The Twenty Years’ Anarchy”, “The Killing Time”, “The Bronze Age Collapse”…or god forbid, “The Great Emu War”…2025 doesn’t seem so bad by comparison.</p>\n<p>Nested 456: My mother grew up playing in bomb sites in northern England right after WW2. Really we’re spoiled brats in comparison</p></blockquote>\n<p>Are there big downsides and serious issues? Oh, definitely, atomization and lack of child freedoms and forms of affordability are big problems, and AI is a big risk.</p>\n\n\n<h4 class=\"wp-block-heading\">Baby Boom</h4>\n\n\n<p><a href=\"https://ourworldindata.org/baby-boom-seven-charts\">Saloni Dattani and Lucas Rodes-Guirao offer us a fun set of charts</a> about the baby boom, but they don’t offer an explanation for how or why that happened, as Derek Thompson points out <a href=\"https://x.com/DKThomp/status/1894025331851268166\">none of the standard explanations fully line up with the data</a>. A lot of people seem to grasp at various straws in the comments.</p>\n<p>Handy and Shester do offer an explanation for a lot of it, <a href=\"https://marginalrevolution.com/marginalrevolution/2025/10/the-microfoundations-of-the-baby-boom.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-microfoundations-of-the-baby-boom\">pointing to decline in maternal mortality</a>, saying this explained the majority of increases in fertility. That is certainly an easy story to tell. Having a child is super scary, so if you make it less scary and reduce the health risks you should get a lot more willingness to have more kids.</p>\n<p>Tyler Cowen sees this as a negative for a future baby boom, since maternal mortality is now low enough that you can’t pull this trick again. The opposite perspective is that until the Baby Boom we had this force pushing hard against having kids and people had tons of kids anyway, whereas now it is greatly reduced, so if we solve our other problems we would be in a great spot.</p>\n\n\n<h4 class=\"wp-block-heading\">Paperwork</h4>\n\n\n<p>The paperwork issue is highly linked to the safety obsession issues, but also takes on a logic all its own.</p>\n<p>As with car seat requirements, the obvious response is ‘that’s silly, people wouldn’t not have kids because of that’ but actually no, this stuff is a nightmare, it’s a big cost and stress on your life, it adds up and people absolutely notice. AI being able to handle most of this can’t come soon enough.</p>\n<blockquote><p><a href=\"https://x.com/KTmBoyle/status/1915449549327663279\">Katherine Boyle</a>: We don’t talk enough about how many forms you have to fill out when raising kids. Constant forms, releases, checklists, signatures. There’s a reason why litigious societies have fewer children. People just get tired of filling out the forms.</p>\n<p>The forms occasionally matter. But I’ve found you don’t have to fill out the checklists. Pro tip. Throw them away.</p>\n<p>Blake Scholl: I was going to have more children but the paperwork was too much.</p>\n<p>Sean McDonald: It’s shocking how many times I’ve been normied in the circumstance I won’t blindly sign a parent form. People will get like..actually mad if you read them.</p>\n<p>Nathan Mintz: An AI agent to fill out forms for parents &#8211; will DM wiring information later.</p>\n<p>Cristin Culver: It’s 13 tedious steps to reconfirm to my children’s school district that the 13 forms I uploaded last time are still correct. <img alt=\"🥵\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f975.png\" style=\"height: 1em;\" /></p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Car Seats As Contraception</h4>\n\n\n<p>Back in 2022 I wrote an extended analysis on <a href=\"https://thezvi.substack.com/p/on-car-seats-as-contraception\">car seats as contraception</a>. Prospective parents faced with having to change cars, and having to deal with the car seats, choose to have fewer children.</p>\n<p>People think you can only fit two car seats in most cars. This drives behaviors remarkably strongly, resulting in substantial reductions in birth rates. No, really.</p>\n<p>The obvious solution is that the extent of the car seat requirements are mostly patently absurd, and can be heavily reduced with almost no downsides.</p>\n<p>It turns out there are also ways to put in three car seats, in many cases, using currently available seats, with a little work. That setup is still annoying as hell, but you can do it.</p>\n<p>The improved practical solution is there is a European car seat design that takes this to four car seats across a compact. <a href=\"https://x.com/LeahLibresco/status/1964747798055928299\">It can be done. They have the technology</a>.</p>\n<p>In an even stupider explanation than usual, the problem is that our crash test fixtures that we use cannot physically include a load leg, so we cannot test the four car seat setup formally, so we cannot formally verify that they comply with safety regulations.</p>\n<blockquote><p>Scarlet Astrorum: I know why we can’t have 4 kids to a row in the car and it’s a silly regulatory thing. Currently, US testing protocols do not allow crash testing of U.S. car seats that feature a load leg, similar to the British four-seater Multimac (pictured).</p>\n<p>The crash test fixture itself is designed so it cannot physically include a load leg. The sled test fixture does not have a floor so there is no place to attach a load leg.</p>\n<p>This means safe, multiple-kid carseats used widely in Europe can’t even be *evaluated* for safety- it’s not that they break US safety regulations, they just can’t even attach onto the safety testing sled, which is all seat (also pictured).</p>\n<p>To test the 4-kid carseats which use a load arm, there are already functional test fixtures, like the ECE R129 Dynamic Test Bench, pictured here, which has a floor. We just need to add this as a testing option. Manufacturers could still test with the old sled.</p>\n<p>What needs to change: 49 CFR § 571.213 s10.1-4 and Figure 1A which lock you in to testing with a floorless sled All that needs to change is updating the wording to clarify test positioning for a sled with a floor as well.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!FGOZ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd05afc7b-08de-44e2-b94c-8420619d736a_1700x1132.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>You would also have to spread the word so people know about this option.</p>\n\n\n<h4 class=\"wp-block-heading\">You Can’t Afford It</h4>\n\n\n<p>Of course you are richer than we used to be, <a href=\"https://x.com/ScarletAstrorum/status/1890907223838105966\">but not measured in the cost to adhere to minimal child raising standards</a>, especially housing and supervision standards.</p>\n<blockquote><p>David Holz: i find it so strange when people say they can’t afford kids. your ancestors were able to afford kids for the last 300,000 years! are we *really* less wealthy now? you might think your parents were better off, but how about further back? they still went on.</p>\n<p>Scarlet Astrorum: What people mean when they say this is often “I am not legally allowed to raise children the way my poor ancestors did”</p>\n<p>Personally I only have to go back 2 generations to find behavior that I think is reasonable given circumstances but would be currently legally considered neglect</p>\n<p>“I will not risk the custody of my existing children to raise more children than I can supervise according to today’s strict standards” is unfortunately a very reasonable stance. Of course, there are creative workarounds, but they are not uniformly available</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Yes The Problem Is Often Money</h4>\n\n\n<p><a href=\"https://x.com/QuantumAlteredX/status/1957550823828819999\">Here is the latest popping up on my timeline of</a> ‘how can anyone have kids anymore you need a spare $300k and obviously no one has that.’</p>\n<p>That is indeed about what it costs to raise a child. If you shrink that number dramatically, the result would be very different, at least in America.</p>\n<p>America has the unique advantage that we want to have children, and like this man we are big mad that we feel unable to have them, usually because of things fungible with money. So we should obviously help people pay for this public good.</p>\n\n\n<h4 class=\"wp-block-heading\">Housework</h4>\n\n\n<p>There is the housing theory of everything.<a href=\"https://www.washingtonpost.com/opinions/2025/02/18/fertility-decline-women-kids-claudia-goldin/\"> Then there’s the housework theory of everything?</a></p>\n<blockquote><p>Heather Long: Goldin concludes that two factors explain much of the downward trend by country: the speed at which women entered the workforce after World War II, and how quickly men’s ideas about who should raise kids and tidy up at home caught up. This clash of expectations explains the fertility decline across the globe.</p>\n<p>In places where men do more around the house, fertility rates are higher, where they do less, rates are lower.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!S73p!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8ed50608-642c-47bb-a1ef-720cb9fc7772_989x828.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Even the green bars are 1.7-1.8. That’s still below 2.1, even with a somewhat cherry-picked graph.</p>\n<p>Also this is rather obviously not the right explanatory variable.</p>\n<p>Why should we care about how many hours of housework a woman does more than the man, rather than the number of hours the woman does housework at all?</p>\n<p>The suggestion from Goldin is more subsidized child care, but that has a long track record of not actually impacting fertility.</p>\n<p>The actual underlying thing is, presumably, how hard it is on the woman to have children, in terms of both absolute cost &#8211; can you do it at all &#8211; and marginal cost versus not doing it. The various types of costs are, again presumably, mostly fungible.</p>\n<p>The idea that ‘50-50’ is a magic thing that makes the work go away, or that it seeming fair would take away the barrier, is silly. The problem identified here is too much work, too many costs, that fall on the woman in particular, and also the household in general.</p>\n<p>One can solve that with money, but the way to do it is simply to decrease the necessary amount of work. There used to be tons of housework because it was physically necessary, we did not have washers and dryers and dishwashers and so on. Whereas today, this is about unreasonable standards, and a lot of those standards are demands for child supervision and ‘safety’ or ‘enrichment’ that simply never happened in the past.</p>\n\n\n<h4 class=\"wp-block-heading\">Greedy Careers</h4>\n\n\n<p>If market labor has increasing returns to scale, <a href=\"https://x.com/RuxandraTeslo/status/1900186033515364405\">then taking time off for a child is going to be expensive in terms of lifetime earnings</a> and level of professional advancement. <a href=\"https://worksinprogress.co/issue/fertility-on-demand/\">Ruxandra’s full article is here,</a> I quote mostly from her thread.</p>\n<blockquote><p>Ruxandra Teslo: One’s 30s are a crucial period for professional advancement. Especially in so-called “greedy careers”: those where returns to longer hours are non-linear.</p>\n<p>But one’s mid 30s is also when most women’s fertility starts to drop.</p>\n<p>In this piece, I lay out how a large part of the “gender pay gap” is just this: a motherhood pay gap. And, as Nobel Laureate Claudia Goldin points out, this is particularly true in high-stakes careers like business, law, medicine, entrepreneurship and so on.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!UTxF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fef73ce94-5ea7-4731-beb1-955e572ed5f0_900x725.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This reduction in earnings is not just about money either: it’s about general career advancement and personal satisfaction with one’s profession. Time lost in one’s 30s is hard to recuperate from later on.</p>\n<p>In law, for example, one’s 30s is when the highest levels of salary growth take place. Founders who launch unicorns (startups worth more than a billion dollars) have a median age of 34 when they found their companies. In academia, one’s thirties are usually the time when a researcher goes through a string of high-pressure postdoctoral positions in an attempt to secure an independent position.</p>\n<p>Aware of this, women delay pregnancy until they have advanced in their careers as far as possible. This is especially true for women w/ professional degrees. Women without a bachelor’s degree tend to have 1 to 1.5 children on ~ by age 28, while those with higher educational attainment have around 0.25 children by same age.</p>\n<p>Highly educated women attempt to catch up during their 30s, with their birth rates increasing more rapidly. However, this compensatory period is limited, as fertility rates across all education levels tend to plateau around age 39. Thus, the educated group ends up with less kids.</p>\n<p>The chance of conceiving a baby naturally with regular sex drops from 25 percent per month in one’s twenties to about five percent per month at 40, while the chance of miscarrying rises from about eight percent for women under 30 to around one in three for 40-year-olds.</p>\n<p>[thread continues and morphs into discussing technological fertility solutions]</p>\n<p><a href=\"https://worksinprogress.co/issue/fertility-on-demand/\">From Her Article</a>: Women know this gap exists and plan accordingly: in countries where the motherhood penalty is keenest, the birth rate is <a href=\"https://www.boomcampaign.org/p/the-impact-of-the-child-penalty-on?r=27r4jr&amp;utm_campaign=post&amp;utm_medium=web\">lower</a>.</p>\n<p>…</p>\n<p>We have come a long way from the explicit sex discrimination of the past. Today, the gap is primarily driven by the career toll exacted by motherhood.</p></blockquote>\n<p>A lot of the problem is our inability to realistically talk and think about the problem. There’s no solution that avoids trading off at least one sacred value.</p>\n\n\n<h4 class=\"wp-block-heading\">The Appeal of Child-Free</h4>\n\n\n<p>It’s definitely super annoying that when you have kids you have to earn your quiet. This both means that you properly appreciate these things, and also that you understand that they’re not that important.</p>\n<blockquote><p><a href=\"https://x.com/HazelAppleyard/status/1991085565370839526\">Hazal Appleyard</a>: When you watch stuff like this as a parent, you realise how truly empty and meaningless all of those things are.</p>\n<p>Destind for Manifest: “I don’t want children because it would keep me away from my favorite activities which are watching cartoons, doing silly hand gestures and taking videos of my daily life, all while keeping an exaggerated smile on my face at all times”</p>\n<p>Literally the perfect mom</p>\n<p><a href=\"https://x.com/myhandle/status/1991210075323789322\">Yashkaf:</a> your life isn’t child-free. you *are* the child</p>\n<p>no one’s making “my child-free life” content about using the spare 6 hours each day to learn some difficult skill or write a book or volunteer at a hospice</p>\n<p>it’s always made by people who don’t seem to have plans, goals, or attention spans longer than an hour</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Motivation</h4>\n\n\n<p><a href=\"https://x.com/mattyglesias/status/1868644010727711102\">I too do not see this as the message to be sending</a>:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!4NUv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F716b2d05-1048-4c7d-ab13-0ff1659b1aae_1019x1156.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Becoming a parent also makes it extremely logistically tricky to go to the movies, or to go out to dinner, especially together. Beyond that, yes, obviously extremely tone deaf.</p>\n<p>The basic principle here is correct, I think.</p>\n<p>Which is, first, that most people have substantial slack in their living expenses, and that in today’s consumer society your expenses will expand to fill the funds available but you’d probably be fine spending a lot less. Digital entertainment in particular can go down to approximately free if you have the internet, and you’ll still be miles ahead of what was available a few years ago at any price.</p>\n<p>And second, that if you actually do have to make real sacrifices here, it is worth doing that, and historically this was the norm. Most families historically really did struggle with material needs and make what today would seem like unthinkable tradeoffs.</p>\n<p>Also third, although she’s not saying it here, that not being able to afford it now does not mean you can’t figure it out as you go.</p>\n<p><a href=\"https://x.com/AmandaAskell/status/1869584124627066977\">Another form of motivation:</a></p>\n<blockquote><p>Amanda Askell: My friends just had a baby and now I kind of want one. Maybe our species procreates via FOMO.</p>\n<p>I have bumped up the dating value of aspiring stay at home partners accordingly, on the off chance that I ever encounter one.</p></blockquote>\n<p>Another key form of motivation is, <a href=\"https://www.ggd.world/p/what-do-parents-want\">what are you getting in return for having kid</a>s? In particular, what will your kids do for you? How much will they be what you want them to be? Will they share your values?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!xr9r!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7a74a118-a0ed-4bd8-b504-4aa6f7e9b66f_1150x812.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The post mostly focuses on the various ways Indian parents shape the experiences of their children including getting transfers of resources back from them but mostly about upholding cultural and religious traditions, and how much modernity is fraying at that. For many, that takes away a strong reason to have kids.</p>\n\n\n<h4 class=\"wp-block-heading\">Grandparents</h4>\n\n\n<p>The New York Times put out an important short article that made people take notice, <a href=\"https://archive.is/b67Kq\">The Unspoken Grief of Never Becoming a Grandparent</a>.</p>\n<blockquote><p>Robert Sterling: I know a huge number of people in their 60s and 70s with one grandchild at most. Many with zero.</p>\n<p>These people had 3-4 kids of their own, and they assumed their kids would do the same. They planned for 10-15 grandkids at this age.</p>\n<p>Not for me to judge, but it’s sad to see.</p></blockquote>\n<p>I have little doubt that those considering having kids are not properly taking into account the grandparent effect, either for their parents or in the future for themselves.</p>\n<p>Throughout, the frame is ‘of course my children should be able to make their own choices about whether to have kids,’ and yes no one is arguing otherwise, but this risks quickly bleeding into the frame of ‘no one else’s preferences should factor into this decision,’ which is madness.</p>\n<p>It also frames the tragedy purely in experiential terms, of missing out on the joy and feeling without purpose. It also means your line dies out, which is also rather important, but we’ve decided as a society you are not allowed to care about that out loud.</p>\n<blockquote><p><a href=\"https://x.com/webdevMason/status/1856210668736917976\">Mason</a>: I really hope I am able to say whatever I need to say and do whatever I need to do for my children to have some grasp of what a complex and transcendent joy it is to bring a new person into the world.</p>\n<p>My daughter’s great-grandfather is dying at hospice. He is not truly present anymore.</p>\n<p>Even when he was able to first meet her, he was not always fully there.</p>\n<p>But a few times he did recognize me, so he knew who she was, and he would not eat so that he could just watch her toddle around.</p>\n<p>I do not know how to explain it, man. At the very end, when you barely even remember who you are, the newest additions to your lineage hold you completely spellbound.</p>\n<p>He would just stare at her and say, “She never even cries,” over and over, so softly.</p></blockquote>\n<p>The flip side is that parents, who are prospective grandparents, seem unwilling to push for this. Especially tragic is when they hoard their wealth, leaving their kids without the financial means to have kids. There is an obviously great trade for everyone &#8211; you support them financially so they can have the kids they would otherwise want &#8211; but everyone is too proud or can’t admit what they want or wants them to ‘make it on their own’ or other such nonsense.</p>\n<p><a href=\"https://x.com/AudreyPollnow/status/1856411205067321738\">Audrey Pollnow has extensive thoughts</a>.</p>\n<p>I appreciated this part of her framing: Having kids is now ‘opt-in,’ which is great, except for two problems:</p>\n<ol>\n<li>We’ve given people such high standards for when they should feel permission to opt-in. Then if they do go forward anyway, it is common to mostly refuse to help.</li>\n<li>Because it is opt-in, there’s a feeling that the kids are therefore not anyone else’s responsibility, only the parents, at least outside an emergency. Shirking that responsibility hurts the prospect of having grandparents, as any good or even bad decision theorist knows, and thus does not improve one’s life or lineage.</li>\n</ol>\n<p><a href=\"https://radiopaper.com/conversation/2sL5a68lCw4t\">I do not agree with her conclusion</a> that therefore contraception, which enables us to go to ‘opt-in,’ is bad actually. That does not seem like the way to fix this problem.</p>\n\n\n<h4 class=\"wp-block-heading\">Expectations of Impossibility</h4>\n\n\n<p>On top of how impossible we’ve made raising kids, and then we’ve given people the impression it’s even more impossible than that.</p>\n<p>Potential parents are also often making the decision with keen understanding of the downsides but not the upsides. We have no hesitations talking about the downsides, but we do hesitate on the upsides, and we especially hesitate to point out the negative consequences of not having kids. Plus the downsides of having kids are far more legible than the benefits of kids or of the downsides of not having kids.</p>\n<blockquote><p><a href=\"https://x.com/zeta_globin/status/1913761800245436783\">Zeta</a>: crying in a diner bathroom because life has no end goal or meaning, the one person who feels like family is as unhappy as you are, you can’t eat bread, you kinda want kids but every time you spend time with other people’s kids it seems waaayyyy too high maintenance, your elderly parents/your only real home are fading and close to death as are impossibly young kids with weird-ass cancers that should be solvable but humans fuck it up and what is even the point of anything</p>\n<p>I don’t know how parents do it, like I get excited to have kids purely as a genetics experiment and then I spend time with them and it’s non-stop chores which are tedious and boring like with a puppy but also not chill like a puppy because it’s a future human but you can’t talk to them about mass neutrophil death in bone formation when they ask questions that necessitate it</p>\n<p>also I know I don’t believe in academia or science but I need to believe in something &#8211; like I need someone to let me rant about what we know for sure in development- otherwise it’s just a chaotic mass of noise hurtling towards a permanent stop just as turbulent and meaningless as the start</p>\n<p>eigenrobot: there’s a lot of that but you kinda stop noticing it because there’s a lot of this too</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!OyCH!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe6c6a795-5b9d-4527-86f9-8c09d378d141_1024x1024.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/webdevMason/status/1913928685964361983\">Mason</a>: Kids are hard but they are 100% better than this, the “what’s even the point” malaise that a lot of us start to feel because we are people who are meant to be building families and our social infrastructure was ill-suited to get everyone to do it in a timely fashion</p>\n<p>I don’t know if it’s a blackpill or a whitepill, but I do think you have to pick your poison a little bit here</p>\n<p>Kids will overwhelm you and deprive you of many comforts for a time, life without them may gradually lead you to become a patchwork of hedonistic copes</p>\n<p>Again I struggle to explain the “upside” of parenthood bc it doesn’t lend itself to tabulation. I don’t just *like* my kids, they are the MOST everything. They are little glowing coals in a cold and uncaring universe. I hold that dear when I am cleaning the poop off the walls</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Isolation</h4>\n\n\n<p>The shading here makes it look a lot more dire than it is, but yes a lack of other kids makes it tougher to have or decide to have your own.</p>\n<blockquote><p><a href=\"https://x.com/webdevMason/status/1983491359903298025\">Mason</a>: 50 years ago, about 1 in 3 of the people around you were children. Now it’s about 1 in 5. That makes a huge difference when it comes to the availability of infrastructure for kids, convenient playmates, family activities.</p>\n<p>For a lot of young people, parenting just looks isolating.</p>\n<p>This is one of the underappreciated ways a population collapse accelerates: when fewer people have kids, fewer people in the age cohort behind them see what it’s like having kids, and it just seems like a strange thing that removes you from public life and activities.</p>\n<p>That’s one reason I think the (fraction of) pronatalists who advocate excessive use of childcare to make parenting less disruptive to their personal lives are counterproductive to their cause.</p>\n<p>Constantly trying to get away from your kids to live your best life sends a message.</p>\n<p>n an ideal world, most adults have some kids, and society accomodates them to a reasonable degree because it wants their labor and their money</p>\n<p>Unofficial kid zones pop up everywhere, indoors and out. Low-supervision safety features are standard to the way things are built.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!N-vA!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F73116544-6c23-4c66-a491-32b80cb38356_1422x2048.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The first best solution is different from what an individual can do on the margin.</p>\n<p>I see the problem of childcare as not ‘the parents are spending too little time with the kids’ but rather ‘we require insane levels of childcare from parents’ so the rational response is to outsource a bunch of that if you can do it. The ideal solution would be to push back on requiring that level of childcare at all, and returning to past rules.</p>\n\n\n<h4 class=\"wp-block-heading\">Decoupling</h4>\n\n\n<p><a href=\"https://www.ggd.world/p/the-global-collapse-of-coupling-and?utm_source=%2Finbox&amp;utm_medium=reader2\">Alice Evans notes that unlike previous fertility declines,</a> in the United States the recent decline is almost entirely due to there being fewer couples, while children per couple isn not changed.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!nXcX!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F776a058c-c82f-4d26-b481-1817152198eb_940x564.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This is at least a little misleading, since desire to have children is a major cause of coupling, and marginal couples should on average be having fewer children. But I do accept the premise to at least a substantial degree.</p>\n<p>Also noteworthy is having less education means a bigger decline:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!CgdE!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F594bbe13-7f08-48f2-8385-86028f5feb60_936x532.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This is happening worldwide, and Alice claims it corresponds with the rise in smartphones. For America I don’t see the timing working out there? Seems like the declines start too early.</p>\n<p>Then she turns to why coupling is <a href=\"https://www.ggd.world/i/154620518/why-is-coupling-plummeting-across-the-middle-east-and-north-africa\">plummeting in the Middle East and North Africa</a>.</p>\n<p>The first explanation is that wives are treated rather horribly by their in-laws and new family, which I can totally see being a huge impact but also isn’t at all new? And it’s weird, because you wouldn’t think a cultural norm that is this bad for your child’s or family’s fertility would survive for long, especially now with internet connectivity making everyone aware how crazy it all is, and yet.</p>\n<p>It’s so weird, in the age of AI, to see claims like “<a href=\"https://www.ggd.world/i/154620518/the-decline-of-coupling-and-fertility-is-the-greatest-challenge-of-the-st-century\">The decline of coupling and fertility is the greatest challenge of the 21st century</a>.”</p>\n\n\n<h4 class=\"wp-block-heading\">South Korea</h4>\n\n\n<p><a href=\"https://x.com/AndrasDobos81/status/1994841594600853949\">This framing hit home for a lot of people in a way previous ones didn’t</a>.</p>\n<blockquote><p>Camus: South Korea is quietly living through something no society has ever survived: a 96% population collapse in just four generations — with zero war, zero plague, zero famine.</p>\n<p>100 people today → 25 children → <a href=\"https://worksinprogress.co/issue/two-is-already-too-many/\">6 grandchildren</a> → 4 great-grandchildren.<br />\nThat’s it. Game over for an entire nation by ~2125 if fertility stays where it is (0.68–0.72).</p>\n<p>No historical catastrophe comes close:</p>\n<p>&#8211; Black Death killed ~50% in a few years</p>\n<p>&#8211; Mongol invasions ~10–15% regionally</p>\n<p>&#8211; Spanish flu ~2–5% globally</p>\n<p>South Korea is on pace to lose 96% of its genetic lineage in a single century… peacefully.</p>\n<p>We shut down the entire world for a virus with 1–2% fatality.<br />\nThis is 96% extinction and the silence is deafening.</p>\n<p>Japan, Taiwan, Italy, Spain, Singapore, Hong Kong, Poland, Greece — all following the same curve, just 10–20 years behind.</p></blockquote>\n<p>Robots, AI and automation might mitigate the effects along the way and prevent total societal collapse for a while, but there would soon be no one left to constitute the society. It would cease to exist.</p>\n<p>It’s so tragic that a lot of this is a perception problem, where parents think that children who can’t compete for positional educational goods are better off not existing.</p>\n<blockquote><p><a href=\"https://x.com/binarybits/status/1998826189776105568\">Timothy Lee</a>: Parenting norms in South Korea are apparently insane. American society has been trending in the same direction and we should think about ways to reverse this trend. The stakes aren’t actually as high as a lot of parents think they are.</p>\n<p><a href=\"https://worksinprogress.co/issue/two-is-already-too-many/\">Phoebe Arslanagic-Little (in Works in Progress)</a>: South Korea is often held up as an example of the failure of public policy to reverse low fertility rates. This is seriously misleading. Contrary to popular myth, South Korean pro-parent subsidies have not been very large, and relative to their modest size, they have been fairly successful.</p>\n<p>… In South Korea, mothers’ employment falls by 49 percent relative to fathers, over ten years – 62 percent init­ially, then rising as their child ages. In the US it falls by a quarter and in Sweden by only 9 percent.</p>\n<p>South Koreans <a href=\"https://stats.oecd.org/index.aspx?DataSetCode=ANHRS\">work</a> more hours – 1,865 hours a year – in comparison with 1,736 hours in the US and 1,431 in Sweden. This makes it hard to balance work and motherhood, or work and anything else.</p>\n<p>… Today, South Korea is the world’s most expensive place to raise a child, costing an average of <a href=\"https://www.koreatimes.co.kr/www/nation/2024/09/113_350152.html\">$275,000</a> from birth to age 18, which is 7.8 times the country’s GDP per capita compared to the US’s 4.1. And that is without accounting for the mother’s forgone income.</p>\n<p>… But South Korea is even worse. Almost <a href=\"https://kostat.go.kr/board.es?mid=a10301070100&amp;bid=245&amp;tag=&amp;act=view&amp;list_no=429923&amp;ref_bid=&amp;keyField=&amp;keyWord=&amp;nPage=1\">80 percent</a> of <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0738059322001602\">children</a> attend a <em>hagwon</em>, a type of private cram school operating in the evenings and on weekends. In 2023, South Koreans poured a total of <a href=\"https://kostat.go.kr/board.es?mid=a10301070100&amp;bid=245&amp;tag=&amp;act=view&amp;list_no=429923&amp;ref_bid=&amp;keyField=&amp;keyWord=&amp;nPage=1\">$19 billion</a> into the shadow education system. Families with teenagers in the top fifth of the income distribution spend 18 percent ($869) of their monthly income on tutoring. Families in the bottom fifth of earners spend an average of <a href=\"https://www.koreatimes.co.kr/www/biz/2024/08/602_353629.html#:~:text=The%20data%20showed%20that%20those,stood%20at%206.53%20million%20won.\">$350</a> a month on tutoring, as much as they spend on food.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!bcXG!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbcf4bd64-9e91-4d07-b5d0-f81c68557d48_1035x767.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>Because most students, upon starting high school, have already learned the entire mathematics curriculum, teachers expect students to be able to keep up with a rapid pace. There’s even pejorative slang for the kids who are left behind– <em>supoja</em> – meaning someone who has given up on mathematics.</p></blockquote>\n<p>The article goes on and things only get worse. Workplace culture is supremely sexist. There’s a 1.15:1 male:female ratio due to sex selection. Gender relations have completely fallen apart.</p>\n<p>The good news is that marginal help helped. The bad news is, you need More Dakka.</p>\n<blockquote><p>Every South Korean baby is now <a href=\"https://www.koreaherald.com/view.php?ud=20240122000698#:~:text=For%20a%20baby%20born%20in,Aging%20Society%20and%20Population%20Policy.\">accompanied</a> by some $22,000 in government support through different programs over the first few years of their lives. But they will cost their parents an average of roughly <a href=\"https://www.koreatimes.co.kr/www/nation/2024/09/113_350152.html\">$15,000</a> every year for eighteen years, and these policies do not come close to addressing the child penalty for South Korean mothers.</p>\n<p>… For each ten percent increase in the bonus, fertility rates have risen by 0.58 percent, 0.34 percent, and 0.36 percent for first, second, and third births respectively. The effect appears to be the result of a real increase in births, rather than a shift in the timing of births.</p>\n<p><a href=\"https://x.com/patio11/status/1999300123382489565\">Patrick McKenzie</a>: I don’t think I had clocked “The nation we presently understand to be South Korea has opted to cease existing.” until WIP phrased baked-in demographic decline in the first sentence here.</p>\n<p>Think we wouldn’t have many lawyers or doctors if we decided “Well we tried paying lawyers $22k once, that didn’t work, guess money can’t be turned into lawyers and that leaves me fresh out of ideas.”</p></blockquote>\n<p>If you ask for a $270k expense, and offer $22k in subsidy, that helps, but not much.</p>\n<p>The result here is actually pretty disappointing, and implies a cost much larger than that in America. The difference is that in America we want to have more kids and can’t afford them, whereas in South Korea they mostly don’t want more kids and also can’t afford them. That makes it a lot harder to make progress purely with money.</p>\n<p>It’s plausible that this would improve with scale. If the subsidy was $30k initially and then $15k per year for 18 years, so you can actually pay all the expenses (although not the lost time), that completely changes the game and likely causes massive cultural shifts. The danger would be if those funds were then captured by positional competition, especially private tuition and tutoring, so you’d need to also crack down on that in this cultural context. My prediction is if you did both of those it would basically work, but that something like that is what it would take.</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/01/south-korea-fact-of-the-day-5.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=south-korea-fact-of-the-day-5\">2024 was the first year since 2015 that total births increased in South Korea</a>, by 3.1%, which of course is not anything remotely like enough.</p>\n<p>Robin Hanson points us to this article called The End of Children, mostly highlighting <a href=\"https://www.newyorker.com/magazine/2025/03/03/the-population-implosion\">the horror show that is South Korea</a> when it comes to raising children.</p>\n<p><a href=\"https://conversableeconomist.com/2025/05/05/koreas-low-fertility-rate/\">Timothy Taylor takes a shot at looking for why South Korea’s fertility is so low</a>, nothing I haven’t covered before. I’m increasingly leading to ‘generalized dystopia’ as the most important reason, with the mismatch of misogyny against changing expectations plus the tutoring costs, general indebtedness and work demands being the concrete items.</p>\n\n\n<h4 class=\"wp-block-heading\">World</h4>\n\n\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!yeFg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F11645961-b2d7-4538-9f97-cd1a254a9b80_1200x616.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!HOMo!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2d8337b4-db88-46e8-9bb8-b1a1530409b3_1200x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!LqzZ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F48878e87-a388-43dd-ba65-7d22b7d8efb4_559x548.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Various Places in Trouble</h4>\n\n\n<blockquote><p><a href=\"https://x.com/AngelicaOung/status/1953823343896887486\">Angelica:</a> Brutality. <a href=\"https://x.com/BirthGauge/status/1951748625983484066\">Taiwanese TFR fell below South Korea thus far 2025.</a></p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!KWCh!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F082ea56b-c403-4263-8d27-c8e238100867_223x241.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!rlK_!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1cec58f2-d247-4ea5-80a8-881ea0dffb31_1060x1546.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!UTSi!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F301da473-3585-40a1-80a6-96bb91c9f498_1044x1495.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">China</h4>\n\n\n<p><a href=\"https://x.com/mi233695/status/1955935449240784969\">China did have a widespread improvement from 2023 to 2024</a>, but only to 1.1, and this was plausibly because it was the Year of the Dragon. In 2025 things seem back to 2023 levels, so it doesn’t look like they’ve turned a corner.</p>\n<p><a href=\"https://x.com/Tviews_/status/1888907383738683763\">China’s marriage rate is collapsing, now less than half of its peak in 2013</a>, and down 20% in only one year.</p>\n<p>As a reminder, these are the demographics, <a href=\"https://asiatimes.com/2024/07/chinas-demographics-arent-a-short-term-problem/\">they do not look good at all</a>, watch the whole chart slowly creep older and the bottom crisis zone that started in 2020 expand.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!TkDp!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F18b2669c-c114-4897-985f-f0703fe59c79_1000x820.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!nNnk!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa675b66b-1e8a-4373-8103-3b89eec21508_1088x894.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/jonatanpallesen/status/1974925767881662776\">Jonatan Pallesen</a>: China’s population pyramid is dire.</p>\n<p>• The last large cohort of women, those aged 34 to 39, is rapidly moving into the non-reproductive age range.</p>\n<p>• There is an extreme surplus of males. More than 30 million. These are men who cannot possibly find a wife, an enormous population of incels by mathematical necessity.</p>\n<p>• Since around 2020, the number of children born has completely collapsed and shows no sign of recovery. In a few decades, China will be full of elderly people and short on workers.</p>\n<p><a href=\"https://x.com/mmjukic/status/1977804312903667949\">Marko Jukic</a>: There is not going to be a Chinese century unless they become the first industrialized country to reverse demographic decline. Seems unlikely, so the default outcome by 2100 is a world poorer than it is today, as we aren’t on track to win the century either.</p></blockquote>\n<p>AI will presumably upend the game board one way or another, but the most absurd part is always the projection that things will stabilize, as in:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!9gh5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff43d5d01-088f-49a3-8d79-8028254d86b8_1000x820.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>The article has that graph be ‘if China’s fertility rate doesn’t bounce back.’ Whereas actually the chart here for 2050 is rather optimistic under ‘economic normal’ conditions.</p>\n<p><a href=\"https://x.com/MichaelAArouet/status/1908433867033223177\">Their overall map looks like this</a>:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!9Fnx!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa21e56eb-0db5-4901-9808-db8edb4d1239_900x842.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/ben_r_hoffman/status/1915447907915845778\">They are at least trying something in the form of… changes to divorce</a>?</p>\n<p>One change in particular seems helpful, which is that if a parent gifts the couple real property, it stays with their side of the family in a divorce. I like this change because it makes it much more attractive to give the new couple a place to live, especially one big enough for a family. That’s known to have a big fertility impact.</p>\n<p>What impact will that have on fertility?</p>\n<blockquote><p><a href=\"https://x.com/ben_r_hoffman/status/1915447907915845778\">Samo Burja</a>: China might have just undertaken the most harsh and serious pro-fertility reform in the world.</p>\n<p>It won’t be enough.</p>\n<p>But this shows they have political will to solve fertility through any means necessary even if it doesn’t look nice to modern sensibilities.</p>\n<p>Ben Hoffman: This doesn’t seem well-targeted at fertility. If fertility is referenced it’s a pretext.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Russia</h4>\n\n\n<p><a href=\"https://zamin.uz/en/world/147796-russias-birth-rate-hits-historic-low-worst-in-200-years.html\">Russia’s birth rate continues to rapidly drop</a> to its lowest point in 200 years, with its population actively declining. Having started a protracted war is not helping matters.</p>\n\n\n<h4 class=\"wp-block-heading\">Europe</h4>\n\n\n<blockquote><p>Rothmus: It’s so over.</p>\n<p><a href=\"https://x.com/moreisdifferent/status/1926309616855515218\">Dan Elton</a>: Douglas Murray seems right on this point — “Western” culture will survive, but specifically European cultures will not, except for small vestiges maintained for tourists.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!jiX-!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F553a5cc7-2da1-4a81-b716-40057b3d7eb9_1194x1200.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Francois Valentin: For the first time in its history the EU recorded fewer births in 2024 than the US.</p>\n<p>Despite having an extra 120 million inhabitants.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!n2Rn!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F773cf497-9375-4972-99e9-b7c5805c5936_640x390.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">America</h4>\n\n\n<p>This is what a relatively healthy demographic graph looks like in 2025.</p>\n<blockquote><p><a href=\"https://x.com/JohnArnoldFndtn/status/1966308796596465729\">John Arnold</a>: Forget office to resi. We need college campus to retirement community conversions.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!J1i_!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb66dc7c6-b631-4e9d-b223-2e9c3d72f765_890x822.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>We still primarily need office to residential because of the three rules of real estate, which are location, location, location. You can put the retirement communities in rural areas and find places you’re still allowed to build.</p>\n<p><a href=\"https://www.washingtonpost.com/nation/2025/09/18/new-mexico-free-child-care-grisham/\">New Mexico to offer free child care regardless of income</a>. As usual, I like the subsidy but I hate the economic distortion of paying for daycare without paying for those who hire a nanny or stay home to watch the kids, and it also likely will drive up the real cost of child care. It would be much better to offer this money as an expanded child tax credit and let families decide how to spend that, including the option to only have one income.</p>\n\n\n<h4 class=\"wp-block-heading\">Kazakhstan</h4>\n\n\n<p><a href=\"https://x.com/TothGCsaba/status/1958909909883322587\">Kazakhstan remains the existence proof that fertility</a> <a href=\"https://link.springer.com/article/10.1007/s10680-023-09671-6#Tab1\">can recover</a>, with economic recovery and growth boosting seemingly rather than hurting fertility as they recovered from the economic woes they experienced in the 1990s.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!3-Tr!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b1a28bd-1270-4087-8034-1f0ae45f3725_552x524.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Israel</h4>\n\n\n<p><a href=\"https://x.com/MoreBirths/status/1870911221630685465\">More Births looks into how Israeli fertility remains so high</a>. ​</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!YuAP!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6a433237-c61b-437a-b6ef-c6923f94d93e_900x722.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p>More Births: On the combined measures of income and fertility, one nation is far ahead of the rest. Israel’s score laps every other country in this index. High fertility countries usually have very low GDPs and high GDP countries usually have very low birthrates. Israel is the only country in the world that does well in both categories.</p></blockquote>\n<p>Israel has high levels of education. It has high housing costs. It has existential threats from outside, but so do Ukraine and Azerbaijan. Israeli levels of religiosity are unremarkable, only 27% attend a service weekly and secular Jewish fertility is around replacement. Social services are generous but not unusually so.</p>\n<blockquote><p>Ultimately, those who live in Israel or talk to Israelis almost always arrive at the same conclusion. Israeli culture just values having children intensely.</p>\n<p>… Another wonderful article, by Danielle Kubes in Canada’s <em>National Post</em>, offers precisely the same explanation for high Israeli fertility: Israel is positively dripping with pronatal belief.</p></blockquote>\n<p>The conclusion is, a lot of things matter, but what matters most is that Israel has strong pronatal beliefs. As in, they rushed dead men from the October 7 attacks to the hospital, so they could do sperm extractions and allow them to have kids despite being dead.</p>\n\n\n<h4 class=\"wp-block-heading\">Consequences</h4>\n\n\n<p>Fix your fertility rate, seek abundance beyond measure, or lose your civilization.</p>\n<p>Your call.</p>\n<blockquote><p><a href=\"https://x.com/SamoBurja/status/1901784722143121781\">Samo Burja</a>: As far as I can tell, the most notable political science results of the 21st century is democracy cannot work well with low fertility rates.</p>\n<p>All converge on prioritizing retirees over workers and immigrants over citizens escalating social transfers beyond sustainability.</p>\n<p>I think this means we should try to understand non-democratic regimes better since they will represent the majority of global political power in the future.</p>\n<p>It seems to me that the great graying and mass immigration simply are the end of democracies as we understood them.</p>\n<p>Just as failure to manage an economy and international trade were the end of Soviet Communism as we understood it.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Unfounded Optimism</h4>\n\n\n<p>Why do official baseline scenarios consistently project recovering fertility rates?</p>\n<blockquote><p><a href=\"https://x.com/KelseyTuoc/status/1973130593807507483\">Kelsey Piper</a>: always a great sign when a projection is “for completely mysterious reasons this trend will reverse starting immediately and return to the baseline we believed in 25 years ago”</p>\n<p>Jason Furman: Fertility rates are way below what the Social Security Trustees projected in both 2000 and 2010. And yet they have barely updated their long-run forecast. What’s the best argument for the plausibility of their forecast?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!-hYs!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F10af08d1-6de3-4aed-b1e1-44a43071bf4c_1000x750.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Compare the lines. This is not how a reasonable person would update based on what has happened since the year 2000. It could go that way if we play our cards right, but it sure as hell is not a baseline scenario and we are not currently playing any cards.</p>\n\n\n<h4 class=\"wp-block-heading\">History</h4>\n\n\n<blockquote><p><a href=\"https://x.com/whyvert/status/1892452804448423941\">Whyvert</a>: Gregory Clark has evidence that Britain’s upper classes had low fertility 1850-1920. This would have reversed the earlier “survival of the richest” dynamic. It may partly explain Britain’s relative decline from the late 19th century.</p></blockquote>\n<p>For most of history the rich had more children that survived to adulthood than the poor. Then that reversed, and this is aying that in Britain this happened big time in the late 1800s.</p>\n<p><a href=\"https://www.science.org/content/article/how-often-are-children-genetically-unrelated-their-presumed-fathers?utm_campaign=Science&amp;utm_medium=ownedSocial&amp;utm_source=facebook&amp;fbclid=IwY2xjawJEDORleHRuA2FlbQIxMAABHakQ60-lYxJuzVCcNfgOyhgrEN1CIrX4xgTDOYo6yJ-NbXgCZCG5lJc87w_aem_ufBKDn8A_-EqefpLr08S5g\">Claim that only 1% or less of children</a> are genetically unrelated to their presumed fathers, very different from the opt-repeated figure of 10%. That’s a very different number, especially since a large fraction of the 1% are fully aware of the situation.</p>\n\n\n<h4 class=\"wp-block-heading\">Implications</h4>\n\n\n<p><a href=\"https://x.com/robinhanson/status/1937081476019003812\">The Social Security administration and UN continue to predict</a> mysterious recoveries in birth rates, resulting in projections that make no sense. There is no reason to assume a recovery, and you definitely shouldn’t be counting on one.</p>\n<p>I do think such projections are ‘likely to work out’ in terms of the fiscal implications due to AI, or be rendered irrelevant by it in various ways, but that is a coincidence.</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/06/how-do-declining-fertility-and-climate-change-interact.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=how-do-declining-fertility-and-climate-change-interact\">Fertility going forward (in ‘economic normal’ worlds not transformed by AI) will have highly minimal impact on climate change</a>, due to the timing involved, with less than a tenth of a degree difference by 2200 between very different scenarios, and it is highly plausible that the drop in innovation flips the sign of the impact. It is a silly thing to project but it is important to diffuse incorrect arguments.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2026/01/02/fertility-roundup-5-causation/",
            "publishedAt": "2026-01-02",
            "source": "TheZvi",
            "summary": "There are two sides of developments in fertility. How bad is it? What is causing the massive, catastrophic declines in fertility? What can we do to stabilize and reverse these trends to a sustainable level? Today I’m going to focus &#8230; <a href=\"https://thezvi.wordpress.com/2026/01/02/fertility-roundup-5-causation/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Fertility Roundup #5: Causation"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3189/",
            "publishedAt": "2026-01-02",
            "source": "XKCD",
            "summary": "<img alt=\"They're not generally used for crewed spacecraft because astronauts HATE going around the corners.\" src=\"https://imgs.xkcd.com/comics/conic_sections.png\" title=\"They're not generally used for crewed spacecraft because astronauts HATE going around the corners.\" />",
            "title": "Conic Sections"
        },
        {
            "content": [
                "<p>TL;DR: 2026 is going to be The Year of The Linux Desktop for me. I haven't booted into Windows in over 3 months on my tower and I'm starting to realize that it's not worth wasting the space for. I plan to unify my three SSDs and turn them all into btrfs drives on Fedora.</p>\n        <p>I've been merely tolerating Windows 11 for a while but recently it's gotten to the point where it's just absolutely intolerable. Somehow Linux on the desktop has gotten so much better by not even doing anything differently. Microsoft has managed to actively sabotage the desktop experience through years of active disregard and spite against their users. They've managed to take some of their most revolutionary technological innovations (the NT kernel's hybrid design allowing it to restart drivers, NTFS, ReFS, WSL, Hyper-V, etc.) then just shat all over them with start menus made with React Native, control-alt-delete menus that are actually just webviews, and forcing Copilot down everyone's throats to the point that I've accidentally gotten stuck in Copilot in a handheld gaming PC and had to hard reboot the device to get out of it. It's as if the internal teams at Microsoft have had decades of lead time in shooting each other in the head with predictable results.</p>\n        <p>To be honest, I've had enough. I'm going to go with Fedora on my tower and <a href=\"https://bazzite.gg/\">Bazzite</a> (or SteamOS) on my handhelds.</p>\n        <p>I think that Linux on the desktop is ready for the masses now, not because it's advanced in a huge leap/bound. It's ready for the masses to use because Windows has gotten so much actively worse that continuing to use it is an active detriment to user experience and stability. Not to mention with the price of ram lately, you need every gigabyte you can get and desktop Linux lets you waste less of it on superfluous bullshit that very few people actually want.</p>\n        <div class=\"flex space-x-2 bg-bg-soft dark:bg-bgDark-soft mx-auto min-h-fit\n        lg:w-[80ch] sm:w-[65ch] w-full\n        lg:p-4 p-2\n        // Base styles for all messages\n        mt-0 mb-0 rounded-none\n        // First message styles\n        first:mt-4 first:rounded-t-lg first:pb-2\n        // Last message styles\n        last:mb-4 last:rounded-b-lg last:pt-1\n        // Middle message top/bottom adjustment\n        [&amp;:not(:first-child)]:-mt-[1px] [&amp;:not(:first-child)]:py-1\"><div class=\"h-16 not-prose\"><img alt=\"Cadey is coffee\" class=\"h-16 w-16 rounded-xs\" src=\"https://stickers.xeiaso.net/sticker/cadey/coffee\" /></div><div class=\"flex-1 min-w-0\"><span class=\"font-semibold text-sm block mb-1\"><a href=\"https://xeiaso.net/characters#cadey\">Cadey</a></span><span class=\"mx-auto\"></span><div class=\"text-fg-1 dark:text-fgDark-1 text-sm prose-p:my-2\"><p>Oh, and if I want a large language model integrated into my tower, I'm going\n        to write the integration myself with the model <a href=\"https://xeiaso.net/blog/2025/dgx-spark-first-look/\">running on hardware I can look\n        at</a>.</p></div></div></div>\n        <p>At the very least, when something goes wrong on Linux you have log messages that can let you know what went wrong so you can search for it.</p>"
            ],
            "link": "https://xeiaso.net/notes/2026/year-linux-desktop/",
            "publishedAt": "2026-01-02",
            "source": "Xe Iaso",
            "summary": "<p>TL;DR: 2026 is going to be The Year of The Linux Desktop for me. I haven't booted into Windows in over 3 months on my tower and I'm starting to realize that it's not worth wasting the space for. I plan to unify my three SSDs and turn them all into btrfs drives on Fedora.</p> <p>I've been merely tolerating Windows 11 for a while but recently it's gotten to the point where it's just absolutely intolerable. Somehow Linux on the desktop has gotten so much better by not even doing anything differently. Microsoft has managed to actively sabotage the desktop experience through years of active disregard and spite against their users. They've managed to take some of their most revolutionary technological innovations (the NT kernel's hybrid design allowing it to restart drivers, NTFS, ReFS, WSL, Hyper-V, etc.) then just shat all over them with start menus made with React Native, control-alt-delete menus that are actually just webviews, and forcing Copilot down everyone's throats to the point that I've accidentally gotten stuck in Copilot in a handheld gaming PC and had to hard reboot the device to get out of it. It's as if the internal teams at Microsoft have had",
            "title": "2026 will be my year of the Linux desktop"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-02"
}