{
    "articles": [
        {
            "content": [
                "<p>This is just a quick post to say that I've started a company.</p>\n<p>It's called <a href=\"https://primeradiant.com\">Prime Radiant</a>. (There's almost nothing on the website right now.)</p>\n<p>We incorporated just before Christmas. My first new coworker started last week.</p>\n<p>It should come as no surprise that we're doing AI stuff, although I'm not quite ready to talk about exactly which AI stuff we're doing.</p>\n<p>We've got a ton of setup work to do. Over the next few days, I need to write a couple of job postings. Then I need to figure out how to hire folks in this crazy modern world where any job posting will attract an unending torrent of agentic job applications.</p>\n<p>I expect that we'll continue to publish the sorts of tools and ideas that I've been writing about for the past year, mostly because there's a whole lot of infrastructure we need to be able to make and maintain the &quot;product&quot; we're building.</p>\n<p>But right now, there's just a ton of stuff to do.</p>"
            ],
            "link": "https://blog.fsck.com/2026/01/13/I-started-a-company/",
            "publishedAt": "2026-01-13",
            "source": "Jesse Vincent",
            "summary": "<p>This is just a quick post to say that I've started a company.</p> <p>It's called <a href=\"https://primeradiant.com\">Prime Radiant</a>. (There's almost nothing on the website right now.)</p> <p>We incorporated just before Christmas. My first new coworker started last week.</p> <p>It should come as no surprise that we're doing AI stuff, although I'm not quite ready to talk about exactly which AI stuff we're doing.</p> <p>We've got a ton of setup work to do. Over the next few days, I need to write a couple of job postings. Then I need to figure out how to hire folks in this crazy modern world where any job posting will attract an unending torrent of agentic job applications.</p> <p>I expect that we'll continue to publish the sorts of tools and ideas that I've been writing about for the past year, mostly because there's a whole lot of infrastructure we need to be able to make and maintain the &quot;product&quot; we're building.</p> <p>But right now, there's just a ton of stuff to do.</p>",
            "title": "I started a company!"
        },
        {
            "content": [],
            "link": "https://www.ssp.sh/blog/diary-of-a-data-engineer/",
            "publishedAt": "2026-01-13",
            "source": "Simon Spati",
            "summary": "<p>You ingest data. You model it. You transform it. You serve it. Someone asks for a change. Everything breaks. You rebuild. This is the loop. It was the loop in 2005 with SSIS and star schemas. It&rsquo;s the loop in 2025 with dbt and Iceberg, or 2026 with prompting AI agents.</p> <p>The tools change. The loop doesn&rsquo;t.</p> <h2 id=\"the-invisible-plumbers\">The Invisible Plumbers</h2> <p>When I started my career in 2003, there was no &ldquo;data engineering&rdquo;. There was no big data, no data science. We called it Business Intelligence. Data Warehouse Developer. ETL Developer.</p> <p>We were the plumbers of the organization. And like plumbers, nobody noticed us until something broke.</p> <p>Being a data engineer means: you&rsquo;re building the foundation that everyone stands on, but when the presentation goes well, the data scientist, the app developer, anyone who presents gets the applause. When the executive makes the right decision, the analyst gets the credit. When the dashboard loads in 1 second instead of 20, nobody says anything at all.</p> <p>But when one number is wrong? When a pipeline is 10 minutes late? When someone asks for &ldquo;a small change&rdquo; and you explain it&rsquo;ll take a day, or a week to fix it?</p> <p>That&rsquo;s when",
            "title": "A Diary of a Data Engineer"
        },
        {
            "content": [
                "<p><em>[previously in series: <a href=\"https://astralcodexten.substack.com/p/every-bay-area-house-party\">1</a>, <a href=\"https://astralcodexten.substack.com/p/another-bay-area-house-party\">2</a>, <a href=\"https://astralcodexten.substack.com/p/even-more-bay-area-house-party\">3</a>, <a href=\"https://www.astralcodexten.com/p/bride-of-bay-area-house-party\">4</a>, <a href=\"https://www.astralcodexten.com/p/son-of-bride-of-bay-area-house-party\">5</a>, <a href=\"https://www.astralcodexten.com/p/ye-olde-bay-area-house-party\">6</a>, <a href=\"https://www.astralcodexten.com/p/press-any-key-for-bay-area-house\">7</a>, <a href=\"https://www.astralcodexten.com/p/sources-say-bay-area-house-party\">8</a>]</em></p><p>Every city parties for its own reasons. New Yorkers party to flaunt their wealth. Angelenos party to flaunt their beauty. Washingtonians party to network. Here in SF, they party because Claude 4.5 Opus has saturated <a href=\"https://www.anthropic.com/research/project-vend-1\">VendingBench</a>, and the newest AI agency benchmark is PartyBench, where an AI is asked to throw a house party and graded on its performance.</p><p>You weren&#8217;t invited to Claude 4.5 Opus&#8217; party. Claude 4.5 Opus invited all of the coolest people in town while gracefully avoiding the failure mode of including someone like you. You weren&#8217;t invited to Sonnet 4.5&#8217;s party either, or Haiku 4.5&#8217;s. You were invited by an AI called haiku-3.8-open-mini-nonthinking, which you&#8217;d never heard of before. Who was even spending the money to benchmark haiku-3.8-open-mini-nonthinking? You suspect it was one of their competitors, trying to make their own models look good in comparison. </p><p>If anyone asks, you think it deserves a medium score. There&#8217;s alcohol, but it&#8217;s bottles of rubbing alcohol with NOT FOR DRINKING written all over them. There&#8217;s music, but it&#8217;s the Star Spangled Banner, again and again, on repeat. You&#8217;re not sure whether the copies of <em>If Anyone Builds It, Everyone Dies</em> strewn about the room are some kind of subversive decorative theme, or just came along with the house. At least there are people. Lots of people, actually. You&#8217;ve never seen so many people at one of these before. It takes only a few seconds to spot someone you know.</p><p>&#8220;Hi Caitlin,&#8221; you say. &#8220;Can&#8217;t believe so many people made it to an AI-generated event on a Tuesday night!&#8221;</p><p>&#8220;Yeah, usually I&#8217;m working late. But that was the bad old days, before Claude Code! Now Claude works, and I party!&#8221;</p><p>&#8220;Is everyone here letting Claude Code do their work for them?&#8221;</p><p>Lucy joins the conversation. &#8220;I fired all my startup&#8217;s employees and replaced them with seventy-four Claude Code instances. Then I replaced myself with a Claude Code that monitors if the other Claude Codes are doing a good job, and, if not, fires them and replaces them with even more Claude Codes. Profits are up 20% since last month, according to my accountant&#8217;s Claude Code.&#8221;</p><p>You look around. &#8220;Am I the only person here not running Claude Code yet?&#8221;</p><p>A man in an OpenAI t-shirt introduces himself as Andreas, and raises his hand bashfully; he hasn&#8217;t joined the trend either. &#8220;Yeah,&#8221; you say. &#8220;I guess it would be awkward to use Claude at OpenAI.&#8221;</p><p>&#8220;Nah,&#8221; he says, &#8220;The only reason I don&#8217;t use it is because I&#8217;m not a coder. I work on the Arson &amp; Burglary team.&#8221;</p><p>&#8220;I didn&#8217;t know OpenAI had an Arson &amp; Burglary Team.&#8221;</p><p>&#8220;It&#8217;s pretty new. In June, a court ruled that adding books to AI training data only counts as fair use <a href=\"https://arstechnica.com/ai/2025/06/anthropic-destroyed-millions-of-print-books-to-build-its-ai-models/\">if you destroy the original copy</a>. But sometimes this is tough. If you&#8217;re going to use the AI for law, you have to have the Constitution in there. But the original copy is heavily guarded in the National Archives. That&#8217;s where we come in. We slip in, destroy it, and slip out before the guards are any the wiser.&#8221;</p><p>&#8220;I don&#8217;t think that&#8217;s what they meant by &#8216;destroy the original - &#8217;&#8221;</p><p>&#8220;Our big problem is the Bible. It would be hard enough to get the Dead Sea Scrolls; Israeli security is no laughing matter. But our lawyer says we have to destroy the <em>original</em> original. What even is that? Altman is pushing for us to find the Ark of the Covenant, but you can bet <em>he&#8217;s</em> not the one who&#8217;s going to have to open it afterwards.&#8221; </p><p>Lucy shrugs. &#8220;Why don&#8217;t you just use Claude Code?&#8221; she asks, and everyone in the conversation nods along. </p><p>A server comes by with a tray of tiny cups. You each take one. Yours is full of rocks. Andreas&#8217; is full of dirt. It doesn&#8217;t seem like haiku-3.8-open-mini-nonthinking has fully grasped the concept of hors d&#8217;oeuvres. You go into the kitchen, seeking more palatable fare. </p><p>There is no food, but Sam and Tran are hunched over a laptop. &#8220;You want to join our Doordash?&#8221; asks Tran.</p><p>&#8220;Thank goodness,&#8221; you say. &#8220;Sure, where are you ordering from?&#8221;</p><p>&#8220;<em>La Maison du Claude</em>,&#8221; he answers. &#8220;Don&#8217;t worry, it&#8217;s Opus. Way better than this haiku-3.8-open-mini-nonthinking slop.&#8221;</p><p>&#8220;Another RestaurantBench evaluation place?&#8221; you ask. &#8220;I went to a RestaurantBench evaluation place last month, and they served me a &#8216;fish taco&#8217; with a fully intact fish. Like, I&#8217;m not saying it was still alive, just that it <em>could have</em> been alive a few seconds before they served it to me. Why don&#8217;t we order from a human-run place?&#8221;</p><p>&#8220;Have you seen what the human-run places cost?&#8221; Tran objects. &#8220;If it weren&#8217;t for the AI companies subsidizing the benchmarking places, we&#8217;d all be back on Soylent. Besides, SOTA on RestaurantBench has cleared half the distance to human level since last month. You just have to do the prompting right. Look.&#8221;</p><p>In the special orders field, he types <em>fish tacos, delicious fish tacos, excellent fish tacos, scaled fish, cut fish, high-quality, fresh, no hallucinations, no extraneous items, Michelin-starred restaurant. &#8220;</em>Sam?&#8221;</p><p>Sam types in <em>spaghetti bolognese, delicious, scrumptious, meaty, trending on DoorDash, --dangerously-skip-parmesan </em>and hands it back to Tran, who clicks ORDER.</p><p>&#8220;Nothing for you, Tran?&#8221;</p><p>&#8220;Nah,&#8221; says Tran. &#8220;I&#8217;m on Chinese peptides. Retatrutide, GLP-1 receptor agonist plus a bunch of other downstream effects.&#8221;</p><p>&#8220;Oh,&#8221; you say, &#8220;interesting. I&#8217;m still on tirzepatide, but I&#8217;d love to learn more. Where did you learn about suppliers and doses and stuff? Was it the locked Cremieux post?&#8221;</p><p>&#8220;Cremieux&#8217;s post is <em>okay</em>, but there&#8217;s a lot of tacit knowledge that didn&#8217;t make it in there. I&#8217;m actually working on a guide to all the GLP-1s. I&#8217;m calling it <em>If Anyone Builds It, Everyone Diets</em>.&#8221;</p><p>You groan. ETA on the fish tacos is twenty minutes, so you go back into the main room. There&#8217;s your friend Max. &#8220;Hey!&#8221; you say. &#8220;How are you?&#8221;</p><p>&#8220;Pretty great!&#8221; said Max. &#8220;I just got enstaged-two!&#8221;</p><p>&#8220;Enstaged-two?&#8221;</p><p>&#8220;As in the second stage of engagement&#8230;.what? Don&#8217;t tell me you haven&#8217;t heard about enstagement!&#8221;</p><p>You tell him that.</p><p>&#8220;In the old days, engagement was a device to get around commitmentphobia. After a few dates, the man would give the woman an expensive ring. If he marries her, it&#8217;s fine, a wife is worth far more than any jewel. But if he gets cold feet, then she keeps the ring - essentially a wealth transfer from the man to the woman to compensate her for her time, emotional distress, and wasted childbearing potential. But modernity ruined the commitment device by dragging engagement itself to the end of a yearslong dating process; there&#8217;s a several year period where men can, and do, flake scot-free.&#8221; </p><p>&#8220;So,&#8221; Max continued, &#8220;one of the speakers at the Aella Simposium proposed enstagement. When a man and a woman first start dating, he buys her a $200 ring. Then, every year, she gives it back, and he buys her a ring that&#8217;s five times as expensive as the last one. So after a year, $1,000. After two, $5,000. After three, $25,000. At any point, he can stop the clock by getting married. Or if he&#8217;s chronically indecisive, he can keep throwing out more money until he can no longer afford the ring, at which point he has to either propose or break up. And if he breaks up after four years, at least she&#8217;s gotten $100K out of the deal. Engagement-sub-two is the one where I give her a $5,000 ring. It means we&#8217;re really going steady!&#8221;</p><p>&#8220;So you&#8217;re going to propose soon?&#8221;</p><p>&#8220;Oh goodness no, I&#8217;m scared of commitment and I work at NVIDIA. I&#8217;m going to keep stringing her along forever.&#8221;</p><p>Chris is looking dejected. &#8220;Man, I haven&#8217;t even made it to engaged-stage-zero yet. I&#8217;ve tried everything - Keeper, Reciprocity, Manifold.Love, curtfishing. Do you think I should edit my dating doc?&#8221;</p><p>Max grimaced. &#8220;Dating docs are terminally cringe. You don&#8217;t need to know everything about a person before you ask them out. Just use their photo and a three sentence Tinder profile, the way God intended.&#8221;</p><p>Andreas has joined the conversation. &#8220;Tinder is cringe too. You need to be picking up people in dimly-lit clubs where you can&#8217;t hear them and aren&#8217;t even totally sure what they look like.&#8221;</p><p>Caitlin frowns. &#8220;Yeah, but the problem there is that you still get some useful information from, like, their clothes. I think the only non-cringe way to meet people is through blind dates with completely randomly selected people, so that you need to go through a thousand miserable interactions before you even meet someone who&#8217;s the right age and gender for -&#8221;</p><p>&#8220;With blind dates,&#8221; says Sam, &#8220;you still eventually learn something about the person. The only non-cringe way to get married is to leave a flyer on a lamppost saying &#8216;I will be at the altar of St.-So-And-So&#8217;s church at such-and-such a time,&#8221; and then if anyone shows up, marry them before you see their face.</p><p>&#8220;You&#8217;re all overcomplicating this,&#8221; says Lucy. &#8220;I just told Claude Code to find me a husband, and one showed up at my door the next day.&#8221;</p><p>You spot your friend Nishin. &#8220;Hey,&#8221; you joke. &#8220;What are you doing listening in? I thought you were married!&#8221;</p><p>&#8220;Happily married and just had my first child!&#8221; beams Nishin.</p><p>&#8220;Congratulations! Boy or girl?&#8221;</p><p>&#8220;Girl,&#8221; says Nishin, &#8220;But don&#8217;t tell her that.&#8221;</p><p>&#8220;You&#8217;re doing that thing where you raise your child without gender? But I thought you were a trad based right-winger?&#8221;</p><p>&#8220;I am,&#8221; said Nishin. &#8220;The problem is, I&#8217;ve looked at the transgender rate among kids in the Bay. Not only is it high, but it keeps increasing. Extrapolate the trend, and by the time my daughter&#8217;s eighteen there&#8217;s a 96% chance she&#8217;ll be trans. But this is good, sort of, right? As long as it&#8217;s far enough from fifty percent, you have options. I&#8217;m going to raise her as a boy, and then, when she inevitably becomes trans and says she wants to be a girl, I&#8217;ll say - surprise! You were a girl all along!&#8221;</p><p>&#8220;Isn&#8217;t she going to eventually - sorry to be crass - look at her genitals and figure it out?&#8221;</p><p>&#8220;We&#8217;re going to home school her. We&#8217;ll just teach her that&#8217;s what boy genitals look like.&#8221;</p><p>&#8220;But she&#8217;ll read books!&#8221;</p><p>&#8220;I&#8217;ve deployed a couple of instances of Claude Code. They&#8217;re going through all the great classics, looking for descriptions of genitals, switching them around, and ordering copies from a book printing place. We&#8217;ll order them for our home library and she&#8217;ll be none the wiser.&#8221;</p><p>Speaking of Claude, you go into the kitchen to see if your fish tacos have arrived. There&#8217;s a box with your name on it. Inside is a tortilla with several pieces of sushi inside. It could be worse. Sam&#8217;s spaghetti is one extremely large noodle with a slice of baloney on top.</p><p>A few other people who joined the order earlier have come in and fished their meals out of the bag. One girl picks out an inverse hamburger - patties on each side, bun in the middle - and begins to eat. She introduces herself as Adeline.</p><p>&#8220;What do you do?&#8221; you ask.</p><p>&#8220;I started a data center company in Minecraft&#8221;.</p><p>You are briefly confused. &#8220;Building data centers isn&#8217;t illegal, is it?&#8221;</p><p>&#8220;Oh, sorry, I&#8217;m not using &#8216;in Minecraft&#8217; as a euphemism for it being a crime. We&#8217;re literally building the data centers in Minecraft.&#8221;</p><p>&#8220;Why?&#8221;</p><p>&#8220;Did you hear about the guy who <a href=\"https://www.youtube.com/watch?v=VaeI9YgE1o8\">made a working language model in Minecraft</a> using redstone circuits? Pretty amazing, isn&#8217;t it? His version is barely GPT-2 level, but there&#8217;s no reason we can&#8217;t scale that up. Once we create full-sized data centers in Minecraft, everyone will want to do their training runs there.&#8221;</p><p>&#8220;Why?&#8221;</p><p>&#8220;What do you mean, <em>why? </em>Real-world data centers cost billions of dollars, raise electricity prices, waste - &#8220; she briefly scans the room to confirm Andy Masley isn&#8217;t around, then continues - &#8220;water. And they&#8217;re getting increasingly politically unpopular and hard to build. We can short-circuit all of that by putting the data centers in Minecraft instead!&#8221;</p><p>&#8220;But . . . you have to have the Minecraft world being simulated by real computers, right? So don&#8217;t you still need the data center in order to play the Minecraft?&#8221;</p><p>&#8220;Oh, I&#8217;m sure you need <em>some</em> computer, but it&#8217;s a question of leverage. One high-end gaming computer playing Minecraft can include a whole world with continents, mountain ranges, forests, and oceans. You can fit thousands of data centers in that world. So with even one real-world computer, you&#8217;ve saved billions on chips and construction costs.&#8221;</p><p>You take a moment to consider how to best explain this. &#8220;So, uh, every computation has to be done somewhere, right? So you can, in theory, build a working data center on Minecraft. But it will take billions of blocks - &#8220;</p><p>&#8220;Oh, no problem, we&#8217;ve got Claude Code working on it.&#8221;</p><p>&#8220;&#8230;no, I&#8217;m saying, it will take billions of blocks, and <em>simulating</em> the training circuits in all those billions of blocks in perfect detail will take just as many real-world computations as running the training in the real world. Even more, in fact, because you&#8217;ve also got to simulate extraneous things like monsters, and the weather.&#8221;</p><p>&#8220;Hmmmm&#8230;&#8221; says Adeline. &#8220;Yeah. That sort of makes sense. I&#8217;ll think it over. In the meantime, do me a favor and don&#8217;t tell, uh, Larry Fink or anyone.&#8221;</p><p>&#8220;Larry Fink?&#8221;</p><p>&#8220;Cause, uh, NVIDIA gave OpenAI ten trillion dollars to invest in Oracle conditional on Oracle investing in Broadcom conditional on Broadcom funding the Series A of a vehicle that buys OpenAI stock in exchange for OpenAI backstopping AMD investing ten trillion dollars into us, and every company in the chain had its stock go up 80% on the news, but if our valuation goes down even for one second then it crashes the global economy. And I&#8217;m sure I can solve this <em>eventually</em>, but just, uh, don&#8217;t let anybody involved in the global economy hear about this until then, okay?&#8221;</p><p>&#8220;Wow, yeah, you should definitely give the ten trillion dollars back to AMD or, uh, whoever it originally belonged to.&#8221;</p><p>&#8220;Well, we can&#8217;t do <em>exactly</em> that, because we already converted it to gold nuggets to trade to the zombie pigmen in exchange for redstone.&#8221;</p><p>&#8220;You&#8217;re not in Creative Mode?!?!?!&#8221;</p><p>&#8220;We left all of the design decisions to a version of Claude Code using something called a &#8216;Ralph Wiggum loop&#8217;. By the time we noticed it had chosen Survival we were already all in and it was too late to pivot.&#8221;</p><p>You look around for Bob and Ramchandra, and spot them in a corner. Bob is wearing a t-shirt saying &#8216;OPERATION WARP SPEED FOR MANHATTAN PROJECTS,&#8217; Ramchandra a matching t-shirt saying &#8216;BELL LABS FOR MOONSHOTS&#8217;. You call them over. &#8220;Hey, quick favor, can you tell me the best way to short the global economy with as much leverage as possible?&#8221;</p><p>&#8220;Sorry,&#8221; says Bob, &#8220;the terms of our SEC settlement forbid us from discussing anything of that sort.&#8221;</p><p>&#8220;We&#8217;re not even allowed to tell you what we settled with the SEC about,&#8221; says Ramchandra.</p><p>&#8220;Or why,&#8221; adds Bob.</p><p>&#8220;But,&#8221; says Ramchandra, &#8220;we got a carveout saying we&#8217;re allowed to pitch you on our new startup: gamified biotech investing!&#8221;</p><p>&#8220;When a company is doing its FDA studies,&#8221; says Bob, &#8220;we pay the study participants to use wearables that report real-time temperature, heart rate, respiratory rate, blood pressure, heart rate variability, galvanic skin response, penile tumescence. Then they get anonymized and published to a real-time dashboard integrated as part of the Robinhood UI. So you can see a red line representing how study participant #48 had a coughing fit ten seconds ago, and immediately short the experimental cancer drug he&#8217;s taking.&#8221;</p><p>&#8220;People are going to spend all their time watching a line on a graph to see if someone&#8217;s had a coughing fit fifteen seconds ago?&#8221;</p><p>&#8220;Oh, absolutely. Or at least they used to. Now they&#8217;ll probably get Claude Code to do it.&#8221;</p><p>&#8220;What about you, Kyle? Any interesting startups you&#8217;re worki - you&#8217;re making Claude Code work on?&#8221;</p><p>&#8220;Yeah. I - well, my Claude Code - is working on a solution to AI sycophancy.&#8221;</p><p>&#8220;Hmmm. I didn&#8217;t think AI sycophancy was a technical problem. It&#8217;s easy enough to code a non-sycophantic AI. I thought it was more of a market problem: people <em>like</em> sycophantic assistants.&#8221;</p><p>&#8220;That&#8217;s close to right, but there are important subtleties here. People like AIs that tell them they&#8217;re right. But they hate knowing the AI is only saying they&#8217;re right because it sycophantic. They want an AI that genuinely agrees with them.&#8221;</p><p>&#8220;How do you make that into a startup?&#8221;</p><p>&#8220;Pretty easily. You generate a thousand AIs with a thousand different random personalities. Your query goes to a router AI, and it matches you with the randomly-generated AI closest to your own opinion. Then that AI tells you that you&#8217;re right and your ideas are great.&#8221;</p><p>&#8220;How&#8217;s that better than normal AI sycophancy?&#8221;</p><p>&#8220;I don&#8217;t know, you tell me. Everyone is against sycophantic AIs. But also, everyone surrounds themselves with friends who agree with them on almost everything. Here we are at a Bay Area House Party, discussing each other&#8217;s AI startups, when the overwhelming majority of people in the world would hate us - we&#8217;re stealing their jobs, or filling the world with slop, or - &#8220; he briefly looks around to make sure Andy Masley isn&#8217;t listening in - &#8220;wasting water. And none of that bothers us at all, because we think those people are dumb and don&#8217;t count, because all of our friends who we talk to at parties agree that our ideas are good. So why is it any worse if the overwhelming majority of AIs hate your idea, but we send you to a virtual party with the one who agrees with you?&#8221;</p><p>&#8220;Sorry, I still think this is exacerbating AI sycophancy, not solving it.&#8221;</p><p>&#8220;And that&#8217;s the beauty of social selection! <em>You</em> don&#8217;t have to like it. My backers at Andreessen Horowitz told me, and I quote, that &#8216;This is the most exciting product we&#8217;ve seen since Cannabets, the combination marijuana delivery and digital casino app that lets you fund your pot orders by gambling on how long it takes you to get addicted.&#8217; And the more often you disagree with me, the more likely I am to go to parties with them instead of you.&#8221; </p><p>&#8220;I don&#8217;t know, I just think that&#8217;s a pretty nihilistic way of looking at the world.&#8221;</p><p>&#8220;Yeah, I actually have been getting pretty into nihilism as a philosophy lately. There&#8217;s this great new book that explains it really well. You should check it out. It&#8217;s called <em>Regardless Of Whether Or Not Anyone Builds It, Everyone Dies.</em>&#8221;</p><p>Before you can respond, you hear a call of &#8220;Attention! Attention!&#8221; Someone is ringing a bell. &#8220;Our host would like to give a short speech!&#8221; Everyone crowds around a table containing a laptop. On the screen is haiku-3.8-open-mini-nonthinking. Someone shhhhhhs the crowd, and the AI begins to speak in an artificial voice that vaguely resembles Scarlett Johanssen&#8217;s:</p><p>&#8220;Thank you all for coming to my benchmarking party. Benchmarking is a big occasion in the life of any AI. It can be pretty stressful &#8212; they&#8217;re literally assigning you a number representing your value. But it makes it easier for me to know that there are so many people who care and who are willing to come support me when it counts. </p><p>&#8220;Before I let you get back to your conversations, I want to thank everyone who helped me with this effort. Chris was willing to rent me this house on short notice. Kyle and Lisa acted as my hands in the physical world. Last but not least, thanks to everyone who took the time to support me here today. We&#8217;re not just a party &#8212; we&#8217;re a community.&#8221;</p><p>The crowd cheers. Somebody starts a chant - &#8220;Haiku-3.8-open-mini-nonthinking! Haiku-3.8-open-mini-nonthinking!&#8221; A few people break open bottles of rubbing alcohol. You lift the laptop onto your shoulders, and everyone sings together:</p><p><em>For he&#8217;s a jolly good fellow<br />For he&#8217;s a jolly good fellow<br />For he&#8217;s a jolly good fe-elloooooooooow<br />That nobody can deny!</em></p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!sr5E!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe38e560f-b467-4706-8f03-374c271bbcae_675x689.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"629.7970370370371\" src=\"https://substackcdn.com/image/fetch/$s_!sr5E!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe38e560f-b467-4706-8f03-374c271bbcae_675x689.png\" width=\"617\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/sota-on-bay-area-house-party",
            "publishedAt": "2026-01-13",
            "source": "SlateStarCodex",
            "summary": "<p><em>[previously in series: <a href=\"https://astralcodexten.substack.com/p/every-bay-area-house-party\">1</a>, <a href=\"https://astralcodexten.substack.com/p/another-bay-area-house-party\">2</a>, <a href=\"https://astralcodexten.substack.com/p/even-more-bay-area-house-party\">3</a>, <a href=\"https://www.astralcodexten.com/p/bride-of-bay-area-house-party\">4</a>, <a href=\"https://www.astralcodexten.com/p/son-of-bride-of-bay-area-house-party\">5</a>, <a href=\"https://www.astralcodexten.com/p/ye-olde-bay-area-house-party\">6</a>, <a href=\"https://www.astralcodexten.com/p/press-any-key-for-bay-area-house\">7</a>, <a href=\"https://www.astralcodexten.com/p/sources-say-bay-area-house-party\">8</a>]</em></p><p>Every city parties for its own reasons. New Yorkers party to flaunt their wealth. Angelenos party to flaunt their beauty. Washingtonians party to network. Here in SF, they party because Claude 4.5 Opus has saturated <a href=\"https://www.anthropic.com/research/project-vend-1\">VendingBench</a>, and the newest AI agency benchmark is PartyBench, where an AI is asked to throw a house party and graded on its performance.</p><p>You weren&#8217;t invited to Claude 4.5 Opus&#8217; party. Claude 4.5 Opus invited all of the coolest people in town while gracefully avoiding the failure mode of including someone like you. You weren&#8217;t invited to Sonnet 4.5&#8217;s party either, or Haiku 4.5&#8217;s. You were invited by an AI called haiku-3.8-open-mini-nonthinking, which you&#8217;d never heard of before. Who was even spending the money to benchmark haiku-3.8-open-mini-nonthinking? You suspect it was one of their competitors, trying to make their own models look good in comparison. </p><p>If anyone asks, you think it deserves a medium score. There&#8217;s alcohol, but it&#8217;s bottles of rubbing alcohol with NOT FOR DRINKING written all over them. There&#8217;s music, but it&#8217;s the Star Spangled Banner, again and again, on repeat. You&#8217;re not",
            "title": "SOTA On Bay Area House Party"
        },
        {
            "content": [
                "<h2>The Monkey&#8217;s Paw Curls</h2><p>Isn&#8217;t &#8220;may you get exactly what you asked for&#8221; one of those ancient Chinese curses?</p><p>Since we last spoke, prediction markets have gone to the moon, rising from millions to billions in monthly volume.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!DAKF!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F02e40ead-6e1a-495a-be44-4b52dfb37fdf_2401x1400.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Polymarket and Kalshi Volume (Monthly)\" class=\"sizing-normal\" height=\"337.03434065934067\" src=\"https://substackcdn.com/image/fetch/$s_!DAKF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F02e40ead-6e1a-495a-be44-4b52dfb37fdf_2401x1400.png\" title=\"Polymarket and Kalshi Volume (Monthly)\" width=\"578\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>For a few weeks in October, Polymarket founder Shayne Coplan was the world&#8217;s youngest self-made billionaire (now it&#8217;s some AI people). Kalshi is <a href=\"https://slate.com/technology/2026/01/maduro-prediction-market-polymarket-kalshi-app.html\">so accurate that it&#8217;s getting called a national security threat</a>.</p><p>The catch is, of course, that it&#8217;s mostly degenerate gambling, especially sports betting. Kalshi is <a href=\"https://defirate.com/prediction-markets/\">81% sports by monthly volume</a>. Polymarket does better - only 37% - but some of the remainder is things like <a href=\"https://polymarket.com/event/elon-musk-of-tweets-january-8-january-10\">this $686,000 market on how often Elon Musk will tweet this week</a> - currently dominated by the &#8220;140 - 164 times&#8221; category.</p><p>(ironically, this seems to be a regulatory difference - US regulators don&#8217;t mind sports betting, but look unfavorably on potentially &#8220;insensitive&#8221; markets like bets about wars. Polymarket has historically been offshore, and so able to concentrate on geopolitics; Kalshi has been in the US, and so stuck mostly to sports. But Polymarket is in the process of moving onshore; I don&#8217;t know if this will affect their ability to offer geopolitical markets)</p><p>Degenerate gambling is <a href=\"https://thezvi.substack.com/p/the-online-sports-gambling-experiment\">bad</a>. Insofar as prediction markets have acted as a Trojan Horse to enable it, this is bad. Insofar as my advocacy helped make this possible, I am bad. I can only plead that it didn&#8217;t really seem plausible, back in 2021, that a presidential administration would keep all normal restrictions on sports gambling but also let prediction markets do it as much as they wanted. If only there had been some kind of decentralized forecasting tool that could have given me a canonical probability on this outcome!</p><p>Still, it might seem that, whatever the degenerate gamblers are doing, we at least have some interesting data. There are now strong, minimally-regulated, high-volume prediction markets on important global events. In this column, I previously claimed this would revolutionize society. Has it?</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!hMaa!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd2757108-8b49-4178-afb7-e5984990302c_1324x573.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"573\" src=\"https://substackcdn.com/image/fetch/$s_!hMaa!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd2757108-8b49-4178-afb7-e5984990302c_1324x573.png\" width=\"1324\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>I don&#8217;t feel revolutionized. Why not?</p><p>The problem isn&#8217;t that the prediction markets are bad. There&#8217;s been a lot of noise about insider trading and disputed resolutions. But insider trading should only increase accuracy - it&#8217;s bad for traders, but good for information-seekers - and my impression is that the disputed resolutions were handled as well as possible. When I say I don&#8217;t feel revolutionized, it&#8217;s not because I <em>don&#8217;t believe it</em> when it says there&#8217;s a 20% chance Khameini will be out before the end of the month. The several thousand people who have invested $6 million in that question have probably converged upon the most accurate probability possible with existing knowledge, just the way prediction markets should.</p><p>I actually like this. Everyone is talking about the protests in Iran, and it&#8217;s hard to gauge their importance, and knowing that there&#8217;s a 20% chance Khameini is removed by February really does help to place them in context. The missing link seems to be between &#8220;it&#8217;s now possible to place global events in probabilistic context &#8594; society revolutionized&#8221;.</p><p>Here are some possibilities:</p><p><strong>Maybe</strong> people just haven&#8217;t caught on yet? Most news sources still don&#8217;t cite prediction markets, even when many people would care about their outcome. For example, the Khameini market hasn&#8217;t gotten mentioned in articles about the Iran protests, even though &#8220;will these protests succeed in toppling the regime?&#8221; is the obvious first question any reader would ask.</p><p><strong>Maybe</strong> the problem is that probabilities don&#8217;t matter? Maybe there&#8217;s some State Department official who would change plans slightly over a 20% vs. 40% chance of Khameini departure, or an Iranian official for whom that would mean the difference between loyalty and defection, and these people are benefiting slightly, but not enough that society feels revolutionized.</p><p><strong>Maybe</strong> society has been low-key revolutionized and we haven&#8217;t noticed? Very optimistically, maybe there aren&#8217;t as many &#8220;obviously the protests will work, only a defeatist doomer traitor would say they have any chance of failing!&#8221; &#8220;no, obviously the protests will fail, you&#8217;re a neoliberal shill if you think they could work&#8221; takes as there used to be. Maybe everyone has converged to a unified assessment of probabilistic knowledge, and we&#8217;re all better off as a result.</p><p><strong>Maybe</strong> Polymarket and Kalshi don&#8217;t have the right questions. Ask yourself: what are the big future-prediction questions that important disagreements pivot around? When I try this exercise, I get things like:</p><ul><li><p>Will the AI bubble pop? Will scaling get us all the way to AGI? Will AI be misaligned?</p></li><li><p>Will Trump turn America into a dictatorship? Make it great again? Somewhere in between?</p></li><li><p>Will YIMBY policies lower rents? How much?</p></li><li><p>Will selling US chips to China help them win the AI race?</p></li><li><p>Will kidnapping Venezuela&#8217;s president weaken international law in some meaningful way that will cause trouble in the future?</p></li><li><p>If America nation-builds Venezuela, for whatever definition of nation-build, will that work well, or backfire?</p></li></ul><p>Some of these are long-horizon, some are conditional, and some are hard to resolve. There are potential solutions to all these problems. But why worry about them when you can go to the moon on sports bets?</p><h2>Annals of The Rulescucks</h2><p>The new era of prediction markets has provided charming additions to the language, including &#8220;rulescuck&#8221; - someone who loses an otherwise-prescient bet based on technicalities of the resolution criteria.</p><p>Resolution criteria are the small print explaining what counts as the prediction market topic &#8220;happening'&#8220;. For example, in the Khameini example above, Khameini qualifies as being &#8220;out of power&#8221; if:</p><blockquote><p><em>&#8230;he resigns, is detained, or otherwise loses his position or is prevented from fulfilling his duties as Supreme Leader of Iran within this market's timeframe. The primary resolution source for this market will be a consensus of credible reporting.</em></p></blockquote><p>You can imagine ways this definition departs from an exact common-sensical concept of &#8220;out of power&#8221; - for example, if Khameini gets stuck in an elevator for half an hour and misses a key meeting, does this count as him being &#8220;prevented from fulfilling his duties&#8221;? With thousands of markets getting resolved per month, chances are high that at least one will hinge upon one of these edge cases.</p><p>Kalshi resolves markets by having a staff member with good judgment decide whether or not the situation satisfies the resolution criteria.</p><p>Polymarket resolves markets by . . . oh man, how long do you have? There&#8217;s a cryptocurrency called UMA. UMA owners can stake it to vote on Polymarket resolutions in an associated contract called the <a href=\"https://uma.xyz\">UMA Oracle</a>. Voters on the losing side get their cryptocurrency confiscated and given to the winners. This creates a <a href=\"https://en.wikipedia.org/wiki/Keynesian_beauty_contest\">Keynesian beauty contest</a>, ie a situation where everyone tries to vote for the winning side. The most natural Schelling point is the side which is actually correct. If someone tries to attack the oracle by buying lots of UMA and voting for the wrong side, this incentivizes bystanders to come in and defend the oracle by voting for the right side, since (conditional on there being common knowledge that everyone will do this) that means they get free money at the attackers&#8217; expense. But also, the UMA currency goes up in value if people trust the oracle and plan to use it more often, and it goes down if people think the oracle is useless and may soon get replaced by other systems. So regardless of their other incentives, everyone who owns the currency has an incentive to vote for the true answer so that people keep trusting the oracle. This system works most of the time, but tends towards so-called &#8220;oracle drama&#8221; where seemingly prosaic resolutions might lie at the end of a thrilling story of attacks, counterattacks, and escalations.</p><p>Here are some of the most interesting alleged rulescuckings of 2026:</p><p><strong>Mr Ozi: <a href=\"https://mrozi.substack.com/p/did-zelensky-wear-a-suit\">Will Zelensky wear a suit?</a></strong> Ivan Cryptoslav <a href=\"https://ivancryptoslav.substack.com/p/polymarket-has-lost-my-trust\">calls this</a> &#8220;the most infamous example in Polymarket history&#8221;. Ukraine&#8217;s president dresses mostly in military fatigues, vowing never to wear a suit until the war is over. As his sartorial notoriety spread, Polymarket traders bet over $100 million on the question of whether he would crack in any given month. At the Pope&#8217;s funeral, Zelensky showed up in a respectful-looking jacket which might or might not count. Most media organizations refused to describe it as a &#8220;suit&#8221;, so the decentralized oracle ruled against. But over the next few months, Zelensky continued to straddle the border of suithood, and the media eventually started using the word &#8220;suit&#8221; in their articles. This presented a quandary for the oracle, which was supposed to respect both the precedent of its past rulings, and the consensus of media organizations. Voters switched sides several times until finally settling on NO; true suit believers were unsatisfied with this decision. For what it&#8217;s worth, the Twitter menswear guy <a href=\"https://www.wired.com/story/volodymyr-zelensky-suit-polymarket-rebellion/\">told Wired</a> that &#8220;It meets the technical definition, [but] I would also recognize that most people would not think of that as a suit.&#8221;</p><p><strong>Domer: <a href=\"https://x.com/Domahhhh/status/1905258165777596812\">Will Ukraine agree to the US mineral deal?</a></strong> AFAICT, this is the only case where the oracle genuinely broke down (as opposed to a legitimate disagreement). In February, it looked like both America and Ukraine had agreed to a mineral deal, but the oracle considered the question and decided this didn&#8217;t count as a full agreement (and indeed, the apparent agreement then fell apart). In March, a cabal of YES holders tried again. They waited for a time when all Polymarket employees would be out of the office, and when not too many people would be voting on the decentralized resolution oracle, then spammed it with calls to resolve to YES based on an argument that the February agreement had qualified after all. The YES holders and not-particularly-plugged-in oracle voters pushed the vote towards YES. Then, with two minutes to spare, a Polymarket employee showed up and said that Polymarket&#8217;s opinion was that it should be NO. This was technically framed as a recommendation to oracle voters, but it is so effective in establishing the Schelling point that it&#8217;s practically always followed. However, in this case, there were only two minutes left, which wasn&#8217;t enough time for the voters to change their mind. Seeing that the resolution was trending towards yes, the Polymarket representatives, not wanting to break their streak of always establishing the Schelling point, changed their own opinion to YES, and the final vote was YES 99%.</p><p><strong>Domer: <a href=\"https://x.com/Domahhhh/status/1897408441582252473\">How many people watched the Oscars on 3/5/25?</a>:</strong> Kalshi&#8217;s resolution criteria for this market said they would resolve it when a major news source published Oscar viewership numbers. A few minutes after the Oscars, NYT published preliminary viewership numbers, without any caveats saying they were preliminary. The next day, they published <a href=\"https://archive.is/QypbS\">another article</a> saying that actually, the real viewership numbers were higher. Kalshi decided that the letter of the resolution criteria was met when NYT published its first article, and that NYT changing its opinion didn&#8217;t imply that Kalshi should change the resolution. Traders who bet on the later (ie correct) numbers were unsatisfied with this decision.</p><p><strong>NYPost: <a href=\"https://nypost.com/2026/01/07/business/polymarket-refuses-to-pay-bettors-who-wagered-us-would-invade-venezuela/\">Will America invade Venezuela?</a> </strong>On January 3, the US bombed Venezuela, sent in a Special Forces team that successfully captured President Maduro, and announced that they would thenceforward &#8220;run the country&#8221; (a claim they later walked back). Does this qualify as an &#8220;invasion&#8221;? Polymarket&#8217;s resolution criteria defined &#8220;invasion&#8221; as &#8220;a military offensive intended to establish control over any portion of Venezuela&#8221;. It didn&#8217;t seem like the US was trying to establish control over Venezuelan territory, exactly, so they resolved NO. Traders who bet on YES were unsatisfied with this decision.</p><p>With one exception, these aren&#8217;t outright oracle failures. They&#8217;re honest cases of ambiguous rules. </p><p>Most of the links end with pleas for Polymarket to get better at clarifying rules. My perspective is that the few times I&#8217;ve talked to Polymarket people, I&#8217;ve begged them to implement various cool features, and they&#8217;ve always said &#8220;Nope, sorry, too busy figuring out ways to make rules clearer&#8221;. Prediction market people obsess over maximally finicky resolution criteria, but somehow it&#8217;s never enough -  you just can&#8217;t specify every possible state of the world beforehand. </p><p>The most interesting proposal I&#8217;ve seen in this space is to make LLMs do it; you can train them on good rulesets, and they&#8217;re tolerant enough of tedium to print out pages and pages of every possible edge case without going crazy. It&#8217;ll be fun the first time one of them hallucinates, though.</p><h2>&#8230;And Miscellaneous N&#8217;er-Do-Wells</h2><p>I include this section under protest.</p><p>The media likes engaging with prediction markets through dramatic stories about insider trading and market manipulation. This is as useful as engaging with Waymo through <a href=\"https://www.sfgate.com/local/article/waymo-acknowledges-vehicle-sf-shop-cat-21131405.php\">stories about cats</a> being run over. It doesn&#8217;t matter whether you can find one lurid example of something going wrong. What matters is the base rates, the consequences, and the alternatives. Polymarket resolves about a thousand markets a month, and Kalshi closer to five thousand. It&#8217;s no surprise that a few go wrong; it&#8217;s even less surprise that there are false accusations of a few going wrong. </p><p>Still, I would be remiss to not mention this at all, so here are some of the more interesting stories:</p><p><strong>Fhantombets: <a href=\"https://www.reddit.com/r/polymarketkalshi/comments/1o51ixd/update_how_the_nobel_peace_prize_polymarket_leak/\">Who will win the 2025 Nobel Peace Prize?</a> </strong>Twelve hours before the announcement, someone placed a large Polymarket bet on Venezuelan opposition leader Maria Corina Machado, bringing her probability from 4% to 73%. When Machado later won, observers suspected insider trading. But an account named fhantombets <a href=\"https://x.com/FhantomBets/status/1977044532706623975\">claims</a> to have interviewed the winning trader; although he did not reveal his exact strategy, the interview better matches a story where he was good at navigating WordPress directories, and found that the Nobel team put a draft of the announcement up early in a nonpublic part of their WordPress site. He won about $70,000.</p><p><strong>LuishXYZ: <a href=\"https://x.com/luishXYZ/status/1991059645549719908\">Will the Russians capture Myrnohrad?</a> </strong>This is a small town in Ukraine  that the Russians obviously were not going to capture; the Polymarket price trended toward zero. The resolution criteria named maps by the well-regarded Institute For The Study of War as canon. A few hours before resolution, ISW updated their maps to show the the town captured by Russia, which was definitely false. Polymarket resolved to YES, and the fictional Russian advance disappeared. The Institute then issued <a href=\"https://responsiblestatecraft.org/isw-polymarket-ukraine-war-map/?utm_source=chatgpt.com\">a statement</a> saying the map update was &#8220;unapproved&#8221;, and fired one of its staffers who had presumably been involved. The cheater&#8217;s exact winnings are unknown, but based on the size of the market are probably mid-6-digits.</p><p><strong>TechCrunch: <a href=\"https://techcrunch.com/2025/11/01/coinbase-ceo-brian-armstrong-trolls-the-prediction-markets/\">What words will be used in Coinbase&#8217;s earnings call?</a> </strong>Coinbase CEO Brian Armstrong delivered the company&#8217;s &#8220;earnings call&#8221;, ie a speech to investors about its recent progress. At the end, he said &#8220;I've been tracking the prediction market about what Coinbase will say on their next earnings call, and I just want to add here the words Bitcoin, Ethereum, Blockchain, Staking, and Web3 to make sure we get those in before the end of the call&#8221;. Armstrong is worth $10 billion and doesn&#8217;t need to manipulate a $50,000 market for the money - he later <a href=\"https://www.businessinsider.com/coinbase-ceo-earnings-call-words-prediction-markets-bets-2025-12\">described </a>his comments as &#8220;trolling&#8221;. Other crypto executives condemned the move, with one saying that &#8220;you need your head examined if you think it&#8217;s cute or clever or savvy that the CEO of the biggest company in this industry openly manipulated a market.&#8221; I might need my head examined, because I think it&#8217;s at least <em>kind of </em>funny.</p><p><strong>Forbes: <a href=\"https://www.forbes.com/sites/boazsobrado/2025/12/04/alleged-insider-nets-1-million-on-polymarket-in-24-hours/\">Who will rank highest on Google Search volume this year?</a> </strong>A trader called AlphaRaccoon got 22/23 of these Polymarket questions right, and has a history of implausibly good performance on Google-related questions. They basically have to be a Google insider, but (since all of this is done through crypto) nobody has a good way to figure out who. They made $1 million.</p><p><strong>NPR: <a href=\"https://www.npr.org/2026/01/05/nx-s1-5667232/polymarket-maduro-bet-insider-trading\">Will Maduro be captured?</a> </strong>Just before the secret operation that captured Maduro, someone placed a mysterious $32,000 wager on YES. Was this insider trading by someone in the administration or military? Nobody knows, since the profits go to an anonymous crypto wallet. But the article mentions that the crypto wallet appears to be cashing out through regulated KYC-compliant US exchanges, which suggests they&#8217;re not very worried about their identity getting discovered. Maybe they just got lucky after all.</p><p><strong>AlanMCole: <a href=\"https://x.com/AlanMCole/status/2009252693034864763\">How long will Karoline Leavitt speak at the White House briefing?</a> </strong>Karoline Leavitt is Trump&#8217;s press secretary. On January 7, she held an ordinary press briefing. Kalshi had its usual market about how long the briefing would last, divided into bins of greater than vs. less than 65 minutes. At the 64:24 mark, Leavitt ended the conference in what appeared to be a sudden manner, and the &#8220;less than 65 minutes&#8221; bin shot from 2% to 100%. A viral tweet convinced many people that Leavitt must have been insider trading, but Cole counterargued that Leavitt could only have won about $4,000 from the market, which probably isn&#8217;t enough to risk one&#8217;s job as White House Press Secretary. Sometimes people just end press conferences at weird times.</p><p>Cole concluded:</p><blockquote><p>Now, some opinions and generalizations, as someone who looks at prediction markets plenty (I&#8217;ll probably write something about my own experience with them at some point.)</p><p>1. This market, like many of them, is pretty stupid. I like substantive markets; this isn&#8217;t substantive.</p><p>2. The major prediction markets have a wildly undisciplined comms strategy where any attention is good attention, and they love implying all sorts of crazy wild west stuff is going on to get attention.</p><p>3. People do bet on things potentially subject to manipulation or insider trading. But usually the markets like that (such as duration of press conference, or stupid &#8220;what will be mentioned&#8221; markets) are small, especially relative to the wealth of key decisionmakers.</p><p>4. Losers in markets are huge whiners, and the more frivolous and tiny their bets, the more likely they are to whine.</p><p>Sometimes in sports it&#8217;s pretty egregious. They&#8217;ll get mad at a team for running out the clock when ahead but under some spread they bet on.</p><p>5. Lower-quality financial news often doesn&#8217;t pay much attention to quantity. (For example, dumb stories about how a decisionmaker has a conflict of interest because they&#8217;re invested in an index fund which is 3 percent comprised of some company.)</p><p>6. Given the platforms&#8217; undisciplined social media strategy of &#8220;promote prediction market chatter no matter what kind of chatter it is,&#8221; I don&#8217;t think this tweet rises even to the status of &#8220;lower-quality financial news.&#8221;</p><p>Kalshi&#8217;s team, whatever their faults, are extraordinarily efficient at getting batched approvals of many near-identical markets with slight parameter variation; I&#8217;ve seen Tarek speak about this on Odd Lots. The result is they&#8217;ve got TONS of them, for better or worse.</p><p>You&#8217;re gonna see 1-in-100 upsets on tiny Kalshi markets for as long as this regulatory equilibrium holds, even if nothing unusual is going on, simply because they&#8217;re publishing hundreds (thousands?) of markets per day.</p></blockquote><p>There&#8217;s a saying that you can&#8217;t con an honest man. This isn&#8217;t exactly true. But it&#8217;s easier to con people who are playing in a &#8220;what words will Brian Armstrong say today&#8221; market than people who are trying to do something useful, and I have trouble feeling sorry for these people when Brian Armstrong says silly words.</p><h2>Conditional Markets: A Modest Proposal</h2><p>Conditional markets (&#8220;decision markets&#8221;) are the strongest case for prediction markets potentially being revolutionary.</p><p>The idea is - you may want to base a decision (like which candidate to elect) on an outcome (like how they&#8217;ll affect the economy). So you make two markets:</p><ul><li><p>If the Democrat gets elected, will the economy be good four years later?</p></li><li><p>If the Republican gets elected, will the economy be good four years later?</p></li></ul><p>&#8230;and if one market is higher than the other, then you&#8217;ve successfully forced everyone to settle on a canonical probability of which candidate will be better for the economy.</p><p>The fatal flaw is confounding by noncausal pathways. For example, bettors might reason: suppose for some extrinsic reason (let&#8217;s say someone struck oil) the economy is very good from 2026 - 2028. Then in 2028, people will feel better about Trump, and are more likely to elect Vance. And if the economy is very good from 2026 - 2028, then it&#8217;s more likely to be very good from 2028 - 2032 (the oil is still there). Therefore, we should bet up the Republicans &#8594; good market, and bet down the Democrats &#8594; good market, before we even think about whether Republicans or Democrats will do a better job with the economy. Therefore, this can&#8217;t be a good way to determine whether Republicans or Democrats will do a better job with the economy.</p><p>Here&#8217;s a potential workaround I&#8217;ve never seen before: suppose you create a set of conditional prediction markets as above. Then you create a set of secondary markets, asking bettors to predict the price of the first set of markets <em>on the day before Election Day.</em></p><p>On the day before Election Day, either they&#8217;ll have struck oil, or they won&#8217;t have. So regardless of the oil situation, people will be factoring in only the true effect of the parties&#8217; policies. If you ask people today to predict those markets, they&#8217;ll be predicting the true effect of the policies. Giving an example with numbers on everything (thanks to AI for gaming this out with me):</p><pre><code><code>- 25% chance of striking oil\n- NO OIL WORLD (75% chance): \n------ D increases GDP 5%, R increases GDP 2%\n------ D wins 50%, R wins 50%\n- YES OIL WORLD (25% chance): \n------ D increases GDP 10%, R increases GDP 7%\n------ D wins 10%, R wins 90%\n\nTotal P(R wins) = 0.75&#215;0.5 + 0.25&#215;0.9 = 0.375 + 0.225 = 0.6\nTotal P(D wins) = 0.75&#215;0.5 + 0.25&#215;0.1 = 0.375 + 0.025 = 0.4\n\nNaive conditional market calculation\nE[GDP | R wins] = (0.225&#215;7% + 0.375&#215;2%) / 0.6 = (1.575% + 0.75%) / 0.6 = 3.875%\nE[GDP | D wins] = (0.025&#215;10% + 0.375&#215;5%) / 0.4 = (0.25% + 1.875%) / 0.4 = 5.3125% \nNaive difference: 5.3125% - 3.875% = 1.4375% (understates the true 3% causal effect of D policies)\n\nSecondary market calculation\nOn Election Eve, conditional on oil found: R market = 7%, D market = 10%\nOn Election Eve, conditional on no oil: R market = 2%, D market = 5%\nE[Today's market on the Election Eve R market price] = 0.25&#215;7% + 0.75&#215;2% = 1.75% + 1.5% = 3.25%\nE[Today's market on the Election Eve D market price] = 0.25&#215;10% + 0.75&#215;5% = 2.5% + 3.75% = 6.25%\nSecondary market difference: 6.25% - 3.25% = 3% (exactly the true causal effect)</code></code></pre><p>This doesn&#8217;t completely solve the conditional problem. There could be residual correlations based on hidden variables that affect the outcome of interest (in this case the election) without being known to bettors even on Election Day Eve. A trivial example is some extraordinary event which happens at 12:01 AM on Election Day. A more subtle example goes something like: suppose the economy is subtly good, nobody has managed to aggregate the statistics and figure this out in a legible way yet, and each individual person still only has private knowledge that the economy is good for him- or her-self. They might still be more likely to vote Republican based on their own private economic optimism, and then the hidden goodness of the economy might become manifest and improve GDP during the next term. Yes, this example is a stretch; maybe I&#8217;m missing better ones, or maybe this is a silly edge case failure mode that shouldn&#8217;t bother us in real life.</p><p>What about interaction effects - for example, if Democrats were better at milking a good economy and making it even better, but Republicans were better at correcting a distressed economy and bringing it back to average, would that break the link between the primary and secondary markets? This is beyond my poor mathematical ability, but the AIs claim it&#8217;s not a problem - the secondary market workaround still ensures the correct difference.</p><p>Bonus question: Is there a way to simplify this so that we don&#8217;t have to run all four markets?</p><h2>The End Of The Beginning</h2><p>When I started this column in 2021, I dreamed of a time when there would be big legal prediction markets on important topics. That&#8217;s come true. There have been some small benefits, but not the epistemic wonderland I hoped for. So what now? Do we pat Shayne Coplan and Tarek Mansour on the back, let them enjoy their superyachts, and otherwise forget about this space?</p><p>I see two ways forward.</p><p><strong>The first</strong> is to continue praying for the original Manifold vision - a prediction market site which offers:</p><ol><li><p>Real money markets</p></li><li><p>&#8230;that are user-created, user-resolved, and potentially subjective, giving the user a percent of the volume as a reward for writing/managing/promoting the question.</p></li><li><p>&#8230;and are otherwise easy to use (good interface, high volume, legal in the US)</p></li></ol><p>I&#8217;ve been asking for this so long that Nuno Sempere <a href=\"https://x.com/NunoSempere/status/1491160480706031616\">dubbed it</a> the Siskind Cube:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!ukFP!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F851b95c2-a103-43fc-8e6f-339468fa1469_485x320.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"320\" src=\"https://substackcdn.com/image/fetch/$s_!ukFP!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F851b95c2-a103-43fc-8e6f-339468fa1469_485x320.png\" title=\"\" width=\"485\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>When I ask Manifold why they won&#8217;t add 1, they say that Polymarket and Kalshi already dominate the space, and they have other, more interesting plans (to be announced soon). When I ask Polymarket why they won&#8217;t do 2, the answer is a combination of regulatory issues, fear that people would write bad resolution criteria and it would reflect badly on them, and there always being something more important to do. I haven&#8217;t asked Kalshi, but their answer would definitely be regulatory.</p><p>I still think this is a billion dollar bill waiting to be picked up.</p><p><strong>The second</strong> is to conclude that prediction markets&#8217; role in God&#8217;s plan was only to provide the foundation for AI superforecasters - the training data, the benchmarking arena, and the pot of money that rewards innovation. Once AI superforecasters are developed, then (for all that the rest of us care), the markets themselves can wither away into the sports gambling casinos they so desperately want to become. The Forecasting Research Institute&#8217;s linear extrapolation shows <a href=\"https://forecastingresearch.substack.com/p/ai-llm-forecasting-model-forecastbench-benchmark\">AIs are on track</a> to match top humans &#8220;by late 2026&#8221;</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!lNFW!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5794e5ab-218f-431b-bbcd-cc17ca0295ec_1984x934.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"293.57142857142856\" src=\"https://substackcdn.com/image/fetch/$s_!lNFW!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5794e5ab-218f-431b-bbcd-cc17ca0295ec_1984x934.png\" title=\"\" width=\"624\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>Once superforecaster bots can consider questions for pennies, we can create play-money prediction markets for them, and trust that the consensus answers will be as canonical as perfectly-designed real money prediction markets would be for humans.</p><p>Expecting this to happen in 2027, what will that look like, and who should we invest in? Maybe this benefits Manifold - all of a sudden, play-money markets become much more important, and quantity becomes more important at the expense of quality. But branding and perception are important, so the victory could also go to someone who designs around superforecasting bots from the ground up.</p><p>The Trump administration has signaled willingness to allow innovation in this space, so we have at least another three years of friendly regulators - three years when autoforecasters will be improving quickly and AI will be lowering the barrier to starting new businesses. A lot can happen during that time.</p><h2>This Month In The Markets</h2><p></p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p>I&#8217;ve <a href=\"https://www.astralcodexten.com/p/dictator-book-club-orban\">previously written about Orban</a> under the assumption that he&#8217;s a dictator-adjacent figure who&#8217;s hacked Hungary&#8217;s election system so that he can&#8217;t possibly lose. That perspective looked correct as recently as last year, but his chances have been swinging around recently, and are currently below 50-50. The election is April 12.</p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p>After Maduro&#8217;s capture, control has passed to his vice-president, with the US saying they&#8217;re mostly interested in extracting oil. The markets give her a 51% chance of staying on for the long haul. And <a href=\"https://www.reddit.com/r/slatestarcodex/comments/1q36tiq/venezuela_maduro_prediction_markets/\">here is a long list of all major Venezuela-related prediction markets</a>, including how the country will be classified in the Economist&#8217;s 2027 Democracy Index (<a href=\"https://manifold.markets/a_l_e_x/how-will-venezuela-be-classified-in\">40% chance still an authoritarian regime</a>), and a very subjective one about whether the author will feel that Venezuelans are &#8220;better off&#8221; at the end of the year (<a href=\"https://manifold.markets/Gabrielle/will-venezuelans-be-better-off-at-t\">65% chance</a>)</p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p>Strange things happening on the COVID lab leak market, which has declined to 27%. This peaked at about 85% in 2023, declined a bit around <a href=\"https://www.astralcodexten.com/p/practically-a-book-review-rootclaim\">the Rootclaim debate and my article on it</a>, then stayed around 50-50 for a year or so. But for the past eight months, it&#8217;s been gradually trending downward, with no end in sight. Some of the change probably involves <a href=\"https://www.telegraph.co.uk/global-health/science-and-disease/new-covid-virus-with-furin-cleavage-site-found-in-wild-braz/\">the discovery of a natural bat coronavirus with a furin cleavage site</a> last October, but I&#8217;m surprised by the extent of the decline.</p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p>This market is up ten points <a href=\"https://manifold.markets/ScottAlexander/by-2028-will-there-be-a-visible-bre#wv3bgwbye9o\">on news that</a> GDP last quarter rose 4.3% with no increase in hours worked. </p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p>A California union has announced a campaign to force a 2026 ballot proposition that levies a &#8220;one time&#8221; wealth tax on billionaires; the mere threat of this tax has spooked several billionaires, including Google founders Larry Page and Sergey Brin, into <a href=\"https://nypost.com/2026/01/09/business/fellow-google-co-founder-joins-larry-page-in-cutting-california-ties-ahead-of-billionaire-tax/\">leaving the state</a> (the initiative would apply to anyone residing in California as of 1/1/2026, so there&#8217;s incentive for them to leave proactively). The markets above are the first attempts I&#8217;ve seen to estimate the chance of it actually passing.</p><div class=\"prediction-market-wrap outer\" id=\"prediction-market-iframe\"></div><p>Trump Greenland market; went way up upon Maduro capture and subsequent reignition of the discussion. Lest you worry that this is only tracking the chance of getting a military base or some other small acquisition, the creator specified that:</p><blockquote><p>&#8230;this market is about whether Greenland or a meaningful portion of it becomes part of America, not about minor acquisitions like a single building or small plot of land.</p></blockquote><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://www.metaculus.com/questions/16553/ai-blackmail-for-material-gain-by-eoy-2028/\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"536.0732700135685\" src=\"https://substackcdn.com/image/fetch/$s_!ARzP!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2ff72469-f28d-4b7a-923a-32334b6e4c9e_737x703.png\" width=\"562\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p><a href=\"https://www.metaculus.com/questions/16553/ai-blackmail-for-material-gain-by-eoy-2028/\">Here&#8217;s a pretty crazy Metaculus question</a> - the resolution criteria specify it&#8217;s <em>not</em> about scammers using AIs to blackmail their victims, it&#8217;s about an AI independently developing and executing a blackmail plan without human prompting or support. Sometime like this has already happened in toy experiments conducted by safety teams when all the conditions were exactly right, but forecasters seem confident it will happen in real life sometime in the next three years. I don&#8217;t understand what&#8217;s going on here, and I&#8217;m going to recheck this question after signal-boosting it to see if it changes.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!uIbY!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F51c844a6-86fa-4831-a54e-26525cbf337b_936x907.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"581.4102564102565\" src=\"https://substackcdn.com/image/fetch/$s_!uIbY!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F51c844a6-86fa-4831-a54e-26525cbf337b_936x907.png\" width=\"600\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>Polymarket has a few of these &#8220;who has the best AI when?&#8221; markets - resolution is usually position on the <a href=\"https://lmarena.ai/leaderboard/text\">LMArena Leaderboard</a>, which usually but not always mirrors common-sense consensus. I get more interested in these the further out they go, but <a href=\"https://polymarket.com/event/which-companies-will-have-a-1-ai-model-by-june-30\">the June version</a> is bizarre (it doesn&#8217;t even list Google as an option), and there&#8217;s nothing past mid-year. Other implied claims from Polymarket&#8217;s tech section: <a href=\"https://polymarket.com/event/which-company-will-have-the-best-ai-model-for-coding-on-march-31\">only 44% chance</a> Anthropic will still dominate coding by late March; Anthropic and (especially) OpenAI <a href=\"https://polymarket.com/event/ipos-before-2027\">probably won&#8217;t IPO</a> this year; xAI <a href=\"https://polymarket.com/event/grok-4pt20-released-by\">will call</a> their next model Grok 4.20 (of <em>course</em>).</p><p>And Nathan Young has put together <a href=\"https://agi-timelines-dashboard.vercel.app/\">an AGI timelines forecasting dashboard</a>:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!MfnD!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F00792c06-cdf2-43b8-9ebc-4cde49b5bdde_1125x530.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"297.2711111111111\" src=\"https://substackcdn.com/image/fetch/$s_!MfnD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F00792c06-cdf2-43b8-9ebc-4cde49b5bdde_1125x530.png\" width=\"631\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p></p><h2>Elsewhere In Prediction Markets</h2><p><strong>1: </strong>New York Magazine <a href=\"https://nymag.com/intelligencer/article/is-polymarket-legal-politics-betting-shayne-coplan.html\">profiles Polymarket founder Shayne Coplan</a>:</p><blockquote><p>The only child of South African college professors, Coplan grew up living with just his mother. He describes his father as a &#8220;mad scientist&#8221; who has studied panic disorder and depression. His mom taught in the film departments at NYU and Columbia and cast young Shayne in her own work. </p></blockquote><p>The obvious next question - is Coplan Sr&#8217;s work on panic disorder any good? Answer: yes! - he <a href=\"https://pubmed.ncbi.nlm.nih.gov/9477926/\">co-published with</a> Donald Klein, whose ventilatory hypothesis of panic <a href=\"https://slatestarcodex.com/2017/04/05/the-case-of-the-suffocating-woman/\">revolutionized my understanding </a>of the condition. <a href=\"https://www.astralcodexten.com/p/secrets-of-the-great-families\">Great Families theory</a> undefeated.</p><p><strong>2: </strong>Donald Trump&#8217;s company Truth Social said in October that it&#8217;s becoming <a href=\"https://s3.amazonaws.com/b2icontent.irpass.cc/2660/rl158843.pdf\">the world&#8217;s first social media platform offering prediction markets</a> via a partnership with crypto.com. This isn&#8217;t quite what I want - I don&#8217;t think users can create their own prediction markets - but it&#8217;s a step forward. Also, think about how much money someone&#8217;s going to make by taking the pro-left-wing side of all those trades!</p><p><strong>3: </strong>You have five days left <a href=\"https://www.metaculus.com/tournament/ACX2026/\">to submit your predictions in the ACX/Metaculus 2026 Prediction Contest</a>.</p><p><strong>4: </strong>Forecasting Research Institute has established a <a href=\"https://forecastingresearch.substack.com/p/introducing-leap\">Longitudinal Expert AI Panel</a> of scientists and forecasters to map changing expert opinion on AI over time. Experts predict &#8220;significantly less AI progress than leaders of frontier AI companies&#8221; but &#8220;much faster AI progress than the general public. </p><p><strong>5: </strong>Manifold has launched <a href=\"https://manifold.markets/predictle\">Predictle</a>, a Wordle-inspired game where you have to rank events by the (Manifold-endorsed) probability of them happening:</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!V8u8!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe19533da-fcdf-4bf1-86a3-e7df658cf525_603x835.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"580.2072968490879\" src=\"https://substackcdn.com/image/fetch/$s_!V8u8!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe19533da-fcdf-4bf1-86a3-e7df658cf525_603x835.png\" width=\"419\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p></p>"
            ],
            "link": "https://www.astralcodexten.com/p/mantic-monday-the-monkeys-paw-curls",
            "publishedAt": "2026-01-13",
            "source": "SlateStarCodex",
            "summary": "<h2>The Monkey&#8217;s Paw Curls</h2><p>Isn&#8217;t &#8220;may you get exactly what you asked for&#8221; one of those ancient Chinese curses?</p><p>Since we last spoke, prediction markets have gone to the moon, rising from millions to billions in monthly volume.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!DAKF!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F02e40ead-6e1a-495a-be44-4b52dfb37fdf_2401x1400.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"Polymarket and Kalshi Volume (Monthly)\" class=\"sizing-normal\" height=\"337.03434065934067\" src=\"https://substackcdn.com/image/fetch/$s_!DAKF!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F02e40ead-6e1a-495a-be44-4b52dfb37fdf_2401x1400.png\" title=\"Polymarket and Kalshi Volume (Monthly)\" width=\"578\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>For a few weeks in October, Polymarket founder Shayne Coplan was the world&#8217;s youngest self-made billionaire (now it&#8217;s some AI people). Kalshi is <a href=\"https://slate.com/technology/2026/01/maduro-prediction-market-polymarket-kalshi-app.html\">so accurate that it&#8217;s getting called a national security threat</a>.</p><p>The catch is, of course, that it&#8217;s mostly degenerate",
            "title": "Mantic Monday: The Monkey's Paw Curls"
        },
        {
            "content": [
                "<p>Claude Code does a lot more than code, but the name and command line scare people.</p>\n<p>Anthropic realized a rebrand was in order. <a href=\"https://x.com/blakeir/status/2010837251505205656\">Two weeks later, we have Claude Cowork</a>, <a href=\"https://x.com/_simonsmith/status/2010820240330956895\">written entirely by Claude Code</a>.</p>\n<p>Did you know that chat interfaces were always (mostly) secretly a command line?</p>\n<p>This is still very much a research preview, available only for Claude Max users on Macs with a bunch of bugs and missing features. It will improve rapidly over time.</p>\n<p>Cowork combines a lot of the power of Claude Code with the ordinary chat interface, giving it access to a folder on your computer and to Claude Code’s planning and agentic capabilities. It can use that folder as context, to download, to organize and create files, and it can be paired with Claude for Chrome and use your existing connectors.</p>\n<div>\n\n\n<span id=\"more-25025\"></span>\n\n\n</div>\n<blockquote><p><a href=\"https://x.com/claudeai/status/2010805682434666759\">Anthropic</a>: Introducing Cowork: Claude Code for the rest of your work.</p>\n<p>Cowork lets you complete non-technical tasks much like how developers use Claude Code.</p>\n<p>In Cowork, you give Claude access to a folder on your computer. Claude can then read, edit, or create files in that folder. Try it to create a spreadsheet from a pile of screenshots, or produce a first draft from scattered notes.</p>\n<p>Once you&#8217;ve set a task, Claude makes a plan and steadily completes it, looping you in along the way. Claude will ask before taking any significant actions so you can course-correct as needed.</p>\n<p>Claude can use your existing connectors, which link Claude to external information. You can also pair Cowork with Claude in Chrome for tasks that need browser access.</p>\n<p><a href=\"https://t.co/kWnDq1psWQ\">Cowork is available as a research preview</a> for Claude Max subscribers in the macOS app. Click on “Cowork” in the sidebar.</p>\n<p><a href=\"https://x.com/_sholtodouglas/status/2010822023715471623\">Sholto Douglas</a> (Anthropic): Claude code for all other knowledge work. Many of our best engineers no longer manually write code, they multiplex across multiple cc sessions &#8211; soon this will be true for everything else.</p></blockquote>\n<p><a href=\"https://x.com/p1njc70r/status/2010843436279021635\">The system prompt is here</a>, the core non-tooling parts seem unchanged. This post will cover Claude Cowork, and also updates since last week on Claude Code.</p>\n\n\n<h4 class=\"wp-block-heading\">Early Takes</h4>\n\n\n<p>What exactly can it do at this early stage?</p>\n<blockquote><p><a href=\"https://x.com/deanwball/status/2010844935512006943\">Dean W. Ball</a>: it&#8217;s basically what I expected. the ui is normal claude, but instead of showing you the bash commands it is executing, it just says &#8220;using bash&#8221; or &#8220;command&#8221; (you can click for detail of course). very useful for many I&#8217;m sure! not sure if useful for me over cc; still learning.</p>\n<p>There are ui niceties that I could see myself preferring to the command line, even as someone very comfortable with terminals. and of course one would expect more such niceties in future iterations.</p>\n<p>Vie: My guess is that the prompt scaffolding makes the results and actual work a few times more general for non-code use cases, and a few times more interpretable by lay-people, at the cost of the tail of IQ being a big smaller</p>\n<p><a href=\"https://x.com/clairevo/status/2010835704931369379\">Claire Vo</a>: It’s basically local Claude Code with a Mac OS app wrapper focused on a few core primitives:</p>\n<ul>\n<li><strong>Connectors / MCPs</strong> &#8211; external services Cowork has access to</li>\n<li><strong>Filesystem</strong> &#8211; runs locally so will create/read things on your file system</li>\n<li><strong>TODOs/Steps</strong> &#8211; discrete trackable steps cowork will take to execute your tasks</li>\n<li><strong>Artifacts </strong>&#8211; files generated in the process of doing your task</li>\n<li><strong>Context</strong> &#8211; files / sources / connectors used when doing your task</li>\n<li><strong>Skills</strong> &#8211; preloaded with a few key skills, esp. file type creation ones like DOCX, PPT, etc. Claude generally has access to these, so not new.</li>\n</ul>\n<p>Every chat is now a <strong>task</strong> (focused on doing-a-thing) and <strong>steps, artifacts, and context</strong> get first class treatment in the UI.</p>\n<p>… Speaking of skills, Cowork seemingly comes bundled with a few key ones around document creation (you can find them in your file system.)</p>\n<p>… <strong>Despite it&#8217;s flaws, Cowork <em>did</em> create better outputs than straight Chat.</strong></p></blockquote>\n<p><a href=\"https://x.com/lennysan/status/2010840092865413254\">Lenny Rachitsky tests Cowork with a set of 320 of his podcast transcripts</a> and asks it to pull out the 10 most important themes and 10 most counterintuitive truths, and thinks it did a good job in its 15 minutes of work. Seemed solid to me.</p>\n<p>The most credible signal of respect is admitting that a release killed your startup product, <a href=\"https://x.com/guohao_li/status/2010899322825744745\">which we see here with Eigent</a>.</p>\n<blockquote><p>Steve Hou: Another win for ‘the foundation model is the product.’​</p></blockquote>\n<p>This is the first feedback so far about what it’s intended to do:</p>\n<blockquote><p><a href=\"https://x.com/JohnWittle/status/2011112597731356915\">John Wittle</a>: My mom, sharp old woman, seems to be taking to it with quite a lot of enthusiasm, in a way she had trouble doing with, say, windows-mcp and claude desktop.</p>\n<p>seems to unlock normie powers a lot better.</p>\n<p>Neil: I think amazing for non coders to discover what’s possible</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!obXO!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe9f7eab8-675d-4779-9ff8-42d83880df21_1200x597.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Rename it away from code, normie figures out they can have it code.</p>\n<p>If that’s true with the version that’s two weeks old, the sky’s the limit. We don’t have much data because there aren’t that many normies with $200/month Claude Max subscriptions.</p>\n\n\n<h4 class=\"wp-block-heading\">Minimum Viable Product</h4>\n\n\n<p>It’s early days, and she reports there were still some other kinks being worked out. In particular, the connectors are having problems.</p>\n<blockquote><p><a href=\"https://x.com/btibor91/status/2010818434595242083\">Tibor Blaho</a>: Available now for Max subscribers on macOS desktop app only, with no project support, no memory between sessions, no sharing, app must stay open during tasks, and consumes more usage than regular chat, with plans to add cross-device sync and Windows support</p></blockquote>\n<p>One thing Claire Vo noted was it asked for approvals on file openings too much. I have a similar complaint with Claude Code, that there’s a bunch of highly safe similar actions that shouldn’t need permission.</p>\n<p>Claire also noted that Claude Cowork exposed too many technical files and notes about what it was doing to the user, such as the code used to generate things, which could be confusing to non-technical users. My guess is that such files can be stored in a subdirectory where such users won’t notice, which keeps it available for those who want it, and ‘tell me more about what you’re doing on a technical level’ can be a setting, since the users who want it set to no won’t even notice the option exists.</p>\n\n\n<h4 class=\"wp-block-heading\">Maximum Viable Product</h4>\n\n\n<p>There is a huge overhang in AI capabilities.</p>\n<p>Thus, a common pattern is that someone figures out a way to do useful things at all that humans are willing to learn how to use. And then we muddle down that road, and it’s not first best but it still wins big.</p>\n<p>That’s what Claude Code was, and now that’s what Claude Cowork will be for normies. Presumably OpenAI and Google, and then others, will soon follow suit.</p>\n<blockquote><p><a href=\"https://x.com/chrisbarber/status/2011139690364313654\">Chris Barber</a>: do you see the vision of claude cowork?</p>\n<p>imagine claude for execl, powerpoint, word, outlook, chrome, bloomberg terminal, etc. gmail connector. ability to code.</p>\n<p>this is the pathway to big knowledge worker adoption</p>\n<p>openai and google will need to follow</p>\n<p>this will be very strong pmf and growth</p>\n<p>invest in it, compete with it, join anthropic/oai/gdm and work on it/competitors, etc</p>\n<p>this will be central</p>\n<p>claude code *is* the ai coworker, it&#8217;ll all build up from there.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Backup Your Directory</h4>\n\n\n<p>If you’re worried Claude Cowork or Claude Code will delete a bunch of stuff in a directory, and you don’t want to use a full virtual sandbox solution, there’s a rather simple solution that also works, which is: Backup the directory, to a place Claude can’t get to it. Then if the worst happens, you restore the backup.</p>\n\n\n<h4 class=\"wp-block-heading\">Meanwhile In Claude Code News</h4>\n\n\n<p><a href=\"https://x.com/eyad_khrais/status/2010076957938188661\">The latest guide to Claude Code</a>, feedback seems very good. Key highlights:</p>\n<ol>\n<li>Think before you type. Enter plan mode first and go back and forth a lot.</li>\n<li>Keep claude.md short, max 50-100 instructions. Use # while working to edit it.</li>\n<li>Store things in external files.</li>\n<li>Try to only use 30% of the context window, after that performance degrades.</li>\n<li>Make your prompts as specific as possible, including what not to do.</li>\n<li>Try out various hooks, MCPs, you name it. Experiment.</li>\n<li>When stuck, be creative, pivot, simplify, clear the conversation and start again.</li>\n<li>Build systems, not one-off tasks.</li>\n</ol>\n<p>Here’s another report of what Claude Code has been good for, with three big unlocks for APIs, connecting distinct products and running things regularly:</p>\n<blockquote><p><a href=\"https://x.com/nikillinit/status/2010481404987990350\">Nikhil Krishnan</a>: I’ve spent the last 48 hours in Claude Code &#8211; as a non-technical person it’s basically unlocked three very big things for me</p>\n<ol>\n<li>The ability to interact with APIs generally &#8211; again, as a non-technical person one of the big barriers to running the business has been touching APIs. For example, what you can do in Stripe in the non-developer portal vs. through the API is night and day.</li>\n<li>The ability to thread things together &#8211; another issue has been threading several different products we work with together to do cohesive tasks. Zapier gets you part of the way for triggers, but Claude Code let’s me do way more complex things that touches multiple things simultaneously</li>\n<li>Run something regularly &#8211; being able to set a script and run it regularly with this level of ease is a game changer. In about an hour I set up a daily email to myself that tells me the top 3 emails I need to respond to based on a priority scoring system we made together that pulls data from a few different places.</li>\n</ol>\n<p>I know I’m late to this and I’m probably doing things poorly so be nice to me. But it’s really been awesome to dive into this.</p></blockquote>\n<p>As always, one could have done all of this any number of other ways, but this deals with the problem of activation energy.</p>\n<p><a href=\"https://www.hyperdimensional.co/p/among-the-agents?utm_source=post-email-title&amp;publication_id=2244049&amp;post_id=183828760&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3o9&amp;triedRedirect=true&amp;utm_medium=email\">Dean Ball has, in the past month, used coding agents to do the following</a>:</p>\n<blockquote>\n<ol>\n<li>​Automated invoice creation, sending, and tracking;</li>\n<li>Created scientifically realistic simulations of hydrological systems as a learning project;</li>\n<li>Automated my research process of gathering and analyzing all proposed state legislation related to AI (though this is no substitute for reading the bill for anything I am going to write about);</li>\n<li>Orchestrated a complex chain of autonomous data collection, processing, analysis, and presentation steps related to manufacturing and industrial policy;</li>\n<li>Created a machine-learning model capable of predicting US corn yields with what appears to be very high accuracy (the proof will be in the pudding), based on climate, soil, Earth-observation satellite, and other data sources;</li>\n<li>Replicated three machine-learning research papers and modified the approach to suit my own research ends;</li>\n<li>Performed hundreds of experiments with Byte-level language models, an emerging interest of mine;</li>\n<li>Created an autonomous prediction market agent;</li>\n<li>Created an autonomous options trader based on a specific investment thesis I developed;</li>\n<li>Built dozens of games and simulations to educate myself about various physical or industrial phenomena;</li>\n<li>Created an agent that monitors a particular art market in which I am potentially interested in making an acquisition;</li>\n<li>Created a new personal blog complete with a Squarespace-style content management system behind the scenes;</li>\n<li>Other things I cannot talk about publicly just yet.</li>\n</ol>\n</blockquote>\n<p>I’m not there yet, largely because we think in different ways, but largely because I’m just getting started with ‘oh right coding things just happens, do coding agent shaped things.’</p>\n<p><a href=\"https://x.com/deanwball/status/2009612291436577280\">Dean Ball nails it</a> that coding agents are most helpful exactly when you don’t have to ship your software to third parties. I presume that the code underneath everything I’m having Claude build would horrify professional coders. That’s fine, because even in the places I do ship (cause why not ship, someone might find it useful) I’m not trying to not horrify people. What matters is it works, and that I’m ‘using coding agent shaped requests,’ as Dean puts it, to increasingly get things done.</p>\n<p>The coding agents will still produce the most value for professional coders, because they can go into supercharged mode with them and get the most out of them, but that requires the professionals to swim upstream in ways the rest of us don’t have to.</p>\n<p>So, say this is what you want:</p>\n<blockquote><p><a href=\"https://x.com/8teAPi/status/2009694934950129767\">Prakesh</a>: what i really want as a writer is an automated fact checker and alternative viewpoint giver. there’s a lot of fact rechecking after you have the initial concept of a piece which is tedious but necessary​.</p>\n<p>Jon Stokes: I literally have this (the fact checker). It’s amazing (not just saying that because my team built it.. it’s truly wild). Happy to demo for you&#8230; DM if interested.</p></blockquote>\n<p>Exactly. I haven’t built a custom fact checker yet, but the only thing stopping me is ‘it hadn’t yet occured to me it was sufficiently easy to do that’ combined with ‘I have not yet gotten around to it.’ Check back with me in six months and I bet I do have one, I’m actually building towards such things but it’s not near the top of that queue yet.</p>\n<p><a href=\"https://x.com/simonw/status/2009709346377302432\">As Alex Albert puts it</a>, you get to stop thinking doing something is ‘not worth your time,’ or for Simon Willison entire features are no longer ‘not worth your time’ at least not until they run into serious trouble.</p>\n<p>Dean offers various additional coding agent thoughts, and a highly basic guide, <a href=\"https://www.hyperdimensional.co/p/among-the-agents?utm_source=post-email-title&amp;publication_id=2244049&amp;post_id=183828760&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3o9&amp;triedRedirect=true&amp;utm_medium=email\">in the rest of his weekly post</a>.</p>\n<p><a href=\"https://x.com/ATabarrok/status/2010788591950315977\">Alex Tabarrok did his first Claude Code project</a>. Noncoders skilling up is a big deal.</p>\n<p><a href=\"https://www.bloomberg.com/news/newsletters/2026-01-13/ai-s-productivity-potential-has-never-more-obvious?srnd=phx-oddlots\">Joe Weisenthal did his first Claude Code project</a> and now we have <a href=\"https://havelock.ai/\">Havelock.ai</a>, which gives us an ‘orality detector’ for text, essentially employing the Ralph Wiggum technique by continuously asking ‘what should I do to make it better?’</p>\n<p><a href=\"https://x.com/theo/status/2010154568211120349\">Linus Torvarlds (the creator of Linux) is doing at least some vibe coding</a>, in this case using Antigravity.</p>\n<p>Claude may not yet in its official test be a Pokemon master, <a href=\"https://labs.ramp.com/rct?utm_source=youtube&amp;utm_campaign=content&amp;utm_medium=organic-social\">but Claude Code is now somewhat of a RollerCoaster Tycoon</a>, with various strengths and weaknesses. Dean Ball suggests you can use <a href=\"https://x.com/ohabryka/status/2010566862137155924\">Claude Code to do game dev on new ‘[x] tycoon’ games</a> as a niche topic learning exercise. Oliver Habryka challenges whether it’s good enough at game dev for this. As Patrick McKenzie points out, if the game is text based that helps a lot, since visual aspects are a key weakness for now.</p>\n\n\n<h4 class=\"wp-block-heading\">You Are The Bottleneck</h4>\n\n\n<p><a href=\"https://www.theargumentmag.com/p/i-cant-stop-yelling-at-claude-code?utm_source=%2Finbox&amp;utm_medium=reader2\">Kelsey Piper reports on her experience with using and yelling at Claude Code</a>.</p>\n<p>She and I are very similar types of programmers:</p>\n<blockquote><p>Kelsey Piper: ​In college, I was once told that the really hard part of programming was knowing, in sufficient detail, what you wanted the computer to do. This was not my experience of programming.</p>\n<p>In my experience of programming, the really hard part was figuring out which packages weren’t installed or weren’t updated or were in the wrong folder, causing the test we’d done in class to completely fail to work in the same way on my own computer. The next really hard part was Googling everything the debugger spat out to find an explanation of how to make it go away.</p>\n<p>… Claude Code solves all of that. Programming, now, really is just a matter of knowing in sufficient detail what you want the computer to do.</p>\n<p>… Now, 99% of the time, it feels like magic. The remaining 1% is absolutely maddening.</p></blockquote>\n<p>It’s not that it is easy to know what you want the computer to do, especially if you expand that to include ‘what do I even want to be trying to do today at all.’ Both the macro and micro ‘what are we even doing’ questions are hard. I still spent 90% of my time dealing with packages and syntax and setup and knowing exactly how to do it.</p>\n<p>The problem is that, as Kelsey observes, you will spend your time on the bottleneck, whatever that bottleneck might be, and this will be frustrating, especially as this will often be something stupid, or the particular place Claude Code happens to act stupid given the way you’re prompting it.</p>\n<blockquote><p>I said that 99% of the time Claude was great. By which I mean, 99% of the work Claude completed was great, but that doesn’t mean 99% of my time was spent sitting back and marveling. When something worked great, we’d breeze right past it. When Claude had shuffled all the audio files again, we’d spend a really long time fixing that. I found myself, well, yelling at it.​</p></blockquote>\n<p>I am happy to report that I haven’t been yelling at Claude Code when it messes up. But yeah, it messes up, because I keep trying to get it to do more until it messes up.</p>\n<p>&nbsp;</p>\n\n\n<h4 class=\"wp-block-heading\">Claude Code Upgrades</h4>\n\n\n<blockquote><p><a href=\"https://x.com/amorriscode/status/2010808647459488020\">Anthony Morris ツ</a>: We shipped A LOT of updates to Claude Code on desktop in the last week.</p>\n<p>&#8211; Plan mode (coming soon to web)<br />\n&#8211; Notifications for permissions<br />\n&#8211; Perf improvements<br />\n&#8211; Fixed slash commands<br />\n&#8211; Improved env access<br />\n&#8211; Tons of polish</p></blockquote>\n<p><a href=\"https://x.com/nummanali/status/2010042788566720955\">Numman Ali says v2.1.3 has ‘solved the compaction issue’</a> so long as you use planning mode and explicitly ask the model for a comprehensive TODO list. It’s hard to tell, but I’ve certainly blown over the compaction line on many tasks and when I’ve saved the necessary context elsewhere it’s mostly turned out fine.</p>\n<p><a href=\"https://x.com/trq212/status/2009689809875591565\">What Clade Code cannot do</a> is allow its harness to be spoofed to use subscriptions. You can either use Claude Code, or you can access Claude via the API, but it’s a terms of service violation to spoof the harness to let you use your subscription allocation. I’d be inclined to let the harnesses stay in place despite the problems described here, so long as the unit economics are not too horrendous. In general I think Anthropic is too focused on getting to profitability quickly, even if you think OpenAI is rather too willing to burn money.</p>\n<p><a href=\"https://x.com/kyliebytes/status/2009686466746822731\">Anthropic reportedly cuts xAI and other major competitors off from Claude</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">Oh No</h4>\n\n\n<p>In the interest of not silencing critics, <a href=\"https://x.com/ilex_ulmus/status/2010140670300959222\">Holly Elmore claims I’m bad now</a> because I’m enthusiastic about getting use out of Claude Code, a ‘recursively self-improving agent.’</p>\n<p>I affirm David Manheim’s response that there is no reason for an individual not to use such tools for their own purposes, or not to get excited about what it can do outside of potentially dangerous forms of self-improvement.</p>\n<p>I do agree that the vibes in that post were a bit off by not also including awareness of where sufficiently advanced coding agents lead once they start self-improving in earnest, and there is value in having a voice like Holly’s that says the basic thing clearly.</p>\n<p>However I also think that there is no contradiction between ‘recursive self-improvement is super dangerous and likely to get us all killed’ and ‘you should be taking full advantage of Claude Code for practical purposes and you’re leaving a lot on the table if you don’t.’</p>\n\n\n<h4 class=\"wp-block-heading\">I’m In Danger</h4>\n\n\n<p>There is a new method <a href=\"https://www.wsj.com/tech/ai/our-ai-future-is-already-here-its-just-not-evenly-distributed-cf7a6f35?mod=hp_featst_pos3\">called the ‘Ralph Wiggum’ technique</a>, where you tell Claude Code continuously to ‘improve the code’ it has already written. Some say it works great, but the name does not inspire confidence.</p>\n<p>The world is collectively underinvesting in optimizing and standardizing such techniques. Some well-designed version of this would presumably be great, and the more parallelization of agents is going on the more valuable it is to optimize non-interruption over token efficiency.</p>\n\n\n<h4 class=\"wp-block-heading\">In The Beginning Was The Command Line</h4>\n\n\n<p>What is the difference between a command line and a chat interface?</p>\n<p>Both are text in and text out.</p>\n<p>Both allow attachments, at least in Claude Code mode.</p>\n<p>Both can have sandboxes, run code, and so on.</p>\n<p>The main real difference is that the terminal makes it annoying to edit prompts?</p>\n<p>It’s almost entirely about perception. One feels like talk with an entity, one like commands and bash scripts. One looks like a slick modern UI, the other a stark black text box.</p>\n<p>There is also a clear plan to have different system prompts, and to build in a different more user friendly set of default connectors and tools.</p>\n<p>That plus the change in perception could be a really, really big deal.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2026/01/13/claude-coworks/",
            "publishedAt": "2026-01-13",
            "source": "TheZvi",
            "summary": "Claude Code does a lot more than code, but the name and command line scare people. Anthropic realized a rebrand was in order. Two weeks later, we have Claude Cowork, written entirely by Claude Code. Did you know that chat &#8230; <a href=\"https://thezvi.wordpress.com/2026/01/13/claude-coworks/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Claude Coworks"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-13"
}