{
    "articles": [
        {
            "content": [
                "<header>\n  <h1>Considering Strictly Monotonic Time</h1>\n  <time class=\"meta\" datetime=\"2026-01-23\">Jan 23, 2026</time>\n</header>\n<p>Monotonic time is a frequently used, load bearing abstraction. Monotonicity is often enforced using\nthe following code:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> now</span>(clock: <span class=\"hl-operator\">*</span>Clock) Instant {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">const</span> t_raw = os_time_monotonic();</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">const</span> t = <span class=\"hl-built_in\">@max</span>(t_raw, clock.guard);</span>\n<span class=\"line\">    assert(t &gt;= clock.guard);</span>\n<span class=\"line\">    assert(t &gt;= t_raw);</span>\n<span class=\"line\"></span>\n<span class=\"line\">    clock.guard = t;</span>\n<span class=\"line\">    <span class=\"hl-keyword\">return</span> t;</span>\n<span class=\"line\">}</span></code></pre>\n\n</figure>\n<p>That is, ask the OS about the current monotonic time, but don’t trust the result too much and clamp\nit using an in-process guard. Under normal scenarios, you can trust the OS promise of monotonicity,\nbut, empirically, there’s a long tail of different scenarios where the promise isn’t upheld:\n<a class=\"display url\" href=\"https://github.com/rust-lang/rust/pull/56988\">https://github.com/rust-lang/rust/pull/56988</a></p>\n<p>Today I realized that, if you are doing the above, you might as well force the time to be <em>strictly</em>\nmonotonic:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">const</span> t = <span class=\"hl-built_in\">@max</span>(t_raw, clock.guard <span class=\"hl-operator\">+</span> 1ns);</span>\n<span class=\"line\">assert(t &gt; clock.guard);</span></code></pre>\n\n</figure>\n<p>The benefit of strict monotonicity is that you can tighten asserts,\n<span class=\"display\"><code>assert(past &lt;= present)</code></span>\ncan become\n<span class=\"display\"><code>assert(past &lt; present)</code></span>\nand that <em>additionally</em> catches the bug where you pass in <em>exactly</em> the same instance.\nIn other words, the <code>&lt;=</code> version explicitly allows either query-ing the time again, or using the old\nvalue directly.</p>\n<p>Conversely, with strictly monotonic time, you know that if you see two numerically identical time\ninstances, they must have been ultimately derived from the exact same call to <code>now()</code>. Time becomes\nfundamentally less ambiguous.</p>\n<p>The constraint here is that the resolution of the time value (<em>not</em> the clock resolution) needs to\nbe high enough, to make sure that repeated <code>+1</code> don’t move you into the future, but nanosecond\nprecision seems fine for that.</p>"
            ],
            "link": "https://matklad.github.io/2026/01/23/strictly-monotonic-time.html",
            "publishedAt": "2026-01-23",
            "source": "Alex Kladov",
            "summary": "<header> <h1>Considering Strictly Monotonic Time</h1> <time class=\"meta\" datetime=\"2026-01-23\">Jan 23, 2026</time> </header> <p>Monotonic time is a frequently used, load bearing abstraction. Monotonicity is often enforced using the following code:</p> <figure class=\"code-block\"> <pre><code><span class=\"line\"><span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> now</span>(clock: <span class=\"hl-operator\">*</span>Clock) Instant {</span> <span class=\"line\"> <span class=\"hl-keyword\">const</span> t_raw = os_time_monotonic();</span> <span class=\"line\"></span> <span class=\"line\"> <span class=\"hl-keyword\">const</span> t = <span class=\"hl-built_in\">@max</span>(t_raw, clock.guard);</span> <span class=\"line\"> assert(t &gt;= clock.guard);</span> <span class=\"line\"> assert(t &gt;= t_raw);</span> <span class=\"line\"></span> <span class=\"line\"> clock.guard = t;</span> <span class=\"line\"> <span class=\"hl-keyword\">return</span> t;</span> <span class=\"line\">}</span></code></pre> </figure> <p>That is, ask the OS about the current monotonic time, but don’t trust the result too much and clamp it using an in-process guard. Under normal scenarios, you can trust the OS promise of monotonicity, but, empirically, there’s a long tail of different scenarios where the promise isn’t upheld: <a class=\"display url\" href=\"https://github.com/rust-lang/rust/pull/56988\">https://github.com/rust-lang/rust/pull/56988</a></p> <p>Today I realized that, if you are doing the above, you might as well force the time to be <em>strictly</em> monotonic:</p> <figure class=\"code-block\"> <pre><code><span class=\"line\"><span class=\"hl-keyword\">const</span> t = <span class=\"hl-built_in\">@max</span>(t_raw, clock.guard <span class=\"hl-operator\">+</span> 1ns);</span> <span class=\"line\">assert(t &gt; clock.guard);</span></code></pre> </figure> <p>The benefit of strict monotonicity is that you can tighten asserts, <span class=\"display\"><code>assert(past &lt;= present)</code></span> can become <span class=\"display\"><code>assert(past &lt; present)</code></span> and that <em>additionally</em> catches the",
            "title": "Considering Strictly Monotonic Time"
        },
        {
            "content": [],
            "link": "https://maggieappleton.com/gastown/",
            "publishedAt": "2026-01-23",
            "source": "Maggie Appleton",
            "summary": "On agent orchestration patterns, why design and critical thinking are the new bottlenecks, and whether we should let go of looking at code",
            "title": "Gas Town’s Agent Patterns, Design Bottlenecks, and Vibecoding at Scale"
        },
        {
            "content": [],
            "link": "https://interconnected.org/home/2026/01/23/umpa",
            "publishedAt": "2026-01-23",
            "source": "Matt Webb",
            "summary": "<div> <p>You couldn’t go a week in the 80s as a kid in Britain without someone saying <em>\"Oompa-Loompa stick it up your jumper.\"</em></p> <p>You did this action too, pumping your hand to make a weird bulge under your jumper through a hoop made with one arm and a pretend arm made from an empty sleeve.</p> <p><a href=\"https://www.youtube.com/watch?v=C_8sqCyXNN0\">Oh here’s a YouTube</a>.</p> <p>Entertainment before the internet!</p> <p>(I never know if “jumper” is a word outside the UK? A sweater, a pullover.)</p> <p>It’s funny how these things come into your head after honestly <em>decades.</em> I think it’s about having a kid of a certain age that erupts memories of being that age yourself.</p> <hr /> <p><a href=\"https://en.wikipedia.org/wiki/Free_association_(psychology)\">Free association</a> was developed by Freud in the 1890s and is a sort of interior Wikipedia rabbit-holing. It’s a kind of divination of the self that reveals personal truths, inaccessible before you begin pulling the thread: <em>\"the logic of association is a form of <u>unconscious thinking</u>.\"</em></p> <hr /> <p>So I remembered this phrase and the admittedly peculiar trick (which is still entertaining as it happens) and went digging and it’s not to do with Oompa-Loompas (<em>Charlie and the Chocolate Factory</em> was published in 1964) but actually spelt",
            "title": "Do today’s work today"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2026/01/23/style/modern-love-the-kiss-that-stopped-traffic.html",
            "publishedAt": "2026-01-23",
            "source": "Modern Love - NYT",
            "summary": "If you choose to live your life on the road, you may end up having the best kiss of your life in the middle of the street.",
            "title": "The Kiss That Stopped Traffic"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2026/Jan/23/fastrender/#atom-entries",
            "publishedAt": "2026-01-23",
            "source": "Simon Willison",
            "summary": "<p>Last week Cursor published <a href=\"https://cursor.com/blog/scaling-agents\">Scaling long-running autonomous coding</a>, an article describing their research efforts into coordinating large numbers of autonomous coding agents. One of the projects mentioned in the article was <a href=\"https://github.com/wilsonzlin/fastrender\">FastRender</a>, a web browser they built from scratch using their agent swarms. I wanted to learn more so I asked Wilson Lin, the engineer behind FastRender, if we could record a conversation about the project. That 47 minute video is <a href=\"https://www.youtube.com/watch?v=bKrAcTf2pL4\">now available on YouTube</a>. I've included some of the highlights below.</p> <p>See my <a href=\"https://simonwillison.net/2026/Jan/19/scaling-long-running-autonomous-coding/\">previous post</a> for my notes and screenshots from trying out FastRender myself.</p> <h4 id=\"what-fastrender-can-do-right-now\">What FastRender can do right now</h4> <p>We started the conversation with a demo of FastRender loading different pages (<a href=\"https://www.youtube.com/watch?v=bKrAcTf2pL4&amp;t=195s\">03:15</a>). The JavaScript engine isn't working yet so we instead loaded <a href=\"https://github.com/wilsonzlin/fastrender\">github.com/wilsonzlin/fastrender</a>, <a href=\"https://en.wikipedia.org/\">Wikipedia</a> and <a href=\"https://cnn.com\">CNN</a> - all of which were usable, if a little slow to display.</p> <p>JavaScript had been disabled by one of the agents, which decided to add a feature flag! <a href=\"https://www.youtube.com/watch?v=bKrAcTf2pL4&amp;t=242s\">04:02</a></p> <blockquote> <p>JavaScript is disabled right now. The agents made a decision as they were currently still implementing the engine and making progress towards other parts... they decided to turn it off or",
            "title": "Wilson Lin on FastRender: a browser built by thousands of parallel agents"
        },
        {
            "content": [
                "<p>In the comments to last year&#8217;s USAID post, Fabian <a href=\"https://www.astralcodexten.com/p/contra-mr-on-charity-regrants/comment/119589529\">said</a>:</p><blockquote><p>While i am happy for the existence of charity organisations, i don't get why people instead of giving to charity are so eager to force their co-citizens to give. If one charity org is not worth getting your personal money, find another one which is. But don't use the tax machine to forcefully extract money for charity. There are purposes where you need the tax machine, preventing freerider induced tragedy of the commons.</p><p>But for charity? There are no freeriders. If you neither give nor receive, you are just neutral. The receivers are not meant to give anyways.</p></blockquote><p>This is a good question. I&#8217;m more sympathetic to this argument than I am to the usual strategy of blatantly lying about the efficacy of USAID; I&#8217;m a sucker for virtuous libertarianism when applied consistently.</p><p>But I also want to gently push back against this exact explanation as a causal story for what&#8217;s happening when people support foreign aid.</p><h2>The &#8220;Other People&#8217;s Money&#8221; Argument</h2><p>IIUC, the argument is that people who would not donate to charity themselves find it more congenial to vote to tax <em>other</em> people and give <em>their</em> money to charity.</p><p>A simple problem with this argument is that actually, each voter&#8217;s money will also be taxed. So for example, if there&#8217;s a vote on whether to tax everyone an extra $100 and spend the money on foreign aid, then voting in favor of the law costs you $100, the same as if you donated the money yourself voluntarily.</p><p>There are two simple ways to rescue the argument (we&#8217;ll discuss complicated ways later):</p><p>First, you could argue that supporters are using the government as a force multiplier. That is, suppose that 51% of people support spending $100 of their own money on foreign aid. If, instead of donating personally, they vote for a law that taxes everyone $100, they can make their &#8220;donation&#8221; go twice as far by &#8220;matching&#8221; it with $100 checks from the 49% of unwilling voters. This doesn&#8217;t have quite the same oomph as the accusation of &#8220;spending other people&#8217;s money because you don&#8217;t want to sacrifice your own&#8221;, but at least it sort of makes rational sense from a public choice theory perspective.</p><p>Second, you could argue that supporters are disproportionately poor people who pay low taxes, and who suffer no personal downside in forcing the rich to donate.</p><p>I don&#8217;t think either of these hold up. Depending on what program you&#8217;re talking about and how you ask, between <a href=\"https://publicconsultation.org/foreign-aid/large-bipartisan-majorities-oppose-deep-cuts-to-foreign-aid/\">60%</a> and <a href=\"https://bipartisanpolicy.org/article/poll-shows-bipartisan-backing-for-continued-u-s-commitment-to-pepfar-sens-frist-daschle-react/\">90%</a> of Americans support some of the more popular foreign aid programs. And although I can&#8217;t find straight income data, <a href=\"https://www.pewresearch.org/2025/05/01/international-engagement-and-support-for-foreign-aid/\">more educated people</a> are more likely to support them, so probably supporters are on average wealthier than opponents. Let&#8217;s say that the votes-in-favor-of-foreign-aid coalition controls 80% of national wealth. It can&#8217;t be worth their time to pass foreign aid laws (rather than donate directly) just in order to seize an extra 20% from the opponents. The average coalition member probably loses more in lack of flexibility (e.g. about where to direct their donations) than they gain from the extra 20% that seizing opponents&#8217; money gives them!</p><p>But this should be mysterious: if the pro-aid coalition is so strong, why <em>don&#8217;t</em> they just donate on their own? We can imagine an extreme scenario where 100% of Americans supported taxing everyone $100 and giving it to Doctors Without Borders - isn&#8217;t it obviously simpler for each American to donate the $100 themselves without the law?</p><p> Yet this whole discussion is predicated on a shared assumption - which I agree with - that without government intervention, most people wouldn&#8217;t donate voluntarily, and the amount of money spent on foreign aid would go way down.</p><p>This post is about solving this mystery.</p><h2>The Virtue Signaling Argument</h2><p>It might seem that a vote on foreign aid offers the following costs and benefits:</p><ul><li><p><strong>VOTE YES:</strong> You feel like a good person, but lose $100 in extra taxes</p></li><li><p><strong>VOTE NO: </strong>You feel like a bad person, but at least you keep the $100</p></li></ul><p>But this only applies if you&#8217;re the single deciding vote pushing the law from 49.999% to 50.001%, which you never are. In real life, it&#8217;s more like:</p><ul><li><p><strong>VOTE YES: </strong>You feel like a good person, and your vote doesn&#8217;t change your taxes.</p></li><li><p><strong>VOTE NO: </strong>You feel like a bad person, and your vote doesn&#8217;t change your taxes.</p></li></ul><p>Since your taxes will be the same either way, voting yes strictly dominates. This is the virtue signaling model of voting, and it implies that <em>even if no single voter supports raising taxes for foreign aid, </em>the electorate might nevertheless vote to raise taxes for foreign aid!</p><p>(although most people don&#8217;t tell others their votes, maybe this is about self-signaling)</p><p>One potential counterargument: votes on these topics tend to reflect polls about voters&#8217; true beliefs pretty well. But you could argue that poll respondents face the same incentive to virtue signal (polls also don&#8217;t change your taxes). Answers to poll questions do change based on changing realities (eg people are less likely to support foreign aid if they&#8217;re told the budget is tight), but, uh, maybe people are also trying to signal fiscal discipline, and, uh, somehow keep all of these signals straight so that it exactly matches what you would expect if they were voting and responding based on true beliefs.</p><p>A stronger counterargument: the Virtue Signaling Argument implies that all &#8220;raise taxes slightly to do a nice thing&#8221; laws should succeed. But in fact, many of these laws fail. There are dozens of state and local measures like this every election, and they usually follow the pattern you would expect - blue states vote in favor, red states vote against, more likely to pass if the taxes are low and the nice thing is popular.</p><p>You could still explain this with more signaling epicycles - the red staters would rather signal fiscal discipline, except on really popular causes where they&#8217;d rather signal support - but now the signaling theory has gotten so complicated that it&#8217;s almost impossible to distinguish from honestly held beliefs even in principle.</p><h2>The Insomnia Argument</h2><p>Fabian&#8217;s critique above gestures at the free rider model of fair taxation. In this model, certain taxes (for example, to fund the police) are fair, because there&#8217;s no market solution to the same problem that avoids free rider effects. We can&#8217;t simply ask each citizen to make their own decision about whether or not to contribute to the police, because police presence lowers crime for everybody. It would be too tempting to defect - that is, to refuse to contribute - trusting that everyone else&#8217;s contributions will be enough to maintain adequate police funding level and keep crime low for you. But if everyone does this, the police don&#8217;t get funded at all.</p><p>Is charity like this? Suppose that we think of charity as purchasing some psychological good - for example, maybe people sleep better knowing that the poor are being helped. Then we can think of non-donation as free-riding on this psychological good - if <em>you</em> donate to charity and solve the African famine, then <em>I</em> can sleep easy instead of fretting about all the poor people starving in Africa. </p><p>The obvious counterargument is that many people don&#8217;t care. They&#8217;re not free riders; they just sleep fine whether poor people are helped or not.</p><p>But we usually ignore this when thinking about government. Let&#8217;s take an example from the other side of the aisle and imagine a plan to privatize ICE: the government sets laws for what it can do (e.g. who can vs. can&#8217;t be deported), but it&#8217;s funded entirely by voluntary donations. What goes wrong? </p><p>Free-rider theorists would say that there are some benefits to fewer immigrants (e.g. lower crime, less job-stealing) that defectors would enjoy even if they didn&#8217;t donate. But many people don&#8217;t believe in these benefits. And many other people, whether they believe or not, are unaffected (for example, they live in crime-free gated communities and have un-stealable-jobs like founder/CEO). These people aren&#8217;t free riders in the minarchist sense. They just don&#8217;t benefit from the policy.</p><p>In order to justify immigration enforcement via taxation rather than voluntary donation, you have to argue that the benefit of coordinating the people who do want fewer immigrants is greater than the unfair cost imposed on the people who don&#8217;t want that. But then you could make this same argument about charity.</p><p>I&#8217;m not sure how to think about this one, or how to avoid having it justify almost anything, so I&#8217;m presenting it for your assessment but otherwise moving on.</p><h2>The Bundling Argument</h2><p>A variation on the above:</p><p>Suppose there&#8217;s a famine that will kill 50,000 people, and the only way to solve it is through a $5 million project - for example, buying a giant cargo ship to transport food. If there are 50,000 altruists with $100 each, this is a coordination problem, where you need to figure out some way to incentivize all of them to do their part. For example:</p><ul><li><p>They might worry that if they donated, other altruists would free-ride off them.</p></li><li><p>They might worry that the cause will collect more than $5 million, and the extra would be useless.</p></li><li><p>They might worry that the cause would collect less than $5 million, and the problem wouldn&#8217;t be solved, but nobody would return their money to them.</p></li></ul><p>You could solve some of these with coordination platforms like Kickstarter, and there are clever/complicated solutions to the others, but it&#8217;s still not trivial, and lots of projects get sunk by considerations like this.</p><p>But this is rarely how real charity works. More likely, your $100 can save one life, and your marginal utility over total lives saved is pretty constant. Making the famine 1 part in 50,000 less bad is 1/50,000th as good as ending it entirely. If the coalition of altruists only reached 49,999 people and saved everyone except for one person, this is still a pretty good outcome, barely any worse than if they&#8217;d succeeded completely. So there is no coordination problem here, and no need to call in the government&#8217;s coordination-problem-solving ability.</p><p>The Bundling Argument asks: what if, psychologically, this isn&#8217;t true? What if &#8220;your $100 plus equal donations from the rest of our coalition of 49,999 other altruists can completely solve this famine&#8221; sounds more appealing then &#8220;if you donate $100, you can save one person from a famine which will still kill thousands of others&#8221;?</p><p>Most people engage with the sorts of distant suffering that require charity primarily through the news. And through the news, a famine that kills 49,999 people sounds the same as one that kills 50,000; from a psychological perspective, your donation did nothing. What you really want is to read the headline &#8220;FAMINE SOLVED, GRATEFUL WORLD GIVES THANKS TO CHARITABLE HEROES&#8221;. Therefore, people might be more willing to vote for a law that takes $100 from everyone and solves the problem, compared to how willing they would be to donate themselves - even if they aren&#8217;t getting any extra leverage from other people&#8217;s money.</p><h2>The Transaction Costs Argument</h2><p>Economists have invented an instrument called the <a href=\"https://en.wikipedia.org/wiki/Assurance_contract\">assurance contract</a> which solves free rider problems without government force.</p><p>A leader (the &#8220;entrepreneur&#8221;) proposes a contract stating that all signatories will donate money, which comes into effect only after a certain number of people sign it. For example, it might say &#8220;Everyone will donate 5% of their income to the Pentagon to provide America with a military, and this contract will activate once every American has signed it.&#8221;</p><p>Making every American sign it is a tough offer - aren&#8217;t some people commie traitors who would prefer to see us invaded by our enemies? - but we can lower the threshold to something like 90% with only slight loss of efficiency. Won&#8217;t there still be free riders hoping that somebody else signs first and they get to be in the 10% who miss out? There&#8217;s a more advanced version called the <a href=\"https://en.wikipedia.org/wiki/Assurance_contract#Dominant_assurance_contracts\">dominant assurance contract</a> which goes some of the way to solving that problem.</p><p> (ACX grantee <a href=\"https://spartacus.app/\">Spartacus.app</a> helps people create their own assurance contracts for collective action situations)</p><p>So: right now, in the real world, do you support replacing military taxation with an assurance contract?</p><p>I don&#8217;t. Even though the math checks out and the incentives are aligned, I expect it would fail to get 90% of Americans, for many reasons:</p><ul><li><p>Some people would never hear about it, no matter how well-advertised it was.</p></li><li><p>Some people would hear about it, but constantly put off signing it out of laziness or anxiety.</p></li><li><p>Some people live paycheck to paycheck and can&#8217;t pay 5% of their yearly income.</p></li><li><p>Some people would misunderstand the situation and come up with incorrect theories of how signing would hurt them, or how they could profit from refusing.</p></li><li><p>Some people would be so upset at the idea of paying 5% of their income that they would psych themselves into thinking that maybe being invaded by foreigners wasn&#8217;t so bad.</p></li><li><p>The average person nods along to insane statements like &#8220;if Elon Musk distributed his fortune evenly, every American would get ten million dollars&#8221; and probably doesn&#8217;t have the reasoning skills to think about coordination problems clearly.</p></li></ul><p>Along with these reasons, it seems like people don&#8217;t donate money even when they care a lot about something. How many people care a lot about wokeness, either pro or con? How many have donated significant amounts of money to organizations promoting or opposing it? Why? Is the answer <em>just</em> free rider problems? Are they just virtue signaling when they talk about wokeness, and they don&#8217;t <em>really</em> care? </p><p>Forget about reaching 90% - would even half of Americans sign this contract and follow through? Or would we announce the end of coercive military taxation to great fanfare, and then immediately be invaded by Canada and turned into the 11th province?</p><p>Contra the economists, I&#8217;m not sure that we fund the military through coercive taxation <em>only</em> to avoid free rider problems. I think we fund it through taxation to avoid the same kinds of transaction cost issues that would sink the assurance contract. Since charity suffers these same transaction costs, the same arguments may apply.</p><h2>The Multiple Preferences Argument</h2><p>Everyone has multiple conflicting sets of preferences that change based on how they&#8217;re being elicited. These go by many names: Near Mode vs. Far Mode, superego vs. id, &#8220;my best self&#8221; vs. &#8220;my regular self&#8221;. </p><ul><li><p>Many people say phones are terrible and destroying society and that their life would be much better without a phone and that they wish they could quit their phone. Then they spend all their time on their phone.</p></li><li><p>I know I should be more social, so when people invite me to a party, I sometimes say yes. Then, when the time for the party comes around, I realize it would involve leaving my house and search for any possible way to get out of it.</p></li></ul><p>Some economists have an irritating tendency to call whichever one ends up being elicited by the immediate environment &#8220;the revealed preference&#8221; and everything else some kind of fake signaling; <a href=\"https://www.astralcodexten.com/p/sure-whatever-lets-try-another-contra\">I consider this unwise</a> - should we really say that an alcoholic&#8217;s &#8220;real&#8221; preference is to drink too much, then pay $10,000 for rehab as a fake signal to his friends to let him claim he doesn&#8217;t want to do it, then go back to drinking because that&#8217;s what he really wants, then do another $10,000 rehab stint but this time actually quit for good because his preference coincidentally changed in the meantime? I prefer George Ainslie&#8217;s <a href=\"https://www.picoeconomics.org/personal.html\">economist-friendly explanation</a> of genuinely time-inconsistent preferences, each of which is able to enlist certain parts of the planning process as allies to its cause.</p><p>Preferences around charity display this kind of time-inconsistency. For example, I used to think I &#8220;should&#8221; donate to charity, but basically never did it. Then I <a href=\"https://www.astralcodexten.com/p/the-pledge\">took the Giving What We Can pledge</a>, which forced me to donate a specific amount at a specific time; even though it felt slightly aversive (&#8220;aaaah! I&#8217;m losing money!&#8221;), I did it to satisfy the pledge, and 99.999% of the time (ie every moment except the exact second I clicked on the donate button) I&#8217;m happier with my choices. This mirrors how some people feel like they &#8220;should&#8221; quit alcohol, but don&#8217;t do it until they take some kind of sobriety pledge with an organization like Alcoholics Anonymous - and then are happier with their lives at every moment <em>except</em> the exact second that they really want a drink but can&#8217;t have one.</p><p>On this model, a vote about foreign aid - which involves a tax bill that won&#8217;t come due for months, and gets laundered through a government budget so complicated that you never feel the pain from any particular line-item - enlists a different, longer-term preference than a decision whether or not to donate at this exact second (and unless someone has taken the GWWC pledge or an equivalent, the personal decision to donate is just the decision to donate at this exact moment, integrated over every moment of the lifespan). It&#8217;s no mystery that people might make different choices on these two decisions, any more than that someone might both use heroin <em>and</em> be willing to vote in favor of a resolution to make heroin vanish from the universe forever. </p><p>If this is right, the question becomes: what&#8217;s the role of government in these sorts of intrapersonal conflicts? Is it fair for one person&#8217;s time-inconsistent preference to enlist government help in its war against that same person&#8217;s other preferences, even when it inconveniences third parties (eg the people who don&#8217;t want to donate to foreign aid at all?)</p><p>There&#8217;s no rule saying that government must always support people&#8217;s shortest-term and least-willpower-requiring preference; for example, laws against gambling give extra support to the long-term preferences at the expense of the impulsive ones. On the other hand, we don&#8217;t want to make a habit of this, or we&#8217;ll end up with Prohibition, or bans on porn, or some other dangerously totalitarian attempt to mandate virtue.</p><p>My true opinion on this is that I would be satisfied with a law that gives foreign aid by default, but allows any citizen who&#8217;s interested to check a box on their tax forms saying something like:</p><blockquote><p><em>I request to cancel my participation in foreign aid this year and receive an $X tax refund. I understand this will result in Y amount of preventable death and suffering.</em></p></blockquote><p>&#8230;as long as there are similar boxes for everything else the government does that can&#8217;t be justified under simple minarchist logic. I predict that only 10% - 40% of voters - the same number who say they disapprove of foreign aid in polls - would check this he box, and I&#8217;d be satisfied with this outcome.</p><p>In practice, probably this is too weird, and sets a &#8220;bad&#8221; precedent (from the government&#8217;s perspective), and so will never happen. But I still think it&#8217;s useful as a thought experiment. Do you agree that, if all foreign aid were cancelled outright, only a small fraction of people would donate on their own? And do you agree that, if the tax form included a box like this, only a small fraction of people would check it? </p><p>If so, then voter support for foreign aid can&#8217;t be a simple matter of &#8220;spending other people&#8217;s money&#8221;. Something more complicated must be going on.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/slightly-against-the-other-peoples",
            "publishedAt": "2026-01-23",
            "source": "SlateStarCodex",
            "summary": "<p>In the comments to last year&#8217;s USAID post, Fabian <a href=\"https://www.astralcodexten.com/p/contra-mr-on-charity-regrants/comment/119589529\">said</a>:</p><blockquote><p>While i am happy for the existence of charity organisations, i don't get why people instead of giving to charity are so eager to force their co-citizens to give. If one charity org is not worth getting your personal money, find another one which is. But don't use the tax machine to forcefully extract money for charity. There are purposes where you need the tax machine, preventing freerider induced tragedy of the commons.</p><p>But for charity? There are no freeriders. If you neither give nor receive, you are just neutral. The receivers are not meant to give anyways.</p></blockquote><p>This is a good question. I&#8217;m more sympathetic to this argument than I am to the usual strategy of blatantly lying about the efficacy of USAID; I&#8217;m a sucker for virtuous libertarianism when applied consistently.</p><p>But I also want to gently push back against this exact explanation as a causal story for what&#8217;s happening when people support foreign aid.</p><h2>The &#8220;Other People&#8217;s Money&#8221; Argument</h2><p>IIUC, the argument is that people who would not donate to charity themselves find it more congenial to vote to tax <em>other</em> people and give <em>their</em> money to charity.</p><p>A simple problem with this",
            "title": "Slightly Against The \"Other People's Money\" Argument Against Aid"
        },
        {
            "content": [
                "<p>If there’s several things this blog endorses, one of them would be going meta.</p>\n<p>It’s time. The big picture awaits.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Live In The Wrong Place</h4>\n\n\n<p>The most important meta question is location, location, location.</p>\n<p>This is the periodic reminder that dating dynamics are very different in different locations, and gender ratios are far more uneven than they appear because a lot of people pair off and aren’t in the pool.</p>\n<p>If you are a man seeking to date women, New York City is the place to be.</p>\n<blockquote><p><a href=\"https://x.com/churrascooooo/status/1945560034877776134\">Churrasco Suadade</a>: when I’m out I notice that tables at restaurants and bars in manhattan are probably around 80-95% women, it’s a new dynamic that no one is talking about.</p>\n<div>\n\n\n<span id=\"more-25051\"></span>\n\n\n</div>\n<p>Fixed Income Guy: Are you at all the poor people places? All the finance guy hang outs are 80% dudes.</p></blockquote>\n<p>I mention Fixed Income Guy to mock him, as in why are you spending a lot more money to hang out with 80% dudes and largely finance dudes at that? I mean, sure, if that’s what you want.</p>\n<blockquote><p><a href=\"https://x.com/IDoTheThinking/status/1946624215903260850\">Darrell Owens</a>: Oh this is new? Coming from the Bay Area, the amount of women I see in Manhattan is insane. You rarely see more than few young women partying back in San Francisco. The gender ratio here feels 70:30 young women to men, its every block in Manhattan!</p>\n<p><a href=\"https://x.com/Noahpinion/status/1946817509174468843\">Noah Smith</a>: In an ideal world, where you live wouldn’t really matter in terms of dating opportunities, but the truth is that one of the easiest ways to get chicks is to just move to New York City.</p>\n<p>Having lived in both Tokyo and NYC, I can pretty confidently tell you that while Tokyo is not a tough dating market by any means, NYC is absolutely on another level.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You’re Not Okay Making Less Money Than She Does, You Fool</h4>\n\n\n<p><a href=\"https://x.com/DesirableTruth/status/1955080072462766478\">This viral clip (which is viral for a reason, it’s good fun, wait for it) is another endorsement of New York City</a> being a great place to meet women, as you have a wide variety of great and largely successful women to explore. What doesn’t get mentioned in that clip as a key reason things are so great is that the gender ratio in NYC is highly favorable for men.</p>\n<p>The interviewer asks about dating women who make more money than then the man, clearly trying to get the guy to say this is a problem, but he isn’t buying it, instead pointing out that successful women are more thoughtful and plan for the future, and it in no way bothers him at all. Right on, but this sidesteps the other half of problem. The man has to be okay with the fact that he earns less money (and often has less formal education or other status markers), which often men aren’t, and also the woman has to be okay with it too.</p>\n<p>That’s the rub. As a man, you might (and should be) be actively all for it (this doesn’t make you less successful, it makes you more successful), but if she’s going to be bothered by it anyway, that’s also your problem. So the key is to figure out quickly if she will actually be fine with it or not.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Work Out The Wrong Amount</h4>\n\n\n<p>Being in shape is great. Having muscle can be a game changer. By far the worst plausible amount of exercise is none at all.</p>\n<blockquote><p><a href=\"https://x.com/laurenlself/status/1883298995600261375\">Lauren Self:</a> Men severely underestimate the power of gaining 20lbs of muscle</p>\n<p><a href=\"https://x.com/laurenlself/status/1916190874683511270\">Lauren Self</a> (QTing from before): LISTEN UP BOYS.</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!nuKe!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F765ad079-34c9-4576-bab6-988504ed19a2_1200x931.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>But don’t go nuts. For most people that is not a problem, but yes it is very possible to go too far. As a man, as I understand preferences in general, you don’t want to go near actual zero fat and you don’t want to look actively skinny.</p>\n<blockquote><p>Taoki: why are women lying about this? like what’s the actual cause?</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!A7Qj!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5140cbf1-04e6-487f-b39b-6c8d4a70896e_656x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!30s5!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa29c4836-8583-424a-81c1-4c50f78bb1ca_680x672.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Lauren Self: 100% of women would choose something in between these two options</p>\n<p>Shako: The aesthetics of a man who poses gives them the ick. But if both were shirtless at a beach they’d obviously prefer the fit guy.</p>\n<p>Special K: No he does look better in the before. Women are correct on this one I fear. Guys obsess over these supremely tight toned muscles and they shouldn’t.</p>\n<p>Liron Shapira: Guy on left looks like he’s a chill dude with a social life, guy on right looks like he’s obsessed with his body. Same body could look better with better social context, although just the extremeness of his rippedness is a little alarming about his life priorities.</p>\n<p>Joel: “let’s get a burger?” v “are you really gonna eat that?”</p>\n<p><a href=\"https://x.com/LouStreets/status/1916564584472658357\">Mason</a>: The male equivalent of the hourglass shape is just “wall”</p>\n<p>Teej dv: his smile is nicer in the first one</p>\n<p>Taoki: It is actually. We like you guys wide.</p>\n<p>LS Vision: Nah this is cap. The women who selected before is def just the insecurity of his value going up afterwards and making them feel insecure he’d cheat or leave. Any man who has went through a gym transformation, you can LITERALLY feel women treat you significantly different after.</p>\n<p><a href=\"https://x.com/webdevMason/status/1916569983280152984\">Mason</a>: Women generally like tall guys who have some (not crazy) muscle definition, and a little extra fat that bulks that out can actually augment that</p>\n<p>We all have our own tastes, but this a pretty typical type.</p>\n<p>I don’t know what there is to be mad about here.</p></blockquote>\n<p>For practical purposes, before beats after here. The before guy is already in ordinary, practical good shape. The after guy took things too far, and seems to know it except that he thinks it is good, which makes it worse.</p>\n<p>Except one key special case?</p>\n<blockquote><p><a href=\"https://x.com/benryanwriter/status/1916858423779496033\">Benjamin Ryan</a>: People are going back and forth about whether women think the guy in the right is hot. But people have no idea how extreme the standards are for gay men. In gay culture, the man on the left is considered hopelessly fat. Many gay men have no reservations about informing such a man about his supposed corpulence being anathema.</p>\n<p><a href=\"https://t.co/CSQKOVkJnz\">I wrote about the rare study</a> to examine the toxic qualities of gay culture for The Guardian.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Don’t Know You Are Hot</h4>\n\n\n<p>I mean, of course there are hot guys who don’t know they’re hot, even more so than there are hot women who don’t know they’re hot.</p>\n<blockquote><p>Pandora: One surprising takeaway from Slutcon was that apparently there are hot guys who just don’t know they are hot? Guess it’s time to go objectify some more men.</p>\n<p>Eneasz Brodski: If you grow up ugly you never really internalize that you are attractive after a glow-up. I still don’t believe it inside, and I hear I’m attractive to a fair percentage of women. Also makes me far more attracted to women w the same experience, but that may be a male universal.</p>\n<p>Pandora: This problem seems even more pervasive than I thought.</p>\n<p>Sparr: Hot in general, to the average viewer, or hot to you? You seem like someone who can probably tell the difference.</p>\n<p>Pandora: I saw examples of guys being clueless about all three at once.</p>\n<p>21 Kindness: The whole “men subsist on one compliment a decade thing” is kinda true lol.</p>\n<p><a href=\"https://x.com/drethelin/status/1978137576092369362\">Misha</a>: it turns out being hot is not, in and of itself, very useful for men.</p>\n<p>Sokoban Hero: No it’s useful.</p>\n<p>Misha: I said not VERY useful.</p>\n<p>Dissproportionately: I’ve seen men unhot themselves to women within minutes. I don’t think women can unhot themselves to men.</p></blockquote>\n<p>Being hot is in many ways a lot less valuable if you don’t know you are hot, because you don’t get the confidence and you don’t take advantage of opportunities or feel you’re good enough, but contra Misha I believe it is still very useful. There are even some advantages to not knowing, in that some of the behaviors that happen when someone knows they are hot are often effectively arrogant or entitled or demanding or selfish, none of which helps.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because Age Gap Discourse Is Crazy</h4>\n\n\n<p><a href=\"https://x.com/devahaz/status/1922019600536834141\">This link is almost certainly bait, but things in some spaces have gotten so insane that you can’t be sure people</a> aren’t talking about 28-31 as a problematic age gap. What?</p>\n<p>I mean, at minimum it’s good bait, it worked.</p>\n<p>I’ve also seen some other examples that look a lot less like bait but still involve obviously totally fine gaps in both directions. As in, I’ve heard talk in places where it definitely wasn’t bait of 24 and 27 being radically different numbers, and I don’t understand why.</p>\n\n\n<h4 class=\"wp-block-heading\">Dating Apps Are Bad For Mental Health</h4>\n\n\n<p>Well, maybe. <a href=\"https://x.com/DegenRolf/status/1995781287714459796\">Via Rolf Degen</a> <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0747563225003267\">there is a meta-study.</a></p>\n<p>The obvious question is whether this is a causal relationship, or whether it is primarily selection effects. You are on the dating apps for a reason.</p>\n<blockquote><p>Rolf Degen (quoting the study):</p>\n<p>Meta-analysis: The use of dating apps is associated with poorer mental health.</p>\n<p>Dating apps hold the promising reward of love but have been accused of using perverse incentive structures to profit from those who try to find it. We conducted the first systematic review and quantitative meta-analysis of studies examining average differences in the outcomes of dating app users and non-users.</p>\n<p>Our results showed that dating app users had worse psychological health and well-being than dating app non-users across a variety of outcomes including depression, anxiety, affective dysregulation, loneliness, and psychological distress, although cross-sectional design limitations prevent causal interpretation. By aggregating findings from extant studies, we showed that in the nearly 17 years since dating apps have been on the market, users of these platforms have reported poorer psychological health and well-being than non-users.</p>\n<p>There are several explanations for why dating app users may be struggling. The first is that dating apps are subject to selection effects, making the people who choose to use these platforms different from those who do not. People who are vulnerable to psychological health and well-being difficulties may prefer dating apps because they can avoid uncomfortable interactions, leading to negative patterns of reinforcement.</p>\n<p>A second explanation involves exposure effects; that is, features such as gamification that may provide positive reinforcements that encourage problematic dating app use and keep people swiping.</p>\n<p>The differences identified here could explain some of the challenges that users are likely to experience and be part of the reason they eventually burn out and quit dating apps altogether.</p></blockquote>\n<p>My guess is that dating apps are in important ways bad for mental health versus having better ways to find dates, and that sufficiently bad outcomes in terms of ability to find dates or find worthwhile dates is indeed worse for short term reported mental health than not trying. Whereas those who are successful get off the apps or never needed them in the first place.</p>\n<p>What is the alternative? If the other choice is ‘do not try’ then for the median user the dating app is probably trading short term pain for chance of long term gain. If the other choice is ‘have uncomfortable real life interactions and make things happen’ and the app is blocking that instead of supplementing or leading into that, then the alternative is plausibly strictly better.</p>\n<p>Certainly we could make app variations that are better for mental health controlling for outcomes, and also that give people better outcomes. Solving for the equilibrium, to get people to actually use those apps, is the difficult part, since people will value convenience and ease of use and low cost and avoiding trivial inconveniences dramatically more than they should, and if enough especially women effectively insist on the swiping experience it’s hard to escape from that.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Listened To E-Girl Advice</h4>\n\n\n<p><a href=\"https://x.com/atroyn/status/1924288233372106841\">I think this is importantly wrong for both e-girls and also VCs?</a></p>\n<blockquote><p>Anton: egirl dating takes are worthless for the same reason vc takes on how you should run your company are worthless; if you could do it you would just do it not talk about it</p>\n<p>men in particular are truly better off without this kind of “help”</p>\n<p>making up egirls in my head to get mad at</p></blockquote>\n<p>If she could be an E-Girl or she could date, what makes you think she would choose to date? What makes you think she isn’t also dating?</p>\n<p>Similarly, if you could be a VC or a startup founder, it’s not that suspicious that you would choose VC. At this point in my life I would definitely prefer VC over founder. I don’t want to go through founder mode again. I am totally prepared to eat my words if I end up doing it anyway, and if I’m in then I’m in, but I don’t want to be in.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Didn’t Hire Blaine Anderson</h4>\n\n\n<p>Division of labor, like dudes and also women, rocks. Matchmakers should be much more of a thing than they are. There is a profound market failure, a failure of the services to be good versions of themselves, or both.</p>\n<p>I cannot in any way vouch for the effectiveness of <a href=\"https://x.com/datingbyblaine\">Blaine Anderson’s</a> matchmaking service. I can however vouch for her Twitter feed having consistently insightful and fun things to say. <a href=\"https://x.com/datingbyblaine/status/1970956388915405279\">Her price range is</a> ‘usually less than $50k’ and in exchange she goes out and sources to fit your particular criteria (which she will sometimes push back on).</p>\n<p>You can also<a href=\"https://t.co/NY1X10Jsgi\"> sign up (for free) to be a woman she reached out to</a> for matches, on first principles being on these lists seems to be a good time investment?</p>\n<p>There’s a lot of self-promotion, no question, but there are hard-to-fake signals that she is the real version of the thing in various ways, facing reality as it is, looking at the data and actually trying to get good results.</p>\n<p>Also this one makes a good case:</p>\n<blockquote><p><a href=\"https://x.com/datingbyblaine/status/1973406391042773100\">Blaine Anderson</a>: Underrated advantage of hiring a matchmaker, if you’re a single man:</p>\n<p>• You sound cringe AF when you brag about yourself to women</p>\n<p>• You sound amazing when I brag about you to women</p></blockquote>\n<p>One thing that blows my mind is she tells stories where the guy will say ‘get me a date with this specific micro-famous woman’ and she (at least sometimes) goes out and makes that happen. The guys asking this look damn good on paper, which no doubt is a lot of why this can sometimes work, but still, hot damn.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Think Zizek Mocked Date Me Docs</h4>\n\n\n<blockquote><p><a href=\"https://x.com/dcxStep/status/1987846253233721618\">EigenGender</a>: despite being very happily in a long term relationship im always very excited to read a dating doc. they’re some of the most vulnerable and genuine writing you can find and a window into another persons life. if you make fun of them you’re burning the commons and you should stop.</p>\n<p>Stephen Fay: I like to read the date me docs, but I also am entertained by what Zizek has to say about them</p>\n<p>Zizek (<a href=\"https://x.com/paularambles/status/1987743577523532036\">well okay actually Paula Rambles</a>): Ah! You see, this miserable little document, this so-called date-me doc, is our era’s most honest pornography. It pretends to be romance, but what is it really? It is no longer the trembling hand on paper, the confession of desire. It is a spreadsheet of desire. “I am ready. I am six foot four. I have done the work.” What work? Love is precisely the place where work collapses into failure. You study and then you fail the exam.</p>\n<p>And look at this language. “Highly agentic, emotionally warm.” Beautiful nonsense. Freedom, yes, but domesticated. Agency, yes, but pointing politely towards him. For Hegel, love is the risky collision of two freedoms. Here, there is no risk. She must arrive pre-formatted.</p>\n<p>Then the farce reaches ecstasy. “If she does not appear, I will pursue single fatherhood.” Magnificent. Chance is canceled. Eros becomes procedure. The miracle of two gazes across a smoky room is replaced by paperwork and a receipt. The objet petit a is now a literal baby routed around the Other. And of course, the “monogamish” clause. Pure ideology. Fidelity with a footnote. Like Coke Zero: love without sugar, passion without calories. He wants the experience of devotion, but sterilized of danger.</p>\n<p>The document offers no asylum from loneliness. It is loneliness, meticulously formatted, hyperlinked, and begging for comments. He does not whisper “I love you.” He says “I am prepared to love you, conditionally, pending review.”</p></blockquote>\n<p>That’s a funny post, and does an excellent job of mocking those who would make fun of date me docs and other actually intentional stances. Such magnificent flailing.</p>\n<p>And thus, you have failed to look at <a href=\"https://docs.google.com/document/d/1jH3L-lIRO0BV8FJr8up2lzZ3JmioX5MNG3roOj-6J1E/edit?tab=t.0\">the Date Me doc of Olga Yakimenko</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Still Single Because You Don’t Appreciate Relationships</h4>\n\n\n<p>Here, in addition to the intended lede, we have at least 40% of respondents having been in a relationship for fully 8 years.</p>\n<blockquote><p>Aella: wow a whole 40% of people in long-term relationships are satisfied with their sex lives!</p>\n<p>Critter: i imagine the numbers are worse for people not in long-term relationships</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!bxtt!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F99e4da5c-1504-40f9-8cc4-7e363ab6789f_1047x439.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>If anything these results seem potentially ‘too good,’ implying that couples are breaking up over this more than they probably should over the longer term.</p>\n<p>One must also note that this is an Aella survey, so some of these relationships will be poly or open, but even accounting for that this says a lot. Selection effects are a lot of this, but that’s part of the point.</p>\n<p>Perhaps you especially don’t appreciate marriage.</p>\n<p><a href=\"https://raffigrinberg.substack.com/p/marriage-is-sexy?r=j2xo&amp;utm_medium=ios&amp;triedRedirect=true\">Raffi Grinberg writes that marriage is sexy</a>, both figuratively that married couples are happier and make more money and have more kids and die less often and all that, and also that they have more sex (even if you only count with each other). And that the lifetime divorce rate is actually only 30% not 50%, average age of marriage is 29 and average first child is 28, despite the implicit cultural message that those numbers are in the 30s.</p>\n<p>And yet he says Hollywood is sending us the opposite message. To which I’d say, sometimes, but I wouldn’t oversell this. Yes, in the How I Met Your Mother episode he talks about Barney keeps making fun of Marshall for being married, but the show clearly thinks that Marshall marrying Lily is sexy and awesome and great for both of them throughout and that Barney is ultimately wrong, and also the whole show is Ted trying to meet his wife and mother of his children.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Not Single And Haven’t Been For a While</h4>\n\n\n<p>Here’s another backdoor ‘are you in a relationship’ poll, 78% of monogamous heterosexual men reported having a partner for longer than a year.</p>\n<blockquote><p>Alice Playing: monogamous hetero men with 1+ year-long partners: if you could have an affair with a woman of your liking, with absolute, 100% certainty that your partner would never find out, would you do it?</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!7muG!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F72cc39cd-e73b-4944-a24f-0e3df31d0fab_1029x278.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>On the question itself, it’s not actually possible, since you’ll know and you can’t be sure you won’t tell them, and you’ll almost certainly act differently even if they never suspect or figure it out. One could even say ‘the only way to have 100% certainty they’ll never find out is if they’re dead, so absolutely not.’</p>\n<p>Literal ‘any woman you wanted’ with zero risk of discovery is a stupidly tempting offer. If you treat this in the spirit it was presumably intended, instead, and everyone was being fully honest including with themselves and fully understood what was on offer (as in literally whoever you’d most want), presumably the ratio would be a lot higher.</p>\n<p>Unless, of course, the way you know your partner will never find out is that your partner (or you and the woman you’d have the affair with) would be dead, in which case yeah bad deal, but that’s presumably not this meant. mnnn oo</p>\n<p>How do we know this? Well, one big data point is this next poll.</p>\n\n\n<h4 class=\"wp-block-heading\">You Are Still Single As Evidenced By Would</h4>\n\n\n<p>Um, guys, are almost none of you in a monogamous relationship? And even if you are single there’s also the issue of risking the friendship. What are you all thinking?</p>\n<blockquote><p>Alice Is Playing: men attracted to women: how many of your female friends would you have a one-night stand with, if they offered?</p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!oSLr!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F179ae329-83f2-4f89-bfdb-049e8c1e01ca_1042x271.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Only 14% of men attracted to women answering this didn’t have at least one female friend they would have a one night stand with? Presumably many of the others don’t have the right female friend. Which means substantially more than 86% of them are not, for the most important practical purpose, in a monogamous relationship?</p>\n<p>Remember that other poll from Aella above, that showed at least 40% of people were in 8+ year relationships? And the one from Alice that 78% of herero men were in a 1+ year nominally monogamous relationship? Rut roh.</p>\n<p>Then on top of that, a majority are willing to do this with a majority of their female friends, not only that one they have that crush on.</p>\n<p>It doesn’t mean these people don’t think they’re in relationships. As we’ve seen, they very much do think this. They might even be right. But don’t tempt them.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Lack Motivation</h4>\n\n\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5148219\">Paper reminds us</a> there is a 34 points gap (+34 versus +0) in net happiness for married versus unmarried people, with cohabitation only worth 10 points, and analyzes how this premium varies (slightly) by demographics.</p>\n<p>As the paper readily admits this tells us essentially nothing about what makes someone happy, because the whole thing is unfixibly confounded to hell. Happier, healthier and more successful people have an easier time getting married, and being unhappy leads to divorce. Both effects are epic in size.</p>\n<p>We do know the overall situation over a 50+ year time horizon is not good news, because while marrieds are slightly happier, the unmarrieds are somewhat less happy and more importantly are a larger percent of the population.</p>\n<p>Beyond that, I don’t know what to do with all these graphs or how to cash it out in useful advice. One might say ‘be the type of person who gets married,’ perhaps.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because Of Robin Hanson</h4>\n\n\n<p>As usual, never stop Robin Hansoning.</p>\n<blockquote><p><a href=\"https://x.com/robinhanson/status/1993823677306294343\">Robin Hanson</a>: You know how in romance stories the main characters hope to find a special relation, better than that which the ordinary people around them settle for? Your relations will probably be more like those of the ordinary folks, less like those of special main characters.</p></blockquote>\n<p>This has to be true, because math.</p>\n<p>It’s less true than it appears, because the relations of ‘main characters’ feel special to them the same as everyone else’s feel special. You could totally make a romantic comedy based on what I experienced, and you could also totally have me as a background character in someone else’s romantic comedy, although probably I’d be in a different genre entirely.</p>\n<p>To you, it will feel more like that of the special main characters, except that you don’t need to have a false crisis in the third act.</p>\n\n\n<h4 class=\"wp-block-heading\">You’re Single Because You Did This Instead Of Going To Therapy</h4>\n\n\n<p><a href=\"https://x.com/senatorshoshana/status/1920302549791371546\">Don’t be whoever Casy Means is being here</a>. Or do, it’s <a href=\"https://t.co/c2Umt8076y\">not like it did that much harm</a>, as long as you don’t expect any of it to do anything.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!xyxv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffb6ca9c7-3aff-4d47-af92-38fea34d01e7_1042x1779.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">The Lighter Side</h4>\n\n\n<p>We wish everyone involved the best.</p>\n<blockquote><p><a href=\"https://x.com/Aella_Girl/status/2002918927337390553\">Aella</a>: ​it’s really unfortunate that having an insane ex turns you personally into a greater liability for others</p>\n<p>Grimes: hahaha [trauma laughter].</p>\n<p>Aella: :( i wasnt thinking about u when i wrote the tweet but also :(.</p></blockquote>\n<p><a href=\"https://x.com/nimbusforecast/status/1938737023340421586\">Try harder.</a></p>\n<p><a href=\"https://www.perthnow.com.au/news/world/new-app-lets-people-buy-tickets-for-strangers-wedding-c-19662340\">A new app lets you pay to crash someone’s wedding and be a legit guest, cost is about $100-$150 per guest</a>. This seems low, given the cost to have a wedding worth crashing, and given you get a full meal, plus buffet and open bar, a unique experience and a reasonable amount of opportunity.</p>\n<p><a href=\"https://www.secondperson.dating/p/sex-at-the-rationalist-conference\">What Jacob learned about sex at the rationalist bloggers’ conference</a>, essentially that with zero integrity you get fuckbois and pickup artists, and when you do the opposite and get sufficiently high integrity and optimize for trust and honesty way above normal levels you get something magical and suddenly many good things are possible.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!2iZo!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F29c423dc-bc7a-4778-a1f1-e16c9f6894c8_1456x971.webp\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>Here’s another fun bit:</p>\n<blockquote><p>Jacob: My friend “<a href=\"https://casualsex.substack.com/\">Standard Deviant</a>” gave a talk titled “How I’ve had more sex.” He described the “<a href=\"https://casualsex.substack.com/p/the-escalation-ladder\">escalator</a>”: starting a conversation, exchanging compliments, light touch on the arm, etc. The important thing isn’t to rush up the escalator, my friend said, but to move <em>together in synchrony</em> whether you’re taking a step up or a step down.</p>\n<p>When women show interest in casual sex, he often asks: <em>do you do this sort of thing often?</em> If they don’t, he often forgoes the opportunity out of an excess of caution.</p>\n<p>Afterwards, more women wanted to have sex with him. I joked that women want to have sex not with the tall guy, hot guy, or the famous guy, but with the Schelling point guy.</p>\n<p>Someone pointed out that tall, hot, and famous are the usual Schelling points.</p></blockquote>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
            ],
            "link": "https://thezvi.wordpress.com/2026/01/23/dating-roundup-11-going-too-meta/",
            "publishedAt": "2026-01-23",
            "source": "TheZvi",
            "summary": "If there’s several things this blog endorses, one of them would be going meta. It’s time. The big picture awaits. You’re Single Because You Live In The Wrong Place The most important meta question is location, location, location. This is &#8230; <a href=\"https://thezvi.wordpress.com/2026/01/23/dating-roundup-11-going-too-meta/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Dating Roundup #11: Going Too Meta"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3198/",
            "publishedAt": "2026-01-23",
            "source": "XKCD",
            "summary": "<img alt=\"'Oh, and can I borrow 50 sacks of loose flour, a pile of lithium-ion batteries, a bucket of bleach, and a bucket of vinega--' 'NO!!!!!!'\" src=\"https://imgs.xkcd.com/comics/double_pronged_extension_cord.png\" title=\"'Oh, and can I borrow 50 sacks of loose flour, a pile of lithium-ion batteries, a bucket of bleach, and a bucket of vinega--' 'NO!!!!!!'\" />",
            "title": "Double-Pronged Extension Cord"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/on-programming-with-agents",
            "publishedAt": "2026-01-23",
            "source": "Zed Blog",
            "summary": "Agents handle typing so we can focus on thinking.",
            "title": "On Programming with Agents"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-23"
}