{
    "articles": [
        {
            "content": [],
            "link": "http://journal.stuffwithstuff.com/2026/01/24/the-value-of-things/",
            "publishedAt": "2026-01-24",
            "source": "Robert Nystrom",
            "summary": "<p>One of the reasons I write is to help me organize my own mind. I have a compulsive need to <em>figure things out</em> and I&rsquo;ll lay awake at night shuffling sentences around in my head until it hangs together. Then I just have to try to get it all down in Markdown before I dissolves back into chaos.</p> <p>Like a lot of people these days, I am losing a lot of sleep over <span name=\"generative\">LLMs</span> and generative AI. I mean that literally. I&rsquo;ve had nights where I tossed and turned worrying about whether AI is going to destroy a career I love or wreck modern society until the sun comes up.</p><aside name=\"generative\"> <p>For brevity&rsquo;s sake, I&rsquo;ll use &ldquo;AI&rdquo; here mostly to mean &ldquo;generative AI&rdquo;. The stuff that LLMs and products like ChatGPT do. I think it&rsquo;s useful to distinguish that from other uses of machine learning like categorization and labeling. But here, all I care about is the generative stuff.</p></aside> <p>I keep hoping I&rsquo;ll sort it out in my head enough to reach some inner peace. I&rsquo;m not saying I will literally figure it out, like, for <em>the world</em>. But I keep hoping I can at least figure out my",
            "title": "The Value of Things"
        },
        {
            "content": [
                "<p>There’s a kind of polite fiction at the heart of the software industry. It goes something like this:</p>\n<blockquote>\n<p>Estimating how long software projects will take is very hard, but not impossible. A skilled engineering team can, with time and effort, learn how long it will take for them to deliver work, which will in turn allow their organization to make good business plans.</p>\n</blockquote>\n<p>This is, of course, false. As every experienced software engineer knows, <strong>it is not possible to accurately estimate software projects</strong>. The tension between this polite fiction and its well-understood falseness causes a lot of strange activity in tech companies.</p>\n<p>For instance, many engineering teams estimate work in <a href=\"https://asana.com/resources/t-shirt-sizing\">t-shirt sizes</a> instead of time, because it just feels too obviously silly to the engineers in question to give direct time estimates. Naturally, these t-shirt sizes are immediately translated into hours and days when the estimates make their way up the management chain.</p>\n<p>Alternatively, software engineers who are genuinely trying to give good time estimates have ridiculous <a href=\"https://news.ycombinator.com/item?id=19671824\">heuristics</a> like “double your initial estimate and add 20%“. This is basically the same as giving up and saying “just estimate everything at a month”.</p>\n<p>Should tech companies just stop estimating? One of my guiding principles is that <strong>when a tech company is doing something silly, they’re probably doing it for a good reason</strong>. In other words, practices that appear to not make sense are often serving some more basic, <a href=\"https://www.seangoedecke.com/seeing-like-a-software-company\">illegible</a> role in the organization. So what is the actual purpose of estimation, and how can you do it well as a software engineer?</p>\n<h3>Why estimation is impossible</h3>\n<p>Before I get into that, I should justify my core assumption a little more. People <a href=\"https://world.hey.com/dhh/software-estimates-have-never-worked-and-never-will-a41a9c71\">have</a> <a href=\"https://news.ycombinator.com/item?id=18487253\">written</a> <a href=\"https://medium.com/@riaanfnel/the-problem-with-estimates-f3d5cddd5e62\">a lot</a> about this already, so I’ll keep it brief.</p>\n<p>I’m also going to concede that <strong>sometimes you can accurately estimate software work</strong>, when that work is very well-understood and very small in scope. For instance, if I know it takes half an hour to deploy a service<sup id=\"fnref-1\"><a class=\"footnote-ref\" href=\"https://www.seangoedecke.com/rss.xml#fn-1\">1</a></sup>, and I’m being asked to update the text in a link, I can accurately estimate the work at something like 45 minutes: five minutes to push the change up, ten minutes to wait for CI, thirty minutes to deploy.</p>\n<p>For most of us, the majority of software work is not like this. We work on poorly-understood systems and cannot predict exactly what must be done in advance. Most programming in large systems is <em>research</em>: identifying prior art, mapping out enough of the system to understand the effects of changes, and so on. Even for fairly small changes, we simply do not know what’s involved in making the change until we go and look.</p>\n<p>The pro-estimation dogma says that these questions ought to be answered during the planning process, so that each individual piece of work being discussed is scoped small enough to be accurately estimated. I’m not impressed by this answer. It seems to me to be a throwback to the bad old days of <a href=\"https://en.wikipedia.org/wiki/Software_architect\">software architecture</a>, where one architect would map everything out in advance, so that individual programmers simply had to mechanically follow instructions. Nobody does that now, because it doesn’t work: programmers must be empowered to make architectural decisions, because they’re the ones who are actually in contact with the code<sup id=\"fnref-2\"><a class=\"footnote-ref\" href=\"https://www.seangoedecke.com/rss.xml#fn-2\">2</a></sup>. Even if it did work, that would simply shift the impossible-to-estimate part of the process backwards, into the planning meeting (where of course you can’t write or run code, which makes it near-impossible to accurately answer the kind of questions involved).</p>\n<p>In short: software engineering projects are not dominated by the known work, but by the unknown work, which always takes 90% of the time. However, only the known work can be accurately estimated. It’s therefore impossible to accurately estimate software projects in advance.</p>\n<h3>Estimates do not come from engineers</h3>\n<p>Estimates do not help engineering teams deliver work more efficiently. Many of the most productive years of my career were spent on teams that did no estimation at all: we were either working on projects that had to be done no matter what, and so didn’t really need an estimate, or on projects that would deliver a constant drip of value as we went, so we could just keep going indefinitely<sup id=\"fnref-3\"><a class=\"footnote-ref\" href=\"https://www.seangoedecke.com/rss.xml#fn-3\">3</a></sup>.</p>\n<p>In a very real sense, <strong>estimates aren’t even made by engineers at all</strong>. If an engineering team comes up with a long estimate for a project that some VP really wants, they will be pressured into lowering it (or some other, more compliant engineering team will be handed the work). If the estimate on an undesirable project - or a project that’s intended to “hold space” for future unplanned work - is too short, the team will often be encouraged to increase it, or their manager will just add a 30% buffer.</p>\n<p>One exception to this is projects that are technically impossible, or just genuinely prohibitively difficult. If a manager consistently fails to pressure their teams into giving the “right” estimates, that can send a signal up that maybe the work can’t be done after all. Smart VPs and directors will try to avoid taking on technically impossible projects.</p>\n<p>Another exception to this is areas of the organization that senior leadership doesn’t really care about. In a sleepy backwater, often the formal estimation process does actually get followed to the letter, because there’s no director or VP who wants to jump in and shape the estimates to their ends. This is one way that some parts of a tech company can have drastically different engineering cultures to other parts. I’ll let you imagine the consequences when the company is re-orged and these teams are pulled into the spotlight.</p>\n<p><strong>Estimates are political tools for non-engineers in the organization</strong>. They help managers, VPs, directors, and C-staff decide on which projects get funded and which projects get cancelled. </p>\n<h3>Estimates define the work, not the other way around</h3>\n<p>The standard way of thinking about estimates is that you start with a proposed piece of software work, and you then go and figure out how long it will take. <strong>This is entirely backwards.</strong> Instead, teams will often start with the estimate, and then go and figure out what kind of software work they can do to meet it.</p>\n<p>Suppose you’re working on a LLM chatbot, and your director wants to implement “talk with a PDF”. If you have six months to do the work, you might implement a robust file upload system, some pipeline to chunk and embed the PDF content for semantic search, a way to extract PDF pages as image content to capture formatting and diagrams, and so on. If you have one day to do the work, you will naturally search for simpler approaches: for instance, converting the PDF to text client-side and sticking the entire thing in the LLM context, or offering a plain-text “grep the PDF” tool.</p>\n<p>This is true at even at the level of individual lines of code. When you have weeks or months until your deadline, you might spend a lot of time thinking airily about how you could refactor the codebase to make your new feature fit in as elegantly as possible. When you have hours, you will typically be laser-focused on finding an approach that will actually work. There are always many different ways to solve software problems. Engineers thus have quite a lot of discretion about how to get it done.</p>\n<h3>How I estimate work</h3>\n<p>So how do I estimate, given all that?</p>\n<p><strong>I gather as much political context as possible before I even look at the code</strong>. How much pressure is on this project? Is it a casual ask, or do we <em>have</em> to find a way to do this? What kind of estimate is my management chain looking for? There’s a huge difference between “the CTO <em>really</em> wants this in one week” and “we were looking for work for your team and this seemed like it could fit”.</p>\n<p>Ideally, I go to the code <strong>with an estimate already in hand</strong>. Instead of asking myself “how long would it take to do this”, where “this” could be any one of a hundred different software designs, I ask myself “which approaches could be done in one week?“.</p>\n<p><strong>I spend more time worrying about unknowns than knowns</strong>. As I said above, unknown work always dominates software projects. The more “dark forests” in the codebase this feature has to touch, the higher my estimate will be - or, more concretely, the tighter I need to constrain the set of approaches to the known work.</p>\n<p>Finally, <strong>I go back to my manager with a risk assessment, not with a concrete estimate</strong>. I don’t ever say “this is a four-week project”. I say something like “I don’t think we’ll get this done in one week, because X Y Z would need to all go right, and at least one of those things is bound to take a lot more work than we expect. Ideally, I go back to my manager with a <em>series</em> of plans, not just one:</p>\n<ul>\n<li>We tackle X Y Z directly, which <em>might</em> all go smoothly but if it blows out we’ll be here for a month</li>\n<li>We bypass Y and Z entirely, which would introduce these other risks but possibly allow us to hit the deadline</li>\n<li>We bring in help from another team who’s more familiar with X and Y, so we just have to focus on Z</li>\n</ul>\n<p>In other words, I don’t “break down the work to determine how long it will take”. My management chain already knows how long they want it to take. <strong>My job is to figure out the set of software approaches that match that estimate.</strong></p>\n<p>Sometimes that set is empty: the project is just impossible, no matter how you slice it. In that case, my management chain needs to get together and figure out some way to alter the requirements. But if I always said “this is impossible”, my managers would find someone else to do their estimates. When I do that, I’m drawing on a well of trust that I build up by making pragmatic estimates the rest of the time.</p>\n<h3>Addressing some objections</h3>\n<p>Many engineers find this approach distasteful. One reason is that they don’t like estimating in conditions of uncertainty, so they insist on having all the unknown questions answered in advance. I have written a lot about this in <a href=\"https://www.seangoedecke.com/taking-a-position\"><em>Engineers who won’t commit</em></a> and <a href=\"https://www.seangoedecke.com/clarity\"><em>How I provide technical clarity to non-technical leaders</em></a>, but suffice to say that I think it’s cowardly. If you refuse to estimate, you’re forcing someone less technical to estimate for you.</p>\n<p>Some engineers think that their job is to constantly push back against engineering management, and that helping their manager find technical compromises is betraying some kind of sacred engineering trust. I wrote about this in <a href=\"https://www.seangoedecke.com/a-little-bit-cynical\"><em>Software engineers should be a little bit cynical</em></a>. If you want to spend your career doing that, that’s fine, but I personally find it more rewarding to find ways to work with my managers (who have almost exclusively been nice people).</p>\n<p>Other engineers might say that they rarely feel this kind of pressure from their directors or VPs to alter estimates, and that this is really just the sign of a dysfunctional engineering organization. Maybe! I can only speak for the engineering organizations I’ve worked in. But my suspicion is that these engineers are really just saying that they work “out of the spotlight”, where there’s not much pressure in general and teams can adopt whatever processes they want. There’s nothing wrong with that. But I don’t think it qualifies you to give helpful advice to engineers who do feel this kind of pressure.</p>\n<h3>Summary</h3>\n<p>I think software engineering estimation is generally misunderstood.</p>\n<p>The common view is that a manager proposes some technical project, the team gets together to figure out how long it would take to build, and then the manager makes staffing and planning decisions with that information. In fact, it’s the reverse: a manager comes to the team with an estimate already in hand (though they might not come out and admit it), and then the team must figure out what kind of technical project might be possible within that estimate.</p>\n<p>This is because estimates are not by or for engineering teams. They are tools used for managers to negotiate with each other about planned work. Very occasionally, when a project is literally impossible, the estimate can serve as a way for the team to communicate that fact upwards. But that requires trust. A team that is always pushing back on estimates will not be believed when they do encounter a genuinely impossible proposal.</p>\n<p>When I estimate, I extract the range my manager is looking for, and only then do I go through the code and figure out what can be done in that time. I never come back with a flat “two weeks” figure. Instead, I come back with a range of possibilities, each with their own risks, and let my manager make that tradeoff.</p>\n<p><strong>It is not possible to accurately estimate software work.</strong> Software projects spend most of their time grappling with unknown problems, which by definition can’t be estimated in advance. To estimate well, you must therefore basically ignore all the known aspects of the work, and instead try and make educated guesses about how many unknowns there are, and how scary each unknown is.</p>\n<p>edit: I should thank one of my readers, Karthik, who emailed me to ask about estimates, thus revealing to me that I had many more opinions than I thought.</p>\n<p>edit: This post got a bunch of comments on <a href=\"https://news.ycombinator.com/item?id=46742389\">Hacker News</a>. Some non-engineers made the <a href=\"https://news.ycombinator.com/item?id=46744538\">point</a> that well-paid professionals should be expected to estimate their work, even if the estimate is completely fictional. Sure, I agree, as long as we’re on the same page that it’s fictional!</p>\n<p>A couple of <a href=\"https://news.ycombinator.com/item?id=46744696\">engineers</a> <a href=\"https://news.ycombinator.com/item?id=46744876\">argued</a> that estimation was a solved problem. I’m not convinced by their examples. I agree you can probably estimate “build a user flow in Svelte”, but it’s much harder to estimate “build a user flow in Svelte <em>on top of an existing large codebase</em>”. I should have been more clear in the post that I think that’s the hard part, for the normal reasons that it’s very hard to work in large codebases, which I <a href=\"https://www.seangoedecke.com/large-established-codebases\">write</a> <a href=\"https://www.seangoedecke.com/wicked-features\">about</a> <a href=\"https://www.seangoedecke.com/clarity\">endlessly</a> on this blog.</p>\n<p>edit: There are also some comments on <a href=\"https://lobste.rs/s/dspppf/how_i_estimate_work_as_staff_software\">Lobste.rs</a>, including a good <a href=\"https://lobste.rs/c/i0sxht\">note</a> that the capability of the team obviously has a huge impact on any estimates. In my experience, this is not commonly understood: companies expect estimates to be fungible between engineers or teams, when in fact some engineers and teams can deliver work ten times more quickly (and others cannot deliver work <em>at all</em>, no matter how much time they have).</p>\n<p>Another commenter <a href=\"https://news.ycombinator.com/item?id=46745726\">politely suggested</a> I read <a href=\"https://www.amazon.com.au/Software-Estimation-Demystifying-Black-Art/dp/%200735605351\"><em>Software Estimation: Demystifying the Black Art</em></a>, which I’ve never heard of. I’ll put it on my list.</p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-1\">\n<p>For anyone wincing at that time, I mean like three minutes of actual deployment and twenty-seven minutes of waiting for checks to pass or monitors to turn up green.</p>\n<a class=\"footnote-backref\" href=\"https://www.seangoedecke.com/rss.xml#fnref-1\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>I write a lot more about this in <a href=\"https://www.seangoedecke.com/you-cant-design-software-you-dont-work-on\"><em>You can’t design software you don’t work on</em></a>.</p>\n<a class=\"footnote-backref\" href=\"https://www.seangoedecke.com/rss.xml#fnref-2\">↩</a>\n</li>\n<li id=\"fn-3\">\n<p>For instance, imagine a mandate to improve the performance of some large Rails API, one piece at a time. I could happily do that kind of work forever.</p>\n<a class=\"footnote-backref\" href=\"https://www.seangoedecke.com/rss.xml#fnref-3\">↩</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://seangoedecke.com/how-i-estimate-work/",
            "publishedAt": "2026-01-24",
            "source": "Sean Goedecke",
            "summary": "<p>There’s a kind of polite fiction at the heart of the software industry. It goes something like this:</p> <blockquote> <p>Estimating how long software projects will take is very hard, but not impossible. A skilled engineering team can, with time and effort, learn how long it will take for them to deliver work, which will in turn allow their organization to make good business plans.</p> </blockquote> <p>This is, of course, false. As every experienced software engineer knows, <strong>it is not possible to accurately estimate software projects</strong>. The tension between this polite fiction and its well-understood falseness causes a lot of strange activity in tech companies.</p> <p>For instance, many engineering teams estimate work in <a href=\"https://asana.com/resources/t-shirt-sizing\">t-shirt sizes</a> instead of time, because it just feels too obviously silly to the engineers in question to give direct time estimates. Naturally, these t-shirt sizes are immediately translated into hours and days when the estimates make their way up the management chain.</p> <p>Alternatively, software engineers who are genuinely trying to give good time estimates have ridiculous <a href=\"https://news.ycombinator.com/item?id=19671824\">heuristics</a> like “double your initial estimate and add 20%“. This is basically the same as giving up and saying “just estimate everything at a month”.</p> <p>Should tech companies just",
            "title": "How I estimate work as a staff software engineer"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-24"
}