{
    "articles": [
        {
            "content": [
                "<img alt=\"One Regulation E, Two Very Different Regimes\" src=\"https://www.bitsaboutmoney.com/content/images/2026/01/ChatGPT-Image-Jan-7--2026--02_51_57-PM.png\" /><p><strong>Programming note:</strong> Happy New Year! <em>Bits about Money</em> is made possible&#x2014;and freely accessible to all&#x2014;by the generous support of professionals who find it useful. If you&#x2019;re one of them, thank you&#x2014;and consider <a href=\"https://www.bitsaboutmoney.com/memberships/\" rel=\"noreferrer\">purchasing a membership</a>.</p><hr /><p>The U.S. is often maligned as being customer-hostile compared to other comparable nations, particularly those in Europe. One striking counterexample is that the government, by regulation, outsources to the financial industry an effective, virtually comprehensive, and extremely costly consumer protection apparatus covering a huge swath of the economy. It does this by strictly regulating the usage of what were once called &#x201c;electronic&#x201d; payment methods, which you now just call &#x201c;payment&#x201d; methods, in <a href=\"https://www.consumerfinance.gov/rules-policy/regulations/1005/1/\">Regulation E</a>.</p><p>Reg E is not uniformly loved in the financial industry. In particular, there has been a concerted effort by banks to renegotiate the terms of it with respect to Zelle in particular. This is principally because Zelle has been anomalously expensive, as Reg E embeds a strong, intentionally bank-funded anti-fraud regime, but Zelle does not monetize sufficiently to pay for it.</p><p>And thus a history lesson, a primer, and an explanation of a live public policy controversy.</p><h2 id=\"these-newfangled-computers-might-steal-our-money\">These newfangled computers might steal our money</h2><p>If you were to ask your friendly neighborhood reference librarian for Electronic Fund Transfers (Regulation E), 44 Fed. Reg. 18469 (Mar. 28, 1979), you might get back <a href=\"https://archives.federalregister.gov/issue_slice/1979/3/28/18467-18483.pdf\">a document yellowed with age</a>. Congress, in its infinite wisdom, intended the <a href=\"https://www.congress.gov/bill/95th-congress/house-bill/13007\">Electronic Funds Transfer Act</a> to rein in what it saw as the downsides of automation of the finance industry, which was in full swing by this time.</p><p>Many electronic transactions might not issue <em>paper receipts</em>, and this would complicate he-said bank-said dispute resolution. So those were mandated. Customers might not realize transactions were happening when they didn&#x2019;t have to physically pull out a checkbook for each one. Therefore, institutions were required to issue periodic statements, via a trustworthy scaled distribution system, paper delivered by the United States Postal Service. And electronic access devices&#x2014;the magnetic-stripe cards, and keyfobs [0], and <em>whatever the geeks dreamed up next</em>&#x2014;might be stolen from customers. And therefore the banks were mandated to be able to take reports of mislaid access devices, and there was a strict liability transfer, where any unauthorized use of a device was explicitly and intentionally laid at the foot of the financial institution.</p><p>Some of the concerns that were top of mind for lawmakers sound even more outlandish to us, today. Financial institutions can&#x2019;t issue credit cards without receiving an &#x201c;oral or written request&#x201d; for the credit card. That sounds like &#x201c;Why would you even need to <em>clarify</em> that, let alone legislate against it?!&#x201d; unless you have the recent memory of Bank of America having the Post Office blanket a city with unsolicited credit cards then just waiting to see what happened. [1]</p><p>The staff who implemented Reg E and the industry advocates commenting on it devoted quite a bit of effort to <em>timelines</em>, informed by their impression of the cadence of life in a middle class American household and the capabilities of the Operations departments at financial institutions across the U.S.&#x2019;s wide spectrum of size and sophistication. Two business days felt like a reasonable timeline after the theft of a card to let the financial institution know. They picked sixty business days from the postmark for discovering an unauthorized transaction in your periodic statements. That felt like a fair compromise between wanting to eventually give financial institutions some level of finality while still giving customers a reasonable buffer to account for holidays, vacation schedules, the time it takes a piece of mail to travel from New York City to Hawaii, and the reality that consumers, unlike banks, do not have teams paid to open and act upon mail.</p><p>And, very importantly for the future, Congress decided that unsophisticated Americans might be conned into using these newfangled electronic devices in ways that might cost them money, and this was unacceptable. Fraudulent use of an electronic fund transfer mechanism was considered an error as grave as the financial institution simply making up transactions. It had the same remedy: the financial institution corrects <em>their bug</em> at <em>their cost</em>.</p><p><em>&#x201c;Unauthorized electronic fund transfer&#x201d; means an electronic fund transfer from a consumer&apos;s account initiated by a person other than the consumer without actual authority to initiate the transfer and from which the consumer receives no benefit.</em></p><p>Reg E provided for two caps on consumer liability for unauthorized electronic fund transfer: $50 in the case of timely notice to the financial institution, as sort of a deductible (Congress didn&#x2019;t want to encourage moral hazard), and $500 for those customers who didn&#x2019;t organize themselves sufficiently. Above those thresholds, it was the bank&#x2019;s problem.</p><p>Reg E also establishes some procedural rights: an obligation for institutions to investigate claims of unauthorized funds transfers (among other errors&#x2014;Congress was quite aware that banks frequently made math and recordkeeping mistakes), to provisionally credit customers during those investigations, strict timelines for the financial institutions, and the presumptive burden of proof.</p><p>In this privately-administered court system, the bank is the prosecutor, the defendant, and the judge simultaneously, and the default judgment is &#x201c;guilty.&#x201d; It can exonerate itself only by, at its own expense and peril, producing a written record of the evidence examined. This procedural hurdle is designed to simplify review by the United States&#x2019; <em>actual</em> legal system, regulators, and consumer advocates.</p><p><em>The institution&apos;s report of the results of its investigation shall include a written explanation of the institution&apos;s findings and shall note the consumer&apos;s right to request the documents that the institution relied on in making its determination. Upon request, the institution shall promptly provide copies of the documents.</em></p><p>Having done <a href=\"https://www.kalzumeus.com/2017/09/09/identity-theft-credit-reports/#ghostwriting\">informal consumer advocacy for people with banking and debt issues for a few years</a>, I cannot overstate the degree to which this prong of Reg E is a gift to consumer advocates. Many consumers are not impressively detail-oriented, and Reg E allows an advocate to conscript a financial institution&#x2019;s Operations department to backfill the customer&#x2019;s files about a transaction they do not have contemporaneous records of. In the case that the Operations department <em>itself</em> isn&#x2019;t organized, great, at least from my perspective. Reg E says the bank just ate the loss. And indeed, several times over the years, the prototypical grandmother in Kansas received a letter from a bank vice president of consumer lending explaining that the bank was in receipt of her Reg E complaint, had credited her checking account, and considered the matter closed. It felt like a magic spell to me at the time.</p><h2 id=\"the-contractual-liability-waterfall-in-card-payments\">The contractual liability waterfall in card payments</h2><p>Banks do not like losing money, citation hopefully unnecessary, and part of the business of banking is arranging for liability transfers. Insurance is many peoples&#x2019; paradigmatic way to understand liability transfers, but banks make minimal use of insurance in core banking services. (A bank which is robbed almost always self-insures, and the loss&#x2014;averaging <a href=\"https://popcenter.asu.edu/sites/g/files/litvpz3631/files/problems/robbery_banks/PDFs/FBI_BankRobbery_2003.pdf\">four figures</a> and trending down&#x2014;is so tiny that it isn&#x2019;t worth specifically budgeting for.)</p><p>The liability transfer which most matters to Reg E is a contractual one, from issuing banks to card processors and from card processors to card-accepting businesses. These parties&#x2019; obligations to banks and cardholders are <em>substantially broader than</em> the banks&#x2019; obligations under Reg E, but the banks use a fraction of those contracts to defray a large portion of their Reg E liability.</p><p>For example, under the various brands&#x2019; card rules, an issuer must have the capability for a customer to say that a transaction which happened over plastic (or the electronic equivalent) simply didn&#x2019;t meet their expectations. The issuer&#x2019;s customer service representative will briefly collect facts from the customer, and then initiate an automatic process to request information from a representative of the card-accepting business. On receipt of that information, or non-receipt of it, a separate customer service representative makes a decision on the case. This mechanism is called a &#x201c;chargeback&#x201d; in the industry, and some banks are notorious for favoring the high-income quite-desirable customers who hold their plastic over the e.g. restaurant that the bank has no relationship with. &#x201c;My eggs were undercooked&#x201d; is a sufficient reason to ask for a chargeback and will result in the bank restoring your money a large percentage of the time.</p><p>In the case where the complaint is &#x201c;My card was stolen and used without my knowledge&#x201d;, essentially the same waterfall activates, perhaps with the internal note made that <em>this</em> dispute is Reg E sensitive. But mechanically it will be quite similar: bank tells processor &#x201c;Customer asserts fraud&#x201d;, processor tells business, business replies with a fax, bank staff reviews fax and adjudicates.</p><p>There are on the order of 5 million criminal cases in the formal U.S. legal system every year. There are more than 100 million complaints to banks, some of them alleging a simple disagreement (undercooked eggs) and very many alleging crime (fraud). It costs banks billions of dollars to adjudicate them.</p><p>The typical physical form of an adjudication is not a weeks-long trial with multiple highly-educated representatives debating in front of a more-senior finder of fact. It is a CSR clicking a button on their web app&#x2019;s interface after 3 minutes of consideration, and then entire evidentiary record often fits in a tweet.</p><p>&#x201c;Customer ordered from online store. Customer asserts they didn&#x2019;t receive the item in six weeks. No response from store. Customer wins. Next.&#x201d;, &#x201c;Customer ordered from online store. Customer asserts they didn&#x2019;t receive item. Store provided evidence of shipping via UPS. Customer does not have a history of fraudulent chargebacks. Customer wins. Next.&#x201d;, &#x201c;Customer&#x2019;s bookkeeper asserts ignorance of software as a service provider charge. Business provided written statement from customer&#x2019;s CEO stating chargeback filed in error by new bookkeeper. Customer wins. Next.&#x201d; (I&#x2019;m still annoyed by that last one, years later, but one has to understand why it is rational for the bank and, in a software company&#x2019;s clearer-minded moments, rational for them to accept the risk of this given how lucrative software is.)</p><p>The funds flow in a chargeback mirrors the contractual liability waterfall: the issuing bank gets money back from a financial intermediary, who gets it back from a card processor (like Stripe, which I once worked for, and which doesn&#x2019;t specifically endorse things I write in my own spaces), who will attempt to get it back from the card accepting business.</p><p>That word &#x201c;attempt&#x201d; is important. What if the business doesn&#x2019;t have sufficient money to pay the aggrieved customer, or they can&#x2019;t be located anymore when the system comes to collect? Reg E has a list of exceptions and <em>those aren&#x2019;t on it</em>. The card processor then eats the loss.</p><p>The same frequently happens to cover the provisional credit mandated while the bank does its investigation, and the opposite happens in the case where the issuing bank decides that the card accepting business is in the right, and should be restored the money they charged a customer.</p><p>This high-frequency privately-funded alternative legal system has quietly ground out hundreds of millions of cases for the last half century. It is a foundation upon which commerce rests. It even exerts influence internationally, since the card brand rules essentially embed a variant of the Reg E rights for cardholders globally, and since nowhere in Reg E is there a carveout for transactions that a customer might make electronically with their U.S. financial institution while not physically located in the United States. If you are mugged and forced to withdraw money at an ATM in Caracas, Uncle Sam says your bank knows that some tiny percentage of cardholders will be mugged every year, and mandates they pay.</p><h2 id=\"enter-zelle\">Enter Zelle</h2><p>Zelle, operated by Early Warning Systems (owned by a consortium of large banks), is a substantially real-time electronic transfer method between U.S. bank accounts. Bank web and mobile apps have for decades supported peer to peer and customer to business transfers, via push ACH (and, less frequently, by wire), but ACH will, in standard practice, take a few days to be credited to the recipient and a few hours until it will become known to them as pending.</p><p>Zelle is substantially a blocking play, against Venmo, Cash App, and similar. Those apps captivated a large number of mostly-young users with the P2P payments, for use cases like e.g. splitting dinner, spotting a buddy $20, or collecting donations for a Christmas gift for the teacher from all the parents in a class. After attracting the users with those features, they kept them with product offerings which, in the limit, <em>resemble</em> bank accounts and which <em>actually had bank accounts under the hood</em> for at least some users.</p><p>And so the banks, fearing that real-time payment rails would not arrive in time (FedNow has been FedLater for a decade and RTP has relatively poor coverage), stood up Zelle, on the theory that this feature could be swiftly built into all the bank apps. Zelle launched in 2017.</p><p>Zelle processes enormous volumes. It <a href=\"https://www.prnewswire.com/news-releases/zelle-hits-new-highs-two-billion-in-transactions-and-nearly-600-billion-in-payments-in-first-half-of-2025-302556767.html\">crowed recently</a> that it did $600 billion in volume in the first half of 2025. Zelle is much larger than the upstarts like Venmo (about <a href=\"https://www.sec.gov/Archives/edgar/data/1633917/000163391725000019/pypl-20241231.htm\">$250 billion in annual volume</a>) and Cash App (<a href=\"https://www.sec.gov/Archives/edgar/data/1512673/000162828025007376/sq-20241231.htm\">about $300 billion</a> in customer inflows annually). This is not nearly in the same league as card payments (~$10 trillion annually) or ACH transfers (<a href=\"https://www.nacha.org/content/ach-network-volume-and-value-statistics\">almost $100 trillion</a> annually), but it is quite considerable.</p><p>All of it is essentially free to the transacting customers, unlike credit cards, which are <a href=\"https://www.bitsaboutmoney.com/archive/how-credit-cards-make-money/\">extremely well-monetized</a>. And there is the rub.</p><h2 id=\"zelle-is-an-enormous-fraud-target\">Zelle is an enormous fraud target</h2><p>&#x201c;Hiya, this is Susan calling from your bank. Your account has been targeted by fraudsters. I need you to initiate a Zelle payment to yourself to move it to a safe account while we conduct our investigation. Just open your mobile banking app, type the password, select Zelle from the menu, and send it to your own phone number. Thank you for your cooperation.&#x201d;</p><p>Susan is lying. Her confederates have convinced at least one financial institution in the U.S. that the customer&#x2019;s phone number is tied to a bank account which fraudsters control. That financial institution registered it with Zelle, so that when the victim sends money, the controlled account receives it substantially instantaneously. They will then attempt to immediately exfiltrate that money, sending it to another financial institution or a gift card or a crypto exchange, to make it difficult for investigators to find it faster than they can spend it. This process often repeats; professionals call this &#x201c;<a href=\"https://www.bitsaboutmoney.com/archive/money-laundering-and-aml-compliance/\">layering</a>.&#x201d;</p><p>So, some days later, when the victim calls the bank and asks what happened to the money the bank was trying to secure from fraud, what does the bank tell them?</p><p>Zelle is quick to point out that only 0.02% of transactions over it have fraud reported, and they assert this compares favorably to competing payments methods. Splendid, then do the banks want to absorb on the order of $240 million a year in losses from fraudulent use of a technology they built into their own apps which is <em>indisputably by any intellectually serious person</em> an electronic funds access device?</p><p>Frequently in the last few years, the bank has said &#x201c;Well, as Gen Z would say, that <em>sounds like a bit of a skill issue</em>.&#x201d; And Reg E? &#x201c;We never heard of it. Caveat emptor.&#x201d;</p><p>To be <em>slightly</em> more sympathetic to the banks, they&#x2019;re engaged in fine-grained decisioning on Zelle frauds, which have many mechanisms and flavor texts. They are more likely to reimburse as required in the case of account takeovers, where the criminal divines a customer&#x2019;s password, pops an email address, or steals access to a phone number, and then uses it to empty a bank account. They are far less likely to reimburse where the criminal convinces the customer to operate their access device (mobile phone) in a way against their interests. <em>Skill issue</em>.</p><p>Why do banks aggressively look for reasons to deny claims? Elementary: there is <em>no waterfall</em> for Zelle. If there is a reimbursement for the user, it has to come from the bank&#x2019;s balance sheet. (Zelle as originally shipped was incapable of reversing a transaction to claw back funds. That mechanism was <em>something of an antipriority</em> at design time, since funds subject to a clawback might be treated by receiving banks as non-settled, and the user experience banks wanted to deliver was &#x201c;instantly spendable, like on Venmo.&#x201d; Instantaneous funds availability exists in fundamental tension with security guarantees even if the finality gets relaxed, as Zelle&#x2019;s was in 2023 under regulatory pressure.)</p><p>Banks like to pretend that the dominant fraud pattern is e.g. a &#x201c;social media scam&#x201d;, where an ad on Facebook or a Tiktok video leads someone to purchase sneakers with a Zelle payment from an unscrupulous individual, who doesn&#x2019;t actually send the sneakers. This pattern matches more towards &#x201c;well, that&#x2019;s a disagreement about how your eggs were done, not a disagreement about how we operate payment rails.&#x201d; Use a card and we&#x2019;ll refund the eggs (via getting the restaurant to pay for them); don&#x2019;t and we won&#x2019;t.</p><p>So, in sum and in scaled practice at call centers, the bank wants to quickly get customers to admit their fingers were on their phone when defrauded. If so, no reimbursement.</p><p>This rationale <em>is new</em> and is against our standard practice, for decades. If you are defrauded via a <a href=\"https://www.fbi.gov/how-we-can-help-you/scams-and-safety/common-frauds-and-scams/skimming\">skimming device</a> attached to an ATM, the bank is absolutely liable, and will almost always come to the correct conclusion immediately. It would be absurdly cynical to say that you intended to transact with the skimming device and demonstrated your assent by physically dipping your card past it.</p><p>Bank recalcitrance caused the Consumer Financial Protection Bureau to <a href=\"https://www.consumerfinance.gov/about-us/newsroom/cfpb-sues-jpmorgan-chase-bank-of-america-and-wells-fargo-for-allowing-fraud-to-fester-on-zelle/\">sue a few large banks in late 2024</a>. The CFPB alleged they had a pattern and practice of not paying out claims for fraud conducted over Zelle rails. The banks will tell you the same, using slightly different wording. Chase, for example, now buries in the fine print &#x201c;Neither Chase nor Zelle&#xae; offers reimbursement for authorized payments you make using Zelle&#xae;, except for a limited reimbursement program that applies for certain imposter scams where you sent money with Zelle&#xae;. This reimbursement program is not required by law and may be modified or discontinued at any time.&#x201d;</p><p>The defensible gloss of banks&#x2019; position on &#x201c;purchase protection&#x201d; is that the purchase protection that customers pay for in credit cards which makes them whole for eggs not cooked to their liking is not available for Zelle payments. Fine.</p><p>The indefensible extension is that banks aren&#x2019;t liable for defrauded customers. That is a potential policy regime, chosen by the polity of many democratic nations. The United States is <em>not one of those nations</em>. Our citizens, through their elected representatives, made the considered choice that financial institutions would need to provide extraordinary levels of safety in electronic payments. In reliance upon that regime, the people of the United States transacted many trillions of dollars over payment rails, which was and is very lucrative for all considered.</p><p>The CFPB&#x2019;s lawsuit was dropped in early 2025, as CFPB&#x2019;s enforcement priorities were abruptly curtailed. (Readers interested in why might see <a href=\"https://www.bitsaboutmoney.com/archive/debanking-and-debunking/\">Debanking and Debunking</a> and Ctrl-F &#x201c;wants some examples made.&#x201d;) To the extent it still exists <a href=\"https://www.cbsnews.com/news/trump-administration-cutting-nearly-90-percent-consumer-financial-protection-bureau/\">after being gutted</a>, it is <a href=\"https://apnews.com/article/cfpb-russell-vought-nteu-federal-reserve-banks-965ff497e53aee8fedd37f0cd07c42e3\">fighting for its life</a>.&#xa0;</p><p>But knifing the CFPB doesn&#x2019;t repeal Reg E. In theory, any bank regulator (and many other actors besides) can hold them to account for obligations under it. One of the benefits of Reg E is that the single national standard is easiest to reason about, but in the absence of it, one can easily imagine a patchwork of state-by-state consumer protection actions and/or coalitioning between state attorneys general. I will be unmoved if banks complain that this is all so complicated and they welcome regulation but it has to be a single national standard.</p><h2 id=\"banks-may-attempt-to-extend-the-zelle-precedent\">Banks may attempt to extend the Zelle precedent</h2><p>Having for the moment renegotiated their Reg E obligations by asserting they don&#x2019;t exist, and mostly getting away with it, some banks might attempt to feel their oats a bit and assert that customers bear fraud risks more generally.</p><p>For example, in my hometown of Chicago, there has been a recent spate of <a href=\"https://www.chicagotribune.com/2025/03/07/credit-card-scam/\">tap-to-pay donation fraud</a>. The fraudster gets a processing account, in their own name or that of a confederate/dupe, to collect donations for a local charitable cause. (This is not in itself improper; the financial industry understands that the parent in charge of a church bake sale will not necessarily be able to show paperwork to that effect before the cookies go stale.) Bad actors purporting to be informal charities accost Chicagoans on the street and ask for a donation via tap-to-pay, but the actual charged donation was absurdly larger than what the donor expected to donate; $4,000 versus $10, for example. The bad actor then exits the scene quickly.&#xa0;</p><p>(A donor who discovers the fraud in the moment is then confronted with the unfortunate reality that they are outnumbered by young men who want to rob them. This ends about as well as you&#x2019;d expect. Chicago has an arrest rate far under 1% for this. A cynic might say that if you don&#x2019;t kill the victim, it&#x2019;s legal. I&#x2019;m not <em>quite</em> that cynical.)</p><p>But Reg E doesn&#x2019;t care about the safety of city streets, in Chicago or anywhere else. It assumes that payment instruments will continue to be used in an imperfect world. This case has a very clear designed outcome: customer calls bank, bank credits customer $4,000 because the customer was defrauded and therefore the &#x201c;charity&#x201d; lacked actual authority for the charge, bank pulls $4,000 from credit card processor, credit card processor attempts to pull $4,000 from the &#x201c;charity&#x201d;, card processor fails in doing so, card processor chalks it up to tuition to <a href=\"https://www.complexsystemspodcast.com/episodes/the-past-present-and-future-of-ai-with-stripe/\">improve its fraud models</a> in the future.</p><p>Except at least some banks, per the Chicago Tribune&#x2019;s reporting, have adopted specious rationales to deny these claims. Some victims surrender physical control of their device, and banks argue that that means they authorized the transaction. Some banks asserted the manufactured-out-of-their-hindquarters rationale that Reg E only triggers when there is a physical receipt. (This inverts the Act&#x2019;s responsibility graph, where <em>banks were required to provide physical hardcopy receipts</em> to avoid an <a href=\"https://www.amazon.com/Unaccountability-Machine-Dan-Davies/dp/1788169549\">accountability sink</a> swallowing customer funds.)</p><p>Banks will often come to their senses after being contacted by the Chicago Tribune or someone with social power and gravitas who knows how to cite Reg E. But it is designed to work even for less sophisticated customers who don&#x2019;t know the legislative history of the state machine. They just have to know &#x201c;Call your bank if you have a problem.&#x201d;</p><p>That <em>should work</em> and we are diminished if it doesn&#x2019;t.</p><h2 id=\"reg-e-encompasses-almost-every-technology-which-exists-and-many-which-don%E2%80%99t-yet\">Reg E encompasses almost every technology which exists and many which don&#x2019;t yet</h2><p>With a limited number of carveouts (e.g. wire transfers), Reg E is intentionally drafted to be future-proof against changes in how Americans transact. This is why, when banks argue that some new payments rail is exempt because it is &#x201c;different,&#x201d; the correct legal response is usually some variation of: <a href=\"https://suno.com/song/173bbd67-92f7-4868-930f-efeca4b373c0\">doesn&#x2019;t matter&#x2014;that&#x2019;s Reg E</a>.</p><p>Our friends in crypto generally believe that Reg E is one star in the constellation of regulations that they&#x2019;re not subject to. They created Schr&#xf6;dinger&#x2019;s financial infrastructure, which is the future of finance in the boardroom and just some geeks playing with an open source project once grandma gets defrauded. There is an unresolved tension in saying &#x201c;Traditional institutions like Visa are <a href=\"https://usa.visa.com/about-visa/newsroom/press-releases.releaseId.21951.html\">adopting stablecoins</a>&#x201d; and in the see-no-evil reimburse-no-losses attitude issuers and others in the industry take towards fraud which goes over their rails.</p><p>Reg E doesn&#x2019;t have an exception in its text for electronic funds transfers which happen over slow databases.</p><p>A hypothetical future CFPB, given the long-standing premise that fraud is not an acceptable outcome of consumer payment systems, would swiftly come to the conclusion that if it walks like a checking account, quacks like a checking account, and is marketed as an alternative to checking accounts, then it is almost certainly within Reg E scope.</p><p>Casting one&#x2019;s eyes across the fintech landscape, <em>many</em> players seem to have checking account envy. In the era of the &#x201c;financial superapp&#x201d; where everyone wants to bolt on high-frequency use cases like payments to e.g. AUM gathering machines like brokerage accounts, that is worth a quick chat with Legal before you start getting the letters from Kansan grandmas.</p><p>[0] The first &#x201c;credit cards&#x201d; were not the plastic-with-a-magstripe form factor which came to dominate but rather &#x201c;charge plates.&#x201d; They were physical tokens which pointed at a record at e.g. a department store&#x2019;s internal accounts, usually by means of an embossed account number, to be read by the Mk 0 human eyeball and, later, physically copied to a paper record <a href=\"https://www.historyofinformation.com/detail.php?id=1710\">via ink</a>. Many were metal and designed to be kept around a key ring. As Matt Levine and many others have mentioned, the crypto community has speedrun hundreds of years of financial history, and keeping your account identifier on etched metal enjoyed a short renaissance recently. Unlike the department stores&#x2019; bookkeepers, crypto enthusiasts lost many millions of dollars of customer funds by <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.deb.190581/gov.uscourts.deb.190581.14.0.pdf\">misplacing their metal</a> (see page 20 particularly).</p><p>[1] Market research in the 1950s was hard. Short version of the <a href=\"https://99percentinvisible.org/episode/the-fresno-drop/\">Fresno drop</a>: they lost money due to abuse by a small segment of users, but successfully proved that the middle class would happily use plastic to transact if they were offered it and it was generally accepted by businesses as opposed to being tied to a single store. They then scaled the 60,000 card pilot to millions within a year. Visa is the corporate descendant of that program; Mastercard that of what competitors did in response.</p>"
            ],
            "link": "https://www.bitsaboutmoney.com/archive/regulation-e/",
            "publishedAt": "2026-01-07",
            "source": "Bits About Money",
            "summary": "<img alt=\"One Regulation E, Two Very Different Regimes\" src=\"https://www.bitsaboutmoney.com/content/images/2026/01/ChatGPT-Image-Jan-7--2026--02_51_57-PM.png\" /><p><strong>Programming note:</strong> Happy New Year! <em>Bits about Money</em> is made possible&#x2014;and freely accessible to all&#x2014;by the generous support of professionals who find it useful. If you&#x2019;re one of them, thank you&#x2014;and consider <a href=\"https://www.bitsaboutmoney.com/memberships/\" rel=\"noreferrer\">purchasing a membership</a>.</p><hr /><p>The U.S. is often maligned as being customer-hostile compared to other comparable nations, particularly those in Europe. One striking counterexample is that the government, by regulation, outsources to the financial industry an effective, virtually comprehensive, and extremely costly consumer protection apparatus covering a huge swath of the economy. It does this by strictly regulating the usage of what were once called &#x201c;electronic&#x201d; payment methods, which you now just call &#x201c;payment&#x201d; methods, in <a href=\"https://www.consumerfinance.gov/rules-policy/regulations/1005/1/\">Regulation E</a>.</p><p>Reg E is not uniformly loved in the financial industry. In particular, there has been a concerted effort by banks to renegotiate the terms of it with respect to Zelle in particular. This is principally because Zelle has been anomalously expensive, as Reg E embeds a strong, intentionally bank-funded anti-fraud regime, but Zelle does not monetize sufficiently to pay for it.</p><p>And thus a history lesson, a primer, and an explanation of a live public policy controversy.</p><h2 id=\"these-newfangled-computers-might-steal-our-money\">These newfangled computers might",
            "title": "One Regulation E, Two Very Different Regimes"
        },
        {
            "content": [
                "&lt;p&gt;Recently, I&amp;#x27;ve found myself introducing more and more friends to &lt;a href=\"https://obsidian.md/\"&gt;Obsidian&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;For those unfamiliar: Obsidian can act as a nice markdown editor for taking structured notes. It&amp;#x27;s sort of like a local-first hybrid of Notion and Roam Research. Obsidian is local-first and works with markdown files on your laptop, so it has a bunch of nice properties: 1) it&amp;#x27;s always available 2) it&amp;#x27;s fast 3) it works remarkably well with Claude Code.&lt;/p&gt;\n&lt;p&gt;I&amp;#x27;ve been a daily Obsidian user since November, 2021 (I checked my daily notes), and it&amp;#x27;s gradually become my &amp;#x27;personal operating system&amp;#x27; for a lot of my own thinking and writing. In that time, I&amp;#x27;ve become more opinionated about how it should work.&lt;/p&gt;\n&lt;p&gt;This post serves as a sort of guide for how I work with it.&lt;/p&gt;\n&lt;h2&gt;The golden rule of note-taking&lt;/h2&gt;\n&lt;p&gt;I have one rule of working with Obsidian and other note-taking apps:&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;The primary goal of the tool should be eliciting thought. Nothing else matters.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;p&gt;It is easy to get caught up in the &amp;#x27;most optimal note-taking setup&amp;#x27;. Automations, tagging, etc, etc. I&amp;#x27;ve now come to believe that the only thing that matters is whether your system causes you to have better (and probably more) thoughts.&lt;/p&gt;\n&lt;p&gt;There are all sorts of corollaries that fall out of this:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#x27;t think too hard about where to put notes&lt;/strong&gt;. If you need to make a decision every time you take a note, you probably are recording fewer thoughts!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#x27;t obsess over organizing old notes.&lt;/strong&gt;  It&amp;#x27;s tempting to want to spend time &amp;#x27;tending to your note-taking garden&amp;#x27;. Maybe you want it all formatted the same way or to follow some sort of standard. But I don&amp;#x27;t think this makes much sense. 99% of the time I never re-visit my notes, and that is &lt;em&gt;fine&lt;/em&gt;. The number one goal is to elicit my thoughts. The only time I use folders now is for automations (daily/ or clippings/), where the folder structure is done for me.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Notes are for you.&lt;/strong&gt; The other benefit I like from Obsidian is that the state is all local (encrypted if you use Obsidian sync or iCloud). I originally didn&amp;#x27;t think this would matter that much, but there&amp;#x27;s something freeing about knowing your notes will not leak.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;When in doubt, respect the golden rule. It&amp;#x27;s almost always better to just start writing.&lt;/p&gt;\n&lt;h2&gt;Systems I use&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Daily note&lt;/strong&gt; - the backbone of my notes is the &amp;#x27;daily note&amp;#x27;. I leverage the &amp;#x27;daily note&amp;#x27; plugin and make sure to set a hotkey for it (Ctrl+Shift+D). I set a template for it (stored in templates/Daily.md) just to get started, which I refresh every ~6mo or so. Here&amp;#x27;s what my current template looks like.&lt;/p&gt;\n&lt;div class=\"mt-7 md:mx-0\"&gt;&lt;img src=\"https://calv.info./how-i-use-obsidian/daily-template.png\" class=\"rounded-lg border\" style=\"transform:scale(1);transform-origin:center\"/&gt;&lt;/div&gt;\n&lt;p&gt;Again, the point of this is so I don&amp;#x27;t have a blank page and I can just get started writing. I&amp;#x27;ll typically journal in the &amp;quot;What&amp;#x27;s happening?&amp;quot; section, and then add any goals I&amp;#x27;d like to finish to the goals/calendar. I have some standard links I keep to remind myself of longer term projects, but I haven&amp;#x27;t been using these a ton.&lt;/p&gt;\n&lt;p&gt;Beyond the daily note, I have a few types of long-lived notes: &lt;strong&gt;Projects&lt;/strong&gt;,  &lt;strong&gt;Nouns&lt;/strong&gt;, &lt;strong&gt;Lists&lt;/strong&gt;, and &lt;strong&gt;Docs&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Project&lt;/strong&gt; notes revolve around some sort of longer-lived project. I am pretty free-form with these (see rule #1). Rather than worry about organizing them, I&amp;#x27;ll typically just come up with a name for the project that&amp;#x27;s a single word and then add an em-dash (colons aren&amp;#x27;t allowed) to whatever. If it&amp;#x27;s some point-in-time doc, I&amp;#x27;ll typically add a month it&amp;#x27;s related to (e.g. Dec &amp;#x27;25).&lt;/p&gt;\n&lt;p&gt;Right now, I&amp;#x27;m hacking on an app called &lt;strong&gt;Tacit&lt;/strong&gt; so this is what that looks like:&lt;/p&gt;\n&lt;div class=\"mt-7 md:mx-0\"&gt;&lt;img src=\"https://calv.info./how-i-use-obsidian/project-notes.png\" class=\"rounded-lg border\" style=\"transform:scale(1);transform-origin:center\"/&gt;&lt;/div&gt;\n&lt;p&gt;I&amp;#x27;ll sometimes create a &amp;quot;Captain&amp;#x27;s Log&amp;quot; doc for running notes. Again, I&amp;#x27;m not too precious about structure here.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nouns&lt;/strong&gt; typically reference some long-lived thing that I&amp;#x27;ll come into contact with again and again: people, companies, restaurants, concepts / mental models. I tend to give these their own note and take notes directly there. I have a short meeting template which basically is just a header with the current date which I&amp;#x27;ll insert whenever I interact with that entity.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lists&lt;/strong&gt; are almost always things that I want to keep track of and pretty self explanatory: book recs, goals, etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Docs&lt;/strong&gt; are kind of the &amp;#x27;catch-all&amp;#x27; for when an idea seems worth exploring. Rather than fire up an entirely new note, my typical workflow is to add the stub to my daily note as one of my TODOs, then go in and flesh out the doc. I&amp;#x27;m not sure why, but something about seeing a stub that needs to be written causes me to want to flesh it out.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hotkeys + Slash Commands&lt;/strong&gt;. Using Obsidian well means learning the hotkeys. You don&amp;#x27;t need all of them, but I do use a handful on a very regular basis:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Daily notes&lt;/em&gt;: ctrl+shift+d, (next: ctrl+shift+n, prev: ctrl+shift-p)&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;New note&lt;/em&gt;: ctrl+n&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Formatting&lt;/em&gt;: bold (cmd+b), italic: (cmd+i)&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Open/Search&lt;/em&gt;: cmd+o&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Add/Complete TODO:&lt;/em&gt; cmd+l&lt;/li&gt;\n&lt;li&gt;Slash command: insert template, insert today&amp;#x27;s date&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;MacWhisper&lt;/strong&gt;. If I ever get stuck writing, I&amp;#x27;ve often found some use in &amp;#x27;changing modes&amp;#x27;. Transcription software has gotten good enough that I&amp;#x27;ll just start speaking and that usually allows me to go from there. I like &lt;a href=\"https://goodsnooze.gumroad.com/l/macwhisper\"&gt;MacWhisper&lt;/a&gt;, which (like Obsidian) works locally and is out of the way. I&amp;#x27;ve configured the right option key to toggle it on and off. I use NVIDIA&amp;#x27;s parakeet model which I find is both fast and accurate. I like the fact that I control where the voice appears by where my cursor is.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Theme: Flexoki&lt;/strong&gt;. For the longest time I didn&amp;#x27;t care much for themes and just used the default. I&amp;#x27;ve recently fallen in love with Steph Ango&amp;#x27;s (Obsidian creator) &lt;a href=\"https://stephango.com/flexoki\"&gt;Flexoki&lt;/a&gt; theme, so I use that. I find it feels a little more personal, which gets me to write slightly more on the margin.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Templates&lt;/strong&gt;. I use a couple of templates. There&amp;#x27;s the Daily template which is the whole note (shown above). I have a Weekplan template which I use to &lt;a href=\"/the-secret-of-the-weekplan\"&gt;plan my weeks&lt;/a&gt;. And I have a &amp;#x27;meeting&amp;#x27; template which I insert into one of the &amp;quot;noun notes&amp;quot; whenever I have a meeting.&lt;/p&gt;\n&lt;h2&gt;Stuff I use occasionally&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Web Clipper&lt;/strong&gt;. One of the officially supported ways to integrate with Obsidian is the &lt;a href=\"https://obsidian.md/clipper\"&gt;web clipper&lt;/a&gt;. Every so often, I&amp;#x27;ll find myself starting to copy/paste from some website, and then remember I can just click a button and it will create a new note in &lt;code&gt;clippings/&lt;/code&gt;. Useful for saving things like recipes or referencing specific blog/reddit posts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Claude Code&lt;/strong&gt;. Because it&amp;#x27;s all markdown, Claude Code is &lt;em&gt;very&lt;/em&gt; good at things like Semantic Search or updating parts of your vault. I&amp;#x27;ve also used it to keep track of stuff that I&amp;#x27;m doing (e.g. put this in my daily note for obsidian).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mobile app&lt;/strong&gt;. If there&amp;#x27;s one place which I have a slightly mixed bag, it&amp;#x27;s the mobile app. Don&amp;#x27;t get me wrong, Obsidian has a great mobile app which is actually really well designed. But the fact that it&amp;#x27;s local first means that it effectively downloads a bunch of markdown while you&amp;#x27;re using the app, leading to the occasional skew issues. I wish there were a better way to do voice transcription → notes on the device but everything I&amp;#x27;ve tried is sort of kludge-y due to the way that Apple has setup the ecosystem on iPhone&lt;/p&gt;\n&lt;p&gt;Then there&amp;#x27;s stuff I tried and don&amp;#x27;t really use much anymore: tagging, folder organization, complicated templates, community plugins. I am sure these are great, but I don&amp;#x27;t find them that useful. I don&amp;#x27;t use Obsidian for obsessively managing TODOs anymore. I treat each day as a new todo list, and then I keep moving.&lt;/p&gt;\n&lt;h2&gt;Interesting Outcomes&lt;/h2&gt;\n&lt;p&gt;When I first started using Obsidian, I tried to add too much structure. Now I find I just start writing about whatever is on my mind. Daily notes have gotten to the point where they&amp;#x27;ve become a habit, they are pretty much the first thing I start looking at when I start my day.&lt;/p&gt;\n&lt;p&gt;My friend Titiaan asked me if there were any downsides to using Obsidian. The main one I&amp;#x27;ve found is that I now &lt;em&gt;need&lt;/em&gt; to write in order to think. It&amp;#x27;s sort of hard for me to deal with a complex decision without spending some time writing about it.&lt;/p&gt;"
            ],
            "link": "https://calv.info/how-i-use-obsidian",
            "publishedAt": "2026-01-07",
            "source": "Calvin French-Owen",
            "summary": "Obsidian has become my personal operating system for thinking and writing. Here's the golden rule I follow and the systems I use.",
            "title": "How I Use Obsidian"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>At the end of last year, AI agents really came alive for me. Partly because the models got better, but more so because we gave them the tools to take their capacity beyond pure reasoning. Now coding agents are controlling the terminal, running tests to validate their work, searching the web for documentation, and using web services <a href=\"https://platform.claude.com/docs/en/agents-and-tools/agent-skills/overview\">with skills</a> we taught them in plain English. Reality is fast catching the hype!<br /><br /></div><div>This is all very evident if you've tried to employ any of the new models — especially Claude Opus 4.5, Codex 5, Gemini 3, and even the Chinese open-weight models like MiniMax M2.1 and GLM-4.7 — in one of the modern terminal harnesses that give them access to all these autonomous powers. The code being produced by this new breed of AI is leagues ahead of where their predecessors were at the beginning of 2025.</div><div><br />I've thoroughly enjoyed putting them all to work in <a href=\"https://opencode.ai/\">OpenCode</a>, which is a terminal interface for coding agents that allows you to seamlessly switch between all of the models, capture your sessions for sharing, and simply looks astounding when theme-matched with the rest of <a href=\"https://omarchy.org\">Omarchy</a> (where we're making it a default in the next version!).<br /><br /></div><div>See, I never really cared much for the in-editor experience of having AI autocomplete your code as you were writing it. That was the original format pioneered by GitHub's Copilot and Cursor, but it left me cold. When I code, I want to finish my own thoughts and sentences. That was <a href=\"https://www.youtube.com/watch?v=vagyIcmIGOQ&amp;t=15273s\">the sentiment I expressed on the Lex Fridman podcast</a> last summer.<br /><br /></div><div>But with these autonomous agents, the experience is very different. It's more like working on a team and less like working with an overly-zealous pair programmer who can't stop stealing the keyboard to complete the code you were in the middle of writing. With a team of agents, they're doing their work autonomously, and I just review the final outcome, offer guidance when asked, and marvel at how this is possible at all.<br /><br /></div><div>Yes, I'm ready to give the current crop of AI agents a promotion. They're no longer just here to help me learn, answer my questions, or check my work. They're fully capable of producing production-grade contributions to real-life code bases.&nbsp;</div><div><br />Yet pure vibe coding remains an aspirational dream for professional work for me, for now. Supervised collaboration, though, is here today. I've worked alongside agents to fix small bugs, finish substantial features, and get several drafts on major new initiatives. The paradigm shift finally feels real.</div><div><br />Now, it all depends on what you're working on, and what your expectations are. The hype train keeps accelerating, and if you bought the pitch that we're five minutes away from putting all professional programmers out of a job, you'll be disappointed.<br /><br /></div><div>I'm nowhere close to the claims of having agents write 90%+ of the code, as I see some boast about online. I don't know what code they're writing to hit those rates, but that's way off what I'm able to achieve, if I hold the line on quality and cohesion.<br /><br /></div><div>But I'll forgive folks for getting excited! Because you don't have to connect many future dots on the current trend line to get dizzy by the prospects. The leaps of improvement that AI agents took in 2025 is simply incredible. This is the most exciting thing we've made computers do since we connected them to the internet back in the '90s. So what might things look like in 2026 or 2027? I get the exuberance.<br /><br /></div><div>I also get that some programmers are eager to tune it all out. The hype drones on relentlessly, the most fantastical claims are still far off from being substantiated, and there's real uncertainty about where all this will leave the profession in the future. But that's still not reason enough to miss out on this incredible moment in human and computing history!&nbsp;<br /><br /></div><div>You gotta get in there. See where we're at now for yourself. Download OpenCode, throw some real work at Opus or the others, and relish the privilege of being alive during the days we taught the machines how to think.</div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/promoting-ai-agents-3ee04945",
            "publishedAt": "2026-01-07",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>At the end of last year, AI agents really came alive for me. Partly because the models got better, but more so because we gave them the tools to take their capacity beyond pure reasoning. Now coding agents are controlling the terminal, running tests to validate their work, searching the web for documentation, and using web services <a href=\"https://platform.claude.com/docs/en/agents-and-tools/agent-skills/overview\">with skills</a> we taught them in plain English. Reality is fast catching the hype!<br /><br /></div><div>This is all very evident if you've tried to employ any of the new models — especially Claude Opus 4.5, Codex 5, Gemini 3, and even the Chinese open-weight models like MiniMax M2.1 and GLM-4.7 — in one of the modern terminal harnesses that give them access to all these autonomous powers. The code being produced by this new breed of AI is leagues ahead of where their predecessors were at the beginning of 2025.</div><div><br />I've thoroughly enjoyed putting them all to work in <a href=\"https://opencode.ai/\">OpenCode</a>, which is a terminal interface for coding agents that allows you to seamlessly switch between all of the models, capture your sessions for sharing, and simply looks astounding when theme-matched with the rest of <a href=\"https://omarchy.org\">Omarchy</a> (where we're making",
            "title": "Promoting AI agents"
        },
        {
            "content": [
                "<p>I opened Claude Code and gave it the command: &#8220;<em>Develop a web-based or software-based startup idea that will make me $1000 a month where you do all the work by generating the idea and implementing it. i shouldn&#8217;t have to do anything at all except run some program you give me once. it shouldn&#8217;t require any coding knowledge on my part, so make sure everything works well.</em>&#8221; The AI asked me three multiple choice questions and decided that I should be selling sets of 500 prompts for professional users for $39. Without any further input, it then worked independently&#8230; FOR AN HOUR AND FOURTEEN MINUTES creating hundreds of code files and prompts. And then it gave me a single file to run that created and deployed a working website (filled with very sketchy fake marketing claims) that sold the promised 500 prompt set. <a href=\"https://prompt-vault-phi-rust.vercel.app/\">You can actually see the site it launched here</a>, though I removed the sales link, which did actually work and would have collected money. I strongly suspect that if I ignored my conscience and actually sold these prompt packs, I would make the promised $1,000.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!dZFA!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F785aaf6e-cad6-4d9a-a0a9-d98f80051180_3656x1630.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"649\" src=\"https://substackcdn.com/image/fetch/$s_!dZFA!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F785aaf6e-cad6-4d9a-a0a9-d98f80051180_3656x1630.png\" title=\"\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">Claude Code does not have a friendly interface, but you can see how I made a single request, the AI interviewed me about it, it worked for over an hour independently, and then gave me exactly what I asked for, without any discernible errors.</figcaption></figure></div><p>This is Claude Code at work, one of a new generation of AI coding tools that represent a sudden capability leap in AI in the past month or so. What makes these new tools suddenly powerful is not one breakthrough, but a combination of two advances. First, the latest AIs are capable of doing far <a href=\"https://www.oneusefulthing.org/p/real-ai-agents-and-real-work\">more work autonomously while self-correcting many of their errors</a>, especially in programming tasks. Second, the AIs are being given an &#8220;agentic harness&#8221; of tools and approaches that they can use to solve problems in new ways. The result of these two factors has led to big leaps in the latest AI tools made by the big AI companies.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!0j_e!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F02d1461a-52fa-4d22-ae62-e367c728a147_1394x676.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"323.93687230989957\" src=\"https://substackcdn.com/image/fetch/$s_!0j_e!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F02d1461a-52fa-4d22-ae62-e367c728a147_1394x676.png\" width=\"668\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\"><a href=\"https://metr.org/blog/2025-03-19-measuring-ai-ability-to-complete-long-tasks/\">METR tracks the length of tasks</a> (measured by how long they take human professionals) that AI can complete autonomously with 50% reliability. It has been increasing exponentially over time, with large leaps in the past few months. This is just one measure of AI ability, but it does correlate with most other measures as well.</figcaption></figure></div><p>Unfortunately for most of us who want to experiment with AI, these new tools are built for programmers. And I mean they are <em>really</em> built for programmers: they assume that you understand Python commands and programming best practices and they are wrapped in interfaces that look like something from a 1980s computer lab. They are also explicitly designed to help analyze, troubleshoot, and write code using approaches that fit into existing programmer workflows. In a lot of ways, this is a shame, because these systems are actually broadly useful to knowledge workers of all types, and, by seeing what they can do (and experimenting with them yourself), I think you can learn a lot about the future of AI. In this post, we are going to focus on one in particular, Claude Code powered by Opus 4.5, but it works similarly to its main competition OpenAI&#8217;s Codex with GPT-5.2 and <a href=\"https://www.oneusefulthing.org/p/three-years-from-gpt-3-to-gemini\">Google&#8217;s Antigravity</a> with Gemini 3. </p><p>To return to the example of the startup company launched by Claude Code, as practically impressive as this was, it was only touching a small part of the capabilities of what the tool is capable of. In that case, I only used Claude Code for coding, but if I ask it to <em>do user testing of the live site from different personas and give me a report</em>, it deploys one of its many tools, its connection to the web browser on my computer. Claude takes control of the browser and goes to the site it created, scrolling through it like a human would. On the first pass, it gave me a pretty optimistic report, but, because I know that AIs tend to be <a href=\"https://www.oneusefulthing.org/p/personality-and-persuasion\">sycophantic</a>, I also asked it for a more critical one. This second report did a better job nailing potential issues (and spotting the sketchy fake reviews that were on the site). As a next step, I could easily ask it to implement its suggestions, continuing the process with minimal input from me.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!TSk_!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbb837ea7-bbb0-47a8-9bc0-c1254d75186a_2854x1059.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"540\" src=\"https://substackcdn.com/image/fetch/$s_!TSk_!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbb837ea7-bbb0-47a8-9bc0-c1254d75186a_2854x1059.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><h1>The Magic Tricks</h1><p>A big reason Claude Code is so good is that it uses a wide variety of tricks in its agentic harness that allow its very smart AI, Opus 4.5, to overcome many of the problems of LLMs. For example, an interesting thing happened while the AI was doing its user research: its context window filled up. As you might know, AIs can only &#8220;remember&#8221; so much information at a time. This context window is often quite long by human standards (150,000 words or more) but it gets filled up remarkably quickly because it contains your entire conversation, every document the AI reads, every image it takes, and the initial system prompts that help guide the AI. There is no real long-term memory for AI, so as soon as the context window fills up, the AI cannot remember anything else. If you are just having a casual chat, this isn&#8217;t really a problem. Any long conversation with ChatGPT features a rolling context window, the AI is constantly forgetting the oldest part of its conversation, but it is generally able to keep up by improvising based on the most recent parts of the discussion. If you are doing real work, however, having the AI forget some of your code as it reads new code becomes a big problem.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!EmO6!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff149ac28-b459-46a0-bb5b-44a2f38887b7_1546x398.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"375\" src=\"https://substackcdn.com/image/fetch/$s_!EmO6!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff149ac28-b459-46a0-bb5b-44a2f38887b7_1546x398.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">Compacting at work.</figcaption></figure></div><p>Claude Code handles this issue in a different way. When it runs out of context, it stops and &#8220;<strong>compacts</strong>&#8221; the conversation so far, taking notes about exactly where it was when it stopped. Then it clears its context window, and the fresh version of Claude Code reads the notes and reviews the progress to date - think of the amnesiac main character from the movie <em>Memento</em> looking at his tattoos for reference whenever he wakes up with no memory. These notes give Claude everything it needs to keep moving. This is why Claude can run for hours at a time, it carefully notes what it is doing along the way, and produces interim work, like pieces of software and reports, that it can refer to.</p><p>This is not the only trick Claude Code uses to get around the limitations of AI. Another is its use of <strong>Skills</strong>. As everyone reading this post knows, users have to prompt AIs to do things. These prompts act as instructions, and, as AIs have gotten smarter, they have become much better at executing complex prompts, even hundred page long prompts. These long prompts take up a lot of the context window, however, and require a giving the AI the right prompt at the right time. That either means that you, as a human, have to keep prompting the AI or you have to design a complex automated system that keeps feeding the AI prompts.</p><p>Skills solve this problem. They are instructions that the AI decides when to use, and they contain not just prompts, but also the sets of tools the AI needs to accomplish a task. Does it need to know how to build a great website? It loads up the Website Creator Skill which explains how to build a website and the tools to use when doing it. Does it need to build an Excel spreadsheet? It loads the Excel skill with its own instructions and tools. To make another movie reference, it is like when Neo in the <em>Matrix</em> gets martial arts instructions uploaded to his head and acquires a new skill: &#8220;I know kung fu.&#8221; Skills can let an AI cover an entire process by swapping out knowledge as needed. For example, Jesse Vincent released an <a href=\"https://github.com/obra/superpowers?tab=readme-ov-file\">interesting free list of skills</a> that let Claude Code handle a full software development process, picking up skills as needed, starting with brainstorming and planning before progressing all the way to testing code. Skill creation is technically very easy, it is done in plain language, and the AI can actually help you create them (more on this in a bit).</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!aEQg!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7d9db565-9016-49aa-a8df-43de302d2b2d_1092x1425.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"328.84615384615387\" src=\"https://substackcdn.com/image/fetch/$s_!aEQg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7d9db565-9016-49aa-a8df-43de302d2b2d_1092x1425.png\" width=\"252\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">An example of the text of a skill, in this case the Design Skill released by Anthropic. Notice how it is written in plain language and trusts the AI to make decisions.</figcaption></figure></div><p>Along with Skills, Claude Code has other tricks up its sleeve to manage its limited context window and solve hard problems. It can also create <strong>subagents</strong> - effectively launching other, specialized AIs to solve specific problems. This can be useful in many ways. Because Opus is a large, expensive model, it can hand off easier tasks to cheaper and faster models. It also allows Claude to run many different processes at once, making it work like a team, rather than an individual. And these models can be very specialized with their own context windows. For example, I built separate subagents for research and for image creation. The main AI model &#8220;hires&#8221; these agents when needed to do specialized work. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!holD!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F054ffc23-597e-4f95-80cc-9ef04ff37529_1464x702.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"278.52884615384613\" src=\"https://substackcdn.com/image/fetch/$s_!holD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F054ffc23-597e-4f95-80cc-9ef04ff37529_1464x702.png\" width=\"581\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>And you don&#8217;t even need to create your own tools. Anyone can share Skills or subagents, and companies who want AI agents to work with their products can use an approach called the <strong><a href=\"https://modelcontextprotocol.io/introduction\">Model Context Protocol</a></strong><a href=\"https://modelcontextprotocol.io/introduction\"> (MCP)</a> to give any AI instructions and access. There are MCPs from publishers that let AI access scientific papers for research, MCPs from payment companies that give the AI the ability to analyze financial data, MCPs from software providers that let AI use a particular software product, and so on.  The result is a very flexible system where a smart generalist AI like Claude Opus 4.5 can apply specialized skills on the fly, use tools as needed, and keep track of what it is doing.</p><p>Claude Code is particularly powerful because it works on your computer and your files. So now you have an AI that can do almost anything a human with a access to your machine can do. It can read all your files and create new ones (PowerPoint and Word are just code, in the end, and Claude knows how to write code), access the web using your browser, write and execute programs for you, and more. Of course, AIs are not flawless and giving an AI access to your browser and computer creates all sorts of new risks and dangers. The AI might delete files it shouldn't, execute code with unintended consequences, or access sensitive data in your browser. Despite these warnings, I am going to give you a very quick intro to Claude Code, but make backups, use a dedicated folder, and don't give it access to anything you can't afford to lose.</p><h1>An Amateur&#8217;s Guide to Claude Code</h1><p>Though I have been using the<a href=\"https://claude.com/product/claude-code?utm_source=google&amp;utm_medium=paid_search_coder&amp;utm_campaign=acq_code_us_q3&amp;utm_content=getstarted_text_v1&amp;utm_term=nonbrand_claude%20code&amp;gclsrc=aw.ds&amp;gad_source=1&amp;gad_campaignid=23253558478&amp;gbraid=0AAAAA99jmqtxN6VikarSeDQz8QpVha3Ch&amp;gclid=Cj0KCQiApfjKBhC0ARIsAMiR_IvpMt1MEuv76RkrZaj27ywu9ZYAtCDoevpkKzKeGX14xov-u5JjgTIaAuVDEALw_wcB\"> Command Line Interface</a> for Claude Code in the screenshots so far, there is an easier way (as of yesterday!) to access Claude Code. You can do this with Claude Desktop, which you can <a href=\"https://claude.com/download\">download and install here</a> (using it for any length of time requires at least a $20 monthly subscription). Right now, the Desktop version has a few less features than the Command Line Interface, but it is much easier for amateurs to use.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!Jtg4!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7578e764-9932-45d5-8d11-d36eb7a7a1fc_1379x918.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"384.7744742567078\" src=\"https://substackcdn.com/image/fetch/$s_!Jtg4!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7578e764-9932-45d5-8d11-d36eb7a7a1fc_1379x918.png\" width=\"578\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p>Now just give the AI access to a folder (remember that Claude can do anything to the files in that folder, so be careful if it is sensitive and make a backup) and you can start working with the AI: have it research and write reports, give it access to your credit card records so it can put them into a spreadsheet and tell you about any anomalies, ask it to <a href=\"https://x.com/mattyglesias/status/2007944461930877172\">do a data visualization</a>, or whatever else you like.  The most powerful options I mentioned earlier are accessed through slash commands that start with a &#8220;/&#8221; &#8212; typing /agents lets you set up subagents, /skills lets you create or download skills, and so on (the desktop version has limited slash commands, but the full set is coming). There are <a href=\"https://simonwillison.net/2025/Oct/16/claude-skills/#claude-as-a-general-agent\">many</a> <a href=\"https://every.to/source-code/how-to-use-claude-code-for-everyday-tasks-no-programming-required\">ways </a><a href=\"https://x.com/skirano/status/2007540021536993712\">people </a>are using Claude Code, so you can experiment to figure out what works for you, but I would also suggest using it to actually code, even if you aren&#8217;t a coder.</p><p>For example, while I was writing this piece, I would occasionally go to a Claude Code window where I had the AI building a game for me for fun: a simulation of history where civilizations rise and fall, developing their own languages, cultures, and economies. Every few minutes, I would give the AI another seemingly impossible request: make sure the world has its own plate tectonics and weather; keep track of the family trees of rulers; build in an AI that dramatically summarizes events and so on. After each change, the AI would playtest the results and produce a new version of the game. Unlike previous vibe coding experiences, the AI never got stuck or went in circles, it all went smoothly. Take a look at the video below. It is, I am sure, filled with issues that a competent coder would catch, but you can<a href=\"https://emollick.itch.io/world-simulator\"> download the results here</a> (the AI handled that part, too).</p><div class=\"native-video-embed\"></div><p>What does all this mean? If you're a programmer, you should already be exploring these tools. If you're programming-adjacent (an academic who works with data, a designer who wants to experiment with code, anyone who wants to try building a thing they are imagining) this is your moment to experiment. But there's a deeper point here: with the right harness, today's AIs are capable of real, sustained work that actually matters, and that, in turn, is starting to change how we approach tasks.</p><p>It is starting, unsurprisingly, with programming. One of the more famous coders in the AI world, Andrej Karpathy, <a href=\"https://x.com/karpathy/status/2004607146781278521\">recently posted</a>: &#8220;I've never felt this much behind as a programmer. The profession is being dramatically refactored as the bits contributed by the programmer are increasingly sparse and between. I have a sense that I could be 10X more powerful if I just properly string together what has become available over the last ~year and a failure to claim the boost feels decidedly like skill issue.&#8221;  Don&#8217;t let the awkwardness of the current Claude Code or its specialization for coding fool you. New harnesses that make AI work for other knowledge tasks are coming in the near future, and so are the changes that they will bring.</p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/subscribe\"><span>Subscribe now</span></a></p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://www.oneusefulthing.org/p/claude-code-and-what-comes-next?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share\"><span>Share</span></a></p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!ek1Q!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb4826ad4-f6bc-4b3f-bb8b-8f4f1ec1fa1e_2624x1632.jpeg\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"312.3708791208791\" src=\"https://substackcdn.com/image/fetch/$s_!ek1Q!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb4826ad4-f6bc-4b3f-bb8b-8f4f1ec1fa1e_2624x1632.jpeg\" width=\"502\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a></figure></div><p></p>"
            ],
            "link": "https://www.oneusefulthing.org/p/claude-code-and-what-comes-next",
            "publishedAt": "2026-01-07",
            "source": "Ethan Mollick",
            "summary": "<p>I opened Claude Code and gave it the command: &#8220;<em>Develop a web-based or software-based startup idea that will make me $1000 a month where you do all the work by generating the idea and implementing it. i shouldn&#8217;t have to do anything at all except run some program you give me once. it shouldn&#8217;t require any coding knowledge on my part, so make sure everything works well.</em>&#8221; The AI asked me three multiple choice questions and decided that I should be selling sets of 500 prompts for professional users for $39. Without any further input, it then worked independently&#8230; FOR AN HOUR AND FOURTEEN MINUTES creating hundreds of code files and prompts. And then it gave me a single file to run that created and deployed a working website (filled with very sketchy fake marketing claims) that sold the promised 500 prompt set. <a href=\"https://prompt-vault-phi-rust.vercel.app/\">You can actually see the site it launched here</a>, though I removed the sales link, which did actually work and would have collected money. I strongly suspect that if I ignored my conscience and actually sold these prompt packs, I would make the promised $1,000.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!dZFA!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F785aaf6e-cad6-4d9a-a0a9-d98f80051180_3656x1630.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\"",
            "title": "Claude Code and What Comes Next"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2026/01/07/podcasts/tell-us-whats-the-most-romantic-thing-youve-ever-seen.html",
            "publishedAt": "2026-01-07",
            "source": "Modern Love - NYT",
            "summary": "We may include your story in an episode of the “Modern Love” podcast.",
            "title": "“Modern Love”: Send Us Your Romantic Stories"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2026/01/07/style/tiny-modern-love-stories-either-a-good-omen-or-a-nightmare.html",
            "publishedAt": "2026-01-07",
            "source": "Modern Love - NYT",
            "summary": "Modern Love in miniature, featuring reader-submitted stories of no more than 100 words.",
            "title": "Tiny Love Stories: ‘Either a Good Omen or a Nightmare’"
        },
        {
            "content": [
                "<h4 class=\"wp-block-heading\">Going Full San Francisco</h4>\n\n\n<p>Waymo goes Full San Francisco West Bay except for SFO:</p>\n<blockquote><p>Jeff Dean: Exciting expansion! @Waymo now serves the whole SF Bay Area Peninsula from SF to San Jose and is taking riders on freeways.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!nEpt!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6599e461-bfae-47fc-a6e6-3bdb0a618d3e_595x768.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>They can serve SJC, <a href=\"https://x.com/Waymo/status/1998482783585366492\">and SFO is almost ready</a>, employee rides are in place and public rides are ‘coming soon.’</p>\n<blockquote><p>Brandan: Would be nice if @Waymo comes across the bay to Berkeley!</p>\n<p>Jeff Dean: We’ll cross that bridge when we come to it!</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Going Down The Highway</h4>\n\n\n<p><a href=\"https://www.understandingai.org/p/waymo-is-finally-ready-for-freeway\">Waymo is going to start using freeways in Phoenix, Los Angeles and San Francisco</a>. That’s a big deal for longer rides, but there is still the problem that Waymos have to obey the technical speed limit. On freeways <a href=\"https://x.com/chrisalbon/status/1990170676909777040\">no huamn driver does this, so obeying the technical speed limit is both slower and more dangerous</a>. We are going to need a regulatory solution, ideally that allows you to drive at the average observed speed.</p>\n<div>\n\n\n<span id=\"more-25011\"></span>\n\n\n</div>\n\n\n<h4 class=\"wp-block-heading\">Looking For Adventure</h4>\n\n\n<p><a href=\"https://avmarketstrategist.substack.com/p/einrides-18b-spac-waymos-freeway\">This is all a big unlock</a>, but it depends on having enough cars to take advantage.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Oqv1!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F721324af-f321-4419-9671-4ec2a5deb707_1054x686.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>At this point, aside from regulatory barriers in some places like my beloved New York City, <a href=\"https://x.com/binarybits/status/1992040986747269341\">it all comes down to being able to get enough cars</a>.</p>\n<blockquote><p>Timothy Lee: The big question about Waymo in 2026 is going to be “how do they get enough cars to service all this new territory?” Three options:</p>\n<p>• Keep retrofitting expensive and no-longer-produced I-PACES</p>\n<p>• Pay 105% tariffs to import Zeekrs</p>\n<p>• Speed-run introduction of Hyundai vehicles</p>\n<p>The Hyundai option would obviously be the best for them but I doubt they’ll achieve large-scale production before 2027. They only announced the partnership a year ago and just started testing them publicly a couple of weeks ago.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">And Whatever Comes Our Way</h4>\n\n\n<p><a href=\"https://x.com/ethanteicher/status/1981405273773535338\">Waymo will be ready for Washington DC</a> in 2026 if legally allowed to proceed, if blocked there will be <a href=\"https://x.com/rachelweinerwp/status/1996241651476332673\">a Waymo Gap where Baltimore has it but not Washington</a>. <a href=\"https://x.com/deanwball/status/1992297964753092650\">Dean Ball notes that</a> councilmember Charles Allen is trying to hold Waymo up over nebulous ‘safety concerns,’ which is the worst possible argument against Waymo. We know for certain that Waymos are vastly safer than human drivers.</p>\n<blockquote><p><a href=\"https://x.com/hamandcheese/status/1992312613460717956\">Samuel Hammond</a>: I lost a good friend to a human driver in DC. The sooner we allow Waymos in the better.</p>\n<p>… Public transit should be autonomous too.</p></blockquote>\n<p>One could say this is cherry picking, but the number of (truthful) such tweets about losing a friend to a Waymo is zero, because it has never happened.</p>\n<p><a href=\"https://www.bloomberg.com/news/articles/2025-10-16/driverless-waymos-set-to-deliver-doordash-orders-in-phoenix?taid=68f0eeb076f6a10001748d22&amp;utm_campaign=trueanthem&amp;utm_content=business&amp;utm_medium=social&amp;utm_source=twitter\">Waymo set to deliver DoorDash orders in Phoenix</a>. That presumably means you’ll have to go out to get the food out of the car, which is slightly annoying but seems fine. My actual concern is whether this will be a little slow? Waymos do not understand that when you have hot food, time is of the essence.</p>\n<p><a href=\"https://www.understandingai.org/p/waymos-next-five-cities-are-all-in\">The cars, they are coming to a City Near You pending regulatory barriers</a>.</p>\n<blockquote><p>Timothy Lee and Kai Williams: On Tuesday, Waymo <a href=\"https://waymo.com/blog/2025/11/safe-routine-ready-autonomous-driving-in-new-cities\">announced</a> driverless testing in five cities: Dallas, Houston, San Antonio, Miami, and Orlando. Driverless testing begins immediately in Miami, while the other four cities will begin “over the coming weeks.” Waymo says commercial service will launch in all five cities in 2026.</p>\n<p>… And probably several other cities as well. Waymo has previously announced 2026 launch plans in six other US cities — Denver, Detroit, Las Vegas, Nashville, San Diego, and Washington DC — plus London. None of these cities has begun driverless testing yet. But if all goes according to plan, Waymo will be offering service in at least 17 cities by the end of next year — more than triple the number Waymo serves today.</p>\n<p><a href=\"https://x.com/binarybits/status/1991555804886102195\">Timothy Lee:</a> Waymo just announced plans to expand to Minneapolis, Tampa, and New Orleans. Here’s an updated map. Waymo didn’t mention 2026 so I put them in the “2027 or later” category. Minneapolis will likely require state legislation so it gets a question mark.</p>\n<p><a href=\"https://x.com/binarybits/status/1996258028375417281\">Timothy Lee</a> (December 3): Waymo just announced testing (with safety drivers) in three new cities: Pittsburgh, St. Louis, and Baltimore. Legislation will be needed to enable driverless operation in both Baltimore and St. Louis (our first red-state question mark!).</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"Image\" src=\"https://substackcdn.com/image/fetch/$s_!B_y0!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe6939b3-f8c4-49cc-bf7c-42ea6667013c_1754x1302.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">It’s Coming</h4>\n\n\n<p>This is not an expanded service area yet, but look at where Waymo is now officially authorized:</p>\n<blockquote><p>Waymo: We’re officially authorized to drive fully autonomously across more of the Golden State.</p>\n<p>Next stop: welcoming riders in San Diego in mid-2026! <img alt=\"☀\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/2600.png\" style=\"height: 1em;\" /></p></blockquote>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!0ihv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F89dd379e-8651-4f10-84d0-f765f38b826e_674x386.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n\n\n<h4 class=\"wp-block-heading\">Who Stands In The Way</h4>\n\n\n<p>It is the state that matters, not the city. That helps.</p>\n<blockquote><p><a href=\"https://x.com/binarybits/status/1991140330846978443\">Timothy Lee</a>: A nuance people are missing here: some of these red-state cities have Democratic mayors. However, AV policy is mostly made at the state level, especially in red states. So city leaders likely couldn’t block Waymo even if they wanted to. That’s certainly the case in California.</p></blockquote>\n<p>Could we do preemption on state laws about self-driving cars? Please?</p>\n<blockquote><p><a href=\"https://x.com/peterwildeford/status/2000681328073756829\">Peter Wildeford</a>: I wish that even half the energy of “federal pre-emption of all state AI laws” went specifically towards “federal pre-emption of municipal laws banning autonomous vehicles”.</p>\n<p>We need to make sure our Waymo future isn’t banned by crazy cities that have no clue what they’re doing.</p>\n<p>Neil Chilson: You may know me as a supporter of preemption, but while I think banning autonomous vehicles is absolutely moronic, I think it’s not squarely in the federal domain.</p></blockquote>\n<p>The states preempting the cities was key to getting deployment in California and Texas, but we still have a long way to go.</p>\n<p>I actually disagree with Neil, I think this should be in the federal domain.</p>\n<p>Then there’s the final boss enemies of all that is good and true, those who would permanently cripple our economy so that people could have permanent entirely fake jobs sitting in trucks:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!rOTD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcf7825ac-299e-4660-90b6-1403ba36d0f0_1031x437.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/SenFettermanPA/status/2001030549368897873\">Senator John Fetterman</a> (D-Penn): I fully agree with @Teamsters.</p>\n<p>Self-driving trucks should *always* be supervised by a qualified professional to keep our roads safe. It’s a necessary partnership for America’s highways and economy.</p></blockquote>\n<p>Across the pond, could there be <a href=\"https://www.ft.com/content/781c88b6-ec6a-4eda-8963-654391aa914c\">anything more Doomed European than an article that says ‘Europe doesn’t need driverless cars’</a>? As with so many things like air conditioning, free speech and economic growth, the European asks, do we really ‘need’ this? Aren’t European roadways already ‘safer’ than American ones now that we’ve slowed them down to make them thus? Wouldn’t this ‘threaten’ European traditions of bikes and public transportation? Aren’t cars ‘inefficient’? Won’t someone please think of the potential traffic issues?</p>\n<p>This emphasizes why I would make the case without emphasizing safety.</p>\n\n\n<h4 class=\"wp-block-heading\">My One Weakness</h4>\n\n\n<p><a href=\"https://x.com/Breaking911/status/2002568542835876194\">When San Francisco had a power outage, there were mistaken initial reports that Waymos came to a halt</a> or ‘bricked,’ causing traffic disruptions. The transition wasn’t perfect, some cars did come to a stop and behavior was more conservative than you would want.</p>\n<p>My understanding is that this was overstated. <a href=\"https://waymo.com/blog/2025/12/autonomously-navigating-the-real-world\">Waymo has now issued a full report.</a></p>\n<p><a href=\"https://x.com/Jess_Riedel/status/2003396117443289520\">Waymo successfully identified the situation</a>. <a href=\"https://x.com/ShanuMathew93/status/2003123328744100096\">The Waymo policy, decided in advance, treated every intersection as a four-way stop sign</a> as per California law while the traffic lights were out, had protocols in place to request additional verification checks, and then as a result Waymo suspended service to avoid slowing traffic.</p>\n<p>That seems fine? It’s not even clear it is non-ideal from Waymo’s perspective given their incentives? The risk-reward of using a more aggressive policy seems rather terrible, and worse than a service suspension? What would you have them do here?</p>\n<blockquote><p>Waymo: Navigating an event of this magnitude presented a unique challenge for autonomous technology. While the Waymo Driver is designed to handle dark traffic signals as four-way stops, it may occasionally request a confirmation check to ensure it makes the safest choice.</p>\n<p>While we successfully traversed more than 7,000 dark signals on Saturday, the outage created a concentrated spike in these requests. This created a backlog that, in some cases, led to response delays contributing to congestion on already-overwhelmed streets.</p>\n<p>We established these confirmation protocols out of an abundance of caution during our early deployment, and we are now refining them to match our current scale. While this strategy was effective during smaller outages, we are now implementing fleet-wide updates that provide the Driver with specific power outage context, allowing it to navigate more decisively.</p>\n<p>As the outage persisted and City officials urged residents to stay off the streets to prioritize first responders, we temporarily paused our service in the area. We directed our fleet to pull over and park appropriately so we could return vehicles to our depots in waves. This ensured we did not further add to the congestion or obstruct emergency vehicles during the peak of the recovery effort.</p>\n\n\n<h4 class=\"wp-block-heading\">The path forward</h4>\n\n\n<p>We’ve always focused on developing the Waymo Driver for the world as it is, including when infrastructure fails. We are analyzing the event, and are already integrating the lessons from this weekend’s PG&amp;E outage. Here are some of the immediate steps we’re taking:</p>\n<ul>\n<li><strong>Integrating more information about outages: </strong>While our Driver already handles dark traffic signals as four-way stops, we are now rolling out fleet-wide updates that give our vehicles even more context about regional outages, allowing them to navigate these intersections more decisively.</li>\n<li><strong>Updating our emergency preparedness and response: </strong>We will improve our emergency response protocols, incorporating lessons from this event. In San Francisco, we’ll continue to coordinate with Mayor Lurie’s team to identify areas of greater collaboration in our existing emergency preparedness plans.</li>\n<li><strong>Expanding our first responder engagement: </strong>To date, we’ve trained more than 25,000 first responders in the U.S. and around the world on how to interact with Waymo. As we discover learnings from this and other widespread events, we’ll continue updating our first responder training.</li>\n</ul>\n</blockquote>\n<p>This seems exactly right. Waymo has to be risk averse for now given that a single incident could derail their entire program. Over time, as they gain experience, they can act more decisively.</p>\n<p>The amount of ‘omg never using a self-driving car again’ or ‘police and fire departments will now fight against self-driving cars to the death’ boggles the mind.</p>\n<p>If enough cars on the road were self-driving, then they wouldn’t even need the traffic lights, they could coordinate in other ways, and this would all be moot.</p>\n<p>Yes, in the case where the internet goes down entirely or Waymos otherwise systemically fail there will be a bigger problem that might not have a great solution right now, but do you think Waymo hasn’t planned for this?</p>\n<p>At most, this says that if we had so many self-driving-only cars that we would be in deep trouble if all the self-driving cars died at once, then we want a solution where the cars are, in such an emergency, something a human could override and drive. That does not seem like such a difficult bar to cross?</p>\n<p>The most common crisis scenario where things go haywire is very simple:</p>\n<ol>\n<li>There is an evacuation or other reason everyone wants to go from A → B.</li>\n<li>The road from A → B becomes completely jammed and stops moving.</li>\n</ol>\n<p>Human drivers cannot solve this. Self-driving cars in sufficiently quantities solves this through coordination. Given these are maximally important scenarios where not getting out often risks death, it’s kind of a big deal. Imagine if things were reversed.</p>\n<p><a href=\"https://x.com/ilex_ulmus/status/2003244632487137678\">Holly Elmore accused me of missing the point here</a>, that it is about all the things that could go wrong with self-driving cars and that haven’t yet occured in the field.</p>\n<p>To which I say no, it is Holly that is missing the point. The reason why AGI is different is that if you have such a failure, you could be dead or lose control, and be unable to recover from the failure, or suffer truly catastrophic levels of damage. Thus, you need to get such potential difficulties right on the first try, before an incident happens, and you have to do this generally against a potential adversary more intelligent than you that will be out of distribution.</p>\n<p>A self-driving car… is a car. It is a normal technology.</p>\n<p>Even if something goes systematically wrong with a fleet of such cars, or all such fleets of cars? This is highly recoverable. The damage even for ‘all the Waymos suddenly floor it and crash’ (or even the pure sci-fi ‘suddenly try to do maximum amounts of damage’) is not so high in the grand scheme of things. There are a finite number of things that could happen that involve things going very wrong, and yes you can list all of them and then hardcode what to do in each case.</p>\n<p>That is, indeed, how the cars actually learn to drive under normal circumstances. If the regulators want to provide a list of potential incident types and require Waymo to say how they plan to deal with each, including any combination of loss of internet and loss of power and everyone simultaneously fleeing an oncoming tsunami caused by a neutron bomb, then okay, sure, fine, I guess, let’s be overly paranoid to keep everyone happy, it will in expectation cost lives but whatever it takes.</p>\n<p>But I think it’s really important, when arguing for AI safety, to be able to differentiate AGI from self-driving cars, and to not draw metaphors that don’t apply.</p>\n\n\n<h4 class=\"wp-block-heading\">Cruise Control</h4>\n\n\n<p><a href=\"https://sf.streetsblog.org/2025/11/24/op-ed-waymo-may-finally-teach-americans-the-speed-limit\">The real final boss for self-driving cars is the speed limit</a>.</p>\n<p>As everyone knows, the ‘real’ speed limit is by default 10 MPH above the speed limit. You’re highly unlikely to get a ticket, in most places, unless you are both more than 10 MPH and substantially faster than other drivers. If the speed limit is enforced to the letter, that usually involves attempting to trick motorists. We call that a ‘speed trap.’</p>\n<p>To be safe, you want to match the speed of other cars around you, so driving the listed speed limit is actively dangerous on many roads.</p>\n<blockquote><p><a href=\"https://x.com/ethanteicher/status/1993091353014673616\">Ethan Teicher</a>: “The lack of a human driver is no longer the reason [Waymos] stand out most from regular traffic. They do so because they follow the speed limit.</p>\n<p>Indeed, cyclists and pedestrians are so used to drivers going 5, 10, or more miles per hour over posted speed limits, that Waymo’s practice of driving by the letter of the law creates a noticeable contrast. So much so that in a recent New York Times article about Zoox entering the autonomous-vehicle fray in San Francisco, the reporters actually had the gall to list law-abiding driving as a downside”</p>\n<p><a href=\"https://x.com/robinhanson/status/1993647109728514162\">Robin Hanson</a>: Human drivers can block competition from self driving cars by just making traffic laws too onerous to obey, yet insisting that robots (only) must obey them. Seems a robust general strategy for preventing AI competition with humans.</p></blockquote>\n<p>The wrong answer is to current obviously too low numbers, and slow down all cars to the current technical speed limits. That’s profoundly stupid. It’s also scarily plausible that we will end up doing it.</p>\n<p>The correct answer is to increase our speed limits across the board to the actual limit, beyond which we can and will ticket you.</p>\n<p>This generalizes, as per Levels of Friction.</p>\n<p>If AI has to obey the rules and humans don’t, the correct answer wherever possible is to change the rules to what we want both AIs and humans to actually have to follow.</p>\n<p>In many other places, this creates a real problem, because the true rules are nebulous and involve social incentives and a willingness to adopt to practical conditions. As Robin Hanson notes, an otherwise highly capable AI that had to formally obey all laws in all ways would find many human tasks impossible or impractical.</p>\n\n\n<h4 class=\"wp-block-heading\">Growth Rates</h4>\n\n\n<p>I strongly agree that Waymo must pick up the pace. 7% growth per month? That’s it?</p>\n<blockquote><p><a href=\"https://www.cnbc.com/2025/12/08/waymo-paid-rides-robotaxi-tesla.html?taid=693709ffa677a9000102a981&amp;utm_campaign=trueanthem&amp;utm_content=main&amp;utm_medium=social&amp;utm_source=twitter\">CNBC</a>: Waymo crosses 450,000 weekly paid rides as Alphabet robotaxi unit widens lead on Tesla.</p>\n<p><a href=\"https://x.com/binarybits/status/2000923359564193975\">Timothy Lee</a>: Weekly driverless Waymo trips:</p>\n<p>May 2023: 10,000<br />\nMay 2024: 50,000 (14% monthly growth)<br />\nAugust 2024: 100,000 (25% monthly)<br />\nOctober 2024: 150,000 (22%)<br />\nFebruary: 2025: 200,000 (7%)<br />\nApril 2025: 250,000 (12%)<br />\nDecember 2025: 450,000 (7%)</p>\n<p>Right on track for 1M by December 2026.</p>\n<p><a href=\"https://x.com/binarybits/status/2000924896508129621\">FWIW this feels way too slow to me</a>. They should be aiming for the ~15% growth rate they achieved in 2024. Hopefully they’re going to figure out their vehicle supply issues and dramatically accelerate in 2027. Tesla has been growing slowly because their technology doesn’t work yet. But they will figure it out in the next year or two and after that I guarantee you Elon won’t be happy with 7% monthly growth.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">The Competition</h4>\n\n\n<p><a href=\"https://x.com/binarybits/status/1984042701499855067\">Tesla continues to not even apply to operate fully autonomous services</a> in the areas it claims it wants to offer those services, such as California, Arizona and Nevada. Please stop thinking Elon Musk’s timelines are ever meaningful.</p>\n<p>The <a href=\"https://avmarketstrategist.substack.com/p/deep-dive-chinese-av-player-q32025\">actual global competition is probably Chinese</a>, as one would expect.</p>\n<blockquote><p><a href=\"https://x.com/binarybits/status/1995532071511405023\">Timothy Lee</a>: US media tends to cover robotaxis as a Waymo/Tesla race, but globally Waymo’s strongest competition is likely to be Chinese companies like Baidu, WeRide, and Pony. Rough robotaxi counts today:</p>\n<p>Waymo: 2,500</p>\n<p>Baidu: 1,000</p>\n<p>Pony: 960</p>\n<p>WeRide: 750</p>\n<p>Tesla: 100</p></blockquote>\n<p><a href=\"https://x.com/SawyerMerritt/status/1990812889586770177\">What they have done is made &#8216;Robotaxi’ service go live in Austin</a> for select rides, but these rides remain supervised with a Tesla employee in the driver’s seat.</p>\n<p><a href=\"https://x.com/karpathy/status/1988705360723763242\">Andrej Karpathy reports the new Tesla self-driving on the HW4 Model X is a substantial upgrade</a>.</p>\n<p><a href=\"https://x.com/aj_hugs/status/1986839344196559301\">Delivery via self-driving e-bikes?</a> Brilliant.</p>\n\n\n<h4 class=\"wp-block-heading\">They Took Our Jobs</h4>\n\n\n<p>If enough people lose their jobs at once, society has a big problem.</p>\n<blockquote><p><a href=\"https://x.com/RoKhanna/status/1994030933343629596\">Ro Khanna</a>: We need smart regulation to protect 3.5 million truck drivers &amp; 2 million long haul drivers. AI should not be used for mass layoffs that drive up short term profits w/ no productivity gains.</p>\n<p>Drivers are needed for safety, oversight, edge cases, &amp; maintenance.</p>\n<p>I stand with humans over machines, with @LorenaSGonzalez @TeamsterSOB over short term profits for corporate oligarchs.</p>\n<p>Roon: what do you think productivity gains are lol.</p></blockquote>\n<p>It’s amazing how easily those opposed to self-driving throw around ‘safety concerns’ when self-driving vehicles are massively safer, or the idea here that gains are ‘short term’ or that there are ‘no productivity gains.’</p>\n<p>Even if we literally require a human to be in each truck at all times ‘in case of emergency’ we would still see massive productivity gains, since the trucks would be able to be on the road 24/7.</p>\n<p>Maintenance is another truly silly objection. Yes, when you need to maintain something you’d (for now at least) bring the truck to a human. Okay.</p>\n<p>That leaves the ever mysterious and present ‘edge cases.’</p>\n\n\n<h4 class=\"wp-block-heading\">Bikers As Winners</h4>\n\n\n<blockquote><p><a href=\"https://x.com/chrisalbon/status/2003501793393967423\">Chris Albon</a>: I bike everywhere in SF. I barely ever take a taxi/uber/waymo. But if you want to ban Waymo it means you don’t care about cyclists like me.</p></blockquote>\n<p>Waymos will reliably yield to bikes, use its turn signals and obey the rules. When you are biking, the problem is tail risk can literally kill you, so you have to constantly be paranoid that any given car will do something unexpected or crazy. With a Waymo, you don’t have to worry about that.</p>\n\n\n<h4 class=\"wp-block-heading\">The Elderly As Big Winners</h4>\n\n\n<p>Both the young and the old, who cannot drive, will benefit greatly. Self-driving cars will be a very different level of freedom than the ability to summon a Lyft. <a href=\"https://x.com/politicalmath/status/2002931251301564645\">Tesla will likely offer ‘unsupervised’ self-driving very soon</a>.</p>\n<p>If you combine self-driving cars with other new smart products, including basic home robots, suddenly assisted living facilities look pretty terrible. They’re expensive and unpleasant, with the upside being that when you need help you really need help. The need for that forces you to buy this entire package of things you mostly don’t want. But what if most of that help was covered?</p>\n<blockquote><p><a href=\"https://x.com/politicalmath/status/2002942981826109641\">PoliMath</a>: Crazy prediction time: I think that nursing homes and assisted living facilities are in trouble long-term.</p>\n<p>These businesses are currently massive profit centers. Full time care for the elderly is a huge business &amp; everyone assumes it will get bigger as boomers age</p>\n<p>But no one wants to move into an assisted care house. They are good for what they are, but it&#8217;s a depressing place. It means moving a whole life into the place where you plan to die. That&#8217;s no fun. No one wants that. Most people want to age &#8220;in place&#8221;. They want to keep their home, keep their space, age and die in a familiar setting. What keeps them from doing this?</p>\n<p>1) transportation &#8211; if they can&#8217;t get around to get their meds, get groceries, go to the movies, go to their favorite restaurant, drive to a park, etc, this severely reduces their quality of life. Assisted care helps solve this</p>\n<p>2) household chores &#8211; Doing the laundry, cooking simple meals, lawn care, self-care (clipping toenails, bathing), these are important things that are harder to do when you get into your 80&#8217;s and 90&#8217;s</p>\n<p>Unsupervised self-driving solves problem #1. The elderly should not be driving. It&#8217;s a brutal reality and one they fight against, but the risk factor is extremely high. An autonomous transportation system allows them enormous mobility and autonomy.</p>\n<p>In-home robots solve problem #2. Robots that can aid with difficult self-care and household chores allows the elderly to stay in place for longer. This has enormous cost-savings and (more importantly) they can feel like they are in charge of their own lives for longer.</p>\n<p>At that point, the biggest challenge is social interaction. This is where assisted care facilities easily out-class these automated solutions. The logistics problem is being solved in front of our eyes and it&#8217;s a miracle. But the social problem is not solved. Not even close.</p></blockquote>\n<p>The social problem requires people who want to interact with you, but note that we’ve solved the transportation problem. That makes it a lot easier.</p>\n\n\n<h4 class=\"wp-block-heading\">Save The Cat</h4>\n\n\n<p><a href=\"https://x.com/KelseyTuoc/status/1984091844989612401\">What will happen when a Waymo finally does kill someone</a>? Waymos are vastly safer than human drivers, but are we always going to be one accident away from disaster? The CEO of Waymo says people will accept it. I think she’s right if Waymo gets enough traction first, the question is when that point comes and whether we have reached it yet.</p>\n<p>In the meantime, they’re trying to drum up outrage <a href=\"https://x.com/ArthurB/status/1984184013905650128\">because a Waymo killed a cat</a>, a ‘one-of-a-kind’ mascot of a bodega, something that happens to 5.3 million cats per year whens truck by human drivers. If ‘cat killed by Waymo’ is news then Waymos are absurdly safe.</p>\n<blockquote><p><a href=\"https://x.com/RollingStone/status/1986101206050283849\">Rolling Stone</a>: KitKat, known as the “Mayor of 16th Street,” was killed by a Waymo cab last week in San Francisco, sparking calls for more regulation of driverless cars.</p>\n<p><a href=\"https://x.com/YIMBYLAND/status/1986507764483395853\">Yimbyland</a>: When do you ever see a spread like this about a human driver running over a cat?</p>\n<p>You don’t, and yet it happens 15,000 TIMES EVERY DAY.</p>\n<p>YES. FIFTEEN THOUSAND CATS ARE RUN OVER EVERY SINGLE DAY.</p>\n<p><a href=\"https://x.com/MissionLoco/status/1985622912850641396\">Mission Loco</a>: A cat ran in front of a car and was run over. This happens 26 MILLION times per year in the US. Now @rachelswan and @JackieFielder_ want to ban vehicles. This is how moronic @Hearst@sfchronicle reporters &amp; @sfbos are.</p>\n<p><a href=\"https://x.com/mpopv/status/1985728416633798914\">Matt Popovich:</a></p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!SLvX!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9064d7bf-3bdc-4abe-9751-ff7bc534c4d7_1180x733.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>(The bottom line should also include millions of cats and other pets as well, of course.)</p>\n<p>I mean, if they wanted to ban all vehicles that would at least make some sense.</p>\n<p>I will note that the 26 million number comes from Merrett Clifton’s extrapolation from 1993 and it’s basically absurd if you think about it, there simply are not enough cats for this to be real. It’s probably more like 2-5 million cats per year. Not that this changes the conclusion that Waymos are obviously vastly safer for cats than human drivers.</p>\n<p><a href=\"https://x.com/AndyMasley/status/1986621185384128790\">The stats are of course in</a>, and if you use reasonable estimates Waymos probably kill on the order of 75x fewer pets, as in a 98%+ reduction in cats killed per mile.</p>\n<p><a href=\"https://x.com/binarybits/status/1989705868296753427\">In the meantime, we continue to deal with things like New York Times</a> articles about a Waymo running over this very special cat, in which they bury the fact Waymos are vastly safer than human drivers.</p>\n<blockquote><p><a href=\"https://x.com/binarybits/status/1989705868296753427\">Timothy Lee</a>: NYTimes article quotes someone saying they are “terrified” of Waymo in paragraph 6. Waits until paragraph 33 (out of 44 paragraphs) to mention that they are 91 percent safer than human drivers. How outraged would liberals be if a news outlet covered vaccines like this?</p>\n<p>The article does mention that human drivers kill hundreds of cats every year so that’s something.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">It’s Going To Be The Future Soon</h4>\n\n\n<p>Even if the rest of AI doesn’t prove that disruptive soon, self-driving will change quite a lot wherever it is allowed to proceed. I too am unreasonably excited.</p>\n<blockquote><p><a href=\"https://x.com/karpathy/status/1989078861800411219\">Andrej Karpathy</a>: I am unreasonably excited about self-driving. It will be the first technology in many decades to visibly terraform outdoor physical spaces and way of life. Less parked cars. Less parking lots. Much greater safety for people in and out of cars. Less noise pollution. More space reclaimed for humans.</p>\n<p>Human brain cycles and attention capital freed up from “lane following” to other pursuits. Cheaper, faster, programmable delivery of physical items and goods. It won’t happen overnight but there will be the era before and the era after.</p>\n<p><a href=\"https://x.com/uninsightful/status/1990835243218260045\">Nikhil:</a> every time I come off a week of taking Waymos in SF:</p>\n<ol>\n<li>it feels increasingly strange to return to a non-autonomous city (just as it felt weird to be in cities that didn’t have uber yet in 2014-2016)</li>\n<li>I come away feeling like we continue to under-discuss the second order effects of self-driving inevitability + ubiquity</li>\n</ol>\n<p>I think the indifference in the air is largely a function of how gradual (relatively) the rollout of AVs has been and will continue to be</p></blockquote>\n<p>The agonizingly slow ramp-up, along with the avalanche of other AI things happening, is definitely taking the focus off of self-driving and making us not realize how much the ground is shifting under our feet. The second order effects are going to be huge. The child mobility and safety improvements are especially neglected.</p>\n\n\n<h4 class=\"wp-block-heading\">In-Context Old Man Yells At Self-Driving Car</h4>\n\n\n<p><a href=\"https://x.com/tszzl/status/1982237128051277880\">A no good, very bad take</a> but also why competition is good:</p>\n<blockquote><p>Roon: i strongly prefer uber to waymo. ubers get you where you need to go much faster. they wait for you when you’re running late. they never suffer catastrophic failure and ignominiously getting stuck behind a truck or something. will be kicked out of san francisco for this take.</p>\n<p>also i learn so much from uber drivers it’s so high entropy.</p></blockquote>\n<p>To state the obvious I vastly prefer Waymos, and I am confused by the part about catastrophic failures since it seems obvious that rates of ‘things go wrong’ are higher for an Uber. But yeah, if you actively want to talk to drivers and to have another human in the car, and you care more about speed than a smooth ride, I can see it.</p>\n\n\n<h4 class=\"wp-block-heading\">The Safety Case</h4>\n\n\n<p>Self-driving cars have been proven vastly safer than human drivers, despite many believing the opposite. The question continues to be, how hard do you push on this?</p>\n<p>Human drivers have been grandfathered in as an insanely dangerous thing we have accepted as part of life. We’ve destroyed huge other parts of life in the name of far less serious safety concerns, whereas here we have a solution that is life affirming while also preventing most of a leading cause of death.</p>\n<blockquote><p><a href=\"https://x.com/slotkinjr/status/1995864439405375903\">Dr. Jon Slotkin</a>: <a href=\"https://www.nytimes.com/2025/12/02/opinion/self-driving-cars.html\">I have a guest essay in @nytimes</a> today about autonomous vehicle safety. I wrote it because I’m tired of seeing children die. Done right, we can eliminate car crashes as a leading cause of death in the United States</p>\n<p>@Waymo recently released data covering nearly 100 million driverless miles. I spent weeks analyzing it because the results seemed too good to be true. 91% fewer serious-injury crashes. 92% less pedestrians hit. 96% fewer injury crashes at intersections. The list goes on.</p>\n<p>39,000 Americans died in crashes last year. More than homicide, plane crashes, and natural disasters combined. The #2 killer of children and young adults. The #1 cause of spinal cord injury. We’ve accepted this as the price of mobility.</p>\n<p>We don’t have to.</p>\n<p>In medicine, when a treatment shows this level of benefit, we stop the trial early. Continuing to give patients the placebo becomes unethical. When an intervention works this clearly, you change what you do.</p>\n<p>In driving, we’re all the control group.</p>\n<p>Cities like DC and Boston are blocking deployment. And cities are not the only forces mobilizing to slow this progress.</p>\n<p>It’s time we stop treating this like a tech moonshot and start treating it like a public health intervention that will save lives.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Keep It Classy</h4>\n\n\n<p><a href=\"https://x.com/Aurelien_Gz/status/1996508065802146101\">Auerlien reports that ‘broken windows theory’ very much applies to cars</a>. If you don’t keep cars fully pristine then people stop respecting the car and things escalate quickly, and also people care quite a lot. Thus, if a Waymo or other self-driving car gets even a little dirty it needs to head back and get cleaned. And thus, every Waymo I’ve ever ridden in has been pristine.</p>\n\n\n<h4 class=\"wp-block-heading\">The Lighter Side</h4>\n\n\n<blockquote><p>Johnny v5: just realized waymo means i can go to office hours without haste now</p>\n<p>Deepfates: that means you can go to Waymo of them!!</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\"></h4>"
            ],
            "link": "https://thezvi.wordpress.com/2026/01/07/advancements-in-self-driving-cars/",
            "publishedAt": "2026-01-07",
            "source": "TheZvi",
            "summary": "Going Full San Francisco Waymo goes Full San Francisco West Bay except for SFO: Jeff Dean: Exciting expansion! @Waymo now serves the whole SF Bay Area Peninsula from SF to San Jose and is taking riders on freeways. They can &#8230; <a href=\"https://thezvi.wordpress.com/2026/01/07/advancements-in-self-driving-cars/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Advancements In Self-Driving Cars"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3191/",
            "publishedAt": "2026-01-07",
            "source": "XKCD",
            "summary": "<img alt=\"It's important to teach yourself to feel responsible for random events, because with great responsibility comes great power. That's what my wise Uncle Ben told me right before he died; he might still be alive today if only I'd said rabbit rabbit that year!\" src=\"https://imgs.xkcd.com/comics/superstition.png\" title=\"It's important to teach yourself to feel responsible for random events, because with great responsibility comes great power. That's what my wise Uncle Ben told me right before he died; he might still be alive today if only I'd said rabbit rabbit that year!\" />",
            "title": "Superstition"
        },
        {
            "content": [],
            "link": "https://zed.dev/blog/dev-containers",
            "publishedAt": "2026-01-07",
            "source": "Zed Blog",
            "summary": "Open projects in Docker-based Dev Containers in Zed for consistent, reproducible development environments.",
            "title": "Run Your Project in a Dev Container, in Zed"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-07"
}