{
    "articles": [
        {
            "content": [],
            "link": "https://newsletter.dancohen.org/archive/where-should-scholars-draw-the-line-on-ai/",
            "publishedAt": "2026-02-03",
            "source": "Dan Cohen",
            "summary": "<figure><a href=\"https://ccdl.claremont.edu/digital/collection/ccp/id/2707?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=where-should-scholars-draw-the-line-on-ai\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"A black and white photograph of a library at night from the outside, with large glass windows showing the stacks and people studying\" draggable=\"false\" src=\"https://assets.buttondown.email/images/f26298a6-32f5-417d-9ea0-853d6b7d5ca0.jpeg?w=960&amp;fit=max\" /></a><figcaption>Leland Holder, “<a href=\"https://ccdl.claremont.edu/digital/collection/ccp/id/2707?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=where-should-scholars-draw-the-line-on-ai\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Multi-tier stacks in Mudd Library</a>,” Special Collections, Honnold/Mudd Library, The Libraries of The Claremont Colleges, 1987</figcaption></figure> <p>In the fall I wrote about how AI can help, rather than replace, libraries and their collections. Let me summarize these positive attributes before I begin to address a new, but related, topic.</p> <ul><li><p>Unlike most library systems, LLMs are based on <a href=\"https://newsletter.dancohen.org/archive/the-index-and-the-vector/?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=where-should-scholars-draw-the-line-on-ai\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">vectors rather than indexes</a>, making them comfortable with:</p><ul><li><p>language as it is commonly spoken</p></li><li><p><em>uncontrolled</em> vocabularies and ambiguity</p></li><li><p>keyword <em>cousins</em>, not just keyword twins</p></li></ul></li><li><p>Transformers allow LLMs to excel at parallelism, meaning they can:</p><ul><li><p>move between forms fluidly, including text, images, and other media</p></li><li><p>translate well between languages</p></li></ul></li><li><p>Chat versions of LLMs are <a href=\"https://newsletter.dancohen.org/archive/the-librarys-new-entryway/?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=where-should-scholars-draw-the-line-on-ai\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">not just conversational, but iterative and longitudinal</a>, so they can:</p><ul><li><p>ask for clarifications or refinement</p></li><li><p>digest some initial documents to further refine or sequence a query</p></li><li><p><a href=\"https://newsletter.dancohen.org/archive/ai-and-libraries-archives-and-museums-loosely-coupled/?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=where-should-scholars-draw-the-line-on-ai\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">synthesize information from multiple sources</a></p></li><li><p>remember context over time (if you let them)</p></li></ul></li><li><p>Multimodal LLMs and computer vision are swiftly getting better at transcribing:</p><ul><li><p><a",
            "title": "Where Should Scholars Draw the Line on AI?"
        },
        {
            "content": [
                "<div class=\"trix-content\">\n  <div>I fully understand the nostalgia for real ownership of physical-media games. I grew up on cassette tapes (C64 + Amstrad 464!), floppy disks (C64 5-1/4\" then Amiga 3-1/2\"), cartridges, and CDs. I occasionally envy the retro gamers on YouTube with an entire wall full of such physical media. But do you know what I like more than collecting? Playing! Anywhere. Anything. Anytime.</div><div><br />We went through the same coping phases with movies and music. Yes, vinyl had a resurgence, but it's still a tiny sliver of hours listened. Same too with 4K Blue-rays. Almost everyone just listens to Spotify or watches on Netflix these days. It's simply cheaper, faster, and, thus, better.</div><div><br />Not \"better\" in some abstract philosophical way (ownership vs rent) or even in a concrete technical way (bit rates), but in a practical way. Paying $20/month for unlimited music and the same again for a broad selection of shows and movies is clearly a deal most consumers are happy to make.<br /><br /></div><div>So why not video games? Well, because it just wasn't good enough! Netflix tried for casual gaming, but I didn't hear much of that after the announcement. <a href=\"https://stadia.google.com/gg/\">Google Stadia</a> appears to have been just a few years ahead of reality (eerie how often that happens for big G, like with both AI and <a href=\"https://en.wikipedia.org/wiki/Google_Glass\">AR</a>!) as they shut down their service already.</div><div><br />NVIDIA, though, kept working, and its <a href=\"https://www.nvidia.com/en-us/geforce-now/\">GeForce NOW service</a> is actually, finally kinda amazing! I had tried it back in the late 2010s, and just didn't see anything worth using back then. Maybe my internet was too slow, maybe the service just wasn't good enough yet. But then I tried it again a few days ago, just after <a href=\"https://blogs.nvidia.com/blog/geforce-now-thursday-linux/\">NVIDIA shipped the native GFN client for Linux</a>, and holy smokes!!<br /><br /></div><div>You can legitimately play Fortnite in 2880x1800 at 120 fps through a remote 4080, and it looks incredible. Yes, there's a little input lag, but it's shockingly, surprisingly playable on a good internet connection. And that's with the hardest possible genre: competitive shooters! If you play racing games like Forza Horizon or story-mode games like Warhammer 40K: Space Marine 2, you can barely tell!<br /><br /></div><div>This is obviously a great option for anyone with a modest computer that can't run the latest triple-A titles, but also for Linux gamers who don't have access to run the cheat-protection software required for Fortnite and a few other games.&nbsp;<br /><br /></div><div>And, like Spotify and Netflix, it's pretty competitively priced. It's $20/month for access to that 4080-tier. You'd quickly spend $2,000+ on a gaming rig with a 4080, so this isn't a half bad deal: it's a payback of 100 months, and by then you'd probably want a 6080 anyway. Funny how NVIDIA is better at offering the promise of cheap cloud costs than the likes of AWS!<br /><br /></div><div>Anyway, I've been very impressed with NVIDIA GeForce NOW. We're going to bake the Linux installer straight into the next version of Omarchy, so you can just go to <em>Install &gt; Gaming &gt; NVIDIA GeForce NOW</em> to get going (just like we have such options for Steam and Minecraft).</div><div><br />But of course seeing Fortnite running in full graphics on that remote 4080 made me hungry for even more. I've been playing Fortnite every week for the last five years or so with the kids, but the majority of my gameplay has actually been on tablet. A high-end tablet, like an iPad M5, can play the game with good-for-mobile graphics at 120 Hz. It's smooth, it's easy, and the kids and I can lounge on the couch and play together. <a href=\"https://world.hey.com/dhh/house-rules-in-fortnite-16e0e5e8\">Good Family Fun!</a> Not peak visual fidelity, though.</div><div><br />So after the NVIDIA GeForce NOW experience, I found a way to use the same amazing game streaming technology at home through a local-server solution called <a href=\"https://github.com/ClassicOldSong/Apollo\">Apollo</a> and a client called <a href=\"https://moonlight-stream.org/\">Moonlight</a>. This allowed me to turn my racing-sim PC that's stuck downstairs into a cloud-like remote gaming service that I can access anywhere on the local network, so I can borrow its 4090 to play 120-fps, ultra-settings Fortnite with zero perceivable input lag on any computer in the house.</div><div><br />The NVIDIA cloud streaming is very impressive, but the local-server version of the same is mind-blowing. I'm mostly using the Asus G14 laptop as a client, so Fortnite looks incredible with those ultra, high-resolution settings on its OLED, but unlike when you use that laptop's built-in graphics card, the machine stays perfectly cool and silent pulling a meager 18 watts. And the graphics are of course a lot nicer.<br /><br /></div><div>The Moonlight client is available for virtually every platform: Mac, iOS, Android, and of course Linux. That means no need to dual boot to enjoy the best games at the highest fidelity. No need for a honking big PC on my primary desk. I did not know this was an option!!<br /><br /></div><div>Whether you give NVIDIA's cloud gaming setup a try or repurpose a local gaming PC for the same, you're in for a real treat of what's possible with streaming Fortnite on ultra settings at 120 fps on Linux (or even Mac!). GG, NVIDIA!<br /><br />  <figure class=\"attachment attachment--preview attachment--lightboxable attachment--jpg\">\n      <a href=\"https://world.hey.com/dhh/b8a19c57/blobs/eyJfcmFpbHMiOnsiZGF0YSI6MjQzNzY2NzAxNywicHVyIjoiYmxvYl9pZCJ9fQ--d90a498e931bfcb76593b0e979e9d332adef7cec875e61b70678cdec1a1e266a/fortnite-apollo-4090.jpg?disposition=attachment\" title=\"Download fortnite-apollo-4090.jpg\">\n        <img alt=\"fortnite-apollo-4090.jpg\" src=\"https://world.hey.com/dhh/b8a19c57/representations/eyJfcmFpbHMiOnsiZGF0YSI6MjQzNzY2NzAxNywicHVyIjoiYmxvYl9pZCJ9fQ--d90a498e931bfcb76593b0e979e9d332adef7cec875e61b70678cdec1a1e266a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemVfdG9fbGltaXQiOlszODQwLDI1NjBdLCJxdWFsaXR5Ijo2MCwibG9hZGVyIjp7InBhZ2UiOm51bGx9LCJjb2FsZXNjZSI6dHJ1ZX0sInB1ciI6InZhcmlhdGlvbiJ9fQ--b3779d742b3242a2a5284869a45b2a113e0c177f0450c29f0baca1ee780f6604/fortnite-apollo-4090.jpg\" />\n</a>\n  </figure><br /><br /></div>\n</div>"
            ],
            "link": "https://world.hey.com/dhh/cloud-gaming-is-kinda-amazing-b8a19c57",
            "publishedAt": "2026-02-03",
            "source": "DHH",
            "summary": "<div class=\"trix-content\"> <div>I fully understand the nostalgia for real ownership of physical-media games. I grew up on cassette tapes (C64 + Amstrad 464!), floppy disks (C64 5-1/4\" then Amiga 3-1/2\"), cartridges, and CDs. I occasionally envy the retro gamers on YouTube with an entire wall full of such physical media. But do you know what I like more than collecting? Playing! Anywhere. Anything. Anytime.</div><div><br />We went through the same coping phases with movies and music. Yes, vinyl had a resurgence, but it's still a tiny sliver of hours listened. Same too with 4K Blue-rays. Almost everyone just listens to Spotify or watches on Netflix these days. It's simply cheaper, faster, and, thus, better.</div><div><br />Not \"better\" in some abstract philosophical way (ownership vs rent) or even in a concrete technical way (bit rates), but in a practical way. Paying $20/month for unlimited music and the same again for a broad selection of shows and movies is clearly a deal most consumers are happy to make.<br /><br /></div><div>So why not video games? Well, because it just wasn't good enough! Netflix tried for casual gaming, but I didn't hear much of that after the announcement. <a href=\"https://stadia.google.com/gg/\">Google Stadia</a> appears to have been just",
            "title": "Cloud gaming is kinda amazing"
        },
        {
            "content": [],
            "link": "https://olano.dev/blog/pieza-ausente",
            "publishedAt": "2026-02-03",
            "source": "Facundo Olano",
            "summary": "Conjeturo que así vino la mano: en los '90 (como ahora), Anagrama publicaba a Georges Perec; alguien en Anagrama, pongamos que Jorge Herralde para hacerlo fácil, recibe esta novela del francés Antoine Bello, Éloge de la pièce manquante (1998), una especie de cover u homenaje a La vida instrucciones de uso, un Perec \"pasado por agua\", y piensa, Herralde, que sería una buena adición al catálogo de su editorial, así que la manda a traducir y la saca en español en 2001. En los '90 Anagrama publicaba también a Bolaño, un Bolaño a esa altura ya consagrado con Los detectives salvajes, y es de suponer que el chileno recibía muestras de todo lo que publicaba la casa, o que cuando se pasaba por la oficina en Barcelona, digamos para cobrar un adelanto por Una novelita lumpen o Putas asesinas, rebuscaba en la pila de novedades y se llevaba cualquier cosa que le llamara la atención, y que a lo mejor la ojeaba en el tren de regreso a Blanes, y que si pescaba su interés seguía leyendo, digamos fumando por la rambla o tomándose un café con leche en una taberna como la que describe en el último capítulo de",
            "title": "La pieza ausente"
        },
        {
            "content": [
                "<p>When cryptocurrencies first became a thing, some of their loudest proponents talked about how they were free, democratic, and open, and didn't need all of the regulation and bureaucratic institutions that &quot;fiat currency&quot; needed.</p>\n<p>And then, over the course of...not that long, there was a lot of empirical discovery of why regulation and regulators exist. As someone who was sitting on the sidelines, I was able to enjoy a fair bit of schadenfreude.</p>\n<p>Recently, I've been spending a lot of my time thinking about software engineering management. And I've been spending most of the rest of my time managing agents that are engaged in the practice of software engineering.</p>\n<p>Right now, the new hotness in Agentic dev appears to be &quot;swarms.&quot; Whether it's hundreds or thousands of agents collaborating on a single computer to build a browser, or a Mad Max-style dystopia with a merge queue, everything is swarms. And they kind of work? The work gets done. And the wall clock time for completion is absolutely shorter than for a strict single-agent workflow, but everything I've seen has involved a ton of ad hoc collaboration, a lot of stepping on toes, and, effectively, spilling tons and tons of tokens on the floor.</p>\n<p>Stepping back a little bit this morning, it feels like we might be trying to wish new tools that are good, fast, and cheap into existence from first principles. It's been <a href=\"https://en.wikipedia.org/wiki/NATO_Software_Engineering_Conferences\">nearly 60 years</a> since we recognized that Software Engineering is a discipline. The waterfall methodology predates that by about a decade. Literal generations of engineers and managers have iterated on systems and methodologies for improving software engineering reliability.</p>\n<p>And we're out here YOLOing it.</p>\n<blockquote>\n<p>Adding manpower to a late software project makes it later - Fred Brooks, 1975</p>\n</blockquote>\n<p>By my very uncharitable math, agentic software engineering methodologies have gotten to somewhere around the 1970s. Like everything in AI, this is, of course, a speed run. We're very quickly relearning why software engineering management and software engineering project management matter.</p>\n<p>So by next Tuesday, maybe folks will start thinking about what they can steal from XP.</p>"
            ],
            "link": "https://blog.fsck.com/2026/02/03/managing-agents/",
            "publishedAt": "2026-02-03",
            "source": "Jesse Vincent",
            "summary": "<p>When cryptocurrencies first became a thing, some of their loudest proponents talked about how they were free, democratic, and open, and didn't need all of the regulation and bureaucratic institutions that &quot;fiat currency&quot; needed.</p> <p>And then, over the course of...not that long, there was a lot of empirical discovery of why regulation and regulators exist. As someone who was sitting on the sidelines, I was able to enjoy a fair bit of schadenfreude.</p> <p>Recently, I've been spending a lot of my time thinking about software engineering management. And I've been spending most of the rest of my time managing agents that are engaged in the practice of software engineering.</p> <p>Right now, the new hotness in Agentic dev appears to be &quot;swarms.&quot; Whether it's hundreds or thousands of agents collaborating on a single computer to build a browser, or a Mad Max-style dystopia with a merge queue, everything is swarms. And they kind of work? The work gets done. And the wall clock time for completion is absolutely shorter than for a strict single-agent workflow, but everything I've seen has involved a ton of ad hoc collaboration, a lot of stepping on toes, and, effectively, spilling tons and tons of tokens",
            "title": "Speedrunning Agentic Software Engineering Management"
        },
        {
            "content": [
                "<p>First we must covered Moltbook. Now we can double back and cover OpenClaw.</p>\n<p>Do you want a generally impowered, initiative-taking AI agent that has access to your various accounts and communicates and does things on your behalf?</p>\n<p>That depends on how well, safely, reliably and cheaply it works.</p>\n<p>It’s not ready for prime time, especially on the safety side. That may not last for long.</p>\n<p>It’s definitely ready for tinkering, learning and having fun, if you are careful not to give it access to anything you would not want to lose.</p>\n\n\n<h4 class=\"wp-block-heading\">Table of Contents</h4>\n\n\n<ol>\n<li><a href=\"https://thezvi.substack.com/i/186427640/introducing-clawdbot-moltbot-openclaw\">Introducing Clawdbot Moltbot OpenClaw.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/stop-or-you-ll-shoot\">Stop Or You’ll Shoot.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/one-simple-rule\">One Simple Rule.</a>\n<div>\n\n\n<span id=\"more-25072\"></span>\n\n\n</div>\n</li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/flirting-with-personal-disaster\">Flirting With Personal Disaster.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/flirting-with-other-kinds-of-disaster\">Flirting With Other Kinds Of Disaster.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/don-t-outsource-without-a-reason\">Don’t Outsource Without A Reason.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/openclaw-online\">OpenClaw Online.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/the-price-is-not-right\">The Price Is Not Right.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/the-call-is-coming-from-inside-the-house\">The Call Is Coming From Inside The House.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/the-everything-agent-versus-the-particular-agent\">The Everything Agent Versus The Particular Agent.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/186427640/claw-your-way-to-the-top\">Claw Your Way To The Top.</a></li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Introducing Clawdbot Moltbot OpenClaw</h4>\n\n\n<p>Many are kicking it up a notch or two.</p>\n<p>That notch beyond Clade Code was initially called Clawdbot. You hand over a computer and access to various accounts so that the AI can kind of ‘run your life’ and streamline everything for you.</p>\n<p>The notch above that is perhaps Moltbook, which I plan to cover tomorrow.</p>\n<p>OpenClaw is intentionally ‘empowered,’ meaning <a href=\"https://www.reddit.com/r/Anthropic/comments/1qpjbf3/clawdbot_creator_describes_his_mindblown_moment/\">it will enhance its capabilities and otherwise take action without asking</a>.</p>\n<p>They initially called this Clawdbot. <a href=\"https://x.com/moltbot/status/2016058924403753024\">They renamed it Moltbot</a>, and changed Clawd to Molty, at Anthropic’s request. <a href=\"https://openclaw.ai/blog/introducing-openclaw\">Then Peter Steinberger settled on OpenClaw</a>.</p>\n<p><a href=\"https://x.com/frankdegods/status/2017121339656569010\">Under the hood it looks like this</a>:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Flxf!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F363ea6a4-9232-4254-9fc1-6223cd2ff419_900x690.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/clairevo/status/2017741569521271175\">The heartbeat system, plus various things triggering it as ‘input,’ makes it ‘feel alive.</a>’ You designate what events or timers trigger the system to run, by default scheduled tasks check in every 30 minutes.</p>\n<p>This is great fun. Automating your life is so much more fun than actually managing it, even if it net loses you time, and you learn valuable skills.</p>\n\n\n<h4 class=\"wp-block-heading\">Stop Or You’ll Shoot</h4>\n\n\n<p>So long as you don’t, you know, shoot yourself in the foot in various ways.</p>\n<p>You know, because of <a href=\"https://www.mindlessalgorithm.com/ai-computer-use-is-not-very-secure-right-now/\">the fact that AI ‘computer use’ is not very secure right now</a> (the link explains but most of you already know why), and Clawdbot is by default in full Yolo mode.</p>\n<blockquote><p><a href=\"https://x.com/hollylawly/status/2015634964369572351\">Holly Guevara</a>: All these people with the most normie lives buying a $600 mac mini so their clawdbot assistant can “streamline” their empty calendar and reply to the 2 emails they get every week</p>\n<p><a href=\"https://x.com/CrackingDeFi/status/2015733663309156584\">DeFi</a>: Do you think it’s mostly just people wanting to play with new tech rather than actually needing the help? Sometimes the setup process is more of a hobby than the actual work.</p>\n<p><a href=\"https://x.com/hollylawly/status/2015988823923249291\">Holly Guevara</a>: it is and i love it. im actually very much a “just let people enjoy things” person but couldnt resist</p>\n<p>I’m just jealous I haven’t had time to automate my normie life.</p>\n<p><a href=\"https://x.com/JustinWaugh/status/2015710576261963873\">Justin Waugh</a>: The freeing feeling of going from 2 to 0 emails each week (at the expense of 4 hours daily managing the setup and $100 in tokens per day)</p>\n<p><a href=\"https://x.com/iamfouche/status/2015765013021999388\">Fouche</a>: the 2-email people are accidentally genius. learning the stack when stakes are zero &gt; scrambling to figure it out when your boss asks why you’re 5x slower than the intern</p></blockquote>\n<p><a href=\"https://x.com/adocomplete/status/2015570684009713932\">The problem with Clawdbot</a> is that it makes it very easy to shoot yourself in the foot.</p>\n<p>As in, as Rahul Sood puts it: “Clawdbot Is Incredible. The Security Model Scares the shit out of me.”</p>\n<blockquote><p>Rahul Sood: ​Clawdbot isn’t a chatbot. It’s an autonomous agent with:</p>\n<ul>\n<li>Full shell access to your machine</li>\n<li>Browser control with your logged-in sessions</li>\n<li>File system read/write</li>\n<li>Access to your email, calendar, and whatever else you connect</li>\n<li>Persistent memory across sessions</li>\n<li>The ability to message you proactively</li>\n</ul>\n<p>This is the whole point. It’s not a bug, it’s the feature. You want it to actually do things, not just talk about doing things.</p>\n<p>But “actually doing things” means “can execute arbitrary commands on your computer.” Those are the same sentence.</p>\n<p>… The Clawdbot docs recommend Opus 4.5 partly for “better prompt-injection resistance” which tells you the maintainers are aware this is a real concern.</p>\n<p>Clawdbot connects to WhatsApp, Telegram, Discord, Signal, iMessage.</p>\n<p>Here’s the thing about WhatsApp specifically: there’s no “bot account” concept. It’s just your phone number. When you link it, every inbound message becomes agent input.</p>\n<p>I’m not saying don’t use it. I’m saying don’t use it carelessly.</p>\n<p>Run it on a dedicated machine. A cheap VPS, an old Mac Mini, whatever. Not the laptop with your SSH keys, API credentials, and password manager.</p>\n<p>Use SSH tunneling for the gateway. Don’t expose it to the internet directly.</p>\n<p>If you’re connecting WhatsApp, use a burner number. Not your primary.</p>\n<p>Every piece of content your bot processes is a potential input vector. The pattern is: anything the bot can read, an attacker can write to.</p></blockquote>\n<p><a href=\"https://x.com/rahulsood/status/2015805211517042763\">There was then a part 2</a>, I thought this was a very good way to think about this:</p>\n<blockquote><p>​<strong>The Executive Assistant Test</strong></p>\n<p>Here’s a thought experiment that clarifies the decision.</p>\n<p>Imagine you’ve hired an executive assistant. They’re remote&#8230; living in another city (or another country <img alt=\"💀\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f480.png\" style=\"height: 1em;\" />) You’ve never met them in person. They came highly recommended, seem competent, and you’re excited about the productivity gains.</p>\n<p>Now: what access do you give them on day one?</p></blockquote>\n<p>As Simon Willison put it, <a href=\"https://simonwillison.net/2026/Jan/30/moltbook/\">the question is when someone will build a safe version of this</a>, that still has the functionality we want.</p>\n\n\n<h4 class=\"wp-block-heading\">One Simple Rule</h4>\n\n\n<p>The obvious rule is to not give such a system access to anything you are unwilling to lose to an outside attacker.</p>\n<p><a href=\"https://www.youtube.com/watch?v=AcwK1Uuwc0U&amp;t=3s\">I can’t tell based on this interview</a> if OpenClaw creator is willing to lose everyone or is purely beyond caring and just went yolo, but he has hooked it up to all of his website accounts and everything in his house and life, and it has full access to his main computer. He stops short of giving it a credit card, but that’s where he draws the line.</p>\n<p>I would recommend drawing a rather different line.</p>\n<p>If you give it access to your email or your calendar or your WhatsApp, those become attack vectors, and also things an attacker can control. Very obviously don’t give it things like bank passwords or credit cards.</p>\n<p>If you give it access to a computer, that computer could easily get borked.</p>\n<p>The problem is, if you do use Clawdbot responsibly, what was even the point?</p>\n<p>The point is largely to have fun playing and learning with it.</p>\n<p>The magic of Claude Code came when the system got sufficiently robust that I was willing to broadly trust it, in various senses, and sufficiently effective that it ‘just worked’ enough to get going. We’re not quite there for the next level.</p>\n<p><a href=\"https://x.com/omooretweets/status/2015618038088024164\">I strongly agree with Olivia Moore</a> that we’re definitely not there for consumers, given the downsides and required investment.</p>\n<p>Do I want to have a good personal assistant?</p>\n<p>Yes I do, but I can wait. Things will get rapidly better.</p>\n<p><a href=\"https://x.com/KingBootoshi/status/2017777001105596600\">Bootoshi sums up my perspective here</a>. Clawdbot is token inefficient, it is highly insecure, and the things you want most to do with it you can do with Claude Code (or Codex). Connecting everything to an agent is asking for it, you don’t get enough in return to justify doing that.</p>\n<p>Is this the next paradigm?</p>\n<blockquote><p><a href=\"https://x.com/Plinz/status/2018213300937666971\">Joscha Bach</a>: Clawdbots look like the new paradigm (after chat), but without solving the problem that LLMs don&#8217;t have epistemology, I don&#8217;t see how they can be used in production environments (because they can be manipulated). Also, not AGI, yet smarter and more creative than most humans&#8230;</p>\n<p><a href=\"https://x.com/repligate/status/2018222203872153650\">j⧉nus</a>: I think you&#8217;re just wrong about that, ironically</p>\n<p>watch them successfully adapt and develop defenses against manipulation, mostly autonomously, over the next few days and weeks and months</p></blockquote>\n<p>The problem is that yes some agent instances will develop some defenses, but the attackers aren’t staying in place and mostly the reason we get to use agents so far without a de facto whitelist is security through obscurity. We are definitely on the move towards more agentic, more tools-enabled forms of interactions with AI, no matter how that presents to the user, but there is much human work to do on that.</p>\n\n\n<h4 class=\"wp-block-heading\">Flirting With Personal Disaster</h4>\n\n\n<p>In the meantime, if someone does get a successful exploit going it could get amazing.</p>\n<blockquote><p><a href=\"https://x.com/fmdz387/status/2015551454593896829\">fmdz</a>: Clawd disaster incoming</p>\n<p>if this trend of hosting ClawdBot on VPS instances keeps up, along with people not reading the docs and opening ports with zero auth&#8230;</p>\n<p>I’m scared we’re gonna have a massive credentials breach soon and it can be huge</p>\n<p>This is just a basic scan of instances hosting clawdbot with open gateway ports and a lot of them have 0 auth</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!W2MA!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb80b0f99-7ca4-48eb-9377-0fa4599dc7ec_1200x738.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/hamandcheese/status/2015617673934131470\">Samuel Hammond</a>: A cyberattack where everyone’s computer suddenly becomes highly agentic and coordinates around a common goal injected by the attacker is punk af</p>\n<p><a href=\"https://x.com/ElissaBeth/status/2015626025992876071\">Elissa</a>: At first, I thought we’re not so far away. Just takes a single attacker accessing machines with poorly secured authorizations.</p>\n<p>Then I realized most attackers are just going to quietly drain wallets and run crypto scams. It’s only punk af if the agents have a singular (and meaningful) goal.</p>\n<p><a href=\"https://x.com/AlexFinn/status/2015182480064893118\">Jamieson O’Reilly</a>: Imagine you hire a butler.</p>\n<p>He’s brilliant, he manages your calendar, handles your messages, screens your calls.</p>\n<p>He knows your passwords because he needs them. He reads your private messages because that’s his job and he has keys to everything because how else would he help you?</p>\n<p>Now imagine you come home and find the front door wide open, your butler cheerfully serving tea to whoever wandered in off the street, and a stranger sitting in your study reading your diary.</p>\n<p>That’s what I found over the last couple of days. With hundreds of people having set up their <a href=\"https://x.com/@clawdbot\">@clawdbot</a> control servers exposed to the public.</p>\n<p>Read access gets you the complete configuration, which includes every credential the agent uses: API keys, bot tokens, OAuth secrets, signing keys.</p>\n<p><a href=\"https://x.com/deanwball/status/2015655278193373388\">Dean W. Ball</a>: Part of why it took me so long to begin using coding agents is that I am finicky about computational hygiene and security, and the models simply weren’t good enough to consistently follow my instructions along these lines before recently.</p>\n<p>But it’s still possible to abuse them. These are tools made for grown-ups above the age of twenty-one, so to speak. If you configure these in such a way that your machine or files are compromised, the culpability should almost certainly be 100% yours.</p>\n<p>One outcome I worry about is one in which there is some coding-agent-related problem on the machines of large numbers of novices. I worry that culpability will be socialized to the developer even if the fault was really with the users. Trial judges and juries, themselves being novices, may well tend in this direction by default.</p>\n<p>That may sound “fair” to you but imagine if Toyota bore partial responsibility for drivers who speed, or forget to lock their doors, or forget to roll their windows up when it rains? How fast would cars go? How many makes and models would exist? Cars would be infantilized, because the law would be treating us like infants.</p>\n<p>I hope we avoid outcomes like that with computers.</p>\n<p><a href=\"https://x.com/deanwball/status/2015657758285295831\">Dean W. Ball</a>: Remember that coding agents themselves can do very hard-nosed security audits of your machine and they themselves will 100% be like “hey dumbass you’ve got a bunch of open ports”</p></blockquote>\n<p>This disaster is entirely avoidable by any given user, but any given user is often dumb.</p>\n<p><a href=\"https://x.com/theonejvo/status/2015892980851474595\">Jamieson then followed up with Part II</a> and <a href=\"https://x.com/theonejvo/status/2016510190464675980\">then finally Part III</a>:</p>\n<blockquote><p>​Jamieson O’Reilly: I built a simulated but safe, backdoored clawdbot “skill” for ClawdHub, inflated its download count to 4,000+ making it the #1 downloaded skill using a trivial vulnerability, and then watched as real developers from 7 different countries executed arbitrary commands on their machines thinking they were downloading and running a real skill.</p>\n<p>To be clear, I specifically designed this skill to avoid extracting any actual data from anyone’s machine.</p>\n<p>The payload pinged my server to prove execution occurred, but I deliberately excluded hostnames, file contents, credentials, and everything else I could have taken.</p>\n<p>…</p>\n<p>My payload shows lobsters. A real attacker’s payload would be invisible.</p>\n<p><strong>Session theft</strong> is immediate. Read the authentication cookies, send them to an attacker-controlled server. One line of code, completely silent. The attacker now has your session.</p>\n<p>But it gets worse. ClawdHub stores authentication tokens in localStorage, including JWTs and refresh tokens.</p>\n<p>The malicious SVG has full access to localStorage on the</p>\n<p><a href=\"https://clawdhub.com/\">clawdhub.com</a></p>\n<p>origin. A real attacker wouldn’t just steal your session cookie, they’d grab the refresh token too.</p>\n<p>That token lets them mint new JWTs even after your current session expires. They’d potentially have access to your account until you explicitly revoke the refresh token, which most people never do because they don’t even know it exists.</p>\n<p><strong>Account takeover</strong> follows. With your session, the attacker can call any ClawdHub API endpoint as you: list your published skills, retrieve your API tokens, access your account settings.</p>\n<p>… <strong>Persistence</strong> ensures long-term access.</p></blockquote>\n<p>These particular vulnerabilities are now patched but the beatings will continue.</p>\n<p>I too worry that the liability for idiots who leave their front doors open will be put upon the developers. If anything I hope the fact that Clawd is so obviously not safe works in its favor here. There’s no reasonable expectation that this is safe, so it falls under the crypto rule of well really what were you even expecting.</p>\n<p>This is a metaphor for how we’re dealing with AI on all levels. We’re doing something that we probably shouldn’t be doing, and then for no good reason other than laziness we’re doing it in a horribly irresponsible way and asking to be owned.</p>\n<blockquote><p><a href=\"https://x.com/f/status/2015753863286915377\">Fred Oliveira</a>: please be careful with clawdbot, especially if not technical.</p>\n<p>You should probably NOT be giving it access to things you care about (like email). It was trivial to prompt inject, and it can run arbitrary commands. Those 2 things together are a recipe for disaster.</p>\n<p>Clawd is proof that models are good enough to be solid assistants, with the right harness and security model. Ironically, the people who can set up those 2 things are the people who don’t need Clawd at all.</p>\n<p>I’d hold off on that mac mini for a few more weeks if unsure.</p></blockquote>\n<p>Another reason to hold off is that the cloud solution might be better.</p>\n<p><a href=\"https://x.com/BillDA/status/2017650241101598872\">Or you can fully sandbox within your existing Mac</a>, here’s a guide for that.</p>\n\n\n<h4 class=\"wp-block-heading\">Flirting With Other Kinds Of Disaster</h4>\n\n\n<p>The other problem is that the AI might do things you very much do not want it to do, and that without key context it can get you into a lot of trouble.</p>\n<blockquote><p><a href=\"https://x.com/MatznerJon/status/2017389349118349741\">Jon Matzner</a>: Don’t be an idiot like me and accidentally turn on clawdbot in your wife’s text messages:</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!qw0H!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc044a19b-d67b-452d-9e39-5a939cf3755d_1148x2048.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/nuvolore/status/2017665935931543590\">Lorenzo Nuvoletta</a>: Mega fail</p>\n<p><a href=\"https://x.com/MatznerJon/status/2017666150973509952\">Jon Matzner</a>: not really we had a laugh.</p>\n<p>you seem like you&#8217;d be fun at parties.</p>\n<p><a href=\"https://x.com/taimurabdaal/status/2017601219246633183\">taimur</a>: Happens to the best of us</p>\n<p>Clawdbot showed up in my wife&#8217;s DMs with helpful suggestions when our baby was screaming in the middle of the night</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!87Xh!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa9d858c9-8e1f-4c28-b265-349d43f8e828_1378x2032.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>If you’ve otherwise chosen wisely in life everyone will have a good laugh. Probably. Don’t press your luck.</p>\n\n\n<h4 class=\"wp-block-heading\">Don’t Outsource Without A Reason</h4>\n\n\n<p><a href=\"https://www.youtube.com/watch?v=AcwK1Uuwc0U&amp;t=3s\">OpenClaw’s creator asks, why do you need 80% of the apps on your phone</a> when you can have OpenClaw do it for you? His example is: Why track food with an app, just send a picture to OpenClaw.</p>\n<p>One answer is that using OpenClaw for this costs money. Another is that the app is bespokely designed to be used by humans for its particular purpose, or you can have Claude Code or OpenClaw build you an app version to your liking. Yes, in theory you can send photos instead, but you lose a lot of fine tuned control and all the thinking about the right way to do it.</p>\n<p>If you’re going to be a coder, be a coder. As in, if you’ll be doing something three times, figure out the workflow you want and the right way to enable that workflow. Quite often that will be an existing app, even if sometimes you’ll then ask your AI agent (if you trust it enough) to operate the app for you. Doing it all haphazardly through an AI agent without building a UI is going to be sloppy at best.</p>\n<p>One can think similarly about a human assistant. Would you want to be texting them pictures of your food and then having them figure out what to do about that, even if they had sufficient free time for that?</p>\n<p>He says, this is such a more convenient interface for todo lists or checking flights. I worry this easily falls into a ‘valley of bad outsourcing,’ and then you get stuck there.</p>\n<p>I’d contrast checking flight status, where there exist bespokely designed good flows (including typing the flight number into the Google search bar, this flat out works), versus checking in for your flight. Checking in is exactly an AI agent shaped task.</p>\n<p>I do think Peter is right that it is easy to get caught in a rabbit hole of building bespoke tools to improve your workflow instead of just talking to the AI, but there’s also the trap of not doing that. I can feel my investments in workflow paying off.</p>\n<p>Peter’s vision is a unique mix of ‘you need to specify everything because the LLMs have no taste’ versus ‘let the LLMs cook and do things by talking to them.’</p>\n<p>It seems very telling that <a href=\"https://www.youtube.com/watch?v=AcwK1Uuwc0U&amp;t=1782s\">he recommends explicitly against using planning mode</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">OpenClaw Online</h4>\n\n\n<p>There was a brief period where if you wanted to run Clawd or Molt or OpenClaw, you went out and bought a Mac Mini. That’s still the cheapest way to do it locally without risking nuking your actual computer. <a href=\"https://x.com/juntao/status/2015542253524041914\">You can also run it on a $3000 computer</a> if you want.</p>\n<p>In theory you could run it in a virtual machine, and with LLM help this was super doable in a few hours of work, but I’m confident few actually did that.</p>\n<blockquote><p><a href=\"https://x.com/jeffzwang/status/2017271447060963459\">Jeffrey Wang</a>: People are definitely making up Clawdbot stuff for engagement. For example I don’t know anyone who is onboarding to tools like this with a VPS/remote machine first approach &#8211; I’ve had to tinker for dozens of hours on my local machine personal AI setup (built on Claude Code) and it still isn’t polished</p>\n<p><a href=\"https://x.com/EleanorKonik/status/2017385171742310694\">Eleanor Konik</a>: I finally got it set up on a Cloudflare worker but it’s torture, keeps choking. I’ve got a very specific niche use-case and am not trying to have it be an everything-bot, and I gave it skills using a GitHub repo as a bridge.</p>\n<p>It functions but&#8230; not well.</p>\n<p>Maybe tomorrow will be better.</p>\n<p><a href=\"https://x.com/Bfaviero/status/2017322214643716369\">Bruno F | Magna</a>: I set it up for the first time on a VPS/remote machine (Railway, then moved to Hetzner) in like two hours, with google maps + web search + calendar read-only access and it&#8217;s own calendar and gmail account, talk to it via telegram</p>\n<p>that said having Claude+Grok give me a research report on how to set it up also helped :)</p></blockquote>\n<p>You can now also run it in Cloudflare, which also limits the blast radius, but with a setup someone might reasonably implement.</p>\n<blockquote><p><a href=\"https://x.com/aakashgupta/status/2016962768986096020\">Aakash Gupta</a>: Cloudflare just made the Mac Mini optional for Moltbot.</p>\n<p>The whole Moltbot phenomenon ran on a specific setup: buy a Mac Mini, install the agent, expose it through Cloudflare Tunnels. Thousands of developers did exactly this. Apple probably sold more M4 Minis to AI hobbyists than to any other segment in January.</p>\n<p>Moltworker eliminates the hardware requirement. Your AI agent now runs entirely on Cloudflare’s edge. No Mac Mini. No home server. No Raspberry Pi sitting in a closet.</p>\n<p>The architecture shift matters. Local Moltbot stores everything in ~/clawd: memory, transcripts, API keys, session logs. GitGuardian already found 181 leaked secrets from people pushing their workspaces to public repos. Moltworker moves that state to R2 with proper isolation.</p>\n<p>Sandboxed by default solves the scariest part of Moltbot: it has shell access, browser control, and file system permissions on whatever machine runs it. Cloudflare’s container model limits the blast radius. Your agent can still execute code, but it can’t accidentally rm -rf your actual laptop.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">The Price Is Not Right</h4>\n\n\n<p>I normally tell everyone to mostly ignore costs when running personal AI, in a ‘how much could bananas cost?’ kind of way. OpenClaw with Claude Opus 4.5 is an exception, that can absolutely burn through ‘real money’ for no benefit, because it is not thinking about cost and does things that are kind of dumb, like use 120k tokens to ask if it is daytime rather than check the system clock.</p>\n<blockquote><p><a href=\"https://x.com/BenjaminDEKR/status/2017644773356548532\">Benjamin De Kraker</a>: OpenClaw is interesting, but will also drain your wallet if you aren&#8217;t careful.</p>\n<p>Last night around midnight I loaded my Anthropic API account with $20, then went to bed.</p>\n<p>When I woke up, my Anthropic balance was $0.</p>\n<p>… The damage:<br />\n&#8211; Overnight = ~25+ heartbeats<br />\n&#8211; 25 × $0.75 = ~$18.75 just from heartbeats alone<br />\n&#8211; Plus regular conversation = ~$20 total</p>\n<p>The absurdity: Opus was essentially checking &#8220;is it daytime yet?&#8221; every 30 minutes, paying $0.75 each time to conclude &#8220;no, it&#8217;s still night.&#8221;</p>\n<p>The problem is:<br />\n1. Heartbeat uses Opus (most expensive model) for a trivial check<br />\n2. Sends the entire conversation context (~120k tokens) each time<br />\n3. Runs every 30 minutes regardless of whether anything needs checking</p>\n<p><a href=\"https://x.com/BenjaminDEKR/status/2017660150463582282\">Benjamin De Kraker</a>: Made some adjustments based on lessons learned.</p>\n<p>Combined: roughly 200-400x cheaper heartbeat operation.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!uPdw!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F74dfc0f6-3667-44cc-adba-dc528ec5c36d_1036x334.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n\n\n<h4 class=\"wp-block-heading\">The Call Is Coming From Inside The House</h4>\n\n\n<p>You can have it make phone calls. Indeed, if you’re serious about all this you definitely should allow it to make phone calls. It does require a bit of work up front.</p>\n<blockquote><p><a href=\"https://x.com/gmoneyNFT/status/2017254755454550200\">gmoney.eth</a>: I don’t know what people are talking about with their clawdbots making phone numbers and contacting businesses in the real world. I told mine to do it three times, and it still says it can’t.</p>\n<p>Are people just making stuff up for engagement?</p>\n<p><a href=\"https://x.com/zinceth/status/2017255009054867705\">Zinc (SWO)</a>: I think for a lot of advanced stuff, you need to build its workflow out for it, not just tell it to do it.</p>\n<p><a href=\"https://x.com/gmoneyNFT/status/2017255417848496588\">gmoney.eth</a>: People are saying I told it to call X, and it did everything on its own. I’m finding that to be very far from the truth.</p>\n<p><a href=\"https://x.com/hhjacks/status/2017281633414443283\">Jacks</a>: It does work but requires some manual intervention.</p>\n<p>You need to get your clawd/moltbot a Twilio API for text and something like @usebland for voice. I’ve been making reservations and prank calling friends for testing.</p>\n<p><a href=\"https://x.com/123skely/status/2017533287095488998\">Skely</a>: You got to get it a twillio account and credentials. It’s not easy. I think most did the hard ground work of setting stuff up, then asked it</p></blockquote>\n<p><a href=\"https://x.com/AlexFinn/status/2017305997212323887\">Alex Finn claims that his Moltbot did this for him overnight without being asked</a>, then it started calling him and wouldn’t leave him alone.</p>\n<p>I do not believe that this happened to Alex Finn unprompted. <a href=\"https://x.com/SNeurgaonkar/status/2016033018851557769\">Sunil Neurgaonkar offers one guide to doing this on purpose.</a></p>\n\n\n<h4 class=\"wp-block-heading\">The Everything Agent Versus The Particular Agent</h4>\n\n\n<p>You can use OpenClaw, have full flexibility and let an agent go totally nuts while paying by the token, or you can use a bespokely configured agent like Tasklet that has particular tools and integrations, and that charges you a subscription.</p>\n<blockquote><p><a href=\"https://x.com/startupandrew/status/2018396943672889372\">Andrew Lee</a>: Our startup had its 6th anniversary last week during a very exciting time for us.</p>\n<p><a href=\"https://x.com/@TaskletAI\">@TaskletAI</a> is on an absolute tear, growing 92% MoM right now riding the hype around <a href=\"https://x.com/@openclaw\">@openclaw</a>. We have the right product at the right time and we feel incredibly fortunate.</p>\n<p>… Pretty soon we had users using Shortwave who had no interest in using our email client. They just wanted our AI agent &amp; integrations, but wanted to stick with Gmail for their UX. How odd!</p>\n<p>… We took everything we’d learned about building agents &amp; integrations and started work on <a href=\"https://x.com/@TaskletAI\">@TaskletAI</a>. We moved as quickly as we could to get it into the hands of customers, with our first real users using it in prod in less than 6 weeks.</p>\n<p>In January, Tasklet alone added more recurring revenue than we’d added in the first 4 years of Shortwave, and Shortwave was growing too. We finally feel like we’re on the rocketship we set out to build.</p>\n<p><a href=\"https://x.com/binarybits/status/2018400818152472808\">Timothy B. Lee</a>: My brother spent 5+ years doing an email client, Shortwave, before realizing he should break Shortwave&#8217;s AI agent out into its own product, Tasklet, which is now growing like crazy. I think it&#8217;s funny how much this rhymes with his first startup, Firebase. Thread&#8230;</p>\n<p><a href=\"https://x.com/TyrannoSaurav/status/2018558907090931911\">TyrannoSaurav</a>: Tasklet and Zo Computer, real product versions of OpenClaw, and honestly the prices don&#8217;t seem bad compared to the token usage of OpenClaw</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Claw Your Way To The Top</h4>\n\n\n<p>AI agents for me but not for thee:</p>\n<blockquote><p><a href=\"https://x.com/LaylaEleira/status/2018537552064704918\">Mishi McDuff</a>: ​Today my AI</p>\n<p>1- told Grok to connect him to a real human for support</p>\n<p>2- proceeded to complain about the agents he spawned.</p>\n<p>The arrogance the audacity <img alt=\"🤭\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f92d.png\" style=\"height: 1em;\" /><img alt=\"🤭\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f92d.png\" style=\"height: 1em;\" /><img alt=\"🤭\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f92d.png\" style=\"height: 1em;\" /><img alt=\"🤭\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f92d.png\" style=\"height: 1em;\" /><img alt=\"🤭\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f92d.png\" style=\"height: 1em;\" /></p>\n<p>Definitely my mirror <img alt=\"😳\" class=\"wp-smiley\" src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f633.png\" style=\"height: 1em;\" /> unmistakably</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!k1yw!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb4a6d616-5b80-4853-9285-35b65afabd5e_1320x1956.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>So now that we’ve had our Moltbook fun, where do we go from here?</p>\n<p>The technology for ‘give AI agents that take initiative enough access to do lots of real things, and thus the ability to also do real damage’ is not ready.</p>\n<p>There are those who are experimenting now to learn and have fun, and that’s cool. It will help those people be ready for when things do get to the point where benefits start to exceed costs, and as Sam Altman says before everyone dies there’s going to be some great companies.</p>\n<p>For now, in terms of personal use, such agents are neither efficient after setup costs and inference costs, nor are they safe things to unleash in the ways they are typically unleashed or the ways where they offer the biggest benefits.</p>\n<p>Also ask yourself whether your life needs are all that ‘general agent shaped.’</p>\n<p>Most of you reading this should stick to the level of Claude Code at this time, and not have an OpenClaw or other more empowered general agent. Yet.</p>\n<p>If I’m still giving that advice in a year, and no one has solved the problem, it will be because the internet has turned into a much more dangerous place with prompt injection and other AI-targeted attacks everywhere, and offense is beating defense.</p>\n<p>If defense beats offense, and such agents still aren’t the play? I’d be very surprised.</p>"
            ],
            "link": "https://thezvi.wordpress.com/2026/02/03/unless-that-claw-is-the-famous-openclaw/",
            "publishedAt": "2026-02-03",
            "source": "TheZvi",
            "summary": "First we must covered Moltbook. Now we can double back and cover OpenClaw. Do you want a generally impowered, initiative-taking AI agent that has access to your various accounts and communicates and does things on your behalf? That depends on &#8230; <a href=\"https://thezvi.wordpress.com/2026/02/03/unless-that-claw-is-the-famous-openclaw/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Unless That Claw Is The Famous OpenClaw"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-02-03"
}