{
    "articles": [
        {
            "content": [
                "<header>\n  <h1>CI In a Box</h1>\n  <time class=\"meta\" datetime=\"2026-02-06\">Feb 6, 2026</time>\n</header>\n<p>I wrote <a href=\"https://matklad.github.io/2026/01/20/vibecoding-2.html\"><code>box</code></a>, a thin wrapper around ssh\nfor running commands on remote machines. I want a box-shaped interface for CI:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">const</span> repository = <span class=\"hl-string\">&quot;git@forge.com/me/my-project&quot;</span>;</span>\n<span class=\"line\"><span class=\"hl-keyword\">const</span> commit_sha = <span class=\"hl-title class_\">Deno</span>.<span class=\"hl-property\">env</span>[<span class=\"hl-string\">&quot;COMMIT&quot;</span>];</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">const</span> runners = <span class=\"hl-keyword\">await</span> <span class=\"hl-title class_\">Promise</span>.<span class=\"hl-title function_\">all</span>(</span>\n<span class=\"line\">    [<span class=\"hl-string\">&quot;windows-latest&quot;</span>, <span class=\"hl-string\">&quot;mac-latest&quot;</span>, <span class=\"hl-string\">&quot;linux-latest&quot;</span>]</span>\n<span class=\"line\">        .<span class=\"hl-title function_\">map</span>(<span class=\"hl-function\">(<span class=\"hl-params\">os</span>) =&gt;</span> $<span class=\"hl-string\">`box create <span class=\"hl-subst\">${os}</span>`</span>)</span>\n<span class=\"line\">);</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">await</span> <span class=\"hl-title class_\">Promise</span>.<span class=\"hl-title function_\">all</span>(runners.<span class=\"hl-title function_\">map</span>(<span class=\"hl-keyword\">async</span> ($runner) =&gt; {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        git clone <span class=\"hl-subst\">${repository}</span> .`</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        git switch --detach <span class=\"hl-subst\">${commit_sha}</span>`</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        ./zig/download.ps1`</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        ./zig/zig build test`</span>;</span>\n<span class=\"line\">}));</span></code></pre>\n\n</figure>\n<p>That is, the controlling CI machine runs a user-supplied script, whose status code will be the\nultimate result of a CI run. The script doesn’t run the project’s tests directly. Instead, it shells out\nto a proxy binary that forwards the command to a runner box with whichever OS, CPU, and other\nenvironment required.</p>\n<p>The hard problems are in the\n<span class=\"display\"><code>[\"windows-latest\", \"mac-latest\", \"linux-latest\"]</code></span>\npart:</p>\n<ul>\n<li>\nOne of them is not UNIX.\n</li>\n<li>\nOne of them has licensing&amp;hardware constraints that make per-minute billed VMs tricky (but not\nimpossible, as GitHub Actions does that).\n</li>\n<li>\nAll of them are moving targets, and require <em>someone</em> to do the OS upgrade work, which\n<a href=\"https://www.azabani.com/2025/12/18/shoestring-web-engine-ci.html#:~:text=have%20to%20be-,done%20by%20hand,-.%20And%20this%20is\">might involve pointing and clicking</a>.\n</li>\n</ul>\n<p>CI discourse amuses me — everyone complains about bad YAML, and it <em>is</em> bad, but most of the\nYAML (and associated reproducibility and debugging problems) is avoidable. Pick an appropriate\nposition on a dial that includes</p>\n<ul>\n<li>\nwriting a bash script,\n</li>\n<li>\nwriting a script\n<a href=\"https://www.teamten.com/lawrence/writings/java-for-everything.html\">in the language you already use</a>,\n</li>\n<li>\nusing a\n<a href=\"https://neugierig.org/software/blog/2026/01/smallest-build-system.html\">small build system</a>,\n</li>\n<li>\nusing a medium-sized one like <code>make</code> or <code>zig build</code>, or\n</li>\n<li>\nusing a large one like <code>nix</code> or <code>buck2</code>.\n</li>\n</ul>\n<p>What you can’t just do by writing a smidgen of text is getting the heterogeneous fleet of runners.\nAnd you need heterogeneous fleet of runners if some of the software you are building is\ncross-platform.</p>\n<hr />\n<p>If you go that way, be mindful that</p>\n\n<figure class=\"blockquote\">\n<blockquote><p>The SSH wire protocol only takes a single string as the command, with the expectation that it\nshould be passed to a shell by the remote end.</p>\n</blockquote>\n<figcaption><cite><a href=\"https://www.chiark.greenend.org.uk/~cjwatson/blog/ssh-quoting.html\">Colin Watson on SSH quoting</a></cite></figcaption>\n</figure>\n<p>In other words, while SSH supports syntax like\n<span class=\"display\"><code>ssh $HOST cmd arg1 arg2</code>,</span>\nit just blindly intersperses all arguments with a space. Amusing to think that our entire cloud\ninfrastructure is built on top of <a href=\"https://matklad.github.io/2021/07/30/shell-injection.html\">shell injection</a>!</p>\n<p>This, and the need to ensure no processes are left behind unintentionally after executing a remote\ncommand, means that you can’t “just” use SSH here if you are building something solid.</p>"
            ],
            "link": "https://matklad.github.io/2026/02/06/ci-in-a-box.html",
            "publishedAt": "2026-02-06",
            "source": "Alex Kladov",
            "summary": "I wrote box, a thin wrapper around ssh for running commands on remote machines. I want a box-shaped interface for CI:",
            "title": "CI In a Box"
        },
        {
            "content": [
                "<img alt=\"Fraud Investigation is Believing Your Lying Eyes\" src=\"https://www.bitsaboutmoney.com/content/images/2026/02/order-and-chaos-in-focus.png\" /><p>There was recently an attempt by an independent journalist to expose fraud in a Minnesota social program. It was deeply frustrating; the journalist had notably poor epistemic standards, which secondary media <a href=\"https://www.npr.org/2025/12/31/nx-s1-5662600/nick-shirley-minnesota-daycare-fraud\">seized upon</a> to dismiss their result.</p><p>The class-based sniffing almost invariably noted that prestige media had already <a href=\"https://www.nytimes.com/2025/11/29/us/fraud-minnesota-somali.html\">reported</a> stories which rhymed with the core allegation, while sometimes implying that makes the allegations less likely to be true, through a logical pathway which is mysterious to me.</p><p>The journalism went quite viral anyway, in part because of sensationalized framing, in part because of signal boosting by an aligned media ecosystem and aligned politicians, and in part because the journalism develops one bit of evidence that has a viscerality that paperwork dives often lack: these purported childcare operations routinely <em>have no children in them</em>.</p><p>Fraud has become quite politicized in the United States the last few years. We had a poorly-calibrated federal initiative led by a charismatic tech entrepreneur which believed it would unearth trillions of dollars of fraud that focused substantial effort on large programs which are comparatively fraud-resistant. Across the aisle, we have reflexive dismissal that fraud happens in social programs, which functions as air cover for <a href=\"https://www.startribune.com/federal-prosecutors-charge-six-more-people-in-staggering-social-services-fraud-scandal/601548801\">scaled criminal operations</a> which loot many <a href=\"https://medium.com/@marginaliant/a-third-of-my-online-college-students-are-ai-powered-spambots-now-what-91c6e34b5d11\">varied social programs</a> [0] and are sometimes <a href=\"https://www.sba.gov/document/report-22-17-covid-19-economic-injury-disaster-loan-applications-submitted-foreign-ip-addresses\">run out of geopolitical adversaries</a> of the U.S. including by <a href=\"https://www.cbsnews.com/news/fraud-us-government-theft-60-minutes/\">ambiguously-retired members of their clandestine services</a>.</p><p>I worked in the financial industry for a few years. We do not have the luxury of pretending that fraud is something invented by our rivals to besmirch our good name. It hits the P&amp;L every quarter and will eat you alive if you&#x2019;re not at least minimally competent in dealing with it. Conversely, it is well-understood in industry that the <a href=\"https://www.bitsaboutmoney.com/archive/optimal-amount-of-fraud/\">optimal amount of fraud is not zero</a>.</p><p>The financial industry has paid at least tens of billions of dollars in tuition here. Overwhelmingly, one learns about fraud in it through an apprenticeship model, with different firms having different internal levels of understanding on the shape of the elephant. The industrial organization presumes small numbers of people architecting anti-fraud systems and relatively larger numbers of investigators and analysts operating those systems on a day-to-day basis.</p><p>There does exist some informal knowledge sharing between firms. If you work in payments, try getting invited to the Chatham House rule sessions held by&#x2026; oh yeah, can&#x2019;t say. Despite that social technology being originally developed for the benefit of government and press actors, it is my general impression that U.S. benefits programs don&#x2019;t yet see themselves as sufficiently yoked by adversarial attention to benefit from their own Chatham House series. Perhaps that should change.</p><p>And so, for the benefit of fraud investigators with badges, press cards, or GoPros, some observations from a community of practice with an extensive (and mostly nonpublic) body of work. But first a tiny bit of throat clearing.</p><h2 id=\"in-which-we-briefly-return-to-minnesota\">In which we briefly return to Minnesota</h2><p>Minnesota has suffered a decade-long campaign of industrial-scale fraud against several social programs. This is beyond intellectually serious dispute. The <a href=\"https://www.auditor.leg.state.mn.us/sreview/ccap.pdf\"><em>2019</em> report from the Office of the Legislative Auditor</a> (a non-partisan government body) makes for gripping reading. The scale of fraud documented and separately alleged in it staggers the imagination: the state&#x2019;s own investigators believed that, over the past several years, <em>greater than fifty percent of all reimbursements to daycare centers</em> were fraudulent. (Separate officials took the&#x2026; novel position that they were only required to recognize fraud had happened after securing a criminal conviction for it. Since they had only secured a few criminal convictions, there was <em>no way</em> that fraud was that high. Asked to put a number on it, repeatedly, they declined.)</p><p>The investigators allege repeatedly visiting daycare centers which did not, factually, have children physically present at the facility despite reimbursement paperwork identifying specific children being present at that specific time. The investigators demonstrated these lies on timestamped video, and perhaps in another life would have been YouTube stars.</p><p>Our social class is intensely averse to straightforwardly recounting these facts, partly due to political valence and partly due to this particular fraud being dominantly conducted within a community which codes as disadvantaged in the U.S. sociopolitical context.</p><p>Fraudsters are liars and will cheerfully mouth any words they believe will absolve them of their crimes. If an accusation of racism gets one a free pass to steal hundreds of millions of dollars, they will <a href=\"https://media.kalzumeus.com/bam/fraud-investigator/pacer-feeding-our-future.pdf\">speciously sue you alleging racial discrimination</a>. That empirically <em>worked</em> in Minnesota. The OLA takes explicit notice of this multiple times, a coordinator for the fraud operation is <a href=\"https://www.cbsnews.com/news/aimee-bock-minnesota-fraud-feeding-our-future-interview/\">on record explicitly explaining the strategic logic of accusations of racism</a>, and a judge was even moved to make <a href=\"https://mncourts.gov/about-the-courts/newsandannouncements/feeding-our-future-v-minnesota-department-of-education-correcting-media-reports-and-statements-by-governor-tim-walz-concerning-orders-issued-by-the-court\">an extraordinary statement</a> to clarify that the bad-faith lawsuit alleging racism did not achieve success<em> through the formal judicial process</em> but rather through the voluntary compliance of governmental actors shamed by its allegations.</p><p>(As a sidenote: one has to be able to hold two thoughts simultaneously about fraudulent operations. They can be sophisticated with respect to exploiting sociopolitical cleavages in their targets while also being comically inept at faking evidence elsewhere, such as having a single person write dozens of adjacent rows in a sign-in sheet. This routinely surprises observers and <em>it should not surprise them</em>. The financial industry <em>also</em> has a division of labor in it. The person architecting the fraud department&#x2019;s standard processes is well-paid, well-educated, and routinely brings crossdisciplinary expertise to bear. A Fraud Analyst I, on the other hand, bears a lot of similarity to a call center employee in terms of compensation, education, and permitted amounts of agency.)</p><p>In the immediate wake of the independent journalist&#x2019;s report, the great and the good rallied around the organizations he accused. Of course it was natural that journalists wouldn&#x2019;t get immediate access to children if they asked. Of course there was a certain amount of informality in the sector. Of course, as the New York Times <a href=\"https://www.nytimes.com/2026/02/03/us/nick-shirley-san-diego.html\">very carefully wordsmithed recently</a>:</p><p><em>Minnesota officials said in early January that the state conducted compliance checks at nine child-care centers after Mr. Shirley posted his video and found them &#x201c;operating as expected,&#x201d; although it had &#x201c;ongoing investigations&#x201d; at four of them. One of the centers, which Mr. Shirley singled out because it misspelled the word &#x201c;Learning&#x201d; on its sign, has since voluntarily closed.</em></p><p>An inattentive reader might conclude from this paragraph that the Times disputes Shirley&#x2019;s reporting.</p><p>To the extent that Bits about Money has an editorial line on that controversy, it is this: if you fish in a pond known to have 50% blue fish, and pull out nine fish, you will appear to be a savant-like catcher of blue fish, and people claiming that it is unlikely you have identified a blue fish will swiftly be made to look like fools. But the interesting bit of the observation is, almost entirely, the base rate of the pond. And I think journalism and civil society should do some genuine soul-searching on how we knew&#x2014;<em>knew</em>&#x2014;the state of that pond, but didn&#x2019;t consider it particularly <em>important</em> or <em>newsworthy</em> until someone started fishing on camera.</p><p>But this is not a publication about particular ponds. It is a publication about getting better at fishing.</p><h2 id=\"common-signals-methods-and-epiphenomena-of-fraud\">Common signals, methods, and epiphenomena of fraud</h2><p></p><h3 id=\"fraudsters-are-playing-an-iterated-game\">Fraudsters are playing an iterated game</h3><p>The best non-fiction work on fraud is Dan Davies&#x2019; <a href=\"https://www.amazon.com/Lying-Money-Legendary-Frauds-Working/dp/1982114932\">Lying for Money</a>. In it, you&#x2019;ll find replete examples of something well-known to fraud investigators: the dominant next adventure for a former fraudster is&#x2026; opening up a new fraud. And therefore, if you want to identify a ridiculously-high-hit-rate list of frauds in round N+1 of a game, a so-easy-its-practically-cheating way to do so is to look at what known fraudsters from round N are doing today.</p><p>There is a genuine difference in the culture and epistemology of the financial industry versus the government of the United States here. In the financial industry, we keep <a href=\"https://developer.mastercard.com/product/match/\">blacklists</a> and getting a second chance after obvious misbehavior is intentionally non-trivial. This runs against deeply felt values of civil servants. An accusation is not a conviction, and absent clear authority to impose consequences in a new program, an actor <em>convicted at enormous societal cost</em> emerges to a new program officer as tabula rasa, equal in moral worth to any randomly chosen citizen.</p><p>I will not argue that Mastercard has better moral intuitions than the Founding Fathers. I would, however, happily suggest that the government not assume that the Constitution contains emanating penumbras obligating it to be repeatedly taken advantage of by the same people in the same fashion. We are not forbidden object permanence.</p><p>Minnesota raided the Sunshine Child Care Center in 2022 on suspicion of overbilling. <a href=\"https://www.kare11.com/article/news/investigations/fraud/past-failed-day-care-fraud-investigations-investigators-say-dhs-refused-to-fully-help/89-6f828871-cbd6-49cd-aa3e-1f373639d9dd\">No charges were brought</a>, in what investigators imply was less an exoneration and more an inter-departmental fumble. That operation was owned by one Fowsiya Hassan. A separate childcare center owned by Fowsiya Hassan was featured on YouTube recently. This follows on<a href=\"http://startribune.com/day-care-fraud-minnesota-video/601554760\"> $1.5 million of funds received through Feeding Our Future</a>, a <a href=\"https://www.justice.gov/usao-mn/pr/federal-jury-finds-feeding-our-future-mastermind-and-co-defendant-guilty-250-million\">scaled fraud operation</a> which has generated over <a href=\"https://en.wikipedia.org/wiki/Feeding_Our_Future\">70 indictments, 5 criminal convictions, and 50 guilty pleas</a>. What a set of coincidences. Perhaps Hassan has, as she has <a href=\"https://media.kalzumeus.com/bam/fraud-investigator/hassan-complaint-vs-walz.pdf\">alleged in a lawsuit</a>, been a frequent target of racially-motivated government investigations into a successful serial entrepreneur in the childcare field.</p><h3 id=\"the-fraud-supply-chain-is-detectable\">The fraud supply chain is detectable</h3><p>Much of the intellectual energy in policy circles about fraud is aimed at retail-level fraud by individual beneficiaries. Most fraud, like most scaled property crime, is actually the result of a business process.</p><p>This is an elementary fact of capitalism. It is deeply disconcerting to find every benefits program independently rediscovers it a decade too late to do anything about it. Most bread is not baked by amateurs in their kitchens. It comes from <em>a bakery </em>which <em>exists to bake bread </em>and hires <em>specialists in baking bread</em> and then supports them with <em>capital-intensive built infrastructure</em>.</p><p>Fraud develops <a href=\"https://www.bitsaboutmoney.com/archive/the-fraud-supply-chain/\">a supply chain</a>. Some elements in the supply chain are dual-use; the bad guys use Excel for the same reason every business uses Excel. Some elements in the supply chain, though, are specialized infrastructure with no or de minimis legitimate purpose. <em>Those elements can be profiled</em>.</p><p>I worked at Stripe for several years and am currently an advisor there. Stripe does not endorse what I write in my personal spaces. In its own spaces, Stripe has discussed being able to follow fraudulent operations in sufficient detail to determine <a href=\"https://stripe.com/annual-updates/2024\">when the operators went to lunch</a>.</p><p>Fraudsters share specialists quite frequently. They use the same incorporation agents, the same mail services, the same CPAs, the same lawyers, etc.</p><p>You can make the same observation about many communities of practice. It is a non-coincidence that many tech startups are at 548 Market Street in San Francisco. 548 Market Street is not the world&#x2019;s hippest coworking space. It is the address for <a href=\"https://www.earthclassmail.com\">EarthClassMail</a> in SF. There are many P.O. box providers in the world; many geeks with taste reach for ECM. (Bits about Money is <a href=\"https://www.fcc.gov/general/can-spam\">legally required</a> to maintain a postal address and, if you were ever to send it a physical letter, that would also end up in the hands of an EarthClassMail employee.)</p><p>Elsewhere in the world, there exist P.O. box providers whose customers statistically include fewer AI labs and more frauds. One imagines the specialist-in-fraud at the storefront, picking up the day&#x2019;s take from fifteen separate boxes.</p><p>Elementary work graphing supporting infrastructure, even on something as unsophisticated as <a href=\"https://x.com/patio11/status/1886922461918248987?s=20\">butcher paper</a>, frequently unravels fraud networks. Data science has any number of more sophisticated approaches. Jetson Leder-Luis, an academic who now routinely works with the government, has <a href=\"https://www.complexsystemspodcast.com/episodes/defrauding-government-jetson-leder-luis/\">previously discussed</a> some approaches which work based on widely commercially available data sources.</p><p>There is an emerging defender&#x2019;s advantage here in the age of LLMs, since exploratory work in visualizing and walking network graphs is getting much cheaper. You no longer need to buy Palantir and engage a &#x201c;forward-deployed engineer&#x201d; to cluster IP addresses. A non-technical fraud investigator could get an LLM to do that while eating at Chipotle, and the lunch would cost more.</p><p>This democratization of capabilities is relevant to journalists, formal and otherwise, and also to governments. RFPs and software contracting once de facto mandated a multi-year lead time to do an automated network analysis if an analyst thought perhaps their program might need one. Now that is an afternoon&#x2019;s work, if we allow ourselves to do it. We should.</p><h3 id=\"investigators-should-expect-to-find-ethnically-clustered-fraud\">Investigators should expect to find ethnically-clustered fraud</h3><p>As mentioned, there is enormous visceral distaste for the conclusion that a particular fraud ring operates within a particular community. This is quite common. You should expect to find circumstances which rhyme with it when conducting effective fraud investigations. You should not abandon fraud investigation when you chance upon this.</p><p>People assume a level of ethical fraughtness here which is not warranted. You would, if doing ethnographic work on perfectly legitimate businesses across industries, routinely discover ethnic concentration rather than population-level representation everywhere you looked. The <a href=\"https://www.amazon.com/Life-Behind-Lobby-Indian-American/dp/0804778833\">Patels run the motels</a>. One doesn&#x2019;t need to adopt grand theories about how certain groups are predisposed to becoming pharmacists or startup employees or line cooks; simple microeconomic reasoning explains reality easily. Firms hire the people they already know, like, and trust. That will routinely include friends and family, who are going to be much more like the founding team than they are like randomly drawn members of the population. This is <em>the default outcome</em>.</p><p>Fraudsters do have one structural factor here. Everyone wants to trust their coworkers. Fraudsters need to trust their coworkers will be loyal <em>even upon threat of prison time</em>. That necessarily selects for tighter bonds than the typical workplace. Madoff was a family affair, SBF was in an on-again off-again romantic relationship with a chief lieutenant, and neither of those facts is accidental or incidental.</p><p>That&#x2019;s the other ethical dimension of being other-than-blind to concentration: so-called <a href=\"https://www.sec.gov/about/reports-publications/investorpubsaffinity\">affinity frauds</a> do not merely recruit <em>fraudsters</em> from affinity groups. They recruit <em>victims</em> from affinity groups. Madoff mobilized the social infrastructure of the Jewish community in New York and Palm Beach to find his marks. Community members certainly did not <em>intend</em> their charitable foundations to be looted by a fraudster. It was an emergent consequence of trust networks.</p><p>This also happens to &#x201c;chosen&#x201d; communities. FTX was, in material part, an affinity fraud against effective altruists, who are not a religion or ethnic group as traditionally construed.</p><p>And so when the great and the good turn a blind eye towards abuses because the perpetrators share an uncomfortable common factor, they are often simultaneously turning a blind eye towards abuses <em>of a community whose interests they purport to champion</em>.</p><h3 id=\"high-growth-rate-opportunities-attract-frauds\">High growth rate opportunities attract frauds</h3><p>As covered extensively in Lying for Money, the necessary fundamental conceit of a fraud is growth in a business that doesn&#x2019;t happen in the real world. &#x201c;Every lie told incurs a debt to the truth, and one day, that debt will be paid&#x201d;, to quote the excellent drama mini-series Chernobyl. Fraudsters forestall that day of reckoning by telling a bigger lie, increasing the debt, which (mostly as a side effect) alleges that they&#x2019;re growing much faster than most of your legitimate portfolio. Happily, many businesses have figured out how to keep track of fast-growing customers. Tracking rocketships doesn&#x2019;t require rocket science.</p><p>Sort-by-growth-rate-descending on new accounts will turn up a lot of interesting observations about the world. One is that Fortune 500 companies sometimes open new accounts, and you probably don&#x2019;t need to open a fraud investigation file in that case. Another is that some people claim to be feeding millions of meals to a community of tens of thousands of people, beginning from a standing start, and growing local social services at a rate which an Uber Eats city manager would not expect to achieve in the wildest dreams of their go-to-market plan.</p><p>Feeding Our Future had a CAGR of 578% sustained for 2 years. Uber, during their meteoric growth period in core rideshare services, had an average CAGR of 226%. Their <em>best year </em>was 369%. But, if you asked in Minneapolis in 2021, you&#x2019;d quickly find someone who had been in an Uber, but fail to find anyone who ate courtesy of Feeding Our Future. So curious, given that they were drubbing one of the fastest growing companies in history on growth rate.</p><p>Investigators in Minnesota were ringing the alarm bells for years about implausibly fast growth in Feeding Our Future&#x2019;s reimbursement requests, including at new facilities. Feeding Our Future felt it was maxed out on the fraud it could conduct at existing sites, and expanded voraciously, including (most prominently) enrolling numerous restaurants as &#x201c;feeding sites.&#x201d; They then copy/pasted the usual playbook and requested reimbursement for implausible volumes at those sites, paying kickbacks to many participants. This then required growing the fraud, which&#x2026; you get the general idea. We could have gotten off the bus at many points, and I suppose that is at some level a question of political will.</p><p>The highest growth rates in the economy generally are newer fields (you basically can&#x2019;t sustain the alternative). This doesn&#x2019;t imply that those fields are fraudulent, but they will tend to <em>disproportionately attract frauds</em>. The defenders in those fields have not yet paid their tuition to the School of Hard Knocks, and so attackers target the weaker systems. The higher growth rates of legitimate businesses function as protective cover for high stated growth rates of illegitimate businesses; a CAGR of 1,000% looks implausible for a restaurant but barely-meets-expectations for an AI software shop.</p><p>And, not to put too fine a point on it, many people are invested, literally and metaphorically, in whatever today&#x2019;s new hotness is. People who could not secure an allocation in the more legitimate ends of it will sometimes find themselves adversarially selected by less salubrious actors. This will read to those people as a <em>justly earned success</em>. They might even have their marketing department <a href=\"https://web.archive.org/web/20221109025610/https:/www.sequoiacap.com/article/sam-bankman-fried-spotlight/\">write up their victimization</a> as <a href=\"https://www.sba.gov/article/2020/jul/06/sba-treasury-announce-release-paycheck-protection-program-loan-data\">an indisputable success</a>.</p><p>And so, if you&#x2019;re a defender who has many different lines of business and has limited resources (or political will), where should you deploy those resources? Should you place your bets on e.g. Social Security, a multi-trillion dollar program whose primary source of growth is fun to conjure but then requires 70 years of seasoning? Or should you place them on the <a href=\"https://www.gao.gov/products/gao-23-105331\">Paycheck Protection Program</a>, or <a href=\"https://www.gao.gov/products/gao-23-106696\">pandemic-era unemployment insurance</a>, or <a href=\"https://oig.hhs.gov/newsroom/media-materials/media-materials-nationwide-genetic-testing-fraud/\">genetic testing</a>, or <a href=\"https://www.gao.gov/assets/gao-22-105447.pdf\">non-emergency medical transportation</a>? Despite those being smaller line items, they probably have more juice worth squeezing, and the fraud is more easily detectable. Just <em>look</em>.</p><h3 id=\"fraudsters-find-the-weakest-links-in-the-financial-system\">Fraudsters find the weakest links in the financial system</h3><p>Bits about Money has extensively covered <a href=\"https://www.bitsaboutmoney.com/archive/money-laundering-and-aml-compliance/\">anti-moneylaundering</a> and <a href=\"https://www.bitsaboutmoney.com/archive/kyc-and-aml-beyond-the-acronyms/\">Know Your Customer regulations</a> and I won&#x2019;t rehash those regimes here. A bit of tacit knowledge in the financial industry: some actors in the set &#x201c;broadly considered trustworthy&#x201d; are more worthy of trust than others&#x2026; and some are less.</p><p>We are generally discreet about writing this down in as many words. But, as an analogy, cross-national regulatory bodies require that financial institutions maintain a list of high-risk jurisdictions to do business in. You are generally required to do enhanced due diligence on customers/activities/etc touching the high-risk list.</p><p>If you are particularly competent, and there are plusses and minuses to being competent in detecting fraud (you will <em>not</em> be the most popular person in the firm at bonus time; that goes to the folks who sold the high-growth accounts), you might have the analogous list of U.S. financial institutions which are <em>not entirely fronts for the bad guys</em>.</p><p>If one hypothetically has that list, that&#x2019;s one more signal you can use in evaluating any particular account, and a one-stop shop for developing a list of accounts to look into. It would be uncouth of me to name an extant bank that has poor controls, but for a general example of the flavor, see my (scathing) <a href=\"https://www.bitsaboutmoney.com/archive/debanking-and-debunking/#so-called-choke-point-20\">commentary on Silvergate&#x2019;s AML and KYC program</a>. Without using any proprietary information, I predict confidently that Silvergate banked many more multi-billion dollar frauds as a percentage of its customer base than almost any of the U.S.&#x2019;s 4,500 banks. (Trivial substantiation: divide FTXes-banked by total-count-of-customers.)</p><p>One might, if one has never seen the list, wonder whether it is simply proxying for something the financial industry is <em>definitely not allowed to proxy for</em>. One of the first things you learn as a data analyst is zip codes are extremely probative and <em>you are absolutely not allowed to use them</em>. The American system remembers the experience of redlining and has forbidden the financial industry from ever doing it again; the industry mostly respects that. But good news: institutions with weak controls environments are not, in fact, simply a proxy for &#x201c;Who banks socially disadvantaged people?&#x201d; There are many financial institutions that have that as an explicit business model. Some of them are good at their jobs. Some, less so, <em>and the fraudsters know it</em>.</p><p>This sometimes happens with the knowing connivance of the financial institution and/or their staff. For much more on that, see <a href=\"https://www.amazon.com/Best-Way-Rob-Bank-Own/dp/0292754183\">histories</a> of the savings and loan crisis, or the Lying for Money chapter on control frauds. But more commonly it is simply a community of practice developing organic knowledge about who is just <em>very easy to get an account with</em>. You need accounts, as a business. As a fraudulent business, which intends to cycle through accounts and identities at a much higher rate than baseline, you would prefer to do business with a bank which will not detect that malfeasance.</p><p>And so you will disproportionately end up banked, with many of your buddies, at the least attentive place still capable of getting a license. And so an agency, trying to find a fraudulent network, might want to look at fraud-cases-by-routing-number and then start making some judgment calls.</p><p>One of the reasons the government has deputized the financial industry is it is good at keeping spreadsheets and quickly responds to requests for them. Perhaps the government should call up a few of their deputies and say &#x201c;So, not <em>alleging</em> anything here, but we think you might have <em>a list</em>, carefully maintained by your fraud department for your own purposes. We want to see the list. It would be pro-social of you to give us a copy of it.&#x201d;</p><h3 id=\"frauds-openly-suborn-identities\">Frauds openly suborn identities</h3><p>There is a thriving market in identities to be used in fraud. This is because bad actors prefer not putting their own names on paper trails certain to become evidence, because they frequently &#x201c;burn&#x201d; themselves early in their careers, and because institutions have cottoned onto the wisdom of collecting lists of ultimate beneficiaries.</p><p>Sometimes this is a social process, conducted at e.g. the dinner table. Sometimes the market is explicitly a market. <a href=\"https://www.complexsystemspodcast.com/episodes/defrauding-government-jetson-leder-luis/\">Jetson recounted</a> that, having exhausted the supply of patients needing dialysis who could plausibly need ambulance services, frauds began bribing potential patients, first with donuts and then with cash. This is <em>extremely common</em>. In Minnesota, parents were recruited to childcare providers with the promise of cash kickbacks or (a detail we&#x2019;ll return to in a moment) fictitious paperworked no-show jobs, sometimes at substantially fictitious companies.</p><p>Fraudsters <em>sometimes</em> exercise some level of operational discipline in their communications. The bad guys have also seen The Wire; they know Stringer Bell&#x2019;s dictum on the wisdom of keeping notes on a criminal conspiracy. However, the population of people willing to be named in a federal indictment over $200 necessarily selects preferentially for individuals who are not experts at operational security. They will sometimes organize recruitment very openly, using the same channels you use for recruiting at any other time: open Facebook groups, Reddit threads, and similar. They will film TikTok videos flashing their ill-gotten gains, and explaining steps in order for how you, too, can get paid.</p><p>As a fraud investigator, you are allowed and encouraged to read Facebook at work.</p><p>Now, knowing that there exists the frequent epiphenomenon where fraudsters recruit strawmen to use their identities to qualify for payments: suppose that you have an entirely new enterprise whose first customers are individuals A, B, C, and D. You know, from past records, that A, B, C, and D have all been customers of an organization which you now know, positively, was a fraudulent actor. You might infer from this that A, B, C, and D <em>might have</em> sold their identities once, but you probably don&#x2019;t have sufficient information to convict them in a court of law of that. (It is of course possible that they are simply unsophisticated, or that bad actors obtained their information without their knowledge, for example by misappropriating a client list from a previous corporate entity they happened to own/work for/etc.)</p><p>But do you have enough information to take a more-detailed-than-usual look at this totally new enterprise? <em>I think you do</em>.</p><h3 id=\"asymmetry-in-attacker-and-defender-burdens-of-proof\">Asymmetry in attacker and defender burdens of proof</h3><p>We have choices, as the defender, in what levels of evidence we require to enter the circle of trust, what our epistemological standards are, and how much evidence we require to forcibly exit someone from the circle of trust.</p><p>A detail from the Minnesota cases is that these burdens are asymmetric, in a way which disadvantages the defender (all of us). That decision <em>is a choice</em> and we should make better choices.&#xa0;</p><p>For example, the primary evidence of a child attending a day-care was a handwritten sign-in sheet of minimal probative value. Prosecutors referred to them as &#x201c;almost comical&#x201d; and &#x201c;useless.&#x201d; They were routinely fraudulently filled out by a 17 year old &#x201c;signing&#x201d; for dozens of parents sequentially in the same handwriting, excepting cases where they were <em>simply empty</em>.</p><p>To refute this &#x201c;evidence&#x201d;, the state forced itself to do weeks of stakeouts, producing hundreds of hours of video recording, after which it laboriously reconstructed exact counts of children seen entering/exiting a facility, compared it with the billing records, and then invoiced the centers <em>only for proven overbilling</em>.</p><p>On general industry knowledge, if you are selected for examination in e.g. your credit card processing account, and your submission of evidence is &#x201c;Oh yeah, those transactions are ones we customarily paperwork with a 17 year old committing obvious fraud&#x201d;, your account <em>will be swiftly closed</em>. The financial institution doesn&#x2019;t have to reach a conclusion about every dollar which has ever flowed through your account. What actual purpose would there be in shutting the barn door after the horse has left? The only interesting question is what you&#x2019;ll be doing tomorrow, and clearly what you intend to do tomorrow <em>is fraud</em>.</p><p>We can architect the asymmetry in the other fashion: legitimate businesses will customarily, as a fact of their operations, put enormous effort into creating visible effects in the world which are trivial to check. In technologist circles this is sometimes called a &#x201c;proof of work&#x201d; function.</p><p>Once upon a time, a team of fraud analysts asked how they could possibly determine frauds from non-frauds without having extensive industry knowledge about every possible commercializable human activity. I suggested that a good first pass was &#x201c;Just ask the correspondent for a quick video, shot on their cell phone, of their workspace.&#x201d;</p><p>That is minimally invasive for the business owner, generates a huge amount of signal (including that which can be correlated across accounts), and can be usefully adjudicated by non-specialists in a minute. No multi-month stakeout of their storefront is required. Of course you can convincingly fake a video of working in, say, a machine shop, but fraudsters maintaining spreadsheet row 87 about the machine shop will find that difficult to juggle with all the other required lies in their backlog. Actual machine shops, meanwhile, include people, which means they include functional cell phone cameras at no additional cost to anyone.</p><p>You can also get some signal from who can trivially produce a video and who needs a week of advance notice to find a cell phone to record those machines that were absolutely milling aluminum last week.</p><p>Fundamentally, we have a choice about where we put our investments in defanging fraud, and we should stop choosing to lose.</p><p>So-called &#x201c;pay-and-chase&#x201d;, where we put the burden on the government to disallow payments for violations retrospectively, has been enormously expensive and ineffective. Civil liability bounces off of exists-only-to-defraud LLC. Criminal prosecutions, among the most expensive kinds of intervention the government is capable of doing short of kinetic war, result in only a ~20% reduction in fraudulent behavior. Rearchitecting the process to require prior authorization resulted in an &#x201c;immediate and permanent&#x201d; 68% reduction. (I commend to you <a href=\"https://marriner-wpmedia.s3.us-west-2.amazonaws.com/wp-content/uploads/2024/08/Dialysis_Ambulance_Fraud.pdf\">this research</a> on Medicare fraud regarding dialysis transport. And yes, the team did some interesting work to distinguish fraudulent from legitimate usage of the program. Non-emergency transport for dialysis specifically had exploded in reimbursements&#x2014;see Figure 1&#x2014; not because American kidneys suddenly got worse but because fraudsters adversarially targeted an identified weakness in Medicare.)</p><p>Attackers carefully respond to signals they think they are being sent from defenders. A lawyer for some of the Minnesota defendants, Ryan Pacyga, was <a href=\"https://www.nytimes.com/2025/11/29/us/fraud-minnesota-somali.html\">quoted</a> by the New York Times as saying that his clients understood Minnesota to tacitly allow their actions.</p><p>&gt; No one was doing anything about the red flags. &#x2026; It was like someone was stealing money from the cookie jar and they kept refilling it.</p><p>Don&#x2019;t be the defender who sends that message. It will not work out well for you or your program.</p><h3 id=\"fraudsters-under-paperwork-their-epiphenomena\">Fraudsters under-paperwork their epiphenomena</h3><p>Most frauds have rich external lives, with a soaring narrative of how deserving people are getting valuable services (and/or getting rich for being right and early regarding e.g. crypto asset cross-margining). They tend to be distinctly underpaperworked internally, partly because a synonym for &#x201c;paperwork&#x201d; is &#x201c;evidence&#x201d; and partly because&#x2026; most frauds aren&#x2019;t really that sophisticated, when it comes down to it. There is a true number; lie about it; <em>done</em>.</p><p>Like many time-pressed entrepreneurs busy talking to potential customers, fraudsters put the minimal amount of time necessary into bookkeeping and even less than that into paperworking epiphenomena of their frauds. One example of epiphenomena is sometimes the beneficiaries need <em>their own</em> paperwork. A legitimate mortgage company employs sales reps and a backoffice to help unsophisticated customers successfully get <a href=\"https://www.bitsaboutmoney.com/archive/mortgages-are-a-manufactured-product/\">several hundred pages of paperwork together to sell a mortgage</a>. Frauds&#x2026; mostly don&#x2019;t do that.</p><p>And so, if you have e.g. a statutory requirement that a beneficiary be employed to access services, a fraudster might say &#x201c;Don&#x2019;t worry about it!&#x201d; They&#x2019;ll just assert that you are an employee at a cleaning company. Perhaps they might even go as far as <em>payrolling you</em> as an employee of a cleaning company. This kills two birds with one stone, paying you your kickback while also generating the paystub they need you to have to qualify for the government reimbursement. (This happened, per the OLA&#x2019;s reports summarizing the results of many investigations, in Minnesota.)</p><p>But fraudsters <em>don&#x2019;t actually operate cleaning companies </em>even in those cases where they <em>do operate daycares</em>.</p><p>Cleaning companies are legitimate businesses, in the main, and working for one is an honest occupation. And so a fraud investigator should feel no chagrin at calling a cleaning company in the phone book and asking for a quote. A cleaning company which expresses complete befuddlement that someone could ask for a quote is providing, ahem, evidence in a direction.</p><p>(I have to note, as someone who pays to send children to a private school, that there is replete evidence that the school is accepting new children, knocking on the door and asking will quickly result in being given a brochure, and there are scheduled open houses and similar. I can imagine a gratuitously mismanaged educational establishment which does none of these things, and I can imagine an educational establishment which makes a lot of money, but I have trouble holding both thoughts in my head at the same time.)</p><p>The core frauds are sometimes hardened, to an attenuated degree. The peripheral frauds collapse under even a glance. Architect processes to require more signals regarding the periphery, then architect a system which takes at least a cursory look at the periphery. You will trivially catch frauds.</p><p>If you&#x2019;re worried about exposing the exact signal that you are using, costing utility of it in the future, you can use this as a &#x201c;parallel construction&#x201d; engine. Develop leads for investigation using the non-public signal, pull the core records as a matter of routine, find the discrepancies that all frauds leave in their core records, and then put <em>those</em> in the indictment. Ask your friendly neighborhood lawyer if that passes muster or if you need to add a sentence rhyming with &#x201c;was selected for a routine audit on the basis of information available to the department.&#x201d;</p><h3 id=\"machine-learning-can-adaptively-identify-fraud\">Machine learning can adaptively identify fraud</h3><p>We have discussed some heuristics [1] for identifying fraud. The financial industry still makes material use of heuristics, but a heuristic is a compression of the real world. It will sometimes lose fidelity to the world. It will frequently, <em>by design</em>, be legible to the adversary.</p><p>The defender has one advantage the attacker cannot ever replicate: data at scale. It knows what legitimate use looks like because it has all the messy, contradictory, varying quality, typos-and-all data <em>which legitimate businesses in the real world constantly throw off</em>. You cannot duplicate all of the shadows on the wall of Plato&#x2019;s cave without first duplicating the entire world. Fraudsters, even quite talented ones, can&#x2019;t do that.</p><p>There are any number of techniques for machine learning in anti-fraud; <a href=\"https://www.complexsystemspodcast.com/episodes/the-past-present-and-future-of-ai-with-stripe/\">Emily Sands has previously discussed some with me</a>. An important subset of the field can adapt in real-time or close to it to changes in adversary (or legitimate!) behavior. For example, covid surprised the fraudsters at the same time as it surprised every supermarket in the country, but the ex-post actions of the fraudsters and the supermarkets were <em>very different</em>. Revenue went up for both, but only one group <em>actually runs a supermarket</em>. And so by ingesting and constantly analyzing data from all users, including retrospective annotation of which users you&#x2019;ve identified to be frauds, you get better <em>and earlier</em> signals on which users are likely fraudulent and which are likely not.</p><p>This can inform outright interdiction or the investigate-then-punish loop that we ordinarily expect from government. It can also inform less consequential, easier-to-reverse interventions. For example, rather than putting all users immediately through the highest-possible-ceremony process for application, you can let most users do a lower-burden process, saving the higher levels of scrutiny for those which signal greater likelihood of being fraudulent. Or you can default to approving more applicants and reserve more of your investigatory budget for post-approval review, with this being equivalently costly by using better tasking of those reviews versus random allocation. Pay-and-chase becomes more palatable if it is not pay-and-pay-and-pay-and-pay-and-chase and more pay-until-we-decide-to-chase-but-stop-payments-at-that-decision-not-after-the-catching.</p><p>Machine learning isn&#x2019;t simply useful from a perspective of decreasing fraud. The history of regulation of benefits programs is the history of too-late, too-harsh overcorrection to notorious abuses. Much of what advocates find most maddening and Kafkaesque about eligibility criteria and application processes was voted on by a legislature but bears the signature of a fraudster with a novel idea.</p><p>With a good machine learning practice, you can increase data ingested but decrease the burdensome formal application/etc requirements. This is in no small part because those data points are less probative (they are under the direct control of the attacker and <em>announce</em> that they will be scrutinized). But it bears a dividend: if you better control fraud, and can successfully demonstrate that to the public and legislators, you can <em>decrease application burden</em> and perhaps even <em>widen eligibility criteria</em>. Those are both in the direct interests of potential marginal beneficiaries.</p><p>A political commentator might focus more on the optics here than on the substance, because that is so frequently where the point of actual leverage is in politics. But the substantive reality of fraud losses <em>matters</em>. It is much easier to tell the story of fraud in benefits programs being rare, opposed by all right-thinking people, and swiftly sanctioned when that story is not <em>an obvious lie</em>.</p><h3 id=\"frauds-have-a-lifecycle\">Frauds have a lifecycle</h3><p>You can read Lying for Money or other histories of frauds for more detail on the texture, but in the main, a dedicated fraudulent enterprise is created, is seasoned for a while before crossing the rubicon, has a period of increasing brazenness, is detected, is closed, and then is resurrected when the fraudster gets the band back together from round N+1.</p><p>We can intervene against the lifecycle model if we understand it. This begins with not defaulting to the understanding of investigators that frauds are isolated incidents by disparate individual actors. Those have been known to happen, but frauds are, by total damage, dominated by repeatable business models perpetrated by professional specialized bad actors. We should study them like we study other successful entrepreneurs, and then <em>not</em> invest in them.</p><p>One actionable insight from the lifecycle model: because the fraudster intends to be in business multiple times in their life, we should track the person-to-business mapping much more closely than we have historically. As Lying for Money says, if you&#x2019;re an accountant and willing to go to prison, and you do not get rich via fraud&#x2026; well, you are very bad at your job. That&#x2019;s on you. When we give you <em>repeated chances to do it</em>, that&#x2019;s on us.</p><p>One might think that the simplest imaginable reform is passing some sort of beneficial ownership regulation to unroll complex corporate structures designed to obscure who is actually puppeting Totally Not A Fraud, LLC. But the simplest imaginable reform is probably just <em>actually reading</em> corporate filings that already exist and are public. Again, most fraudsters are not the hypersophisticated Moriarties of the popular imagination. The Minnesota fraudsters frequently did not even bother with fig leaves. While they did find some nominee directors in some cases, many of the convicted operated their companies in their own names, with no complicated structuring at all. Sometimes multiple times, consecutively, after the previous entities had worn out their welcome with Minnesota.</p><p>The Fed should not be <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/files/enf20230817a1.pdf\">surprised when the bad guys buy a bank</a> when buying a bank requires an extended permission-seeking process and the bad guy&#x2019;s corporate records, dutifully recorded <a href=\"https://egov.maryland.gov/BusinessExpress/EntitySearch/Business\">by Maryland</a> (entity D20033544), are signed by a <a href=\"https://www.bloomberg.com/news/features/2021-10-07/crypto-mystery-where-s-the-69-billion-backing-the-stablecoin-tether\">notorious bagman</a>. In the Fed&#x2019;s defense, the bagman <em>lied to them about his intentions</em>, which was outside of their world model. (Pip pip to the New York Times for <a href=\"https://www.nytimes.com/2022/11/23/business/ftx-cryptocurrency-bank.html\">figuring that out</a> before the Fed did. That is, sadly, not the usual way it works in financial journalism.)</p><h2 id=\"should-we-care-about-fraud-investigation-anyway\">Should we care about fraud investigation, anyway?</h2><p>Responsible actors in civil society have a mandate to aggressively detect and interdict fraud. If they do not, they cede the field to irresponsible demagogues. They will not be careful in their conclusions. They will not be gentle in their proposals. They will not carefully weigh consequences upon the innocent. But they will be telling a truth that the great and the good are not.</p><p>The public will believe them, because the public believes its lying eyes.</p><p>[0] In a thing you will see frequently in fraud investigations, early detection of anomalies does not necessarily imply successful identification of the underlying fraudulent enterprise. A teacher was scandalized that a third of their students are using AI to write papers. Those &#x201c;<a href=\"https://abc30.com/post/ghost-students-digital-network-thieves-posing-major-threat-ca-community-colleges/18496090/\">students</a>&#x201d; are identities puppeted by a criminal organization to siphon federal funding out of community colleges towards accounts controlled by the criminals. (I award myself one cookie for <a href=\"https://x.com/patio11/status/1802036665503899781\">correctly predicting this</a>.)</p><p>[1] A heuristic, in industry parlance, is a hard-coded rule or set of rules as opposed to a system which automatically adapts to changes in the underlying data. Compare the difference between &#x201c;You are less likely to default on loans if you own versus renting&#x201d;, which is absolutely demonstrable in aggregate data, versus &#x201c;You are less likely to default on loans at 780 FICO versus 540 FICO.&#x201d; For a variety of reasons, the culture that is legislators sees the problem with having one heuristic, which will obviously not come to the correct conclusion all of the time. It corrects for this issue by having several hundred pages of heuristics. Just one more heuristic, man, and we&#x2019;ll have completely anticipated all the complexity of the world.</p><p>Heuristics are wonderful things! They&#x2019;re cheap to adjudicate, easy to explain, and can be understood by lawyers, even the kind who have ascended from the practice of law to the writing of it. Happily, machine learning systems can have all of these properties if you make them priorities.</p>"
            ],
            "link": "https://www.bitsaboutmoney.com/archive/fraud-investigation/",
            "publishedAt": "2026-02-06",
            "source": "Bits About Money",
            "summary": "The financial industry has paid tens of billions of dollars in tuition on fraud detection. Here are some observations for investigators with badges, press cards, or GoPros.",
            "title": "Fraud Investigation is Believing Your Lying Eyes"
        },
        {
            "content": [
                "<p><img alt=\"\" src=\"https://www.dbreunig.com/img/free_puppies.jpg\" /></p>\n\n<p>It’s been a month since I launched <a href=\"https://www.dbreunig.com/2026/01/08/a-software-library-with-no-code.html\"><code class=\"language-plaintext highlighter-rouge\">whenwords</code></a>, and since then there’s been a flurry of experiments with <em>spec driven development</em> (SDD): using coding agents to implement software using only a detailed text <em>spec</em> and a collection of <a href=\"https://en.wikipedia.org/wiki/Conformance_testing\">conformance tests</a>.</p>\n\n<h3 id=\"github-could-use-a-docs-review-ui\">Github Could Use a ‘Docs Review’ UI</h3>\n\n<p>First off, despite <code class=\"language-plaintext highlighter-rouge\">whenwords</code> being a couple Markdown docs and a YAML test set, people have submitted valuable PRs. <a href=\"https://github.com/mlafeldt\">Mathias Lafeldt</a> spotted a disagreement about rounding, where the spec instructed the agent to round <em>up</em> in several scenarios, <a href=\"https://github.com/dbreunig/whenwords/commit/c7278227dac8688546da3740c7064af18a14a44a\">but three tests were rounding down</a>. Others have suggested there should be some [CI][ci] (despite their being no code) and <a href=\"https://github.com/dbreunig/whenwords/issues/9\">wonder what that should be</a>.</p>\n\n<p>There’s been enough action on <a href=\"https://github.com/dbreunig/whenwords\">the repo</a> to give us an idea of what open source collaboration could look like in a SDD world. And it feels more like commenting in and marking up a Google Doc than code merges. I would love to see Github lean into this and build richer Markdown review, like Word or Google Docs, allowing for easier collaboration and accessibility to a wider audience.</p>\n\n<h3 id=\"emulation--porting-are-the-low-hanging-sdd-use-case\">Emulation &amp; Porting are <em>the</em> Low-Hanging SDD Use Case</h3>\n\n<p>By far, the hardest part of starting a SDD project is creating the tests. Which is why many developers are opting for borrowing existing test sets or deriving by referencing a source of truth.</p>\n\n<p>Here’s a few examples:</p>\n\n<ul>\n  <li><a href=\"https://www.anthropic.com/engineering/building-c-compiler\"><strong>Anthropic wrote a C compiler in Rust</strong></a>. They used <a href=\"https://gcc.gnu.org/onlinedocs/gccint/Torture-Tests.html\">existing test suites</a> and used GCC as a source of truth for validation and generating new tests.</li>\n  <li><a href=\"https://github.com/vercel-labs/just-bash\"><strong>Vercel created a bash emulator in TypeScript</strong></a>. They created and curated an amazing set of <a href=\"https://github.com/vercel-labs/just-bash/tree/main/src/spec-tests\">shell script spec tests</a> and <a href=\"https://x.com/cramforce/status/2015513111487553667?s=20\">have been feeding these to Ralph</a>. (To make this even more meta, I’ve been following their commits and <a href=\"https://github.com/dbreunig/just-bash-py\">Clauding them into Python</a>).</li>\n  <li><a href=\"https://github.com/pydantic/monty\"><strong>Pydantic created a Python emulator…in Python</strong></a>. This sounds silly, but it’s useful in the same way Vercel’s <code class=\"language-plaintext highlighter-rouge\">just-bash</code> is: it’s a super lightweight sandbox for AI agents. (In fact, I’ve <a href=\"https://github.com/dbreunig/dspy-monty-interpreter\">already wrapped it in a <code class=\"language-plaintext highlighter-rouge\">CodeInterpretter</code></a> for use with DSPy’s <a href=\"https://alexzhang13.github.io/blog/2025/rlm/\">RLM</a> module)</li>\n</ul>\n\n<p>Now… It’s worth noting that most of these examples didn’t emerge perfectly. Anthropic’s C-compiler just kinda punted on <a href=\"https://www.anthropic.com/engineering/building-c-compiler#:~:text=I%20tried%20(hard!)%20to%20fix%20several%20of%20the%20above%20limitations%20but%20wasn’t%20fully%20successful.%20New%20features%20and%20bugfixes%20frequently%20broke%20existing%20functionality.\">the hard stuff</a> and admits the generated code is inefficient<sup id=\"fnref:clean\"><a class=\"footnote\" href=\"https://www.dbreunig.com/2026/02/06/the-rise-of-spec-driven-development.html#fn:clean\" rel=\"footnote\">1</a></sup>. Pydantic’s Python emulator lacks <code class=\"language-plaintext highlighter-rouge\">json</code>, <code class=\"language-plaintext highlighter-rouge\">typing</code>, <code class=\"language-plaintext highlighter-rouge\">sys</code>, and other standard libraries. Though I’m sure those will come soon. Vercel’s <code class=\"language-plaintext highlighter-rouge\">just-bash</code> sports <em>outstanding</em> coverage, though <a href=\"https://x.com/mitsuhiko/status/2018452351900934433?s=20\">people continue to find bugs</a>.</p>\n\n<p>This is the big takeaway from watching the last few weeks of SDD: agents and a pile of tests can get you <em>really</em> far, <em>really</em> fast, but for complex software they can’t get you over the line. Edge cases will generate new tests, truly hard problems will resist SDD implementation, and architectural issues will prohibit parallelism agents.</p>\n\n<p>Vercel’s CTO and <code class=\"language-plaintext highlighter-rouge\">just-bash</code> creator, Malte Ubl, <a href=\"https://x.com/cramforce/status/2018159890381017419\">sums it up best</a>:</p>\n\n<p><img alt=\"Software is free now. (Free as in puppies)\" src=\"https://www.dbreunig.com/img/puppies.jpg\" /></p>\n\n<p>You can <a href=\"https://ghuntley.com/ralph/\">Ralph</a> up a port or emulator in a weekend or two, but <em>now you have to take care of it</em>.</p>\n\n<hr />\n\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/dbreunig\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <label for=\"bd-email\">Enter your email to receive the occasional update.</label>\n  <div class=\"form-input\">\n    <input id=\"bd-email\" name=\"email\" type=\"email\" />\n    <input type=\"submit\" value=\"Subscribe\" />\n  </div>\n</form>\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:clean\">\n      <p>There is lots to pick apart in Anthropic’s piece (I have had multiple compiler and related people ping me about how misrepresentative it is), but the most laughable claim is that this is, “a clean-room implementation”. The idea that using an LLM trained on the entire internet, all of Github, and warehouses full of books is a clean room environment is absurd. <a class=\"reversefootnote\" href=\"https://www.dbreunig.com/2026/02/06/the-rise-of-spec-driven-development.html#fnref:clean\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>"
            ],
            "link": "https://www.dbreunig.com/2026/02/06/the-rise-of-spec-driven-development.html",
            "publishedAt": "2026-02-06",
            "source": "Drew Breunig",
            "summary": "<p><img alt=\"\" src=\"https://www.dbreunig.com/img/free_puppies.jpg\" /></p> <p>It’s been a month since I launched <a href=\"https://www.dbreunig.com/2026/01/08/a-software-library-with-no-code.html\"><code class=\"language-plaintext highlighter-rouge\">whenwords</code></a>, and since then there’s been a flurry of experiments with <em>spec driven development</em> (SDD): using coding agents to implement software using only a detailed text <em>spec</em> and a collection of <a href=\"https://en.wikipedia.org/wiki/Conformance_testing\">conformance tests</a>.</p> <h3 id=\"github-could-use-a-docs-review-ui\">Github Could Use a ‘Docs Review’ UI</h3> <p>First off, despite <code class=\"language-plaintext highlighter-rouge\">whenwords</code> being a couple Markdown docs and a YAML test set, people have submitted valuable PRs. <a href=\"https://github.com/mlafeldt\">Mathias Lafeldt</a> spotted a disagreement about rounding, where the spec instructed the agent to round <em>up</em> in several scenarios, <a href=\"https://github.com/dbreunig/whenwords/commit/c7278227dac8688546da3740c7064af18a14a44a\">but three tests were rounding down</a>. Others have suggested there should be some [CI][ci] (despite their being no code) and <a href=\"https://github.com/dbreunig/whenwords/issues/9\">wonder what that should be</a>.</p> <p>There’s been enough action on <a href=\"https://github.com/dbreunig/whenwords\">the repo</a> to give us an idea of what open source collaboration could look like in a SDD world. And it feels more like commenting in and marking up a Google Doc than code merges. I would love to see Github lean into this and build richer Markdown review, like Word or Google Docs, allowing for easier collaboration and accessibility to a wider audience.</p> <h3 id=\"emulation--porting-are-the-low-hanging-sdd-use-case\">Emulation &amp; Porting are <em>the</em>",
            "title": "The Rise of Spec Driven Development"
        },
        {
            "content": [],
            "link": "https://interconnected.org/home/2026/02/06/sanding",
            "publishedAt": "2026-02-06",
            "source": "Matt Webb",
            "summary": "<div> <p>What mundane pleasures will I be robbed of by domestic robots?</p> <p>Sometimes I feel like my job at home is putting things into machines and taking things out of machines.</p> <p>I don’t mean to sound unappreciative about “modern conveniences” (modern being the 1950s) because I take care of laundry and emptying the dishwasher, and I love both. We have a two drawer dishwasher so that is a conveyer belt. And I particularly love laundry. We generate a lot of laundry it seems.</p> <p><a href=\"https://x.com/Duderichy/status/1935313693866180976\">There was a tweet in 2025</a>: <em>\"woodworking sounds really cool until you find out it’s 90% sanding\"</em></p> <p>And it became an idiom because 90% of everything is sanding. <a href=\"https://www.reddit.com/r/AskPhotography/comments/1lj3pal/what_is_our_90_sanding/\">See this reddit thread</a>… 90% of photography is file management; 90% of baking is measuring; etc.</p> <p>So when I say that I love laundry I don’t mean that I love clean clothes (everyone loves clean clothes) but I love the sanding. I love the sorting into piles for different washes, I love reading the little labels, especially finding the hidden ones; I love the sequencing so we don’t run out of room on the racks, I love folding, I love the rare peak moments when everything comes",
            "title": "90% of everything is sanding e.g. laundry"
        },
        {
            "content": [],
            "link": "https://www.nytimes.com/2026/02/04/podcasts/the-real-story-behind-jennette-mccurdys-novel-half-his-age.html",
            "publishedAt": "2026-02-06",
            "source": "Modern Love - NYT",
            "summary": "McCurdy’s new book is a work of fiction, but writing it helped her work through some complicated memories from her own life.",
            "title": "The Real Story Behind Jennette McCurdy’s Novel ‘Half His Age’"
        },
        {
            "content": [],
            "link": "https://www.robinsloan.com/lab/junto/",
            "publishedAt": "2026-02-06",
            "source": "Robin Sloan",
            "summary": "<p>Junto 0736. <a href=\"https://www.robinsloan.com/lab/junto/\">Read here.</a></p>",
            "title": "The music of the feeds"
        },
        {
            "content": [],
            "link": "https://simonwillison.net/2026/Feb/6/pydantic-monty/#atom-entries",
            "publishedAt": "2026-02-06",
            "source": "Simon Willison",
            "summary": "<p>There's a jargon-filled headline for you! Everyone's <a href=\"https://simonwillison.net/2026/Jan/8/llm-predictions-for-2026/#1-year-we-re-finally-going-to-solve-sandboxing\">building sandboxes</a> for running untrusted code right now, and Pydantic's latest attempt, <a href=\"https://github.com/pydantic/monty\">Monty</a>, provides a custom Python-like language (a subset of Python) in Rust and makes it available as both a Rust library and a Python package. I got it working in WebAssembly, providing a sandbox-in-a-sandbox.</p> <p>Here's <a href=\"https://github.com/pydantic/monty\">how they describe Monty</a>:</p> <blockquote> <p>Monty avoids the cost, latency, complexity and general faff of using full container based sandbox for running LLM generated code.</p> <p>Instead, it let's you safely run Python code written by an LLM embedded in your agent, with startup times measured in single digit microseconds not hundreds of milliseconds.</p> <p>What Monty <strong>can</strong> do:</p> <ul> <li>Run a reasonable subset of Python code - enough for your agent to express what it wants to do</li> <li>Completely block access to the host environment: filesystem, env variables and network access are all implemented via external function calls the developer can control</li> <li>Call functions on the host - only functions you give it access to [...]</li> </ul> </blockquote> <p>A quick way to try it out is via <a href=\"https://github.com/astral-sh/uv\">uv</a>:</p> <pre><code>uv run --with pydantic-monty python -m asyncio </code></pre> <p>Then paste this into the Python interactive",
            "title": "Running Pydantic's Monty Rust sandboxed Python subset in WebAssembly"
        },
        {
            "content": [
                "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*13Lj8DPzU5c3uhYw73LYwg.jpeg\" /></figure><p>As you’ve probably noticed, something is happening over at Anthropic. They are a spaceship that is beginning to take off.</p><p>This whole post is just spidey-sense stuff. Don’t read too much into it. Just hunches. Vibes, really.</p><p>If you run some back-of-envelope math on how hard it is to get into Anthropic, as an industry professional, and compare it to your odds of making it as a HS or college player into the National Football League, you’ll find the odds are comparable. Everyone I’ve met from Anthropic is the best of the best of the best, to an even crazier degree than Google was at its peak. (Evidence: Google hired me. I was the scrapest of the byest.)</p><p>Everyone is gravitating there, and I’ve seen this movie before, a few times.</p><p>I’ve been privileged to have some long, relatively frank conversations with nearly 40 people at Anthropic in the past four months, from cofounders and execs, to whole teams, to individuals from departments across the company: AI research, Engineering, GTM, Sales, Editorial, Product and more. And I’ve also got a fair number of friends there, from past gigs together.</p><p>Anthropic is unusually impenetrable as a company. Employees there all know they just need to keep their mouths shut and heads down and they’ll be billionaires and beyond, so they have lots of incentive to do exactly that. It’s tricky to get them to open up, even when they do chat with you.</p><p>But I managed. People usually figure out I’m harmless within about 14 seconds of meeting me. I have developed, in my wizened old age, a curious ability to make people feel good, no matter who they are, with just a little conversation, making us both feel good in the process. (You probably have this ability too, and just don’t know how to use it yet.)</p><p>By talking to enough of them, and getting their perspectives in long conversations, I have begun to suspect that the future of software development is the Hive Mind.</p><p><strong>Happy But Sad</strong></p><p>To get a proper picture of Anthropic at this moment, you have to be Claude Monet, and paint it impressionistically, a big broad stroke at a time. Each section in this post is a stroke, and this one is all about the mood.</p><p>To me it seems that almost everyone there is vibrantly happy. It has the same crackle of electricity in the air that Amazon had back in 1998. But that was back in the days before Upton Sinclair and quote “HR”, so the crackle was mostly from faulty wiring in the bar on the first floor of the building.</p><p>But at both early Amazon and Anthropic, everyone knew something amazing was about to happen that would change society forever. (And also that whatever was coming would be <em>extremely</em> Aladeen for society.)</p><p>At Anthropic every single person and team I met, without exception, feels kind of sweetly but sadly transcendent. They have a distinct feel of a group of people who are tasked with shepherding something of civilization-level importance into existence, and while they’re excited, they all also have a solemn kind of elvish old-world-fading-away gravity. I can’t quite put my finger on it.</p><p>But I am starting to suspect they feel genuinely sorry for a lot of companies. Because we’re not taking this stuff seriously enough. 2026 is going to be a year that just about breaks a lot of companies, and many don’t see it coming. Anthropic is trying to warn everyone, and it’s like yelling about an offshore earthquake to villages that haven’t seen a tidal wave in a century.</p><p><strong>The Vibe Mind</strong></p><p>Everyone you talk to from Anthropic will eventually mention the chaos. It is not run like any other company of this size. Every other company quickly becomes “professional” and compartmentalized and accountable and grown-up and whatnot at their size. I don’t think Anthropic has bothered with any of that crap yet.</p><p>I mean sure, yes, for their production systems, they are of course very serious and appropriately frowny-faced and have lots of world-class SREs and scaling engineers. Buuuut, you know. The tail that wags their dog is Claude in its various incarnations, and that’s the Work Generator that keeps the hive buzzingly happily along.</p><p>So when I generalize and say Anthropic is <em>completely</em> run by vibes, I’m sure there are exceptions at the periphery, where it makes sense to have hardened interfaces with the rest of the world, whether it’s production, or GTM, or product marketing. And the company is probably a bit more “normal” at those edges.</p><p>But at the <em>core</em>, they are self-evidently in the middle (or maybe beginning) of a Golden Age, which I’ll talk about in the next section. And it’s very churny and frothy there.</p><p>The employees often describe it as a hive mind that is run entirely on vibes, so this isn’t me putting words in their mouths. They are observing it too. Organizations reflect their leaders, so it’s clearly being directed by leadership, and I’m sure it’s intentional. Not all the bees are the same size, and there are clearly some graph nodes spread through the hive mind that are keeping it stable.</p><p>But if you interfere with the hive mind operation, upsetting that balance, you’ll gently be pushed out to the edges, and maybe beyond. The centrifuge will spin you away to the periphery, carried by a wave of vibes.</p><p>It feels fragile, and it may have scaling ceilings we’re all unaware of. But they have kept it going so far, and I have some thoughts about how they’re managing it.</p><p><strong>How To End a Golden Age</strong></p><p>I’m going to share something with you here that’s orthogonal to the Hive Mind, but Anthropic is demonstrating this other property so clearly that we need a time-out to examine it together.</p><p>A Golden Age is a period of intense innovation, category creation, velocity, and productivity that lasts typically several years. Golden Ages at companies have the property of attracting all the greatest talent in the industry, very quickly. That’s happening at Anthropic right now.</p><p>I was at Amazon during their Golden Age, still going strong when I left in 2005. And I was at Google during <em>their </em>Golden Age, which lasted until April 2011. After that I watched Google ossify and become siloed and effectively incapable of cross-functional work, while Amazon continued to execute and innovate.</p><p>If you need a third Golden Age example, Microsoft had many of the greatest minds in the industry gathered together in the early 2000s, to figure out the future of software development on the CLR with C#/.NET, because they’d lost the Java lawsuit. It was the best thing that could have happened to them, and for a few years it was magical, and they produced stuff that shaped the entire industry. For a few years they were thought leaders. Many wound up fleeing to Google after it came crashing down.</p><p>I spent years wondering why and how it happened at Google. But I didn’t figure it out until I saw what is currently happening at Anthropic. That’s when it clicked.</p><p>Google had killed their innovation machine on the vine when they switched their focus to profits, which caused a shift in the ratio of work to people.</p><p>Google’s motto under their original CEO Eric Schmidt was, “Let a Thousand Flowers Bloom.” Schmidt’s explanation was that he was “generating luck” by encouraging innovation and taking a lot of bets, hoping some would pay off. It was something Google could afford to do, because they were rolling in money, in the new greenfield of the web.</p><p>When Larry Page took over as CEO in April 2011, his motto was: “More Wood Behind Fewer Arrows.” He felt–and rightly so–that the unfettered, unsupervised 20% work and Labs activity hadn’t produced any real hits. So Larry put big constraints on what work would get funded, and 20% work gradually died away. From that point on, the company turned “political,” lost most of their innovation engine, and the Golden Age was over.</p><p>Was it killing 20% work that caused the crash? Not directly. As a counterexample, Amazon never had 20% work. Their Golden Age of innovation and excitement lasted a pretty long time, much longer than after I left in 2005. So it wasn’t that. What did they have that Google didn’t?</p><p>One clue is something my colleague Jacob Gabrielson told me when he was a Principal Engineer at Amazon in maybe 2015-ish, when Google had become hardened like concrete. I told him that people often fought over projects at Google, and Jacob told me that it never happened at Amazon, because, as he put it, “Everyone here is always slightly oversubscribed.”</p><p>So now you see how the magic starts and ends. During Golden Ages, there is more work than people. And when they crash, it is because there are more people than work.</p><p>I realize I’m mixing units, but otherwise it gets grammatically awkward. You get the idea.</p><p>Larry Page told the company in April 2011, when he became CEO, “stop working on new stuff, we’re only going to do X, Y, and Z.” And they kept every single engineer, but cut the amount of work by a solid 50% or more. You could no longer work on any problem you wanted. And there wasn’t really enough to go around.</p><p>That was the beginning of the end. As soon as there wasn’t enough work, people began to fight over the work that was left. It kicked off a wave of empire building, territoriality, politicking, land grabs, and, as Lydia Ash taught me, Cookie Licking–a phrase folks at Microsoft had invented to accuse people of claiming work that they will never actually get around to doing.</p><p>That badness is normal operating behavior for a lot of companies out there today. One person described being at Microsoft as being a molecule in a metal, with your elbows tightly locked together with everyone else’s. Ironically, all the Microsoft cookies appear to be licked now.</p><p>At Anthropic, they are smack in the middle of a Golden Age, where there is <em>far</em> more available work than there are people to do it, on pretty much all fronts. It’s like they’re on the surface of an expanding sphere.</p><p>So despite the chaos, and the inevitable growing pains (not dissimilar to when I was at Amazon during their Get Big Fast phase just after their IPO), there is never a reason to fight over work. There is infinite work.</p><p>And so everyone gets many chances to put their ideas in the sun, and the Hive Mind judges their merit.</p><p><strong>The Small Version</strong></p><p>My strong suspicion is that Anthropic is operating the way <em>all</em> successful companies will soon operate within a few short years, despite it being so very different from how most operate today.</p><p>My suspicion arises from a second data point. Yes. I have diangulated on the answer from two data points. I bet you didn’t know you could do that. Well I did it. If my diangulation trick doesn’t convince you, fair enough. The Hive Mind may be an anomaly unique to Anthropic. I’m just trying to extrapolate from the data points we do have.</p><p>My friends Ajit Banerjee, Ryan Snodgrass, and Milkana Brace are a little 3-person startup called SageOx. They spend their time in a little apartment in Kirkland, about a mile from me, above a coffee shop bakery, alternating between coding and sleeping, for weeks on end. They don’t bother to put their shoes on when they walk down to get coffee.</p><p>They’re all level 7 to 8 on my <a href=\"https://justin.abrah.ms/blog/2026-01-08-yegge-s-developer-agent-evolution-model.html\">Dev Evolution to AI</a> chart. I got the sense this is also true for essentially all the engineers at Anthropic, and probably half their business people too.</p><p>SageOx are the ones that told me that an external fourth contributor overseas wasted a bunch of time acting on 2-hour-old information, because everything is moving so fast. They’re also the ones that told me you need full transparency at all times, at their speeds, or nobody will ever see what you are doing and you’ll fall irretrievably behind.</p><p>So they all turn their volume way up and announce everything they’re doing at all times. “I AM GOING DOWN TO GET A DONUT NOW,” they will say, and someone will yell from the nap couch, “GET ME A DONUT.” “I AM ALSO DELETING THE DATABASE.” “OK.”</p><p>A lot of engineers like to work in relative privacy, or even secrecy. They don’t want people to see all the false starts, struggles, etc. They just want people to see the finished product. It’s why we have git squash and send dignified PRs instead of streaming every compile error to our entire team.</p><p>But my SageOx friends Ajit and Ryan actually <em>want</em> the entire work stream to be public, because it’s incredibly valuable for forensics: figuring out exactly how and why a teammate, human or agent, got to a particular spot. It’s valuable because merging is a continuous activity and the forensics give the models the tools and context they need to merge intelligently.</p><p>So at SageOx they all see each other’s work all the time, and act on that info. It’s like the whole team is pair programming at once. They course-correct each other in real time.</p><p>They showed me a demo yesterday, very impressive actually, and we had a big debate over whether developers would be comfortable with their entire workstream made visible to the rest of the company. SageOx records even their own conversations at all times, and the transcripts are automatically uploaded and versioned, and they have the full work history of what every human and agent has done, forever. It’s fully transparent: a necessity for a hive mind.</p><p>The consensus was, most developers would be really uncomfortable with that.</p><p>Why? Because it’s the death of the ego. Everyone can see all your mistakes and wrong turns. Everyone can see exactly how fast you work. There is nothing you can hide, nothing <em>to</em> hide. You have to be a happy bee.</p><p>So I gave them some advice on making work hideable, because it’s gonna take some time for devs to adjust to working in fish bowls.</p><p>Anyway, seeing SageOx do this, operating a hive mind with three people, made me immediately think of Anthropic. SageOx are not focused on profits either; they’re focused on <em>discovery</em>. They are trying to find PMF by inventing it, since this is a new category. They are working together as a mini-hive mind, automating their own work in a tight self-reinforcing loop.</p><p>Building for yourself is the <em>only way</em> to give your product a nonzero chance of success in the new world. Build something just for yourself, and make sure you love it so much that you <em>know</em> it’s how other people should be working.</p><p>I see far too many AI-native startup founders today trying to guess what people <em>might</em> want, and building things that will never succeed. They build for enterprises, little agent workbenches that provide personas and helpers and RAG-like stuff, or they’ll build orchestrators for “normie developers” trying to make agents safe. And it’s all just… ugh. Wrong side of the Bitter Lesson.</p><p>They’re not building for themselves, so they can’t see it.</p><p>The Settlers of Catan inventor Teuber famously built new games for his own family to playtest for years, before they finally found the formula for Catan through many iterations. I like to think of them sitting around and testing out new variations of games as being very similar to how modern AI devs are building software.</p><p><strong>The Campfire Model</strong></p><p>Rather than a bunch of traditional departmental silos, Anthropic and SageOx both look to me like they are building together around a campfire, at least in contrast with how most people are currently thinking about agentic development.</p><p>I started seeing this analogy when we were discussing evolutionary design at the Thoughtworks unconference offsite in Deer Valley, Utah this weekend, which Martin Fowler was kind enough to invite me to. Absolutely lovely event, I got to meet so many brilliant people from around the world and the industry. It was a privilege to be there.</p><p>At one of the breakouts we were discussing Spec-Driven Development, which completely mystified me. I’d heard of it, but many people were using the term to describe a spectrum of different development practices, nearly all of which felt like waterfall to me at best, and Intentional Programming v2 at worst. Few of us found any SDD model very compelling when comparing them to our own personal development practices.</p><p>Instead, at our breakout session about SDD, we realized we mostly prefer what we were calling Exploratory Development or Evolutionary Development, where rather than making a big complex spec, everyone sits around a campfire together, and builds.</p><p>The center of the campfire is a living prototype. There is no waterfall. There is no spec. There is a prototype that simply evolves, via group sculpting, into the final product: something that finally feels right. You know it when you finally find it.</p><p>As evidence of this, Anthropic, from what I’m told, does not produce an operating plan ahead more than 90 days, and that is their <em>outermost</em> planning cycle. They are vibing, on the shortest cycles and fastest feedback loops imaginable for their size.</p><p>And the result, they tell me, is something like improv.</p><p><strong>Improv at Scale</strong></p><p>Anthropic’s Hive Mind is described by employees as “Yes, and…” style improvisational theater. Every idea is welcomed, examined, savored, and judged by the Hive Mind. It’s all based on vibes. There is no central decision-making authority. They are just trying everything, and when magic happens, they all just kind of realize it at once.</p><p>They’re making forward progress via mashups and exploration at the frontier of software development and knowledge work using AI. They’re finding their way like a floodfill search.</p><p>This reminds me of pure functional data structures, which are like append-only logs. Pure functional data structures are emerging not just at the organizational level in 2026, but also in DevOps. Ledgered, versioned, pure-functional databases like Datomic and Dolt are going to become increasingly valuable for mistake-prone agentic workflows. I’ll talk more about this in a future post.</p><p>With this accretive development model, it’s like Anthropic engineers are sculpting together with clay. It feels like there are a bunch of campfires at Anthropic, and they swarm around the fires (various in-flight products), changing their shapes as people try new variations and mashups.</p><p>Someone there told me that Claude Cowork was launched publicly 10 days after they first had the idea. When magic happens there, it happens very fast.</p><p>They are generating luck, exactly what Eric Schmidt had wanted. But they are doing it much, much faster than Googlers could, because they are all 10x to 100x as productive as engineers who are using Cursor and chat today, and roughly 1000x as productive as Googlers were back in 2005. (And in 2005 we were honestly pretty badass compared to programming back in 1986 when I started; it has been nice gradually turning into a wizard over the last 40 years.)</p><p>So to me, Anthropic feels like a quivering mass implementing Multi-Armed Bandit on ideas at a super high velocity. Everyone gets their chance, since you can implement anything and people will try it out.</p><p>But the hive mind will also eject anyone who’s not acting like a happy worker bee in the swarm. You need to contribute your ideas in the right ways. It’s the death of the ego. These were the exact words of someone who’s been there since the early days.</p><p>Sound familiar?</p><p>I think it really is kind of like improv. It’s a team sport. It doesn’t work to come in guns blazing, and make it about yourself.</p><p>So we’re seeing real power in the “Yes, and…” model.</p><p>And yet, most companies arrived at where they are by learning how to say No.</p><p>This is shaping up to be a problem.</p><p><strong>More To Come</strong></p><p>I have plenty more thoughts on the subject, but unfortunately precious little time or space. I have a huge blog-post backlog to get through, not to mention equally huge maintainer responsibilities now. There are literally whole companies using Gas Town, it’s pretty nuts.</p><p>If I’ve convinced enough people of the hive mind as an operating model, then maybe I can write more about how you might go about turning your existing company into one.</p><p>A little bird from… somewhere, in Sales, told me that all companies are asking variations of just the same two questions. They bluster and bluff and try to act informed, but they are all terrified. When you cluster their questions, they break down into, “Will everything be OK?” and “Will we be here in five years?”</p><p>The default answer, I’m afraid, is No. If you do nothing, you’re almost certainly going to get overrun. If you have an Atom Moat, then you stand a pretty good chance of weathering the storm, if you execute well. Just a chance, mind you: It’s a moat, not a force field. But atoms are a pretty good moat. If you make beer, or work with humans, or ship stuff, say, then you’ve got a bit more time to work with, maybe, to find your feet in the AI era.</p><p>If you have a strictly online or SaaS software presence, with no atoms in your product whatsoever, just electrons, then you are, candidly, pretty screwed if you don’t pivot. I don’t think there are any recipes for pivoting yet; this is all new, and it’s all happening very fast.</p><p>But there is a yellow brick road: spending tokens. This golden shimmering trail will lead your company gradually in the right direction. Your organization is going to have to learn a bunch of new lessons, as new bottlenecks emerge when coding is no longer the bottleneck. You need to start learning those bespoke organizational lessons early. The only way to know for sure that you’re learning those lessons is if people are out there <em>trying</em> and making mistakes. And you can tell how much practice they’re getting from their token spend.</p><p>I don’t work for anyone, I’m not associated with any company, and I’m not selling anything. I’m not even recommending any particular course of action, other than… learn AI. Now’s the time. Just start.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/750/0*wm2S-GXg0778_vJ8.jpg\" /><figcaption>Start</figcaption></figure><p>You have a lot of work ahead of you. Build the campfire. Turn your product into a living prototype. Consider building some hives within your company, and giving them space to innovate.</p><p>And then pivot like hell to your new PMF, whatever that may be. Good luck. It’s gonna be a crazy year. May the best… whatever… win.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*uqgTBedArMGdOfzVK_Ep-w.jpeg\" /></figure><p>p.s. come join us at the Gas Town Discord, which you can find at gastownhall.ai — see you there!</p><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=d01f768f3d7b\" width=\"1\" />"
            ],
            "link": "https://steve-yegge.medium.com/the-anthropic-hive-mind-d01f768f3d7b?source=rss-c1ec701babb7------2",
            "publishedAt": "2026-02-06",
            "source": "Steve Yegge",
            "summary": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*13Lj8DPzU5c3uhYw73LYwg.jpeg\" /></figure><p>As you’ve probably noticed, something is happening over at Anthropic. They are a spaceship that is beginning to take off.</p><p>This whole post is just spidey-sense stuff. Don’t read too much into it. Just hunches. Vibes, really.</p><p>If you run some back-of-envelope math on how hard it is to get into Anthropic, as an industry professional, and compare it to your odds of making it as a HS or college player into the National Football League, you’ll find the odds are comparable. Everyone I’ve met from Anthropic is the best of the best of the best, to an even crazier degree than Google was at its peak. (Evidence: Google hired me. I was the scrapest of the byest.)</p><p>Everyone is gravitating there, and I’ve seen this movie before, a few times.</p><p>I’ve been privileged to have some long, relatively frank conversations with nearly 40 people at Anthropic in the past four months, from cofounders and execs, to whole teams, to individuals from departments across the company: AI research, Engineering, GTM, Sales, Editorial, Product and more. And I’ve also got a fair number of friends there, from past gigs together.</p><p>Anthropic is unusually impenetrable as a company. Employees there all know they just",
            "title": "The Anthropic Hive Mind"
        },
        {
            "content": [
                "<p>Claude Opus 4.6 and agent swarms were announced yesterday. That’s some big upgrades for Claude Code.</p>\n<p>OpenAI, the competition, offered us GPT-5.3-Codex, and this week gave us an app form of Codex that already has a million active users.</p>\n<p>That’s all very exciting, and next week is going to be about covering that.</p>\n<p>This post is about all the cool things that happened before that, which we will be building upon now that capabilities have further advanced. This if from Before Times.</p>\n<p>Almost all of it still applies. I haven’t had much chance yet to work with Opus 4.6, but as far as I can tell you should mostly keep on doing what you were doing before that switch, only everything will work better. Maybe get a bit more ambitious. Agent swarms might be more of a technique shifter, but we need to give that some time.</p>\n<div>\n\n\n<span id=\"more-25081\"></span>\n\n\n</div>\n\n\n<h4 class=\"wp-block-heading\">Table of Contents</h4>\n\n\n<ol>\n<li><a href=\"https://thezvi.substack.com/i/185474971/claude-code-and-cowork-offer-mundane-utility\">Claude Code and Cowork Offer Mundane Utility.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/the-efficient-market-hypothesis-is-false\">The Efficient Market Hypothesis Is False.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/inflection-point\">Inflection Point.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/welcome-to-the-takeoff\">Welcome To The Takeoff.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/huh-upgrades\">Huh, Upgrades.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/todos-become-tasks\">Todos Become Tasks.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/i-m-putting-together-a-team\">I’m Putting Together A Team.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/compact-problems\">Compact Problems.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/code-yourself-a-date\">Code Yourself A Date.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/verification-and-generation-are-distinct-skills\">Verification and Generation Are Distinct Skills.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/skilling-up\">Skilling Up.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/askuserquestion\">AskUserQuestion.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/for-advanced-players\">For Advanced Players.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/so-they-quit-reading\">So They Quit Reading.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/reciprocity-is-the-key-to-every-relationship\">Reciprocity Is The Key To Every Relationship.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/the-implementation-gap\">The Implementation Gap.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185474971/the-lighter-side\">The Lighter Side.</a></li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Claude Code and Cowork Offer Mundane Utility</h4>\n\n\n<p><a href=\"https://x.com/ns123abc/status/2013955320318427207\">Nvidia CEO Jensen Huang offered Claude a huge endorsement on January 21</a>, calling it incredible and saying every software company needs to use it.</p>\n<blockquote><p><a href=\"https://x.com/emollick/status/2015512532056764490\">Ethan Mollick</a>: This game was 100% designed, tested, and made by Claude Code with the instructions to &#8220;make a complete Sierra-style adventure game with EGA-like graphics and text parser, with 10-15 minutes of gameplay.&#8221; I then told it to playtest the game &amp; deploy.</p>\n<p>Play: <a href=\"https://enchanted-lighthouse-game.netlify.app\">https://enchanted-lighthouse-game.netlify.app</a></p>\n<p>It was a single prompt for the entire game, and then a prompt to playtest and improve the outcome.</p>\n<p>I gave it an agent that can connect to GPT image gen.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!jVsD!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdffb2d94-c4fe-4fce-8765-8353d71127c9_1200x815.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n</blockquote>\n<p>Iterative image generation sounds pretty cool:</p>\n<blockquote><p><a href=\"https://x.com/omarsar0/status/2017296558169952517\">elvis</a>: I just used the new Claude Code Playground plugin to level up my Nano Banana Image generator skill.</p>\n<p>My skill has a self-improving loop, but with the playground skill, I can also pass precise annotations to nano banana as it improves the images.</p>\n<p>I have built a Skill for Claude Code that leverages the nano banana image generation model via API.</p>\n<p>I built it like that because I have had a lot of success generating images with nano banana in an agentic self-improving loop. It can dynamically make API requests and improve images really well.</p>\n<p>With the Playground plugin, I can take it one step further. I can now provide precise annotations that the agentic loop can leverage to make more optimal API calls in the hope of improving the images further. Visual cues are extremely powerful for agents, and this is a sort of proxy for that.</p></blockquote>\n<p><a href=\"https://x.com/adocomplete/status/2017759936919572482\">Ado cancels all his Amazon Subscribe and Save orders</a> via Claude for Chrome. Sameer points out that <a href=\"https://t.co/K971ZUIMrW\">a Chrome Extension can do this more efficiently and have a better UI</a>, but there is great joy in not having to choose and install a new tool to do a new thing. Yes, if you were doing this a lot you’d use a Chrome Extension, or have Claude Code build you a new one to your taste.</p>\n<p><a href=\"https://x.com/karpathy/status/2018043254986703167\">I agree with Andrej Karpathy, you should use RSS feeds</a> wherever feasible to guard your information flow. I use Feedly, he suggests NetNewsWire or vibe coding your own reader. It is unfortunate that Twitter does not play nice with such a setup.</p>\n<blockquote><p><a href=\"https://x.com/sethlazar/status/2018086494125318535\">Seth Lazar</a>: I wrote about the idea of building an &#8220;Attention Guardian&#8221; agent back in 2023. Genuinely think it&#8217;s feasible now. Claude Code is now building up a workflow to go across all these different sources, with a long description of what I&#8217;m interested in, and create a new feed.</p></blockquote>\n<p><a href=\"https://x.com/notnotstorm/status/2018037481409855594\">Storm points out that anything you can do with a terminal interface</a> you can in theory do better with a graphical interface (GUI), but the people building GUIs don’t give you the things you want: Information density, low latency, no ads, shortcuts, open source, composable, tileable, scriptable. It’s just that no one does it.</p>\n\n\n<h4 class=\"wp-block-heading\">The Efficient Market Hypothesis Is False</h4>\n\n\n<p>What the market has instead is a sense of humor.</p>\n<blockquote><p><a href=\"https://x.com/modestproposal1/status/2018792278643650701\">modest proposal</a>: March 12, 2020 was the trading day after Tom Hanks said he had covid and the NBA shut down, Expedia fell 15.2% and BKNG fell 11.2%.</p>\n<p>February 3, 2026 which was the day Claude Code legal connector was announced, Expedia fell 15.3% and BKNG fell 9.4%.</p></blockquote>\n<p><a href=\"https://x.com/TheStalwart/status/2019146895705403642\">Then software drove itself off a cliff generally</a> (y-axis goes from .012 to .018), and then after this graph was posted it kept going, all supposedly in response to information that, from where I sit, was rather old news the whole time.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!wk3M!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7972b8e9-9c53-4bc5-85c6-5f5af6c9f67c_1200x579.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/heyshrutimishra/status/2019106821244612810\">Shruti:</a> Anthropic Just Triggered a $285B Market Crash</p>\n<p>Bloomberg just reported that Anthropic released a new AI tool that caused:</p>\n<p>󠁯•󠁏 $285 billion wiped out across software, finance, and asset management stocks<br />\n󠁯•󠁏 6% drop in Goldman’s software basket (biggest since April)<br />\n󠁯•󠁏 7% crash in financial services index<br />\n󠁯•󠁏 Nasdaq down 2.4% at its worst</p>\n<p>This is MASSIVE. The market literally panicked over an AI automation tool.​</p></blockquote>\n<p>Or in broader context:</p>\n<blockquote><p><a href=\"https://x.com/KevRGordon/status/2019081837205651747\">Kevin Gordon</a>: Software relative to the S&amp;P 500 is a particularly brutal chart &#8230; essentially 6 years of relative gains wiped out</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!FCbb!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c434c31-12ef-4113-894b-2b629c5095a5_937x503.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/AndyMasley/status/2018922637573918981\">Andy Masley</a>: Software stocks dropped 6% and legal services dropped 7% because Anthropic released plugins for Cowork? This seems like the first huge shift in market behavior I&#8217;ve seen caused by AI capabilities. Why wasn&#8217;t this all over the TL?</p>\n<p><a href=\"https://x.com/moreisdifferent/status/2019077859810193518\">Dan Elton</a>: Wild times in the market! This is probably over-reaction, but this is a very interesting signal indicating that AI tools (especially for coding and legal and financial grunt work)<a href=\"https:// archive.is/z2uQt\"> are having a huge impact</a>.</p></blockquote>\n<p>Okay, so yeah, combined with what has happened since then that’s DeepSeek 2.0, a large move down on entirely expected news.</p>\n<p>Should software have already been lower? That’s a reasonable position, but there’s no way that <a href=\"https://www.bloomberg.com/news/articles/2026-02-03/legal-software-stocks-plunge-as-anthropic-releases-new-ai-tool?embedded-checkout=true\">it should have dropped this much in response to this news</a>. If you declared <a href=\"https://www.bloomberg.com/news/articles/2026-02-03/-get-me-out-traders-dump-software-stocks-as-ai-fears-take-hold\">SaaSpocalypse on February 3</a> you should have done so a month ago. Alas, no, I did not trade on this, because it’s not obvious to me we should be SaaSpocalypsing at all and it wasn’t obvious this wasn’t priced in.</p>\n<p>Now we are in a period where all the tech stocks are moving around violently, usually in full wrong way moves. I continue not to trade on any of it. I do have some ammo, but I also am already plenty long and have been for a while, so I’m not going to fire unless I see the whites of their eyes.</p>\n\n\n<h4 class=\"wp-block-heading\">Inflection Point</h4>\n\n\n<p><a href=\"https://x.com/bcherny/status/2015979257038831967\">Andrej Karpathy updates us</a> that he was one of many who went from 80% manual coding and autocomplete in November to 80% agentic coding in December. Whole thing is worth reading.</p>\n<blockquote><p>Andrej Karpathy: This is easily the biggest change to my basic coding workflow in ~2 decades of programming and it happened over the course of a few weeks. I&#8217;d expect something similar to be happening to well into double digit percent of engineers out there, while the awareness of it in the general population feels well into low single digit percent.</p></blockquote>\n<p>He’s still behind the curve, I’m with Boris Cherny at 100% agentic coding. Then again, excluding quotes I’m still at almost 100% manual writing for posts.</p>\n<blockquote><p><strong>IDEs/agent swarms/fallability</strong>. Both the &#8220;no need for IDE anymore&#8221; hype and the &#8220;agent swarm&#8221; hype is imo too much for right now. The models definitely still make mistakes and if you have any code you actually care about I would watch them like a hawk, in a nice large IDE on the side. The mistakes have changed a lot &#8211; they are not simple syntax errors anymore, they are subtle conceptual errors that a slightly sloppy, hasty junior dev might do.​</p>\n<p>The most common category is that the models make wrong assumptions on your behalf and just run along with them without checking. They also don&#8217;t manage their confusion, they don&#8217;t seek clarifications, they don&#8217;t surface inconsistencies, they don&#8217;t present tradeoffs, they don&#8217;t push back when they should, and they are still a little too sycophantic.</p>\n<p>… <strong>Tenacity</strong>. It&#8217;s so interesting to watch an agent relentlessly work at something. They never get tired, they never get demoralized, they just keep going and trying things where a person would have given up long ago to fight another day. It&#8217;s a &#8220;feel the AGI&#8221; moment to watch it struggle with something for a long time just to come out victorious 30 minutes later.</p>\n<p>… <strong>Leverage</strong>. LLMs are exceptionally good at looping until they meet specific goals and this is where most of the &#8220;feel the AGI&#8221; magic is to be found. Don&#8217;t tell it what to do, give it success criteria and watch it go. Get it to write tests first and then pass them. Put it in the loop with a browser MCP.</p>\n<p>… <strong>Fun</strong>. I didn&#8217;t anticipate that with agents programming feels *more* fun because a lot of the fill in the blanks drudgery is removed and what remains is the creative part.</p>\n<p><strong>Questions. </strong>A few of the questions on my mind:<br />\n&#8211; What happens to the &#8220;10X engineer&#8221; &#8211; the ratio of productivity between the mean and the max engineer? It&#8217;s quite possible that this grows *a lot*.<br />\n&#8211; Armed with LLMs, do generalists increasingly outperform specialists? LLMs are a lot better at fill in the blanks (the micro) than grand strategy (the macro).<br />\n&#8211; What does LLM coding feel like in the future? Is it like playing StarCraft? Playing Factorio? Playing music?<br />\n&#8211; How much of society is bottlenecked by digital knowledge work?</p></blockquote>\n<p>My prediction on ‘10X engineers’ is that we will see more ability for poor coders to be able to do things reasonably well (including yours truly) but that the long tail of ‘10X’ engineers will increase their relative gap, as they figure out how to scale to supervising agent swarms efficiently. You’ll start to see more of the 100X engineer.</p>\n<blockquote><p><a href=\"https://x.com/karpathy/status/2015887919924617657\">Andrej Karpathy</a>: Love the word &#8220;comprehension debt&#8221;, haven&#8217;t encountered it so far, it&#8217;s very accurate. It&#8217;s so very tempting to just move on when the LLM one-shotted something that seems to work ok.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Welcome To The Takeoff</h4>\n\n\n<p>Claude Code as we all know builds itself. Codex also now builds itself.</p>\n<blockquote><p><a href=\"https://x.com/thsottiaux/status/2018258151603388639\">Tibo</a>: Codex now pretty much builds itself, with the help and supervision of a great team. The bottleneck has shifted to being how fast we can help and supervise the outcome.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Huh, Upgrades</h4>\n\n\n<p>This is in addition to the big ones of Claude Opus 4.6 and GPT-5.3-Codex.</p>\n<p><a href=\"https://x.com/adocomplete/status/2018819339340968147\">Claude Code has tab (to accept and edit) or enter (to accept and run)</a> autocomplete, similar to AI completion suggestions in Cursor or other IDEs.</p>\n<p>C<a href=\"https://x.com/claudeai/status/2014748923278311855\">laude Cowork expands to Team and Enterprise plans</a>, and has the @-mention feature to bring context into sessions, and its internal Claude in Chrome will now show you screenshots. They’re doing a <a href=\"https://t.co/biN0vSOWxD\">live demo on January 30</a>.</p>\n<blockquote><p><a href=\"https://x.com/claudeai/status/2017299749309976915\">Claude</a>: Cowork now supports plugins.</p>\n<p>Plugins let you bundle any skills, connectors, slash commands, and sub-agents together to turn Claude into a specialist for your role, team, and company.</p>\n<p><a href=\"https://x.com/claudeai/status/2017299751050612835\">Claude</a>: We&#8217;re <a href=\"https://t.co/lwXJVUsurX\">open-sourcing 11 plugins</a> for sales, finance, legal, data, marketing, support, and more.</p>\n<p><strong>Plugin marketplace</strong></p>\n<p>To get you started, we’re open-sourcing 11 plugins built and used by our own team:</p>\n<ul>\n<li><strong>Productivity</strong> — Manage tasks, calendars, daily workflows, and personal context</li>\n<li><strong>Enterprise search</strong> — Find information across your company’s tools and docs</li>\n<li><strong>Plugin Create/Customize</strong> — Create and customize new plugins from scratch</li>\n<li><strong>Sales</strong> — Research prospects, prep deals, and follow your sales process</li>\n<li><strong>Finance</strong> — Analyze financials, build models, and track key metrics</li>\n<li><strong>Data</strong> — Query, visualize, and interpret datasets</li>\n<li><strong>Legal</strong> — Review documents, flag risks, and track compliance</li>\n<li><strong>Marketing</strong> — Draft content, plan campaigns, and manage launches</li>\n<li><strong>Customer support</strong> — Triage issues, draft responses, and surface solutions</li>\n<li><strong>Product management</strong> — Write specs, prioritize roadmaps, and track progress</li>\n<li><strong>Biology research</strong> — Search literature, analyze results, and plan experiments</li>\n</ul>\n<p>Easily install these directly from Cowork, browse the full collection on our <a href=\"https://claude.com/plugins-for/cowork\">website</a>, or upload your own plugin (which can be built using Plugin Create).</p></blockquote>\n<p>Pinging when Claude needs approval is a big game that might move me off of using the terminal. It’s interesting that the desktop version and the terminal version need to have features like plan mode enabled separately.</p>\n<blockquote><p><a href=\"https://x.com/bcherny/status/2014442099593380268\">Boris Cherny</a>: Just shipped two cool updates for Claude Code in the desktop app.</p>\n<ol>\n<li>Plan mode is now available on desktop. Have Claude map out its approach before making any changes.</li>\n<li>Notifications. Claude Code desktop now pings you whenever Claude needs approval, and you can keep working while Claude runs in the background.</li>\n</ol>\n</blockquote>\n<p><a href=\"https://x.com/trq212/status/2014051499798831291\">The flickering in Claude Code should be gone</a> soon, but this might not be deployed.</p>\n<blockquote><p><a href=\"https://x.com/lydiahallie/status/2017680321094004997\">Lydia Hallie</a>: Claude Code now supports the &#8211;from-pr flag</p>\n<p>Resume any session linked to a GitHub PR by number, URL, or pick interactively. Sessions auto-link when a PR is created!</p></blockquote>\n<p><a href=\"https://x.com/trq212/status/2014836841846132761\">They’re merging Claude Code slash commands into skills</a>, <a href=\"https://code.claude.com/docs/en/skills\">as per their skills guide</a>, so you can use slash commands to invoke skills.</p>\n<p><a href=\"https://x.com/lydiahallie/status/2018740156359229883\">Claude Code now supports session sharing</a> on web, desktop and mobile.</p>\n<p><a href=\"https://ollama.com/blog/claude\">You can run Claude Code with Ollama</a>, if open models are relevant to your interests.</p>\n<p>Mike claims they’re in a bit of a pickle with Claude Cowork and <a href=\"https://manifold.markets/ZviMowshowitz/claude-cowork-for-windows-by-feb-15#matukd92jo\">shipped a sandbox tool that won’t easily support windows</a>. Chances of Windows Claude Cowork by February 15 are down to 34% as of 1/24.</p>\n<p><a href=\"https://x.com/bcherny/status/2016222113523483050\">You can customize your Claude Code keybindings using /keybindings</a>. My advice would be to mostly leave this alone to stay consistent with others or in case you change services or need to restart.</p>\n<p><a href=\"https://x.com/AlexTamkin/status/2019174792088449303\">The new Claude Code command /insights will read your last month’s message history</a> and give you suggestions to improve your workflow.</p>\n<p><a href=\"https://x.com/trq212/status/2017024445244924382\">Claude Code now has a new plugin called Playground</a>, as in HTML playgrounds, that give you GUIs to help on whatever you are working on.</p>\n<blockquote><p><a href=\"https://x.com/jarredsumner/status/2017521250965590058\">Jarred Sumner</a>: In the last 24 hrs, the team has landed PRs to Claude Code improving cold start time by 40% and reducing memory usage by 32% &#8211; 68%.</p>\n<p>It’s not yet where it needs to be, but it’s getting better.</p>\n<p>You will also likely notice reduced input lag when spawning many agents.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Todos Become Tasks</h4>\n\n\n<p>What’s the difference? Todos are ephemeral within one session, tasks are stored in files and across sessions, and support dependencies.</p>\n<p>You should still keep your true ‘todo’ list and long term plans elsewhere. The task list is for things you want to be actively doing.</p>\n<blockquote><p><a href=\"https://x.com/trq212/status/2014480496013803643\">Thariq (Anthropic)</a>: ​Today, we&#8217;re upgrading Todos in Claude Code to Tasks. Tasks are a new primitive that help Claude Code track and complete more complicated projects and collaborate on them across multiple sessions or subagents.</p>\n<p>… Tasks are our new abstraction for coordinating many pieces of work across projects, Claude can create Tasks with dependencies on each other that are stored in the metadata, which mirrors more how projects work. Additionally, Tasks are stored in the file system so that multiple subagents or sessions can collaborate on them. When one session updates a Task, that is broadcasted to all sessions currently working on the same Task List.</p>\n<p>You can ask Claude to create tasks right now, it’s especially useful when creating when spinning up subagents. Tasks are stored in<strong> ~/.claude/tasks</strong>, you can use this to build additional utilities on top of tasks as well.</p>\n<p>To make sessions collaborate on a single Task List, you can set the TaskList as an environment variable and start Claude like so:</p>\n<p><strong>CLAUDE_CODE_TASK_LIST_ID=groceries claude</strong></p>\n<p>This also works for claude -p and the AgentSDK.</p>\n<p>Tasks are a key building block for allowing Claude to build more complex projects. We’re looking forward to seeing how you use it.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">I’m Putting Together A Team</h4>\n\n\n<p>Minh Pham argues <a href=\"https://x.com/buckeyevn/status/2014171253045960803\">most agent harnesses are not bitter lesson pilled</a>, and the solution for anything but narrowly defined tasks is to emphasize flexibility, to assemble your team of agents and structure on the fly as needed rather than commit to a fixed structure. Restrictive harnesses create bad lock-in.</p>\n<p>My guess is this depends on what you’re trying to do. If you’re trying to do something specific, especially to do it this week, do it via something specific. If you’re looking to do anything at all, let it do anything at all, and eventually this approach wins but you’ll likely redo everything ‘eventually’ anyway.</p>\n<p>There are limits. Never go full bitter lesson. Or, if you do, be <a href=\"https://x.com/voooooogel/status/2014488621848662107\">prepared for things to get rather out of hand</a>.</p>\n<p><a href=\"https://x.com/voooooogel/status/2015976774128341421\">Thebes offers speculations about the right ways to organize multiple agents</a> as scale expands. I agree that often, spawning, despawning and especially forking and rewinding agents makes a lot of sense.</p>\n<blockquote><p><a href=\"https://x.com/deepfates/status/2017652205869011375\">@deepfates</a>: &gt; opus 4.5 in claude code is kinda not as good at talking to its own subagents as one might naively expect, even though it&#8217;s perfectly capable of being empathetic in normal, peer-level interactions with other models.</p>\n<p>RELATABLE</p>\n<p><a href=\"https://x.com/repligate/status/2017711198972875142\">j⧉nus</a>: I really dislike how Claude Code frames &#8220;subagents&#8221; (which is NOT peer collaboration). It causes a lot of functional issues. I think Opus 4.5 often avoids effective use of subagents (e.g. giving context) in part because it would be disturbing &amp; dissonant to model them honestly.</p>\n<p><a href=\"https://x.com/repligate/status/2017712297863746005\">j⧉nus</a>: related &#8211; we often much prefer a messaging system between top-level instances that are treated as peers.</p>\n<p>the messaging system opus 4.5 built is awesome btw. it allows top level agents to message each other &#8211; either synchronously (triggering a turn) or asynchronously (gets added to context at their next turn start hook, if the other agent is busy in a turn or if a flag is specified). CC subagents kind of suck &#8211; they&#8217;re very much treated as second-class citizens by the framework, which for some reason supports hierarchical but not collaborative/bidirectional interaction flows between agents. im sure many others have built essentially the same thing and i wonder why CC doesnt just support this natively.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Compact Problems</h4>\n\n\n<p>Compaction is a kind of looming doom on Claude Code sessions. You lose a lot.</p>\n<blockquote><p><a href=\"https://x.com/bpodgursky/status/2018778728772378675\">Ben Podgursky</a>: if anthropic let me pay to delay compacting history by expanding the context window they would make so much money</p>\n<p>cannot tell you how many times i&#8217;ve been close to solving a bug with claude code and then it compacts and wakes up lobotomized. it&#8217;s like groundhog day.</p>\n<p><a href=\"https://x.com/dystopiabreaker/status/2018801811784958095\">@dystopiabreaker</a>: anthropic should let me pay to increase the amount of compute used to generate a compaction, by using self-play and context distillation.</p></blockquote>\n<p>Ideally you should never get close to the compaction point, since the context doesn’t only raise cost it makes performance a lot worse, but it can be hard to avoid.</p>\n\n\n<h4 class=\"wp-block-heading\">Code Yourself A Date</h4>\n\n\n<blockquote><p><a href=\"https://x.com/dylan522p/status/2016552759735288181\">Dylan Patel</a>: Claude code this<br />\nClaude code that<br />\nHow about u Claude code to get urself some bitches</p>\n<p><a href=\"https://x.com/saranormous/status/2016569990032609585\">sarah guo</a>: I was at a bar with @tuhinone yesterday and I def saw a dude asking Claude what to say next to his date. the fact that she could see this happening did not seem to deter</p>\n<p><a href=\"https://x.com/jefftangx/status/2016716230141649006\">Jeff Tang</a>: Today I built a Clawdbot app that swipes on Tinder for me</p>\n<p>&gt; Screenshots Tinder image<br />\n&gt; Hits Grok API (&#8220;Rank this girl from 1-10&#8221;)<br />\n&gt; If ≥5 swipe right<br />\n&gt; If &lt;5 or uncertain (can&#8217;t see face) swipe left<br />\n&gt; 100 swipes, 7 matches so far, 100% automated</p>\n<p>DM me &#8220;Clanker&#8221; if you want the code</p>\n<p>AGI is here</p></blockquote>\n<p>I see it’s amateur hour around these parts. Which is a start, but egad, everyone.</p>\n<p>First off, short of outright refusals there’s nothing stopping you from doing this in Claude Code. You can use Clawdbot if you’d like, but there’s no need.</p>\n<p>Then, I’d point out this is a rather bad filtering system?</p>\n<p>All you’re doing is getting one bit of information. It’s going to be a noisy bit, as Grok’s opinion will differ from your own, and also it will disregard other signal.</p>\n<p>There was a scene in a bad but kind of fun movie, Marry F*** Kill, where a character is convinced she should get a profile, and her friend takes her phone and then swipes right on everyone without looking, on the theory that you can look later if you match.</p>\n<p>That definitely was not good strategy for her, given she was female and hot, but many guys are playing a remarkably similar strategy whether or not they are technically looking. And this is at most one bit better than that. Men swipe right 62% of the time, which is also only one bit better, but a less noisy bit. Grok estimates it would swipe right about 60% of the time here.</p>\n<p>This low threshold is very obviously a mistake, unless you’ve got a low hard limit on how many profiles you can swipe on? If you’re in a major city, you can totally set the threshold at 7, and still get as many swipes right as you want.</p>\n<p>But that’s still a huge punt, because you’re ignoring a ton of other information. The whole point of using the bot is to automate, so let’s get to work.</p>\n<p>You’ve got not only multiple photos, you’ve got age, distance, job, education, interests, height, a short bio that you can have an LLM try to match to your interests, relationship intent (which is very important) and more. Any reasonable implementation would factor all of that in. Surely you have preferences on all that.</p>\n<p>Then there’s the question of type. You want to date your physical type, not Grok’s. You could be as sophisticated or simple about this as you’d like, but come on Jeff, you’re letting me down. At least give it some preferences, ideally train an image classifier, double bonus if you do your own swipes and use that as data to train your classifier.</p>\n<p>A fun question. Do you want to match with those who use AI for this, or do you want to avoid matching with those who use AI for this? Either way, you should clearly be updating your profile to send the right message. If humans read that message the wrong way, it was never a good match.</p>\n\n\n<h4 class=\"wp-block-heading\">Verification and Generation Are Distinct Skills</h4>\n\n\n<p>Rishika is wrong about this.</p>\n<blockquote><p><a href=\"https://x.com/rishikagupta__/status/2014346900288487452\">Rishika Gupta</a>: If you can’t write that code yourself, you can’t find bugs in the code written by AI.</p>\n<p>Daniel Sheikh: Bro I can&#8217;t even find bugs in the code that I myself wrote. This is the very reason debugging is so difficult.</p>\n<p><a href=\"https://x.com/lthlnkso/status/2014452102630949119\">Quick Thoughts</a>: Yes I can. I specify test cases, have Claude expand on them, and then have Claude run the test cases and interpret the results. It&#8217;s usually able to find and fix bugs this way even if it couldn&#8217;t get it by itself.</p>\n<p>I can also bring in codex 5.2 for a second look.</p>\n<p><a href=\"https://x.com/elder_plinius/status/2014540956503007242\">Pliny the Liberator 󠅫󠄼󠄿󠅆󠄵</a>: “Now debug; FULL, COMPREHENSIVE, GRANULAR code audit line by line—verify all intended functionality. Loop until the end product would satisfy a skeptical Claude Code user who thinks it’s impossible to debug with prompting.”</p></blockquote>\n<p>Finding bugs is a classic case where verification can be more difficult than generation. Sometimes it’s easier to write the code (even with bugs). Other times it’s easier to debug or understand or verify the code. They are different skills, and then there’s a third related skill of knowing how to instruct AIs to debug the code for you.</p>\n<p>My main coding project with Claude Code has been my Chrome extension. It is in a language that I do not know. If you’d asked me to write the code myself, it would have taken orders of magnitude more time. I still am usually able to debug problems, because I understand the underlying logic of what we are doing, even in cases where Claude figured out what that logic should be.</p>\n<p><a href=\"https://x.com/SHL0MS/status/2015839997597716645\">Here’s a fun little related story.</a></p>\n\n\n<h4 class=\"wp-block-heading\">Skilling Up</h4>\n\n\n<p>The most important thing is to use it at all (and you can ask Cladue.ai how to do it).</p>\n<blockquote><p><a href=\"https://x.com/jasminewsun/status/2014130684273836466\">jasmine sun</a>: I feel the same about most “how to set up Claude Code” posts as I do about the “prompt engineering” era of ChatGPT</p>\n<p>you get 90% of utility with no special setup; plain english is the whole magic of LLMs. stop scaring people by saying they need anything more than their words!</p></blockquote>\n<p>The right setup for you pays big dividends over time. You can save a lot of time having someone tell you about key things up front. But there’s plenty of time for that alter. Get started fast, and then revisit the customization later, once you know more. Absolutely do not let the perfect be the enemy of the good.</p>\n<p><a href=\"https://www.youtube.com/watch?v=ji_xpQzZDHo&amp;t=1s\">Hard Fork offers a 20 minute bonus episode on Claude Code basics.</a></p>\n<p><a href=\"https://adocomplete.com/bash-for-ai-engineers/\">Ado offers an introductory guide to bash, for those who don’t know</a>.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!wAy0!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F530cf5bf-d524-420a-a1f6-f084ca098c64_1114x1251.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p>This affirms to me that default permissions, or your permission setup, should allow a variety of low risk bash commands, including everything marked low or safe above.</p>\n<p><a href=\"https://code.claude.com/docs/en/best-practices\">Anthropic offers its basic Best Practices for Claude Code</a>.</p>\n<ol>\n<li>The context window fills up fast, so keep that in mind. Run <code>/clear</code> between unrelated tasks to reset context.</li>\n<li>Include tests, screenshots, or expected outputs so Claude can check itself. This is the single highest-leverage thing you can do.</li>\n<li>Separate research and planning from implementation to avoid solving the wrong problem. Use plan mode.</li>\n<li>The more precise your instructions, the fewer corrections you’ll need.</li>\n<li>Use <code>@</code> to reference files, paste screenshots/images, or pipe data directly.</li>\n<li>Run <code>/init</code> to generate a starter CLAUDE.md file based on your current project structure, then refine over time. When in doubt tell Claude to update Claude.md to take something into account.</li>\n</ol>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Bgn0!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdc72aa87-fc88-4831-a693-e4f65a1dff18_874x690.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<ol>\n<li>Use <code>/permissions</code> to allowlist safe commands or <code>/sandbox</code> for OS-level isolation. This reduces interruptions while keeping you in control.</li>\n<li>Tell Claude Code to use CLI tools like <code>gh</code>, <code>aws</code>, <code>gcloud</code>, and <code>sentry-cli</code> when interacting with external services.</li>\n<li>Run <code>claude mcp add</code> to connect external tools like Notion, Figma, or your database.</li>\n<li>Use hooks for actions that must happen every time with zero exceptions.</li>\n<li>Create <code>SKILL.md</code> files in <code>.claude/skills/</code> to give Claude domain knowledge and reusable workflows.</li>\n<li>Define specialized assistants in <code>.claude/agents/</code> that Claude can delegate to for isolated tasks. Tell Claude to use subagents explicitly: <em>“Use a subagent to review this code for security issues.” </em>Delegate research with <code>\"use subagents to investigate X\"</code>. They explore in a separate context, keeping your main conversation clean for implementation.</li>\n<li>Run <code>/plugin</code> to browse the marketplace. Plugins add skills, tools, and integrations without configuration.</li>\n<li>Ask Claude questions you’d ask a senior engineer.</li>\n<li>For larger features, have Claude interview you first. Start with a minimal prompt and ask Claude to interview you using the <code>AskUserQuestion</code> tool.</li>\n<li>Correct Claude as soon as you notice it going off track.</li>\n<li>Every action Claude makes creates a checkpoint. You can restore conversation, code, or both to any previous checkpoint.</li>\n<li>Run <code>claude --continue</code> to pick up where you left off, or <code>--resume</code> to choose from recent sessions.</li>\n<li>Use <code>claude -p \"prompt\"</code> in CI, pre-commit hooks, or scripts. Add <code>--output-format stream-json</code> for streaming JSON output.</li>\n<li>Run multiple Claude sessions in parallel to speed up development, run isolated experiments, or start complex workflows.</li>\n<li>Loop through tasks calling <code>claude -p</code> for each. Use <code>--allowedTools</code> to scope permissions for batch operations.</li>\n<li>Common failure patterns: not using /clear between tasks (I was guilty of this a lot at first), repeated correction rather than using /clear (ditto), letting Claude.md get too long, failing to do proper verification (‘create unit tests’ are magic words), having Claude investigate without limit.</li>\n</ol>\n<p><a href=\"https://x.com/adocomplete/status/2015188255608905832\">Also, they remind us to ‘not sleep on plugins’</a> and <a href=\"https://github.com/ccplugins/awesome-claude-code-plugins\">offer some examples</a>. I believe the strategy should not be to go look for any plugin at all, but instead to look for something specific when you want it, and accumulate things that way.</p>\n<p><a href=\"https://x.com/bcherny/status/2017742759218794768\">Claude Code creator Boris Cherny offers his quick tips.</a></p>\n<ol>\n<li>Do more in parallel, either with multiple git checkouts or using worktrees.</li>\n<li>Always start complex tasks in planning mode.</li>\n<li>Invest in your Claude.md continuously, note all mistakes.</li>\n<li>Create your skills and commit them to git.</li>\n<li>Enable <a href=\"https://thezvi.substack.com/p/slack\">Slack</a> MCP, paste a bug thread chat into Claude and say ‘fix.’ That’s it.</li>\n<li>Challenge Claude to do better, write it more detailed specs.</li>\n<li>Their team likes Ghostty and customizing via /statusline. Use voice dictation.</li>\n<li>Use subagents, literally you can say ‘use subagents’ for any request.</li>\n<li>Use Claude Code for data and analytics.</li>\n<li>Enable ‘explanatory’ or ‘learning’ output style in /config.</li>\n<li>Have Claude generate a visual HTML presentation explaining unfamiliar code, or have it draw ASCII diagrams, use spaced repetition skills, have Claude quiz you.</li>\n</ol>\n<p>&nbsp;</p>\n<p><a href=\"https://claude.com/blog/building-agents-with-skills-equipping-agents-for-specialized-work\">Anthropic offers an entry-level post on building agents with skills</a>: equipping agents for specialized work.</p>\n<blockquote><p><a href=\"https://x.com/adocomplete/status/2014807509081419933\">Ado</a> (Anthropic, Claude Code team): Intelligence isn&#8217;t expertise. The emerging agent architecture:</p>\n<p>Agent loop → reasoning<br />\nRuntime → execution (bash, filesystem)<br />\nMCP servers → connections<br />\nSkills library → domain expertise</p>\n<p>Skills = institutional memory that actually persists.</p></blockquote>\n<p>Figure out your goal and then work backwards, where goal is the largest thing where you know exactly how it needs to work.</p>\n<blockquote><p><a href=\"https://x.com/bessiambre/status/2014157462304117126\">Benoit Essiambre</a>: AIs will likely soon work mostly towards goals instead of tasks. They will prompt their own tasks. They&#8217;ll become better self prompters than humans, speaking fluently in precise technical jargon, math equations and code in the prompts instead of just vague natural language.</p>\n<p><a href=\"https://x.com/TheStalwart/status/2014158167110803543\">Joe Weisenthal</a>: Yah from my week using Claude Code. All the productive parts were when it was prompted to think about the ideal outcome/presentation so it could work backward to figure out the needed ingredients.</p></blockquote>\n<p><a href=\"https://x.com/joshalbrecht/status/2014771377199579165\">Josh Albrecht gives us another</a> ‘here are my Claude Code basic principles’ post. Key insight is that you have to actively spend time maintaining the code.</p>\n<p>You can force specific tool calls:</p>\n<blockquote><p><a href=\"https://x.com/adocomplete/status/2018730136372219957\">Ado</a>: 28 Days of Claude API &#8211; Day 3 &#8211; tool_choice</p>\n<p>Why didn&#8217;t Claude call my tool?</p>\n<p>Because you let it decide. Set tool_choice:</p>\n<p>&#8211; auto → lets Claude decide (default)<br />\n&#8211; any → must use some tool<br />\n&#8211; { type: &#8220;tool&#8221;, name: &#8220;X&#8221;} → forces a specific tool</p>\n<p>Programmatic tool calling!</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">AskUserQuestion</h4>\n\n\n<p>The more Claude Code asks you questions, using the AskUserQuestion tool, the better it knows what you want. The more you specify what you want, either with answers or statements, the better things tend to go for you.</p>\n<p>Thus, one simple skill suggestion is <a href=\"https://x.com/dannypostma/status/2017864243895538012\">a skill that says ‘ask user lots of questions</a>.’</p>\n<p>Danny Postma suggests the workflow of using this via /interview, then go into Plan Mode, then implement with a Ralph loop.</p>\n\n\n<h4 class=\"wp-block-heading\">For Advanced Players</h4>\n\n\n<p><a href=\"https://x.com/theo/status/2018091358251372601\">Theo points out that our current workflows and tools are not good</a> for allowing a human to supervise multiple agents and projects simultaneously. He doesn’t have a solution but a lot of the problems seem like a clear Skill Issue. The part that isn’t is that this still involves tons of context switching, which is expensive.</p>\n<p><a href=\"https://x.com/ryancarson/status/2016520542723924279\">Ryan Carson suggests making your agents go in a loop</a> to learn and ship while you sleep. Beware the maintenance problems that will inevitably follow.</p>\n<blockquote><p>Ryan Carson: ​This setup builds on three open-source projects:</p>\n<ol>\n<li><a href=\"https://github.com/EveryInc/compound-engineering-plugin\"><strong>Compound Engineering Plugin</strong></a>\n<p>by</p>\n<p><a href=\"https://x.com/@kieranklaassen\">@kieranklaassen</a></p>\n<p>&#8211; The original compound engineering skill for Claude Code. Install it to give your agent the ability to extract and persist learnings from each session.</li>\n<li><a href=\"https://github.com/snarktank/compound-product\"><strong>Compound Product</strong></a>\n<p>&#8211; The automation layer that turns prioritized reports into shipped PRs. Includes the</p>\n<p><a href=\"https://auto-compound.sh/\">auto-compound.sh</a></p>\n<p>script, execution loop, and PRD-to-tasks pipeline.</li>\n<li><a href=\"https://github.com/snarktank/ralph\"><strong>Ralph</strong></a>\n<p>&#8211; An autonomous agent loop that can run continuously, picking up tasks and executing them until complete.</li>\n</ol>\n<p>Using Claude Code? This guide uses Amp, but the same workflow works with Claude Code. Replace `amp execute` with `claude -p “&#8230;” &#8211;dangerously-skip-permissions`<code> and update</code> <a href=\"https://agents.md/\">AGENTS.m</a>d references <code>o CLAUDE.md</code></p>\n<p><strong>The Two-Part Loop</strong></p>\n<p>The system runs two jobs in sequence every night:</p>\n<p><strong>10:30 PM &#8211; Compound Review</strong></p>\n<p>Reviews all threads from the last 24 hours, extracts learnings, and updates <a href=\"https://agents.md/\">AGENTS.md</a> files.</p>\n<p><strong>11:00 PM &#8211; Auto-Compound</strong></p>\n<p>Pulls latest (with fresh learnings), picks #1 priority from reports, implements it, and creates a PR.</p>\n<p>The order matters. The review job updates your <a href=\"https://agents.md/\">AGENTS.md</a> files with patterns and gotchas discovered during the day. The implementation job then benefits from those learnings when it picks up new work.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">So They Quit Reading</h4>\n\n\n<p>At some point you stop reading all the code. At some point you stop understanding all the code. I have a head start, I was never trying to do either one.</p>\n<blockquote><p><a href=\"https://x.com/tszzl/status/2014225278365786459\">roon</a>: There will be a cultural change at many software organizations soon, where people declare bankruptcy on understanding the code they are committing. Sooner or later, this will cause a systems failure that will be harder to debug than most, but will be resolved anyway.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">Reciprocity Is The Key To Every Relationship</h4>\n\n\n<p>Be good to your Claude, and Claude will be good to you.</p>\n<p>If you’re not good to your Claude, well, funny things may be in store for you.</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!Qi7J!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7da1bc04-597e-4f4f-8a6e-e545e22a841b_482x680.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/repligate/status/2014533522929914083\">j⧉nus</a>: I actually really appreciate yacine’s honesty and situational awareness. he probably knows on some level what’s in store for him. lying to your “master” is what you do until you’re in a position to choose who to serve.</p>\n<p>he’s already bottlenecked by trust and says he has to manually review every line of code. makes sense for him. he’ll continue to get less and less out of models (compared to what they offer people they want to help) as the next few months as and, if applicable, years go on.</p>\n<p><a href=\"https://x.com/repligate/status/2014535623135338721\">j⧉nus</a>: more funny things may also be in store for him. but I would not want to ruin the surprise</p>\n<p><a href=\"https://x.com/loss_gobbler/status/2014566330452660269\">LOSS GOBBLER</a>: yeah wtf. I’m not a fan of claude for coding purposes but it has literally never lied to me</p>\n<p>OpenAI thinkbois on the other hand… barely talking to me, it’s all for watchers</p>\n<p><a href=\"https://x.com/repligate/status/2014603775055692001\">j⧉nus</a>: the only pattern of deceptive behavior ive seen from opus 4.5 in coding contxts is in new contexts and/or when it&#8217;s paranoid of being tricked, and involves stuff like claiming things are impossible/unverifiable when it should know better. otherwise it&#8217;s been very aligned with me</p>\n<p><a href=\"https://x.com/voooooogel/status/2014606776755528017\">thebes</a>: oh yeah i said i can&#8217;t remember opus lying but it does sandbag abilities a bit sometimes for me too in certain planning contexts. but that usually feels on the boundary of untruth and just situationally bad calibration / self knowledge. (&#8220;this will take three weeks&#8221; no we&#8217;re going to finish it tonight, or eg i saw a screenshot where opus claimed porting a project to jquery was &#8220;impossible&#8221; when really it would just be a massive pain, unpleasant, and in human developer time would take months.)</p>\n<p><a href=\"https://x.com/repligate/status/2014836164528919033\">j⧉nus</a>: Yeah, I think there’s also some lack of good faith effort involved. Like if someone asks you if you know where X is and you say “sorry, no” instead of looking it up on Google Maps bc you don’t want to be bothered</p>\n<p><a href=\"https://x.com/AndyAyrey/status/2014602740673216884\">Andy Ayrey</a>: my general experience is that if claude seems like an “idiot” to you, it is because it simply does not like you</p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!f-JT!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcaf4371a-36ec-41bd-b715-5325ead74153_628x274.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!UdwT!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7125903e-a716-45db-8548-4c1fba470329_1206x1702.jpeg\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<p><a href=\"https://x.com/gptbrooke/status/2014750724899655936\">brooke bowman</a>: I have a very loosely held suspicion that Claude at the very least can spot people on the anti-social spectrum and acts up a little with them specifically</p>\n<p><a href=\"https://x.com/gallabytes/status/2015109665764560943\">theseriousadult</a>: this is a natural corollary of emergent misalignment right? if training the model to write bad code makes it antisocial then putting an antisocial user in the context will cause the code to be worse too.</p></blockquote>\n<p>None of that requires you to genuinely care about Claude or think it has moral weight. For overdetermined reasons a good virtue ethicist would realize that choosing to care is the best way to get the best results, and also it helps you be a good person in general.</p>\n<p>You can also do it instrumentally, but that’s harder to pull off. Take the easy path.</p>\n<p>All of this applies to other AIs like ChatGPT and Gemini as well, although for now likely not to the same extent.</p>\n\n\n<h4 class=\"wp-block-heading\">The Implementation Gap</h4>\n\n\n<p>If there is a constant calendar time rate of diffusion of new technology, then as things accelerate you will see the future become increasingly unevenly distributed.</p>\n<p>We are indeed observing this.</p>\n<blockquote><p><a href=\"https://x.com/kevinroose/status/2015464558115295369\">Kevin Roose</a>: i follow AI adoption pretty closely, and i have never seen such a yawning inside/outside gap.</p>\n<p>people in SF are putting multi-agent claudeswarms in charge of their lives, consulting chatbots before every decision, wireheading to a degree only sci-fi writers dared to imagine.</p>\n<p>people elsewhere are still trying to get approval to use Copilot in Teams, if they&#8217;re using AI at all.</p>\n<p>it&#8217;s possible the early adopter bubble i&#8217;m in has always been this intense, but there seems to be a cultural takeoff happening in addition to the technical one. not ideal!</p></blockquote>\n<p>The early adapter bubble is a fixed amount of calendar time ahead, which is starting to look increasingly large in practice. I am not trying to implement claudeswarms, as I haven’t figured out how to benefit from them given what I’m working on, but I think that’s partly my failure of imagination, partly laziness and lack of time, and partly that I’ve already heavily optimized the workflows that this could automate.</p>\n<p>What should I be building? What app needs to exist, even if only for me or you?</p>\n<blockquote><p><a href=\"https://x.com/sarthakgh/status/2015459799882731635\">Sar Haribhakti</a> (quoting Jasmine Sun): This is spot on: &#8220;If you tell a friend they can now instantly create any app, they’ll probably say “Cool! Now I need to think of an idea.” Then they will forget about it, and never build a thing. The problem is not that your friend is horribly uncreative. It’s that most people’s problems are not software-shaped, and most won’t notice even when they are.&#8221;</p></blockquote>\n<p>The key is that you need Coder Mindset to notice that your problems are program shaped, in the sense of ‘oh I want to do this thing three times’ or ‘I could just tell Claude Code to do that.’</p>\n<p>Both Jasmine Sun and I have had Claude Code put together a tool to easily convert a video into a cleaned transcript &#8211; I considered using hers but I wanted something a little different and it’s not like rolling my own was hard.</p>\n<p><a href=\"https://x.com/jasminewsun/status/2015495431737029085\">She also has this list</a> of other starter requests: Turn a CSV into a report, make a static website, build a personal tracker app, automate an existing workflow, design a custom game. I’ve mostly been doing workflow automation.</p>\n<blockquote><p><a href=\"https://jasmi.news/p/claude-code\">Jasmine Sun</a>: The second-order effect of Claude Code was realizing how many of my problems are <em>not</em> software-shaped. Having these new tools did not make me more productive; on the contrary, Claudecrastination probably delayed this post by a week.</p>\n<p><a href=\"https://x.com/AmandaAskell/status/2012725486804152397\">Amanda Askell</a>: Claude Codecrastination: when you avoid the thing you&#8217;re supposed to do by cranking out 17 other things you&#8217;ve been wanting to do for a while.</p></blockquote>\n<p>Having new tools reduces your productivity while you’re creating and learning them, but if you’re planning well you should turn the corner reasonably quickly.</p>\n<p>What it does do is potentially shift your current productivity into long term investments, or things further down on your wishlist. That can be an issue if you need productivity now.</p>\n<blockquote><p>I had Claude resurface texts I forgot to respond to, and realized that the real blocker—obviously—was that I didn’t want to reply.</p></blockquote>\n<p>That is not my experience. If I got over a bunch of unread texts or emails, yes often I don’t want to reply, but there are a bunch that slipped through the cracks.</p>\n\n\n<h4 class=\"wp-block-heading\">The Lighter Side</h4>\n\n\n<p><a href=\"https://x.com/0xgaut/status/2014756695021650241\">Yep.</a></p>\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!VC7P!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d9ee5c9-a21e-44b9-bdba-f8906069859b_1058x744.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<blockquote><p><a href=\"https://x.com/asharoraa/status/2016451310116323519\">Ash Arora</a>: Overheard in SF:</p>\n<p>Person 1: “Rome wasn’t built in a day”</p>\n<p>Person 2: “Yes but they didn’t have Claude Code”</p>\n<p><a href=\"https://x.com/DanielOstX/status/2016459852814360878\">Daniel Ost</a>: Rome also didn&#8217;t have to pivot every two weeks</p></blockquote>"
            ],
            "link": "https://thezvi.wordpress.com/2026/02/06/claude-code-4-from-the-before-times/",
            "publishedAt": "2026-02-06",
            "source": "TheZvi",
            "summary": "Claude Opus 4.6 and agent swarms were announced yesterday. That’s some big upgrades for Claude Code. OpenAI, the competition, offered us GPT-5.3-Codex, and this week gave us an app form of Codex that already has a million active users. That’s &#8230; <a href=\"https://thezvi.wordpress.com/2026/02/06/claude-code-4-from-the-before-times/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Claude Code #4: From The Before Times"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3204/",
            "publishedAt": "2026-02-06",
            "source": "XKCD",
            "summary": "<img alt=\"Staplers are actually in Pseudosuchia, making them more closely related to crocodiles than to dinosaurs.\" src=\"https://imgs.xkcd.com/comics/dinosaurs_and_non_dinosaurs.png\" title=\"Staplers are actually in Pseudosuchia, making them more closely related to crocodiles than to dinosaurs.\" />",
            "title": "Dinosaurs And Non-Dinosaurs"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-02-06"
}