{
    "articles": [
        {
            "content": [
                "<p>On Sunday evening, I quietly swapped out a key tool that I use to write this site.\nIt’s a big deal for me, but hopefully nobody else noticed.</p>\n<p>The tool I changed was my <a href=\"https://en.wikipedia.org/wiki/Static_site_generator\">static site generator</a>.\nI write blog posts in text files using <a href=\"https://daringfireball.net/projects/markdown/\">Markdown</a>, and then my static site generator converts those text files into HTML pages.\nI upload those HTML pages to my web server, and they become available as my website.</p>\n<p>I’ve been using a Ruby-based static site generator called <a href=\"https://jekyllrb.com\">Jekyll</a> since late 2017, and I’ve replaced it with a Python-based static site generator called Mosaic.\nIt’s a new tool I wrote specifically to build this website, so I know exactly how it works.\nI’m getting rid of a Ruby tool I only half-understand, in favour of a Python tool I understand well.</p>\n<p>Nothing is changing for readers (yet).\nI tried hard to avoid breaking anything – URLs haven’t changed, pictures look identical, the RSS feed should be the same as before.\nPlease <a href=\"https://alexwlchan.net/contact/\">let me know</a> if you spot something broken!</p>\n<p>You’ll see more changes soon, because I have lots of ideas to try this year.\nI want to make this website into more of a <a href=\"https://tomcritchlow.com/2019/02/17/building-digital-garden/\">“digital garden”</a>, getting even further away from <a href=\"https://alexwlchan.net/2024/not-all-posts/\">a single list</a> of chronologically ordered posts.\nI don’t want to build that with Jekyll – or to be precise, I don’t want to build it with Ruby.</p>\n<h2 id=\"it-s-not-ru-by-it-s-me\">It’s not Ru(by), it’s me</h2>\n<p>I don’t want to sound dismissive of Jekyll.\nIt’s an impressive project that powers thousands of sites, and I used it happily for over eight years.\nI pushed it to build a lot of custom and bespoke pages, and it handled it with ease.</p>\n<p>Jekyll’s superpower is its <a href=\"https://jekyllrb.com/docs/themes/\">theming</a> and <a href=\"https://jekyllrb.com/docs/plugins/\">plugin system</a>, which allow you to customise its behaviour.\nWant something that Jekyll can’t do out of the box?\nCreate your own template or plugin.\nBut those plugins have to be written in Ruby, the same language as Jekyll itself – and I only write Ruby to make blog plugins.\nI can do it, but I’m slow, I’m unsure, and writing Ruby has never felt familiar.</p>\n<p>You can build a digital garden with Jekyll and Ruby – plenty of people already have – but I know I’d find it a difficult and frustrating experience.\nMy lack of Ruby experience would slow me down.</p>\n<p>While my Ruby knowledge has sat still, I’ve become a much better Python programmer.\nSince I set up Jekyll in 2017, I’ve worked on big Python projects with extensive tests, thorough data validation, and an explicit goal of longevity.\nI tried writing a Python static site generator in 2016 and I got stuck; a decade later and I’m ready for another attempt.</p>\n<p>This isn’t just general Python expertise – I’ve written about how I’m using <a href=\"https://alexwlchan.net/2024/static-websites/\">static websites for tiny archives</a>, and all the surrounding tools are written in Python.\nPorting this website to Python means I can reuse a lot of that code.</p>\n<p>I hacked together an experimental Python static site generator over Christmas, and I wrote it properly over the last few weeks.\nI named it “Mosaic” after the square-filled headers on every page, and I really like it.\nI already feel faster when I’m working on the site, writing a language I know properly.</p>\n<h2 id=\"how-does-mosaic-work\">How does Mosaic work?</h2>\n<p>Mosaic works like other static site generators: it reads a folder full of Markdown files, converts them to HTML, and writes the HTML into a new folder.\nAnd just like Jekyll and similar tools, I’m building on powerful open-source libraries.</p>\n<p>Here’s a comparison of the key dependencies:</p>\n\n<table class=\"block\" id=\"comparison\">\n<thead>\n<tr>\n<th>Purpose</th>\n<th>Jekyll</th>\n<th>Mosaic</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Templates</td>\n<td><a href=\"https://shopify.dev/docs/api/liquid\">Liquid</a></td>\n<td><a href=\"https://jinja.palletsprojects.com/en/stable/\">Jinja</a></td>\n</tr>\n<tr>\n<td>Markdown rendering</td>\n<td><a href=\"https://kramdown.gettalong.org/\">kramdown</a></td>\n<td><a href=\"https://mistune.lepture.com/en/latest/\">Mistune</a></td>\n</tr>\n<tr>\n<td>Image generation</td>\n<td><a href=\"https://github.com/libvips/ruby-vips\">ruby-vips</a></td>\n<td><a href=\"https://pillow.readthedocs.io/en/stable/\">Pillow</a></td>\n</tr>\n<tr>\n<td>Syntax highlighting</td>\n<td><a href=\"http://rouge.jneen.net\">Rouge</a></td>\n<td><a href=\"https://pygments.org/\">Pygments</a></td>\n</tr>\n<tr>\n<td>Data validation</td>\n<td><a href=\"https://github.com/voxpupuli/json-schema/\">json-schema</a></td>\n<td><a href=\"https://docs.pydantic.dev/latest/\">Pydantic</a></td>\n</tr>\n<tr>\n<td>HTML linting</td>\n<td><a href=\"https://github.com/gjtorikian/html-proofer\">HTMLProofer</a></td>\n<td>???</td>\n</tr>\n</tbody>\n</table>\n<p>Here are some thoughts on each.</p>\n<h3 id=\"templates-with-jinja\">Templates with Jinja</h3>\n<p>Jinja is the templating engine used by <a href=\"https://flask.palletsprojects.com/en/stable/\">Flask</a>, a framework I’ve used to build dozens of small web apps, so I was very familiar with the basic syntax.\nIt’s similar to Liquid – both use <code>{% … %}</code> for operators and <code>{{ … }}</code> to insert values – so I could reuse my templates with only small changes.</p>\n<p>The tricky part was replicating my custom tags, which I’d previously implemented using <a href=\"https://jekyllrb.com/docs/plugins/tags/\">Jekyll plugins</a>.\nI had to write my own <a href=\"https://jinja.palletsprojects.com/en/stable/extensions/#module-jinja2.ext\">Jinja extensions</a>, which are harder than writing Jekyll tags.\nIn Jinja, I have to interact directly with the lexer and parser, whereas a Jekyll plugin is a simple <code>render</code> function.</p>\n<h3 id=\"markdown-with-mistune\">Markdown with Mistune</h3>\n<p>Mistune is a Markdown library I discovered while working on this project.\nI used <a href=\"https://python-markdown.github.io/\">Python-Markdown</a> previously, but Mistune is faster and easier to extend.\nIn particular, it provides a friendly way to <a href=\"https://mistune.lepture.com/en/latest/renderers.html#customize-htmlrenderer\">customise the HTML output</a> by overriding named methods.\nFor example, I can add an <code>id</code> attribute to my headings by overriding the <code>header(text, level)</code> method.</p>\n<p>The tricky part about changing Markdown renderer is all the subtle differences in the places where Markdown isn’t defined clearly.\nMistune and kramdown return the same output in 95% of cases, but there’s a lot of variation and broken HTML in the remaining 5%.</p>\n<p>One particular difficulty was all my <a href=\"https://daringfireball.net/projects/markdown/syntax#html\">inline HTML</a>.\nThis is one of my favourite Markdown features – you can include arbitrary HTML and it gets passed through as-is – and I make heavy use of it in this blog.\nBut kramdown and Mistune disagree about where inline HTML starts and ends, and Mistune was wrapping <code>&lt;p&gt;</code> tags around HTML that kramdown left unchanged.\nI had to adjust my templates and whitespace to help Mistune distinguish Markdown and HTML.</p>\n<h3 id=\"image-generation-with-pillow\">Image generation with Pillow</h3>\n<p>I generate <a href=\"https://alexwlchan.net/2023/picture-plugin/\">multiple sizes and formats</a> for every image, so they get served in a fast and efficient way.\nI use Pillow to generate each of those derivatives.</p>\n<p>Pillow is easier to install and supports a wider range of image formats than any of the Ruby gems I tried; it’s a highlight of the Python ecosystem.</p>\n<p>The picture handling code has always been the thorniest bit of the website, and I hope that building it atop a nicer library will give me the space to simplify that code.</p>\n<h3 id=\"syntax-highlighting-with-pygments\">Syntax highlighting with Pygments</h3>\n<p>Rouge and Pygments are both capable libraries, and they return compatible HTML which made it easy to switch – I could reuse my CSS and my <a href=\"https://alexwlchan.net/2025/syntax-highlighting/\">syntax highlighting tweaks</a>.</p>\n<p>I think Pygments theoretically supports highlighting a wider variety of languages, but I never found Rouge lacking so it’s not a meaningful improvement.</p>\n<h3 id=\"data-validation-with-pydantic\">Data validation with Pydantic</h3>\n<p>Every Markdown file in my site has <a href=\"https://jekyllrb.com/docs/front-matter/\">YAML “front matter”</a> for storing metadata, for example:</p>\n<pre class=\"lng-yaml\"><code>---\nlayout<span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">post</span>\ntitle<span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">Swapping gems for tiles</span>\n---</code></pre>\n<p>Jekyll treats this as arbitrary data and doesn’t do any validation on it, which made it harder to change and keep consistent as the site evolved.\nI built a rudimentary validation layer using json-schema, but it was always an add-on.</p>\n<p>In Mosaic, this front matter is parsed straight into a Pydantic model, so it’s type-checked throughout my code.\nThis means I can write stricter validation checks, and catch more issues and inconsistencies before they break the website.</p>\n<h3 id=\"linting-html-with-html-proofer\">Linting HTML with HTML-Proofer</h3>\n<p>I’ve been using the <a href=\"https://github.com/gjtorikian/html-proofer\">HTMLProofer gem</a> to check my HTML since 2019.\nIt checks my HTML for errors like broken links or missing images, so I’m less likely to publish a broken page.\nIt’s caught so many mistakes.</p>\n<p>There’s no obvious Python equivalent, so for now I’m still running it as a separate step after I generate my HTML.\nIt has a much lower overhead than running Jekyll so I’m not in a hurry to remove it – although eventually I’d like to reimplement the checks I care about with <a href=\"https://www.crummy.com/software/BeautifulSoup/\">BeautifulSoup</a>, so I can fully expunge Ruby.</p>\n<p>I’m also considering using <a href=\"https://playwright.dev\">Playwright</a> for some static site testing, but that’s a larger piece of work.</p>\n<h2 id=\"it-s-not-named-after-a-museum-in-georgia\">It’s not named after a museum in Georgia</h2>\n<p>The name isn’t so important, because I’m the only person who will ever use this tool – but I discovered a fun nugget that’s too juicy not to share.</p>\n<p>I named my tool “Mosaic” after the tiled headers that appear at the top of every page.\nThose headers are a design element I added in 2016, and I’m so fond of them now I can’t imagine getting rid of them.\nI later remembered that Mosaic is also the name of <a href=\"https://en.wikipedia.org/wiki/Mosaic_web_browser\">a discontinued web browser</a>, and I like the “old web” vibes of that name.\nOne of the best compliments I’ve ever received about this site was “it looks like something from the 1990s” – fast, clean, and not junked up with ads.</p>\n<p>One of the bizarre things I discovered while writing this post is that it’s not the first time the names “Mosaic” and “Jekyll” have appeared alongside each other.</p>\n<p>There’s a small historical island off the coast of Georgia (the USA one) called <a href=\"https://en.wikipedia.org/wiki/Jekyll_Island\">Jekyll Island</a>.\nIt includes bike trails, golf courses, a beach that’s been in several films… and a history museum called <a href=\"https://en.wikipedia.org/wiki/Jekyll_Island_Museum\">Mosaic</a>.\nWhat are the chances?</p>\n<p>I know nothing about Jekyll Island or the history of Georgia, but if I ever feel safe enough to return to the US, I’d love to visit.</p>\n<h2 id=\"growing-the-garden\">Growing the garden</h2>\n<p>I’ve been using Mosaic for several weeks and I’m really enjoying it.\nI wouldn’t recommend using it for anything else – it’s only designed to build this exact site – but all the <a href=\"https://github.com/alexwlchan/alexwlchan.net/tree/main/mosaic\">source code is public</a>, if you’d like to read it and understand how it works.</p>\n<p>Switching to Mosaic has allowed me to start working on three improvements to the site:</p>\n<ol>\n<li><p><strong>Replace my “today I learned” (TIL) posts with “notes”.</strong>\nI really like how the TIL section has allowed me to write more frequent, smaller posts, but they’re still point-in-time snapshots.\nI want to replace them with notes that aren’t tied to a particular date, and instead can be living documents I update as I learn more.</p>\n</li>\n<li><p><strong>Make the list of topics more useful.</strong>\nMy current tags page is a wall of text, a list of 241 keywords with minimal context or explanation.\nNobody is wading through that to find something interesting – I want to add some hierarchy to make it easier to read, and give a better overview of the site.</p>\n</li>\n<li><p><strong>Fold my book reviews into my main site.</strong>\nMy book reviews currently live on a separate site, which is only half-maintained.\nI’d like to merge them into the main site, let them benefit from the design improvements here, and start writing reviews of other entertainment.</p>\n</li>\n</ol>\n<p>I’ve had these ideas for months, and I’m excited to finally ship them, and bring this site closer to my idea of a “digital garden”</p>\n\n    <p>[If the formatting of this post looks odd in your feed reader, <a href=\"https://alexwlchan.net/2026/mosaic/?ref=rss\">visit the original article</a>]</p>"
            ],
            "link": "https://alexwlchan.net/2026/mosaic/?ref=rss",
            "publishedAt": "2026-01-31",
            "source": "Alex Chan",
            "summary": "<p>On Sunday evening, I quietly swapped out a key tool that I use to write this site. It’s a big deal for me, but hopefully nobody else noticed.</p> <p>The tool I changed was my <a href=\"https://en.wikipedia.org/wiki/Static_site_generator\">static site generator</a>. I write blog posts in text files using <a href=\"https://daringfireball.net/projects/markdown/\">Markdown</a>, and then my static site generator converts those text files into HTML pages. I upload those HTML pages to my web server, and they become available as my website.</p> <p>I’ve been using a Ruby-based static site generator called <a href=\"https://jekyllrb.com\">Jekyll</a> since late 2017, and I’ve replaced it with a Python-based static site generator called Mosaic. It’s a new tool I wrote specifically to build this website, so I know exactly how it works. I’m getting rid of a Ruby tool I only half-understand, in favour of a Python tool I understand well.</p> <p>Nothing is changing for readers (yet). I tried hard to avoid breaking anything – URLs haven’t changed, pictures look identical, the RSS feed should be the same as before. Please <a href=\"https://alexwlchan.net/contact/\">let me know</a> if you spot something broken!</p> <p>You’ll see more changes soon, because I have lots of ideas to try this year. I want to make this website",
            "title": "Swapping gems for tiles"
        },
        {
            "content": [],
            "link": "https://lucumr.pocoo.org/2026/1/31/pi/",
            "publishedAt": "2026-01-31",
            "source": "Armin Ronacher",
            "summary": "<p>If you haven&#8217;t been living under a rock, you will have noticed this week that a project of my friend Peter <a href=\"https://en.wikipedia.org/wiki/OpenClaw\">went viral on the internet</a>. It went by many names. The most recent one is <a href=\"https://openclaw.ai/\">OpenClaw</a> but in the news you might have encountered it as ClawdBot or MoltBot depending on when you read about it. It is an agent connected to a communication channel of your choice that <a href=\"https://lucumr.pocoo.org/2025/7/3/tools/\">just runs code</a>.</p> <p>What you might be less familiar with is that what&#8217;s under the hood of OpenClaw is a little coding agent called <a href=\"https://github.com/badlogic/pi-mono/\">Pi</a>. And Pi happens to be, at this point, the coding agent that I use almost exclusively. Over the last few weeks I became more and more of a shill for the little agent. After I gave a talk on this recently, I realized that I did not actually write about Pi on this blog yet, so I feel like I might want to give some context on why I&#8217;m obsessed with it, and how it relates to OpenClaw.</p> <p>Pi is written by <a href=\"https://mariozechner.at/\">Mario Zechner</a> and unlike Peter, who aims for &#8220;sci-fi with a touch of madness,&#8221; <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"https://lucumr.pocoo.org/feed.xml#fn-1\">1</a></sup>",
            "title": "Pi: The Minimal Agent Within OpenClaw"
        },
        {
            "content": [
                "<h1>Manufacturing as Maintenance</h1>\n<p>The maintenance spectrum has two ends.</p>\n<p>At one end, an object is lovingly maintained with effort and care through the years. A cherished blade sharpened on a whetstone every few months.</p>\n<p>At the other end, we have manufacturing: just toss the dull knife into the smelter at one end of a factory, and out the other end comes a beautiful, perfect, factory-sharp replacement.</p>\n<p>The former garners respect. And it's easy to see why: frequent maintenance was requisite for civilization until the Industrial Revolution. When a suit of armor took months of skilled labor to produce, you'd better maintain it well.</p>\n<p>So our culture developed in a world where maintenance has a quasi-moral component and is nearly synonymous with virtue.</p>\n<p>My own aesthetic preference is the opposite. Maintenance is tedium. It's using up valuable mental real estate perpetually juggling the upkeep status of all the objects in my life.</p>\n<p>The modal reaction to this preference is mild revulsion. Our culture has inculcated in us the morality of thrifty maintenance.</p>\n<p>I propose the opposite: the amount of precious time and effort spent on maintenance is a disgusting waste of human potential.</p>\n<p>We should view the need for maintenance as a historical burden to be shrugged off, just as we've shrugged off the need for most people to participate in back-breaking agriculture.</p>\n<p>The most common reason people give for preferring maintenance over manufacturing is <em>wastefulness</em>. Re-forging a knife is <em>wasteful</em>. But what's being wasted?</p>\n<p>The metal is not destroyed or transmuted into some lesser element. The only \"waste\" is the energy needed to melt my dull knife and cast it into a new, sharp one. In our industrial age, this is only a few <em>cents'</em> worth of energy.</p>\n<p>And in our industrial age, the cheapest energy is bountiful, clean solar.</p>\n<p>Rather than spending 10 minutes sharpening a knife on a whetstone, you'd be better off spending 10 minutes making solar panels, and then using those solar panels to melt and reforge your old knife.</p>\n<p>A market economy, of course, intermediates all this, but the thought experiment is still a useful way to show how our inherited intuitions on alleged wastefulness are wrong.</p>\n<p>There are more benefits to manufacturing as maintenance.</p>\n<p><strong>Rebirth is a cleansing fire. Rebirth is a chance to start anew. With continual re-making, we get better at making.</strong></p>\n<p>How much better would home construction be if we rebuilt every 10 years instead of every 50?</p>\n<p>We'd have 5x the societal experience. Every homebuilder could be a master of his craft in 5 years instead of 25.</p>\n<p>Homes would never be long out of date. No knob-and-tube wiring to contend with. No lead pipes. A home built in the 2000s would have Ethernet cable running throughout. And one in the 2010s would have a WiFi mesh in the walls.</p>\n<p>Homes would transform to grow with families. A starter home in your 20s. A home for kids in your 30s, and a different one for teens in your 40s. Then another for empty-nesters in their 50s.</p>\n<p>We'd build them much faster and cheaper. What shortcuts and simplifications can you make if you know you'll tear it down 10 years later? How would society change when a home costs only a few months' salary, and could be built in a month?</p>\n<p><strong>We are headed this way</strong>.</p>\n<p>People increasingly don't maintain modular desktop computers whose parts can be upgraded piecemeal. They buy a brand new maintenance-free laptop every 5 years.</p>\n<p>Electric cars, too, require very little maintenance, and aren't likely to join the ranks of classic cars people lovingly maintain for a half-century.</p>\n<p>Homes, too, will be swept up in this.</p>\n<p>Industrial production of homes has existed for decades, but only at the low end: manufactured mobile homes designed for trailer parks or rural plots.</p>\n<p>But a few startups are succeeding at industrial production of homes. <a href=\"https://buildcover.com/\">Cover</a>, for example, builds luxury homes in record time.</p>\n<p>Even without producing components in a factory like <em>Cover</em>, technologies such as humanoid robotics would get us there anyway. Imagine a squad of fifty humanoid robots descending on a homebuilding site, working 24/7 with inhumanly perfect coordination and plan-adherence. They'd finish in days.</p>\n<p><strong>I'm reminded of <a href=\"https://en.wikipedia.org/wiki/Ise_Shrine\">Ise Jingū</a></strong>, a Shintō shrine that is ceremonially rebuilt every 20 years.</p>\n<p>It's a manifestation of the concept of <em>tokowaka</em> (常若). The word literally means \"ever-young\". It's the idea that vitality is preserved with periodic renewal.</p>\n<p>The direction of industrial society is toward ubiquitous <em>tokowaka</em>. We should throw off our fetishization of maintenance and actively work towards this.</p>\n<hr />\n<p><strong>A quick postscript on pollution:</strong> modern chemistry has enabled the creation of materials that are not readily renewed with energy alone.</p>\n<p>Such products are popular in large part because they are so low-maintenance, but that chemical durability results in pollution.</p>\n<p>By embracing manufacturing-as-maintenance of products made of recyclable materials like metal and wood, we can draw people away from such polluting materials.</p>"
            ],
            "link": "https://grantslatton.com/manufacturing-as-maintenance",
            "publishedAt": "2026-01-31",
            "source": "Grant Slatton",
            "summary": "<h1>Manufacturing as Maintenance</h1> <p>The maintenance spectrum has two ends.</p> <p>At one end, an object is lovingly maintained with effort and care through the years. A cherished blade sharpened on a whetstone every few months.</p> <p>At the other end, we have manufacturing: just toss the dull knife into the smelter at one end of a factory, and out the other end comes a beautiful, perfect, factory-sharp replacement.</p> <p>The former garners respect. And it's easy to see why: frequent maintenance was requisite for civilization until the Industrial Revolution. When a suit of armor took months of skilled labor to produce, you'd better maintain it well.</p> <p>So our culture developed in a world where maintenance has a quasi-moral component and is nearly synonymous with virtue.</p> <p>My own aesthetic preference is the opposite. Maintenance is tedium. It's using up valuable mental real estate perpetually juggling the upkeep status of all the objects in my life.</p> <p>The modal reaction to this preference is mild revulsion. Our culture has inculcated in us the morality of thrifty maintenance.</p> <p>I propose the opposite: the amount of precious time and effort spent on maintenance is a disgusting waste of human potential.</p> <p>We should view the need for maintenance as",
            "title": "Manufacturing as Maintenance"
        },
        {
            "content": [
                "<p>I’ve spent the last few months talking to B2B SaaS vendors and I noticed a common pattern: “Our product is more powerful than ever, but customers aren’t using half of it.”</p>\n\n<p><strong>This is the silent crisis in B2B SaaS right now.</strong> You’re losing deals and renewals not because your product lacks features, but because customers can’t make your rigid platform match their actual processes.</p>\n\n<!--more-->\n\n<h2 id=\"the-consolidation-wave-youre-not-ready-for\">The Consolidation Wave You’re Not Ready For</h2>\n\n<p>The average enterprise now manages 275 SaaS applications at $49M in annual spend, <a href=\"https://zylo.com/reports/2025-saas-management-index/\">according to Zylo’s data</a>. That’s a 9.3% year-over-year increase in spending while portfolios only grew 2.2%.</p>\n\n<p>Read that again: <strong>vendors raised prices 4x faster than companies added new tools.</strong></p>\n\n<p>CFOs are noticing. CIOs are noticing. And when renewal season comes, they’re asking one question that should terrify every B2B SaaS vendor:</p>\n\n<p><strong>“What’s our actual utilization rate on this platform?”</strong></p>\n\n<p>If the answer is “60% of licenses are active but users only touch 30% of the features because our workflows don’t match theirs,” you’re toast. You’re the first thing cut when consolidation pressure hits.</p>\n\n<h2 id=\"the-engineering-death-spiral\">The Engineering Death Spiral</h2>\n\n<p>Here’s what’s killing you: every customer has slightly different workflows. Your ERP works great if you do approvals <em>exactly</em> the way you designed it. Your CRM is powerful if you follow your opinionated process.</p>\n\n<p>But no two enterprises run the same way. Customer A needs three approval stages. Customer B needs five, with different routing logic. Customer C needs to pull data from systems you’ve never heard of.</p>\n\n<p>So what happens?</p>\n\n<p>Your sales team promises “we can customize that” to close the deal. Then your customer-facing teams discover the customization requires engineering work. Engineering says “we’ll prioritize it for Q3.” Q3 becomes Q1 next year. Meanwhile, the customer is manually working around your rigid workflows, adoption tanks, and at renewal they say “we’re not getting value.”</p>\n\n<p><strong>You’re caught in a death spiral:</strong></p>\n<ol>\n  <li>Rigid platform → low adoption</li>\n  <li>Low adoption → customers request workflow changes</li>\n  <li>Changes require engineering → long wait times</li>\n  <li>Long wait times → deals stall, adoption suffers, renewals at risk</li>\n  <li>Lost revenue → pressure to raise prices on remaining customers</li>\n  <li>Higher prices + same adoption problems = more churn</li>\n</ol>\n\n<p>And the worst part? <strong>Your competitors who solve this problem will eat your customers during the consolidation wave.</strong></p>\n\n<h2 id=\"the-roi-measurement-problem\">The ROI Measurement Problem</h2>\n\n<p><a href=\"https://www.mckinsey.com/industries/technology-media-and-telecommunications/our-insights/the-net-revenue-retention-advantage-driving-success-in-b2b-tech\">McKinsey reports</a> that B2B buyers are increasingly demanding performance guarantees and outcome-based pricing. They’re done paying for “powerful platforms” that sit mostly unused.</p>\n\n<p>When a CFO scrutinizes that $49M SaaS portfolio, underutilized platforms get axed. Period.</p>\n\n<p>The problem is that your platform <em>could</em> drive massive ROI—if customers could actually adapt it to their workflows without waiting 8 months for engineering. But they can’t, so adoption stays low, and low adoption reads as “no ROI” when renewal comes.</p>\n\n<p>You’re losing deals not because your product is bad, but because <strong>you can’t prove ROI fast enough in a world where every SaaS dollar is under scrutiny.</strong></p>\n\n<h2 id=\"the-customer-facing-team-bottleneck\">The Customer-Facing Team Bottleneck</h2>\n\n<p>Here’s the answer nobody wants to hear: <strong>your customer-facing teams need to deliver workflow customizations directly.</strong></p>\n\n<p>Not engineering. Not after a 6-month roadmap process. <em>Directly.</em></p>\n\n<p>Your Customer Success, Solutions, Implementation, and Sales teams are the ones who:</p>\n<ul>\n  <li>Actually understand customer workflows</li>\n  <li>Have relationships with customer stakeholders</li>\n  <li>Know exactly what’s blocking adoption and expansion</li>\n  <li>Are already measured on retention, growth, and deal velocity</li>\n  <li>See the same workflow patterns across multiple customers</li>\n</ul>\n\n<p>Right now, these teams are glorified ticket filers. Customer needs a workflow adjustment? File a feature request. Customer wants custom approval routing? Add it to the backlog. Customer struggling with adoption because your UI doesn’t match their process? Send them “best practices” documentation.</p>\n\n<p>Then they watch the deal stall, the renewal at risk, the expansion conversation die—all because engineering won’t prioritize a workflow change that affects 15 customers when there’s core product work to ship.</p>\n\n<p><strong>This is what’s killing your growth.</strong> The people who can drive adoption, expansion, and retention are blocked from doing their job by engineering capacity constraints.</p>\n\n<p>What if when your Implementation team discovered that 20 customers struggle with the same workflow, they could <em>deliver a solution</em> in days instead of filing a request that dies in the backlog?</p>\n\n<p>This is what <strong>business vibe coding</strong> enables.</p>\n\n<p>While “vibe coding” has become synonymous with amateurs building weekend projects through AI prompts, business vibe coding brings that speed to enterprise—governed, audited, and built by customer-facing professionals who understand business requirements. It’s customer-facing teams delivering custom apps that sit on top of your platform, dramatically improving adoption without touching your engineering roadmap.</p>\n\n<h2 id=\"what-this-unlocks\">What This Unlocks</h2>\n\n<p>Let me get specific about the outcomes this enables:</p>\n\n<p><strong>Faster deal velocity:</strong>\nYour Sales Engineer discovers a prospect needs custom approval routing to close the deal. Instead of “we can build that in Q3,” they deliver a working solution during the POC. Deal closes.</p>\n\n<p><strong>Higher adoption rates:</strong>\nYour Implementation team sees customers struggling with a 12-click process. They build a 2-click shortcut that matches the customer’s actual workflow. Adoption improves, expansion conversations start.</p>\n\n<p><strong>Retention defense:</strong>\nYour Customer Success team identifies renewal risk because the platform doesn’t match the customer’s evolved process. They deliver workflow adjustments in days instead of waiting for engineering. Customer renews.</p>\n\n<p><strong>Expansion without headcount:</strong>\nYour Solutions team builds workflow patterns once, deploys across 50 similar customers. You scale delivery without linearly scaling professional services headcount.</p>\n\n<p>This isn’t about who builds it. It’s about <strong>unlocking your customer-facing teams to deliver the customizations that drive revenue without engineering dependencies.</strong></p>\n\n<p>For an ERP, that’s custom approval workflows and dashboard views. For a CRM, it’s deal review shortcuts and custom scoring logic. For ITSM, it’s incident playbooks and routing automation.</p>\n\n<p>None of it requires your core engineering team. None of it takes months. But all of it directly impacts adoption, expansion, and retention—the metrics that determine whether you survive consolidation.</p>\n\n<h2 id=\"the-maintenance-question\">The Maintenance Question</h2>\n\n<p>“Won’t this create technical debt?”</p>\n\n<p>Only if you build it wrong.</p>\n\n<p>The system itself should enforce constraints, since most workflow customizations follow predictable patterns. Quote approvals. Deal reviews. Incident routing. The first customer’s custom workflow becomes a template for the next 50. <strong>You’re building a library, not bespoke software for each customer.</strong></p>\n\n<p>And unlike the invisible complexity you have now—spreadsheet workarounds, undocumented processes, one-off feature requests—this is visible, governed, and measurable. You can track what drives adoption, deprecate what doesn’t, and scale what works.</p>\n\n<h2 id=\"why-now-is-urgent\">Why Now Is Urgent</h2>\n\n<p>Two forces are colliding that make this not just possible, but <em>necessary for survival</em>:</p>\n\n<p><strong>1. Market pressure makes slow customization lethal</strong></p>\n\n<p>You’re raising prices 10-20% annually while budgets grow at 2.8%. Every dollar is under scrutiny. Underutilized platforms get cut, and “we’ll add that workflow in Q3” isn’t good enough when competitors can deliver it in a week.</p>\n\n<p>The consolidation wave is here. Vendors who can’t prove ROI quickly will lose customers to those who can.</p>\n\n<p><strong>2. AI makes customer-facing team delivery actually viable</strong></p>\n\n<p><a href=\"https://www.gartner.com/en/newsroom/press-releases/2021-11-10-gartner-says-cloud-will-be-the-centerpiece-of-new-digital-experiences\">Gartner’s prediction</a> that 70% of new apps would use low-code/no-code by 2025 landed right as AI-assisted development exploded.</p>\n\n<p>Customer-facing teams can now build functional workflow solutions without engineering degrees. The tooling has caught up to the need. <a href=\"https://www.businessinsider.com/openai-chair-vibe-coding-not-endgame-bret-taylor-2026-1\">Even OpenAI’s chair acknowledges</a> that “vibe coding” is here to stay as a legitimate development approach.</p>\n\n<p>Your customer-facing teams can either keep filing feature requests that die in the backlog, or they can start delivering solutions. The technology barrier is gone.</p>\n\n<h2 id=\"from-blocker-to-accelerator\">From Blocker to Accelerator</h2>\n\n<p>Here’s the business model shift: <a href=\"https://media.trustradius.com/product-downloadables/ZZ/AH/VWHXTSL23TP3.pdf\">customer-facing teams are evolving</a> from order-takers to value delivery engines.</p>\n\n<p>Right now, these teams are bottlenecked. Sales can’t close deals that need workflow customization. Implementation can’t drive adoption when your platform doesn’t match customer processes. CS can’t defend renewals when workflow friction kills utilization.</p>\n\n<p>The workflow that’s killing you:</p>\n<ol>\n  <li>Customer needs workflow adjustment to get value</li>\n  <li>Customer-facing team files feature request</li>\n  <li>Engineering prioritizes it for “next quarter”</li>\n  <li>Deal stalls / adoption tanks / renewal at risk</li>\n</ol>\n\n<p>The workflow that wins:</p>\n<ol>\n  <li>Customer-facing team identifies workflow need</li>\n  <li>Team delivers working solution in days</li>\n  <li>Customer sees immediate value</li>\n  <li>Deal closes / adoption improves / expansion conversation starts</li>\n</ol>\n\n<p>One Solutions Engineer can build workflow patterns that unlock revenue across hundreds of customers. One Implementation specialist can solve adoption blockers that would otherwise take quarters to address.</p>\n\n<p>Your competitors with rigid platforms and 6-month engineering cycles can’t compete with that. Their customers get told “we’ll add that to the roadmap.” Your customers get working solutions before the next renewal cycle.</p>\n\n<h2 id=\"the-vendors-who-survive-consolidation\">The Vendors Who Survive Consolidation</h2>\n\n<p>In three years, the B2B SaaS landscape will look very different.</p>\n\n<p>There will be vendors who:</p>\n<ul>\n  <li>Prove ROI in weeks instead of quarters</li>\n  <li>Scale CS without linearly scaling headcount</li>\n  <li>Turn adoption problems into expansion opportunities</li>\n  <li>Defend against churn with actual workflow value, not just contracts</li>\n</ul>\n\n<p>And there will be vendors who:</p>\n<ul>\n  <li>Keep telling customers “we’ll add that to the roadmap”</li>\n  <li>Watch adoption metrics slowly decline</li>\n  <li>See renewal rates erode as CFOs scrutinize utilization</li>\n  <li>Get replaced by competitors who adapted faster</li>\n</ul>\n\n<p><strong>The difference isn’t product features. It’s workflow flexibility.</strong></p>\n\n<p>When SaaS portfolios are under intense budget scrutiny, when prices are rising 4x faster than budgets, when every dollar needs to justify itself—the vendors who win are the ones who make it <em>trivially easy</em> for customers to prove ROI.</p>\n\n<p>And you can’t prove ROI when your platform forces customers to choose between “our rigid workflow” and “don’t use the platform.”</p>\n\n<h2 id=\"what-this-gets-you\">What This Gets You</h2>\n\n<p>Business vibe coding is about <strong>enabling the people who understand customer requirements to deliver custom apps that drive adoption, expansion, and retention without engineering dependencies.</strong></p>\n\n<p>It’s about turning customizations from a blocker into a competitive advantage.</p>\n\n<p>It’s about surviving the consolidation wave that’s coming for every B2B SaaS vendor who can’t prove they’re worth keeping.</p>\n\n<p>The technology exists. The market pressure is real.</p>\n\n<p>The question is: whether you’ll adapt, or will your customers choose a vendor who already did.</p>\n\n<hr />\n\n<p><em>We’re help B2B SaaS vendors enable business vibe coding for their customer-facing teams. If this resonates, reach out at <a href=\"mailto:mail@namanyayg.com\">mail@namanyayg.com</a></em></p>"
            ],
            "link": "https://nmn.gl/blog/saas-vibe-coding",
            "publishedAt": "2026-01-31",
            "source": "Namanyay Goel",
            "summary": "I’ve spent the last few months talking to B2B SaaS vendors and I noticed a common pattern: “Our product is more powerful than ever, but customers aren’t using half of it.” This is the silent crisis in B2B SaaS right now. You’re losing deals and renewals not because your product lacks features, but because customers can’t make your rigid platform match their actual processes.",
            "title": "SaaS Companies Need to Let Their Customers Vibe Code on Top of Their Tools"
        },
        {
            "content": [
                "<p><a href=\"https://randsinrepose.com/wp-content/uploads/2026/01/IT_Paddling.png\"><img alt=\"Fully Formed Humans\" class=\"alignleft wp-image-4474\" src=\"https://randsinrepose.com/wp-content/uploads/2026/01/IT_Paddling.png\" /></a></p>\n<p>In our 95th episode, we again talk about the value of exercise. Lyle paddles an outrigger, Rands used to play hockey, but now he bikes, and we compare peak heart rates. It&#8217;s a thriller.</p>\n<p>Enjoy it now, or <a href=\"https://traffic.libsyn.com/rands/theimportantthing0095.mp3\">download</a> for later. Here&#8217;s a handy <a href=\"https://rands.libsyn.com/feed\">feed</a> or subscribe via <a href=\"https://overcast.fm/itunes1195704939/the-important-thing\">Overcast</a> or <a href=\"https://podcasts.apple.com/us/podcast/the-important-thing/id1195704939\">iTunes</a>.</p>\n<audio class=\"wp-audio-shortcode\" controls=\"controls\" id=\"audio-5445-2\" preload=\"none\" style=\"width: 100%;\"><source src=\"https://traffic.libsyn.com/rands/theimportantthing0095.mp3?_=2\" type=\"audio/mpeg\" /></audio>"
            ],
            "link": "https://randsinrepose.com/archives/the-one-about-exercise-again/",
            "publishedAt": "2026-01-31",
            "source": "Rands in Repose",
            "summary": "In our 95th episode, we again talk about the value of exercise. Lyle paddles an outrigger, Rands used to play hockey, but now he bikes, and we compare peak heart rates. It&#8217;s a thriller. Enjoy it now, or download for later. Here&#8217;s a handy feed or subscribe via Overcast or iTunes.",
            "title": "The One About Exercise (Again)"
        },
        {
            "content": [
                "<p>Two days ago, the Anthropic Fellows program released a paper called <a href=\"https://arxiv.org/pdf/2601.20245\"><em>How AI Impacts Skill Formation</em></a>. Like <a href=\"https://www.seangoedecke.com/your-brain-on-chatgpt\">other</a> <a href=\"https://www.seangoedecke.com/real-reasoning\">papers</a> on AI before it, this one is being <a href=\"https://www.reddit.com/r/ExperiencedDevs/comments/1qqy2ro/anthropic_ai_assisted_coding_doesnt_show/\">treated</a> as proof that AI makes you slower and dumber. Does it prove that?</p>\n<p>The structure of the paper is sort of similar to the 2025 MIT study <a href=\"https://arxiv.org/pdf/2506.08872\"><em>Your Brain on ChatGPT</em></a>. They got a group of people to perform a cognitive task that required learning a new skill: in this case, the Python Trio library. Half of those people were required to use AI and half were forbidden from using it. The researchers then quizzed those people to see how much information they retained about Trio.</p>\n<p>The banner result was that <strong>AI users did not complete the task faster, but performed much worse on the quiz</strong>. If you were so inclined, you could naturally conclude that any perceived AI speedup is illusory, and the people who are using AI tooling are cooking their brains. But I don’t think that conclusion is reasonable.</p>\n<h3>Retyping AI-generated code</h3>\n<p>To see why, let’s look at Figure 13 from the paper:</p>\n<p><span class=\"gatsby-resp-image-wrapper\" style=\"display: block; margin-left: auto; margin-right: auto;\">\n      <a class=\"gatsby-resp-image-link\" href=\"https://www.seangoedecke.com/static/1deb94af67210428f7358afe10795555/f238d/fig13.png\" rel=\"noopener\" style=\"display: block;\" target=\"_blank\">\n    <span class=\"gatsby-resp-image-background-image\" style=\"display: block;\"></span>\n  <img alt=\"figure 13\" class=\"gatsby-resp-image-image\" src=\"https://www.seangoedecke.com/static/1deb94af67210428f7358afe10795555/fcda8/fig13.png\" style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle;\" title=\"figure 13\" />\n  </a>\n    </span></p>\n<p>The researchers noticed half of the AI-using cohort spent most of their time <em>literally retyping the AI-generated code</em> into their solution, instead of copy-pasting or “manual coding”: writing their code from scratch with light AI guidance. <strong>If you ignore the people who spent most of their time retyping, the AI-users were 25% faster.</strong></p>\n<p>I confess that this kind of baffles me. What kind of person manually retypes AI-generated code? Did they not know how to copy and paste (unlikely, since the study was mostly composed of professional or hobby developers<sup id=\"fnref-1\"><a class=\"footnote-ref\" href=\"https://www.seangoedecke.com/rss.xml#fn-1\">1</a></sup>)? It certainly didn’t help them on the quiz score. The retypers got the same (low) scores as the pure copy-pasters.</p>\n<p>In any case, if you know how to copy-paste or use an AI agent, I wouldn’t use this paper as evidence that AI will not be able to speed you up. </p>\n<h3>What about the quiz scores?</h3>\n<p>Even if AI use offers a 25% speedup, is that worth sacrificing the opportunity to learn new skills? What about the quiz scores?</p>\n<p>Well, first we should note that <strong>the AI users who used the AI for general questions but wrote all their own code did fine on the quiz</strong>. If you look at Figure 13 above, you can see that those AI users averaged maybe a point lower on the quiz - not bad, for people working 25% faster. So at least some kinds of AI use seem fine.</p>\n<p>But of course much current AI use is not like this: if you’re using Claude Code or Copilot agent mode, you’re getting the AI to do the code writing for you. Are you losing key skills by doing that?</p>\n<p>Well yes, of course you are. If you complete a task in ten minutes by throwing it at a LLM, you will learn much less about the codebase than if you’d spent an hour doing it by hand. I think it’s pretty silly to deny this: it’s intuitively right, and anybody who has used AI agents extensively at work can attest to it from their own experience.</p>\n<p>Still, I have two points to make about this.</p>\n<h4>Software engineers are paid to ship, not to learn</h4>\n<p>First, <strong>software engineers are not paid to learn about the codebase</strong>. We are paid to deliver business value (typically by delivering working code). If AI can speed that up dramatically, avoiding it makes you worse at your job, even if you’re learning more efficiently. That’s a bit unfortunate for us - it was very nice when we could get much better at the job simply by doing it more - but that doesn’t make it false.</p>\n<p>Other professions have been dealing with this forever. Doctors are expected to spend a lot of time in classes and professional development courses, learning how to do their job in other ways than just doing it. It may be that future software engineers will need to spend 20% of their time manually studying their codebases: not just in the course of doing some task (which could be far more quickly done by AI agents) but just to stay up-to-date enough that their skills don’t atrophy.</p>\n<h4>Moving faster gives you more opportunities to learn</h4>\n<p>The other point I wanted to make is that <strong>even if your learning rate is slower, moving faster means you may learn more overall</strong>. Suppose using AI meant that you learned only 75% as much as non-AI programmers from any given task. Whether you’re learning less overall depends on <em>how many more tasks you’re doing</em>. If you’re working faster, the loss of learning efficiency may be balanced out by volume.</p>\n<p>I don’t know if this is true. I suspect there really is no substitute for painstakingly working through a codebase by hand. But the engineer who is shipping 2x as many changes is probably also learning things that the slower, manual engineer does not know. At minimum, they’ll be acquiring a greater breadth of knowledge of different subsystems, even if their depth suffers.</p>\n<p>Anyway, the point is simply that a lower learning rate does not by itself prove that less learning is happening overall.</p>\n<h3>We need to talk about GPT-4o</h3>\n<p>Finally, I will reluctantly point out that the model used for this task was GPT-4o (see section 4.1). I’m reluctant here because I sympathize with the AI skeptics, who are perpetually frustrated by the pro-AI response of “well, you just haven’t tried the <em>right</em> model”. In a world where new AI models are released every month or two, demanding that people always study the best model makes it functionally impossible to study AI use at all.</p>\n<p>Still, I’m just kind of confused about why GPT-4o was chosen. This study was funded by Anthropic, who have much better models. This study was conducted <em>in 2025</em><sup id=\"fnref-2\"><a class=\"footnote-ref\" href=\"https://www.seangoedecke.com/rss.xml#fn-2\">2</a></sup>, at least six months after the release of GPT-4o (that’s like five years in AI time). I can’t help but wonder if the AI-users cohort would have run into fewer problems with a more powerful model.</p>\n<h3>Summary</h3>\n<p>I don’t have any real problem with this paper. They set out to study how different patterns of AI use affect learning, and their main conclusion - that pure “just give the problem to the model” AI use means you learn a lot less - seems correct to me.</p>\n<p>I don’t like their conclusion that AI use doesn’t speed you up, since it relies on the fact that 50% of their participants spent their time <em>literally retyping AI code</em>. I wish they’d been more explicit in the introduction that this was the case, but I don’t really blame them for the result - I’m more inclined to blame the study participants themselves, who should have known better.</p>\n<p>Overall, I don’t think this paper provides much new ammunition to the AI skeptic. Like I said above, it doesn’t support the point that AI speedup is a mirage. And the point it does support (that AI use means you learn less) is obvious. Nobody seriously believes that typing “build me a todo app” into Claude Code means you’ll learn as much as if you built it by hand.</p>\n<p>That said, I’d like to see more investigation into long-term patterns of AI use in tech companies. Is the slower learning rate per-task balanced out by the higher rate of task completion? Can it be replaced by carving out explicit time to study the codebase? It’s probably too early to answer these questions - strong coding agents have only been around for a handful of months - but the answers may determine what it’s like to be a software engineer for the next decade.</p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-1\">\n<p>See Figure 17.</p>\n<a class=\"footnote-backref\" href=\"https://www.seangoedecke.com/rss.xml#fnref-1\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>I suppose the study doesn’t say that explicitly, but the Anthropic Fellows program was only launched in December 2024, and the paper was published in January 2026.</p>\n<a class=\"footnote-backref\" href=\"https://www.seangoedecke.com/rss.xml#fnref-2\">↩</a>\n</li>\n</ol>\n</div>"
            ],
            "link": "https://seangoedecke.com/how-does-ai-impact-skill-formation/",
            "publishedAt": "2026-01-31",
            "source": "Sean Goedecke",
            "summary": "<p>Two days ago, the Anthropic Fellows program released a paper called <a href=\"https://arxiv.org/pdf/2601.20245\"><em>How AI Impacts Skill Formation</em></a>. Like <a href=\"https://www.seangoedecke.com/your-brain-on-chatgpt\">other</a> <a href=\"https://www.seangoedecke.com/real-reasoning\">papers</a> on AI before it, this one is being <a href=\"https://www.reddit.com/r/ExperiencedDevs/comments/1qqy2ro/anthropic_ai_assisted_coding_doesnt_show/\">treated</a> as proof that AI makes you slower and dumber. Does it prove that?</p> <p>The structure of the paper is sort of similar to the 2025 MIT study <a href=\"https://arxiv.org/pdf/2506.08872\"><em>Your Brain on ChatGPT</em></a>. They got a group of people to perform a cognitive task that required learning a new skill: in this case, the Python Trio library. Half of those people were required to use AI and half were forbidden from using it. The researchers then quizzed those people to see how much information they retained about Trio.</p> <p>The banner result was that <strong>AI users did not complete the task faster, but performed much worse on the quiz</strong>. If you were so inclined, you could naturally conclude that any perceived AI speedup is illusory, and the people who are using AI tooling are cooking their brains. But I don’t think that conclusion is reasonable.</p> <h3>Retyping AI-generated code</h3> <p>To see why, let’s look at Figure 13 from the paper:</p> <p><span class=\"gatsby-resp-image-wrapper\" style=\"display: block; margin-left: auto; margin-right: auto;\"> <a class=\"gatsby-resp-image-link\" href=\"https://www.seangoedecke.com/static/1deb94af67210428f7358afe10795555/f238d/fig13.png\"",
            "title": "How does AI impact skill formation?"
        },
        {
            "content": [
                "<p><img alt=\"wikipedia.org\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/4.jpeg?raw=true\" /></p>\n<p><img alt=\"gwern.net\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/2.jpeg?raw=true\" /></p>\n<p><img alt=\"wikipedia.org\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/1.jpeg?raw=true\" /></p>\n<p><img alt=\"taylor.town\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/3.jpeg?raw=true\" /></p>\n<p><img alt=\"gwern.net\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/5.jpeg?raw=true\" /></p>"
            ],
            "link": "https://github.com/surprisetalk/AdBoost",
            "publishedAt": "2026-01-31",
            "source": "Taylor Troesh",
            "summary": "<p><img alt=\"wikipedia.org\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/4.jpeg?raw=true\" /></p> <p><img alt=\"gwern.net\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/2.jpeg?raw=true\" /></p> <p><img alt=\"wikipedia.org\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/1.jpeg?raw=true\" /></p> <p><img alt=\"taylor.town\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/3.jpeg?raw=true\" /></p> <p><img alt=\"gwern.net\" src=\"https://github.com/surprisetalk/AdBoost/blob/main/screenshots/5.jpeg?raw=true\" /></p>",
            "title": "AdBoost"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-31"
}