{
    "articles": [
        {
            "content": [
                "<p><em>Cross-posted from &#8220;<a href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride\">Bring Back Ops Pride</a>&#8220;</em></p>\n<p><strong>&#8220;Operations&#8221; is not a dirty word, a synonym for toil, or a title for people who can&#8217;t write code. May those who shit on ops get the operational outcomes they deserve.</strong></p>\n<p>I was planning to write something else today, but god dammit, I got nerd-sniped.</p>\n<p>Last week I published a piece on the Honeycomb blog called “<a href=\"https://www.honeycomb.io/blog/you-had-one-job-why-twenty-years-of-devops-has-failed-to-do-it\" rel=\"\">You Had One Job: Why Twenty Years of DevOps Has Failed to Do It</a>.” Allow me to quote myself:</p>\n<blockquote><p>In retrospect, I think the entire DevOps movement was a mighty, twenty year battle to achieve one thing: a single feedback loop connecting devs with prod.</p>\n<p>On those grounds, it failed.</p>\n<p>Not because software engineers weren’t good at their jobs, or didn’t care enough. It failed because the technology wasn’t good enough. The tools we gave them weren’t designed for this, so using them could easily double, triple, or quadruple the time it took to do their job: writing business logic.</p>\n<p>This isn’t true everywhere. Please keep in mind that <strong>all data tools are effectively fungible</strong> if you can assume an infinite amount of time, money, and engineering skill. You can run production off an Excel spreadsheet if you have to, and some SREs <em>have done so</em>. That doesn’t make it a great solution, the right use of resources, or accessible to the median engineering org.</p></blockquote>\n<p>It’s a fun piece, if I do say so myself, and you should go read it. (<a href=\"https://www.honeycomb.io/blog/you-had-one-job-why-twenty-years-of-devops-has-failed-to-do-it\" rel=\"\">Much stick art</a>!)</p>\n<p>I posted the link on LinkedIn yesterday morning. Comments, as ever, ensued.</p>\n<p>(The internet was a mistake, Virginia.)</p>\n<h2 class=\"header-anchor-post\">“Devs should own everything”</h2>\n<p>A number of commenters said things like, “devs should own everything”, “make every team responsible for their own devops work”, and my personal favorite:</p>\n<blockquote><p>“I still think the main problem is with the ownership model &#8211; the fact that devs don’t own the full system, including infra and ops.”</p></blockquote>\n<p>(Courtesy of <a href=\"https://www.linkedin.com/in/alexpulver/\" rel=\"\">Alex Pulver</a>, who has graciously allowed me to quote him here by name, adding that “he stands firmly behind this 😂”.)</p>\n<p>As it happens, I have been aggressively advocating for the model I believe my friend is describing here, where software developers are empowered (and expected) to own their code in production, for approximately the past decade. No argument!</p>\n<p>But “devs should own the full system, including infra and ops”?</p>\n<p>We need to talk.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" /><img alt=\"fire_burn\" class=\"sizing-normal\" height=\"162\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21w1R9%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa74323bd-8424-4da9-8724-fbaa9917dfaf_220x220.png?resize=162%2C162&#038;ssl=1\" title=\"fire_burn\" width=\"162\" />\n<div></div>\n</div>\n</figure>\n</div>\n<h2 class=\"header-anchor-post\">I do not think ‘ops’ means what you think it means</h2>\n<p>In software—and <em>only</em> in software—ops has become a dirty word. Nobody wants to claim it. Operations teams got renamed to DevOps teams, SRE, infrastructure, production engineering, or more recently, platform engineering teams. <em>Anything</em> but ops.</p>\n<p>Ops means Toil! Hashtag #NoOps!</p>\n<p>Number one, this is <em>fucking ridiculous</em>.</p>\n<p>What’s wrong with operations? Ops is not a synonym for toil; it <em>literally</em> means “get shit done as efficiently as possible”. Every function has an operational component at scale: business ops, marketing ops, sales ops, product ops, design ops and everything else I could think of to search for, and so far as I can tell, <em>none </em>of them are treated with anything like the disrespect, dismissal and outright contempt that software engineering<span><a class=\"footnote-anchor\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-1-184825970\" id=\"footnote-anchor-1-184825970\" rel=\"\" target=\"_self\">1</a></span> has chosen to heap upon its operational function.</p>\n<p>Number two…what <em>happened</em>?</p>\n<p>I can think of a number of contributing factors (APIs and cloud computing, soaring profit margins, etc), but I can also think of one easy, obvious, mustache-twirling villain, which would make a better story for you AND less work for me. (Root cause analysis wins again!! ✊)</p>\n<h2 class=\"header-anchor-post\">Whose fault is it?</h2>\n<p>Google. It’s Google’s fault.</p>\n<p>I know this, because I asked Google and it told me so.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"721\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21FpTy%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7ee21b1e-a5da-4132-99ca-bdf84a72d1f3_685x748.png?resize=660%2C721&#038;ssl=1\" width=\"660\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"></div>\n</div>\n</div>\n</figure>\n</div>\n<p>(What? This is a free substack, not science.)</p>\n<p>Here’s what I think happened. I think Google came out swinging, saying traditional operations could not scale and needed to become more like software engineering, and it was exactly the right message at exactly the right time, because cloud computing, APIs, SaaSes and so forth were just coming online and making it <em>possible</em> to manage systems more programmatically.</p>\n<p>So far so good. But a crucial distinction got lost in translation, when we started defining this as developers (people who write code: good) vs <em>operators</em> (people who do things by hand: bad), which is what set us on the slippery slope to where we are today, where the entire business-critical function of operations engineering is widely seen as backwards and incompetent.</p>\n<h2 class=\"header-anchor-post\">Dev vs Ops is a separation of concerns</h2>\n<p>The difference between “dev” and “ops” is not about whether or not you can write code. Dude, it’s 2026: <strong>everyone writes software</strong>.</p>\n<p>The difference between dev and ops is a separation of concerns.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" /><img alt=\"Dev and ops responsibilities.\" class=\"sizing-normal\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21NbpK%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8cbaee52-99f3-45c1-91f2-b9a563d27a54_605x692.webp?w=241&#038;ssl=1\" title=\"Dev and ops responsibilities.\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"></div>\n</div>\n</div>\n</figure>\n</div>\n<p>If your concern is building new features and products to attract customers and generate new revenue, then congrats: you’re a dev. (But you knew that.)</p>\n<p>If your concern is building core services and protecting their ability to serve customers in the face of any and all threats (including, at the top of the list, your own developers): congratulations slash I’m sorry, but you are, in fact, in ops.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21wjo0%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F18ade258-010d-4ec4-bcd4-b2ca52d2f139_525x631.png?w=385&#038;ssl=1\" title=\"\" />\n<div class=\"image-link-expand\">\n<div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"></div>\n</div>\n</div>\n</figure>\n</div>\n<p>Both of these functional concerns are vital, as in “you literally can’t survive without them”, and complementary. You need product developers to be focused on building features and products, caring deeply about the experience of each user, and looking for ways to add value to the business. You need operations to provide a resilient, scalable, efficient base for those products to run on.</p>\n<h2 class=\"header-anchor-post\">The hardest technical problems are found in ops</h2>\n<p>Ops is not “toil”. It does not mean “dummies who can’t program good”. Operations engineering is not easier or lesser than writing software to build products and features.</p>\n<p>What’s darkly ironic is that, if anything, the opposite is true.</p>\n<p>Product engineering is typically much simpler than infrastructure engineering—in part, of course, because one of the key functions of operations is to make it <strong>as easy as possible to build and ship products</strong>. Operations absorbs the toughest technical problems and provides a surface layer for product development that is simple, reliable, and easy to navigate.</p>\n<p>Not because product engineers are dumb or lesser than (let’s not slip into <em>that</em> trap<span><a class=\"footnote-anchor\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-2-184825970\" id=\"footnote-anchor-2-184825970\" rel=\"\" target=\"_self\">2</a></span> again!), but because <strong>cognitive bandwidth is the scarcest resource in any engineering org</strong>, and you want as much of that as possible going towards things that move the business materially forward, instead of wrestling with the messy underbelly.</p>\n<p>The hardest technical challenges and the long, stubborn tail of intractable problems have <em>always</em> been on the infrastructure side. <strong>That’s why we work </strong><em><strong>so hard</strong></em><strong> to try not to have them</strong>—to solve them by partnerships, cloud computing, open source, etc. <em>Anything</em> is better than trying to build them again, starting over from scratch. We know the cost of new code in our bones.<span><a class=\"footnote-anchor\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-3-184825970\" id=\"footnote-anchor-3-184825970\" rel=\"\" target=\"_self\">3</a></span></p>\n<p>As I have said a thousand times: the closer you get to laying bits down on disk, the more conservative (and afraid) you should be.</p>\n<p>The closer you get to user interaction, the more okay it is to get experimental, let AI take a shot, YOLO this puppy.</p>\n<p>This is as it should be.</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" />\n<figure class=\"wp-caption alignnone\" style=\"width: 300px;\"><img alt=\"\" class=\"sizing-normal\" height=\"161\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21y7E9%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1ad05ab6-c633-4cb0-bbb7-a8ab5e3be82b_300x161.png?resize=300%2C161&#038;ssl=1\" width=\"300\" /><figcaption class=\"wp-caption-text\">The cost and pain of developing software is approximately zero compared to the operational cost of maintaining it over time.</figcaption></figure>\n<div></div>\n</div><figcaption class=\"image-caption\">The cost and pain of developing software is approximately zero compared to the operational cost of maintaining it over time.</figcaption></figure>\n</div>\n<h2 class=\"header-anchor-post\">Domain level differences</h2>\n<p>The difference between dev and ops isn’t about writing code or not. But there <em>are</em> differences. In perspective, priorities, and (often) temperament.</p>\n<p>I touched on a number of these in <a href=\"https://www.honeycomb.io/blog/you-had-one-job-why-twenty-years-of-devops-has-failed-to-do-it\" rel=\"\">the article I just wrote on feedback loops</a>, so I’m not going to repeat myself here.</p>\n<p>The biggest difference I did <em>not</em> mention is that they have different relationships with resources and definitions of success.</p>\n<p>Infrastructure is a cost center. You aren’t going to make more money if you give ten laptops to everyone in your company, and you aren’t going to make more money by over-spending on infrastructure, either. Great operations engineers and architects never forget that <strong>cost is a first class citizen</strong> of their engineering decisions.</p>\n<p>You can, in theory, make more money by spending more on product engineering. This is what we refer to as an “investment”, although sometimes it seems to mean “engineers who forget their time costs money”.</p>\n<p>(Sorry, that was rude.)</p>\n<h2 class=\"header-anchor-post\">What about platform engineering?</h2>\n<p>“What about platform engineering?” Baby, that’s ops in dressup.</p>\n<p>A bit less flippantly: I like my friend <a href=\"https://www.syntasso.io/post/scaling-platform-building-balancing-what-is-unique-to-your-org-and-common-across-teams\" rel=\"\">Abby Bangser’s quote</a>: “platforms should encode things that are unique to your business but common to your teams”, and I like <a href=\"https://jackdanger.com/infrastructure-gravity/\" rel=\"\">Jack Danger’s stick art</a>, and his observation that “The only thing that naturally draws engineers to look at the middle of their system is pure blinding rage.”</p>\n<p>What I love about the platform engineering movement is that it has brought design thinking and product development practices to the operational domain.</p>\n<p>Yes, we should absolutely be treating our product developers like customers, and thinking critically about the interfaces we give them. Yes, there is a middle layer between infrastructure and product engineering, with patterns and footguns of its very own.</p>\n<p>Also yes: from a functional perspective, platform engineering is still ops. (Or at least, more ops than not.)</p>\n<div class=\"captioned-image-container\">\n<figure>\n<div class=\"image2-inset can-restack\"><source type=\"image/webp\" />\n<figure class=\"wp-caption alignnone\" style=\"width: 300px;\"><img alt=\"\" class=\"sizing-normal\" height=\"153\" src=\"https://i0.wp.com/substackcdn.com/image/fetch/%24s_%21Dpti%21%2Cw_1456%2Cc_limit%2Cf_auto%2Cq_auto%3Agood%2Cfl_progressive%3Asteep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcb05ad97-920a-4b3b-ae27-8456723ea389_300x153.png?resize=300%2C153&#038;ssl=1\" width=\"300\" /><figcaption class=\"wp-caption-text\">Yes, you need an ops team. If you have hard operational problems. You should try not to have hard operational problems. (from a talk I gave back in 2015)</figcaption></figure>\n<div></div>\n</div><figcaption class=\"image-caption\">Yes, you need an ops team. If you have hard operational problems. You should try not to have hard operational problems. (from a talk I gave back in 2015)</figcaption></figure>\n</div>\n<h2 class=\"header-anchor-post\">Does it matter what we call it?</h2>\n<p>Yeah, I kinda think it does.</p>\n<p>All these trendy naming schemes do not change the core value of operations, which is to consolidate and efficiently serve the revenue-generating parts of the function.<span><a class=\"footnote-anchor\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-4-184825970\" id=\"footnote-anchor-4-184825970\" rel=\"\" target=\"_self\">4</a></span> This is as true in technology as it is in sales or marketing. Running away from the term and denying your purpose muddies the water and causes confusion at the exact point where <strong>clarity is most needed</strong>.</p>\n<p>An engineering team needs to know if they are oriented towards efficiency or investment. It changes how you hire, how you build, how you think about success and measure progress. It changes not only your appetite for risk, but what counts as a risk in the first place. <em>You can’t optimize for both at once.</em></p>\n<p>They also need to know whether they are responsible for the business logic or the platform it runs on.</p>\n<p>Why? Because <strong>no one can do everything</strong>. Telling devs to own their code is one thing. (Great.) Asking them to own their code and <em>the entire technological iceberg beneath it</em> is wholly another. The more surface area you ask someone to master and attend to, the less focus you can expect from them in any given place. Do you want your revenue-generating teams generating revenue, or not?</p>\n<p>If you can’t separate these concerns at the moment, maybe that’s something to work towards. Which is going to be hard to do, if we can’t talk about the function of operations without half the room running away and the remaining half squawking “toil!&#8221;</p>\n<h2 class=\"header-anchor-post\">Naming is a form of respect</h2>\n<p>Operational rigor and excellence are not, how shall I say this…not yet something you can take for granted in the tech industry. The most striking thing about the 2025 DORA report was that the <em>majority of companies</em> report that AI is just adding more chaos to a system already defined by chaos. In other words, most companies are bad at ops.</p>\n<p>To some extent, this is because the problems are hard. To a larger extent, I think it’s the cause (and result) of our wholesale abandonment of operations as a term of pride.</p>\n<p>It’s another a fucking feedback loop. Ambitious young engineers get the message that being associated with ops is bad, so they run away from those teams. Managers and execs want to recruit great talent and make jobs sound enticing, so they adopt trendy naming schemes to make it clear this work is <em>not ops</em>.</p>\n<p>If you want to do something well, historically speaking, this is not the way. The way to build excellence is to name it for what it is, build communities of practice, raise the bar, and compensate for a job well done.</p>\n<p>Or as <a href=\"https://charity.wtf/2016/05/31/wtf-is-operations-serverless/\" rel=\"\">one prognosticator</a> said, way back in 2016:</p>\n<blockquote><p>I think <strong>it’s time to bring back “operations” as a term of pride.</strong> As a thing that is valued, and rewarded.</p>\n<p>“Operations” comes with baggage, no doubt. But I just don’t think that distance and denial are an effective approach for making something better, let alone trash talking and devaluing the skill sets that you need to deliver quality services.</p>\n<p><strong>You don’t make operational outcomes magically better by renaming the team “DevOps” or “SRE” or anything else.</strong> You make it better by naming it and claiming it for what it is, and helping everyone understand how their role relates to your operational objectives.</p></blockquote>\n<p>Wow. Truly, I couldn’t have said it better myself.</p>\n<h3>Footnotes</h3>\n<div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-anchor-1-184825970\" id=\"footnote-1-184825970\" rel=\"\" target=\"_self\">1</a></p>\n<div class=\"footnote-content\">\n<p>Not to get all Jungian on you all, but part of me has to wonder if “ops” represents the shadow self to software engineers, the parts of yourself that you hate and despise and are most insecure about (I am weak and bad at coding!! I might be automated out of a job!), and thus need to project onto some externalized other that can be safely loathed from a distance.</p>\n</div>\n</div>\n<div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-anchor-2-184825970\" id=\"footnote-2-184825970\" rel=\"\" target=\"_self\">2</a></p>\n<div class=\"footnote-content\">\n<p>This might surprise you youngsters, but there was a time when systems folks were clearly the cool kids and developers were considered rather dim. Devs had to know data structures and algorithms, but sysadmins had to know <em>everything</em>. These things tend to come and go in cycles, so we may as well not shit on each other, eh?</p>\n</div>\n</div>\n<div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-anchor-3-184825970\" id=\"footnote-3-184825970\" rel=\"\" target=\"_self\">3</a></p>\n<div class=\"footnote-content\">\n<p>As my friend Peter van Hardenburg likes to say, “The best code is no code at all. The second best code is code someone else writes and maintains for you. The worst code is the code you have to write and maintain yourself.” If it would fit on my knuckles, I would get this in knuckle tatts.</p>\n</div>\n</div>\n<div class=\"footnote\"><a class=\"footnote-number\" contenteditable=\"false\" href=\"https://charitydotwtf.substack.com/p/bring-back-ops-pride#footnote-anchor-4-184825970\" id=\"footnote-4-184825970\" rel=\"\" target=\"_self\">4</a></p>\n<div class=\"footnote-content\">\n<p>Would it be helpful to acknowledge that IT/ops serves an entirely different function than software engineering operations for production systems? Because it absolutely does.</p>\n</div>\n</div>"
            ],
            "link": "https://charity.wtf/2026/01/19/bring-back-ops-pride-xpost/",
            "publishedAt": "2026-01-19",
            "source": "Charity Majors",
            "summary": "Cross-posted from &#8220;Bring Back Ops Pride&#8220; &#8220;Operations&#8221; is not a dirty word, a synonym for toil, or a title for people who can&#8217;t write code. May those who shit on ops get the operational outcomes they deserve. I was planning to write something else today, but god dammit, I got nerd-sniped. Last week I published [&#8230;]",
            "title": "Bring Back Ops Pride (xpost)"
        },
        {
            "content": [],
            "link": "https://newsletter.dancohen.org/archive/a-heros-iconography/",
            "publishedAt": "2026-01-19",
            "source": "Dan Cohen",
            "summary": "<p>On this Martin Luther King Jr. Day, it is helpful to remember that heroes still walk among us. One of them is Ted Landsmark.</p> <p><a href=\"https://en.wikipedia.org/wiki/Ted_Landsmark?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=a-heros-iconography\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Dr. Theodore C. Landsmark</a>’s wide-ranging biography and profound impact are impossible to contain in this small space. He has been a powerful civil rights leader, thoughtful urban planner, and scholar and administrator in the realms of public policy, culture, and community work. <a href=\"https://cssh.northeastern.edu/faculty/theodore-c-landsmark/?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=a-heros-iconography\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">At Northeastern University</a>, where we are colleagues, it was wonderful to <a href=\"https://news.northeastern.edu/2026/01/14/ted-landsmark-activist-lawyer-profile/?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=a-heros-iconography\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">see him celebrated last week</a> for the incredible influence and change he has brought to Boston.</p> <p>Although he has had such a great impact in so many ways, Landsmark will probably be known decades and even centuries from now for being at the center of one of the most infamous photographs in twentieth-century American history:</p> <figure><a href=\"https://en.wikipedia.org/wiki/The_Soiling_of_Old_Glory?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=a-heros-iconography\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"A black and white photograph of a Black man in a plaza being attacked by a White teenager brandishing the American flag.\" draggable=\"false\" src=\"https://assets.buttondown.email/images/de1e5d97-a086-4543-9a78-948683ec8133.png?w=960&amp;fit=max\" /></a><figcaption>Stanley Forman, <a href=\"https://en.wikipedia.org/wiki/The_Soiling_of_Old_Glory?utm_source=dancohen&amp;utm_medium=email&amp;utm_campaign=a-heros-iconography\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"><em>The Soiling of Old Glory</em></a>, photograph taken on April 5, 1976, shown here cropped and halftoned as",
            "title": "A Hero's Iconography"
        },
        {
            "content": [],
            "link": "https://anyblockers.com/posts/driving-for-passengers/",
            "publishedAt": "2026-01-19",
            "source": "Eric Zakariasson",
            "summary": "What separates a good ride from a bad one",
            "title": "Driving for Passengers"
        },
        {
            "content": [
                "<p>Many, many years ago, at my childhood house in the Santa Cruz mountains, I grabbed a shovel and started to dig a hole.</p>\n\n\n\n<p>Why? Unclear. I was six or seven. I&#8217;d seen what my Dad could do with a shovel, so one afternoon…. I started digging, and by the time evening approached, my Dad walked out, &#8220;So, wha&#8217;cha doing there?&#8221;</p>\n\n\n\n<p>At the time of the hole intervention, I&#8217;d been at my hole digging for a couple of hours, and while that sounds like a lot of time, I was only two or three feet deep in a hole maybe the size of a picnic table. The removed dirt was tossed carelessly in every direction.</p>\n\n\n\n<p>&#8220;I&#8217;m digging a hole.&#8221;</p>\n\n\n\n<p>&#8220;I see that. Wha&#8217;cha planning on doing with that hole?&#8221;</p>\n\n\n\n<p>No real answer at the ready. Like <a href=\"https://randsinrepose.com/archives/the-stick-in-the-stream/\">pulling a stick from a stream</a>, I was mostly enthralled with the act of digging a hole. I dodged his question, &#8220;Yeah, I think I&#8217;m going to need some wooden columns here at some point. Ya&#8217;know, to hold the ceiling up when I get that far.&#8221;</p>\n\n\n\n<p>Dad, &#8220;Uh huh.&#8221; The hole was three or four feet deep — barely above my knees. And it was getting dark.</p>\n\n\n\n<p>I continued, &#8220;And I am worried about moisture…. ya&#8217;know? Dripping from the ceiling.&#8221;</p>\n\n\n\n<p>Dad, &#8220;Yeah. I get that.&#8221; <strong>Barely</strong> to my seven-year old knees.</p>\n\n\n\n<p>The digging continued for another hour. I&#8217;d discovered blisters (no gloves) and also dirt was now  falling back into the hole with each shovel-full (no solid dirt extraction plan), but my Dad stood there the entire time. Question continued:</p>\n\n\n\n<p>Dad: &#8220;Maybe we should get you a wheelbarrow? You could move the dirt into the ravine.&#8221; I ignored him and kept digging.</p>\n\n\n\n<p>Me: &#8220;Dad, do we have a wooden chest? Where could we keep my stuff in the cave? Like a treasure chest?&#8221; Dad, &#8220;I&#8217;m sure we could figure that out.&#8221;</p>\n\n\n\n<p>You think you know how this story ends, and you&#8217;re mostly correct. We covered my picnic-table-sized shallow hole with a piece of plywood to &#8220;make sure no one falls in.&#8221; My plan was to finish digging the following day, but I have no memory of that picnic-table-sized hole after that night. I&#8217;m sure I visited it the next day, but the interest had vanished.</p>\n\n\n\n<p>I don&#8217;t remember this story because of the picnic-table-sized shallow hole; I remember this story because of my Dad. He walked out of the house and found his young son digging a random hole on the property. No plan, poorly equipped, but enthusiastically digging. He stood there asking questions, not judging. Supporting the dream.</p>\n\n\n\n<p>Just letting me gleefully dig.</p>\n\n\n\n<p>He taught me that no one knows where inspiration comes from — only that it&#8217;s fragile, invaluable, and fleeting.</p>\n\n\n\n<p></p>"
            ],
            "link": "https://randsinrepose.com/archives/im-going-to-dig-a-hole/",
            "publishedAt": "2026-01-19",
            "source": "Rands in Repose",
            "summary": "Many, many years ago, at my childhood house in the Santa Cruz mountains, I grabbed a shovel and started to dig a hole. Why? Unclear. I was six or seven. I&#8217;d seen what my Dad could do with a shovel, so one afternoon…. I started digging, and by the time evening approached, my Dad walked&#8230; <a class=\"excerpt-more\" href=\"https://randsinrepose.com/archives/im-going-to-dig-a-hole/\">more</a>",
            "title": "I’m Going to Dig a Hole"
        },
        {
            "content": [
                "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Thanks to everyone who commented on the <a href=\"https://www.astralcodexten.com/p/the-dilbert-afterlife\">Dilbert Afterlife</a> post, including people who offered critiques/pushback. I&#8217;ll try to have a Highlights From The Comments soon.</p><p><strong>2: </strong>In the ACX grants announcement, I said one of our grantees was an organization promoting free speech in the UK, and I&#8217;d be signal-boosting it once it came out of stealth. I can now announce that they are <a href=\"https://www.speakuk.org/\">SPEAK</a> , their platform is a Free Speech Act for the UK, and you can follow them on Twitter at <a href=\"https://x.com/speakukorg\">@speakukorg</a>. Check them out, and <a href=\"https://www.speakuk.org/#get-involved\">join</a> if interested.</p><p><strong>3: </strong>You may have heard of <a href=\"https://www.smithsonianmag.com/smart-news/scientists-weigh-the-risks-of-mirror-life-synthetic-molecules-with-a-reverse-version-of-lifes-building-blocks-180987360/\">mirror life</a>, a hypothetical form of synthetic microorganism based on reversed versions of biomolecules. If it were ever created - for example, by bioterrorists, risky research + lab leak, or a rogue AI - it could act as a sort of super-invasive species that would threaten most forms of normal life, including humans. The <a href=\"https://www.mbdialogues.org/\">Mirror Biology Dialogues Fund</a> is the main organization working to prevent its creation (you can learn more about them <a href=\"https://80000hours.org/podcast/episodes/james-smith-mirror-biology-catastrophe/\">on this 80K podcast</a>) and they ask me to announce that <a href=\"https://www.mbdialogues.org/jobs\">they&#8217;re hiring</a>. Open roles include <a href=\"https://www.mbdialogues.org/jobs/deputy-director\">deputy director</a> and <a href=\"https://www.mbdialogues.org/jobs/people-program-ops-lead\">people &amp; programs operation lead</a>. Both roles are remote, salaries are $180K+ and $120K+ respectively, and first-round applications close 1/25 and 2/8, respectively.</p>"
            ],
            "link": "https://www.astralcodexten.com/p/open-thread-417",
            "publishedAt": "2026-01-19",
            "source": "SlateStarCodex",
            "summary": "<p>This is the weekly visible open thread. Post about anything you want, ask random questions, whatever. ACX has an unofficial <a href=\"https://www.reddit.com/r/slatestarcodex/\">subreddit</a>, <a href=\"https://discord.gg/RTKtdut\">Discord</a>, and <a href=\"https://www.datasecretslox.com/index.php\">bulletin board</a>, and <a href=\"https://www.lesswrong.com/community?filters%5B0%5D=SSC\">in-person meetups around the world</a>. Most content is free, some is subscriber only; you can subscribe <strong><a href=\"https://astralcodexten.substack.com/subscribe\">here</a></strong>. Also:</p><div><hr /></div><p><strong>1: </strong>Thanks to everyone who commented on the <a href=\"https://www.astralcodexten.com/p/the-dilbert-afterlife\">Dilbert Afterlife</a> post, including people who offered critiques/pushback. I&#8217;ll try to have a Highlights From The Comments soon.</p><p><strong>2: </strong>In the ACX grants announcement, I said one of our grantees was an organization promoting free speech in the UK, and I&#8217;d be signal-boosting it once it came out of stealth. I can now announce that they are <a href=\"https://www.speakuk.org/\">SPEAK</a> , their platform is a Free Speech Act for the UK, and you can follow them on Twitter at <a href=\"https://x.com/speakukorg\">@speakukorg</a>. Check them out, and <a href=\"https://www.speakuk.org/#get-involved\">join</a> if interested.</p><p><strong>3: </strong>You may have heard of <a href=\"https://www.smithsonianmag.com/smart-news/scientists-weigh-the-risks-of-mirror-life-synthetic-molecules-with-a-reverse-version-of-lifes-building-blocks-180987360/\">mirror life</a>, a hypothetical form of synthetic microorganism based on reversed versions of biomolecules. If it were ever created - for example, by bioterrorists, risky research + lab leak, or a rogue AI - it could act as a sort of super-invasive species that would threaten most forms of",
            "title": "Open Thread 417"
        },
        {
            "content": [
                "<p>My birthday’s coming up, Jan 20th. Fifty-seven. As my Uncle Harold used to say in the 1980s, “Hey it’s my birthday. Keep it under fifty bucks.” I’m not sure what I thought I’d be doing right now, 30 years ago. But I wouldn’t have guessed being in the best physical shape of my life, cranking out thousands of lines of production code per day, chatting all day with brilliant friends all around the world, and generally having an absolute blast. Life has a lot of ups and downs, so it’s good to have an up year once in a while.</p><p>2026 is shaping up to be straight-up insane. There’s a lot going on, and it’s speeding up. Here’s a sketch of how my week has been. I’ll talk about five themes: Money, Time, Power, Control, and Direction.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*gdwF568ZEAFp6QHdgfLShQ.jpeg\" /><figcaption>Figure 1: A Busy Week</figcaption></figure><h3><strong>Part 1: Money</strong></h3><p>There is a lot of money in AI, deserved or no. And even more money is sniffing around trying to get <em>in</em> to AI. The world’s money is like a conscious thing, and it exerts pressure as it sloshes around. Money has a good nose, and it smells big changes in the air this year. First and foremost, it smells changes for software devs. But that’s just a precursor to all knowledge workers being changed somehow by AI. Soon. Money knows this. Money wants the fuck <em>in</em>.</p><p>It is now poking its head around every corner, through every nook in the AI spaces. Money got a pretty good whiff of my <a href=\"https://steve-yegge.medium.com/welcome-to-gas-town-4f25ee16dd04\">Gas Town</a> fart, and now I’m being stalked as prey by money from all sides. I don’t have much money, having pissed all my AMZN and GOOG stock away on stuff I have zero regrets about, living life. And I wasn’t raised with money, so I know fuck-all about how it works.</p><p>But I know it’s trying to get me. And for now, I’ve gotta push back.</p><p>My deepest apologies to the fifteen or sixteen VCs who have reached out so far, at a rate of roughly one per day since launch.<strong> </strong>I appreciate you. I’ve given it a lot of thought. But I’m not likely to go that route. I’m sure there are nice $200B businesses to be built on both Beads and on Gas Town, but I’m aiming bigger. They both build directly toward the third movie in my software orchestration trilogy, and I need to be relentlessly focused on that, not chasing ARR. I totally get that there are amazing people out there who would give me plenty of runway, but what I’m building toward isn’t financially defensible. It’s not a moat. It’s a life raft.</p><p>And now I’ll turn very briefly to another sloshing money monster that came after me last week. To catch you up if you’re behind, and I <a href=\"https://medium.com/@steve-yegge/bags-and-the-creator-economy-249b924a621a\">posted about it in detail</a> a few days ago, someone created a meme coin about Gas Town and within a week I had made $300k USD in cryptocurrency transaction fees on that coin, which traded something like 16 million dollars in volume. Very weird turn of events. But it means I must be super clear:</p><p><strong><em>Disclosure:</em></strong><em> I receive creator royalties/trading fees associated with $GAS trading on BAGS, and I may benefit financially from that activity. I didn’t create $GAS and have no control over its price, supply, or liquidity. $GAS is </em><strong><em>not</em></strong><em> equity and does not give you any ownership interest in Gas Town or my work. This post is not financial advice — Crypto assets are highly volatile and speculative. Do not trade based on this content.</em></p><p>And with that disclaimer out of the way, I must reiterate my sincere regrets to the CT/BAGS crowd, who so generously funded me to the tune of just shy of $300k last week on <a href=\"https://bags.fm/\">bags.fm</a>. That money was hard to duck, and the funds are deeply appreciated. They will help Gas Town be a big success this year. But Gas Town itself needs my full attention; between that and Beads it’s a wonder I get anything done at all.</p><p>So I had to step back from the community. I do find it amazing how they band together, dissenting voices rolling around like a big Katamari Damacy ball, and yet they somehow collectively find the discipline to act like financial analysts for institutional investors, weighing developer dossiers, product business cases, and doing critiques like a collective of professionals. All in crypto-bro speak. But it’s the same due diligence.</p><p>But the CT community, like any highly engaged stakeholders, were going to be asking for a lot of my time. There are always strings attached.</p><p>In short, I’m avoiding tying myself to any money that makes demands on my time or direction. I’ve got too much to do, to be worrying about monetizing right now.</p><h3><strong>Part 2: Time</strong></h3><p>I had lunch again (Kirkland Cactus) with my buddies Ajit Banerjee and Ryan Snodgrass, the ones who have been chastising teammates for acting on ancient 2-hour-old information. Every week we discuss some surprising new phenomenon or principle we’ve discovered while coding with 20+ agents.</p><p>This week the surprise phenomenon was nappy time. Yeah, I don’t use the word “surprising” lightly. High-end vibe coding is fucking with our sleep cycles. All though December I had weird sleeping patterns while I was building Gas Town. I’d work late at night, and then have to take deep naps in the middle of the day. I’d just be working along and boom, I’d drop. I have a pillow and blanket on the floor next to my workstation. I’ll just dive in and be knocked out for 90 minutes, once or often twice a day.</p><p>At lunch, they surprised me by telling me that vibe coding at scale has messed up their sleep. They get blasted by the nap-strike almost daily, and are looking into installing nap pods in their shared workspace.</p><p>Before they mentioned it, I had chalked it up to jet lag. I get hit hard flying back West, and it can take me a couple weeks to get on my feet. But it has been 5 weeks since Sydney and it never stopped. I got clocked by a nap-strike on Friday. Your buffer just fills up and you’re gone. I’ve fallen asleep slower at the anesthesiologist. You wake up with a drool-soaked pillow wondering who you are, and five minutes later you’re going hard with the agents again.</p><p>This wasn’t happening last year. It wasn’t until we’d started working with a dozen or more agents at once and doing swarming of large piles of work.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GxI7LWAadOFxmZyHDExk0w.jpeg\" /><figcaption>Figure 2: Bezos Mode: Reviewing reports all day</figcaption></figure><p>Our hypothesis is that we’re operating at such a high level of decision-making that we’re exhausting some internal buffers, and need to grab some gradient-descent time before we can continue.</p><p>To me it feels like Jeff Bezos Mode. I used to work for the man, and he basically spent his day listening carefully to presentations that smart people had prepared for him. They were never presenting easy shit. You only presented hard problems to Bezos. He had to absorb new information incredibly fast all day long, come up to speed on the spot, and make decisions that didn’t conflict with each other. I call that Jeff Bezos Mode, and it’s why he was always 18 steps ahead of all of the rest of us. He was solving curated puzzles all day, and it gave him otherworldly perspective.</p><p>It must have been utterly exhausting. Even for him.</p><p>Well, all three of us spent years at Amazon, and we agree, this feels like Bezos Mode. With Opus 4.5 swarms, you flit from agent to agent, only stopping at the ones that have finished their work and have produced a report for you. These are the reports from agents that you gave hard problems to; e.g., your Gas Town Crew. Ephemeral agents like polecats can handle all the easy stuff without you needing to look, by definition. Which means that everything that you actually wind up reading from agents tends to be architecturally rich, complex, and nuanced.</p><p>And we’re finding it to be exhausting.</p><p>We’re all pretty old, though, so YMMV. I don’t remember Bezos running off to take naps. Maybe this phenomenon only hits senior citizens. But the much younger Geoffrey Huntley, who was kind enough to pre-review this blog post, shared that it was happening to him all last year, and continues to this day. “Every discovery blasts me. Wipes me out and takes a while to recover.” So maybe we’re on to something here.</p><p>I’m going to go lay down and, uh, think about the problem with my eyes closed.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*WofgvCliHun-BmYFwbbM_Q.jpeg\" /><figcaption>Figure 3: Nap Strike</figcaption></figure><h3><strong>Part 3: Power</strong></h3><p>I caught up today with Jeffrey Emanuel, who just launched a <a href=\"https://x.com/doodlestein/status/2012972038332260744?s=20\">Rust port of Beads</a> (pre-Gas Town API). He confirmed what I’ve been seeing myself and hearing from others, which is that things are starting to accelerate insanely at the bleeding edges of software development.</p><p>Jeffrey, as we saw from his X posts, has bought so many Claude Pro Max $200/month plans (22 so far, or $4400/month in tokens) that he got auto-banned by Anthropic’s fraud detection. He has become inhumanly productive. Among other things, he has recently ported a large number of popular libraries to Rust. All the Charm TUI libraries, fastapi, fastmcp, sqlmodel, a bunch of other stuff. Huge, polished libraries, completely cloned. And we’re just seeing Jeffrey’s exhaust, the projects he spins off as he works towards his bigger ambitions, which he’s sketched for me.</p><p>I’d just like to remind everyone that I predicted this pay-to-play productivity boost, betting a lot of my own rep on it, in <a href=\"https://sourcegraph.com/blog/revenge-of-the-junior-developer\">Revenge of the Junior Developer</a>, ten months ago. I knew that the tools would support running 100+ Claude Code instances, and that the high-end spend would rival an engineer’s salary within a year. Those predictions have come true.</p><p>I’m sure there aren’t many people quite as far along as Jeffrey; on my 8-level chart he’s a level 10. But they do exist, and their ranks are growing. There are on-ramps for the less crazy users. Gas Town, Claude Flow, and Loom are all gentle introductions to working with dozens of concurrent agents. They let you grow into the idea gradually, and it scales up with you as you practice. Everyone is going to learn how this stuff works this year, or die not trying. The industry won’t be kind to the people who sleep on this.</p><p>When you reach Level 8, building your own orchestrators, Gas Town may not be enough for you. You may want to try Gas City, my upcoming orchestration-builder toolkit, which I’ll talk about below.</p><p>Software engineering has always been incredibly high-leverage relative to other craft professions. Paul Graham used to write about this back in the late 1990s and early 00s. You could always find programmers who are 10x or 100x better than the average programmer, and you don’t see such a broad distribution in most other professions.</p><p>With agentic coding, it’s about to go to 1000x or even 10000x. I’m far from the only one noticing or talking about this. The more agents you can run successfully, the further you climb up the exponential curve, because it’s recursive: agents can run agents who run agents. The trick will be to manage that without becoming the Flying Wallendas. It will happen.</p><p>2026 will be a year where you see single engineers cloning, say, the entire Java/JVM stack and core ecosystem by themselves. Or a team of 2–5 engineers being able to recreate the an entire enterprise stack for a big company, in any language they want, factored into maintainable microservices. If you can afford the tokens, and you can <em>find</em> the tokens, you will be able to build things like you never imagined. You just have to learn how to tame the camels.</p><p>As I predicted in RotJD, you tame them with orchestrators: the new IDEs.</p><h3><strong>Part 4: Control</strong></h3><p>Agent orchestrators are programs that use agents to run other agents.</p><p>There are, as far as I can tell, four main players in this space: <a href=\"https://github.com/anthropics/claude-code/tree/main/plugins/ralph-wiggum\">Ralph Wiggum</a>, <a href=\"https://github.com/ghuntley/loom\">Loom</a>, <a href=\"https://github.com/ruvnet/claude-flow\">Claude Flow</a>, and <a href=\"https://github.com/steveyegge/gastown\">Gas Town</a>. More will come <em>very</em> soon, from all corners. But I thought I’d share my thoughts on how to tell the current group apart, as they are all very important.</p><p>This is just a snapshot of my current thinking. I haven’t used any of the other orchestrators, and as far as I know, none of us have used each other’s work. We’re all very busy. This is a best-effort first take.</p><p>First off, I’d like to reiterate my deepest respect to the creators of these orchestrators. They’re the level 9s, the ones who have already built multiple working orchestrators in order to get this far. They’re the ones who had the guts to launch when all everyone else could do is say “I’m working on one.” Thanks to <a href=\"https://medium.com/u/e26a0a46e594\">Dan Shapiro</a> for that insight, and I heartily agree, since it took a lot of guts to launch Gas Town.</p><p>Here’s how I’m thinking about them right now. They’re all changing fast so this is a snapshot.</p><p>I think Geoffrey Huntley and I have been exploring two of the key components of the Industrial Revolution happening in agentic software development: factories, and workers. In my view, Claude Code is a worker. Geoffrey has built a super-worker, and also a team of super workers with <a href=\"https://youtu.be/zX_Wq9wAyxI?si=aLGKmzKlGrTQxgDx\">Loom</a>, whereas I’ve built a super-factory. These are all orthogonal, complementary, and necessary.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*1wiTWL2IdFrQ-dRLaSMBlw.jpeg\" /><figcaption>Figure 4: Coding Agent Industrial Revolution</figcaption></figure><p>Claude Flow is a bit different; it also tries to be a factory, and it’s quite clever, but it’s not thinking about the problem the way I am. All three of the others have orchestration as their core primitive. Whereas for Gas Town, the work itself is the primitive. Gas Town federates work into an auditable ledger for tracking millions of work items in a blockchain. I’m solving a completely different problem. Gas Town’s orchestration facilities are a thin layer atop a work-definition stack. And in time, Gas Town will be rewritten in that stack, in a much more flexible way, allowing for all sorts of orchestration shapes.</p><p>Geoffrey Huntley and I have been chatting and plotting together lately, with more collaboration to come. One amusing thing we discovered is that we were each tackling the other’s problem last year. I was working on a super-agent (basically, quality) and he was working on swarming (quantity). We each built multiple complete implementations. And toward the end of the year, we each flipped to the opposite problem.</p><p>In my view, Geoffrey’s Ralph loops are a brilliant automation of the discovery that LLMs can self-review to convergence, which I believe Jeffrey Emanuel was also onto with his (weaker, manual) Rule of Five. I also have a weak version of this idea in Gas Town; I can show you exactly where. It’s the top row of Figure 12 in <a href=\"https://steve-yegge.medium.com/welcome-to-gas-town-4f25ee16dd04\">Welcome to Gas Town</a>, “Gas Town’s Patrols,” where there is a row of workflows that are not patrols. These are vestigial remnants of my first two orchestrators, which focused on trying to get Claude to act like a thorough engineer when it has finally been assigned a task by the factory.</p><p>These weren’t fully productionized; the polecats can use them but never do, and the right thing to do is rip them out and replace them with Ralph loops. Gas Town shouldn’t be trying to solve the quality problem, since Ralph has done a much better job.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*NLSSmqgf-vqGePyVstB6og.jpeg\" /><figcaption>Figure 5: Gas Town’s Hidden Shitty Ralph Clone</figcaption></figure><p>Similarly, Gas Town has very loose coordination primitives for groups of workers tackling a task — e.g. polecats are often parts of larger convoys. I’ve no doubt whatsoever that in these situations, something like either Loom or Claude Flow is going to be the right solution to plug in. That’s not Gas Town’s focus; I had almost none of it at launch.</p><p>Gas Town’s focus is the work, the stuff you know needs to be done, independent of superintelligence. I’m a big believer in the MEOW stack, Nondeterministic Idempotence, and Beads as a Universal Data Plane. These are all critically important differentiators for Gas Town, and they will yield unexpected emergent benefits over time because of the audit trail.</p><p>Orchestrators will shift and change shape rapidly over the next few months. Everyone’s going to start building them. But I think Gas Town’s core infrastructure has a credible advantage over anyone who’s not thinking about the data trail properly.</p><p>I contend that Beads was like the discovery of oil. Right now everyone is playing with it and lighting lanterns, not realizing it’s going to turn into the global petroleum industry for data. Gas Town makes work (Beads) shoot out in geysers. It’s an actual boom town built on the oil of a digital data plane in git. Think where it will go.</p><p>I don’t think Gas Town is like any other orchestrator out there. Not remotely close. The only thing that’s probably not quite right with it yet, is the shape. Kubernetes-shaped is just one way to make an orchestrator, and there are a million other ways.</p><p>Let’s talk about how Gas Town will find exactly the right shape for you.</p><h3><strong>Part 5: Direction</strong></h3><p>Last topic. What a week, amirite?</p><p>I’ve mentioned that Dario Amodei refers to 2026 as “The Endgame.” Well, we’re here.</p><p>Gas Town has a deep stack, but its current form factor is just a sketch. All the roles are completely hardwired in the Go code. Gas Town has Go modules dedicated to the Witness, Refinery, Mayor, Deacon, Polecats, etc. So it’s part of the architecture, and hard to change at this point.</p><p>But halfway through the implementation, I realized the MEOW stack had become powerful enough to abstract away the roles themselves, allowing you to express them in a sort of DSL based on Beads, with just a little orchestration glue.</p><p>I chatted with Claude, and we decided to finish Gas Town and then turn around and immediately begin work on the SDK-builder that lets you build your own Gas Town, with your own roles, teams, coordination rules, and worker instructions. This will allow people to create, for instance, roles and patrols that handle custom business processes.</p><p>So Gas Town will soon evolve into a kit that lets you build your own town shapes. (And wire in your own sandboxes, plugins, hooks, etc. etc.) Where does Ralph fit in?</p><p>Ralph loops are effectively tasks. A Ralph loop is fundamentally concerned with <em>finishing a task </em>at a high level of quality. A Gas Town patrol is fundamentally concerned with <em>recording task execution</em> for a well-defined sequence of steps, often done in a loop. For instance, ETLs are an old-fashioned kind of patrol, where every time a database changes, someone notices and exports the data with some transformation steps. Businesses are all built on patrols, but we don’t call them that because they have not historically had humanlike intelligence. Starting in 2026, they will.</p><p>A patrol step is a task. So I feel the ideal patrol will turn out to be one that invokes a Ralph loop at each step, at least for steps that require complex processing. A good patrol agent will know when it’s needed, and use Ralph loops judiciously, even watching them to make sure they don’t go off-rails.</p><p>In addition to making patrols more reliable, I think another huge Ralph win for Gas Town will be for the polecats, which are ephemeral Claude Code instances that handle feature work, bug fixes, code reviews, and other one-shot tasks. Work is slung to polecats in the context of a Convoy for tracking, and polecats have persistent Git identities, so there’s a factory dance to it all.</p><p>Great. But, once a polecat finally spins up and takes its task, it has proven about as trustworthy as a real polecat.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*AFpNBmKUvz8bXbYcmTsZIA.jpeg\" /><figcaption>Figure 6: Four ways Gas Town polecats can work</figcaption></figure><p>The picture above shows four different possible polecat work styles. The one we have in play today is the lower-right quadrant, which accurately depicts one sleeping, one daydreaming about playing trombone (this may be the first genuinely funny joke I’ve seen from nano banana), and various others in states of disarray.</p><p>That is how Gas Town feels right now. The polecats are unsupervised, uncoordinated, and left on their own to get to the finish line. You spend a lot of time asking the Mayor to poke them to finish up. This is a quality problem, and Ralph will solve it brilliantly. And for more complex tasks, Loom or Claude Flow could push it even further, tackling ever-larger problems.</p><p>Real-world use case: Gas Town often has a problem with giving tasks that are too large to polecats, and they can choke trying to swallow their food. They’ll run out of context and compact (a failure scenario IMO), or do a bad job, or balk. They do have the ability to escalate and kick it back to the human if the task needs splitting. But why bother with that, when you could just have a Ralph loop brute-force it? Ralph’s super-workers will turn Gas Town into a super-factory.</p><p>Gas City is what I’m calling my next iteration, where you can define your own custom roles in addition to patrols etc. I’ve got some stuff in the queue to finish up first, such as switching Beads to use the amazing Dolt database, which I’ll post about soon. But Ralph’s on the docket. And I keep adding Claude Pro Max subscriptions, so I may get to it sooner than later.</p><p>In the meantime, I’m still working on Gas Town stability, merging community PRs, and making the core Gas Town work better and better for people brave enough to try it out. Gas Town itself still has a long way to go in order to be ready for mass-market adoption. A <em>loooong </em>way. But we’ll get there.</p><p>And it’s a wrap! What a week.</p><p>Biggest takeaway: If you haven’t tried Beads yet, now’s the time. Gas Town is a big experiment, but Beads is mature and already getting replicated in other language ecosystems.</p><p>See you all online! Thanks again to the amazing CT community, the Gas Town contributors, the Beads contributors, and everyone who bought our <a href=\"https://www.amazon.com/Vibe-Coding-Building-Production-Grade-Software/dp/1966280025\">Vibe Coding</a> book!</p><p><em>p.s. if I’ve promised to get back to you about a podcast, interview, livestream, workshop, speaking engagement, coffee meetup, or similar, I’ll do my best. If I haven’t responded in a week give me a nudge. Shit’s crazy right now.</em></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*trnka-eA6vH_DNnKI4EFhw.jpeg\" /><figcaption>Figure 7: End of a Great Week</figcaption></figure><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=34f437139cb5\" width=\"1\" />"
            ],
            "link": "https://steve-yegge.medium.com/steveys-birthday-blog-34f437139cb5?source=rss-c1ec701babb7------2",
            "publishedAt": "2026-01-19",
            "source": "Steve Yegge",
            "summary": "<p>My birthday’s coming up, Jan 20th. Fifty-seven. As my Uncle Harold used to say in the 1980s, “Hey it’s my birthday. Keep it under fifty bucks.” I’m not sure what I thought I’d be doing right now, 30 years ago. But I wouldn’t have guessed being in the best physical shape of my life, cranking out thousands of lines of production code per day, chatting all day with brilliant friends all around the world, and generally having an absolute blast. Life has a lot of ups and downs, so it’s good to have an up year once in a while.</p><p>2026 is shaping up to be straight-up insane. There’s a lot going on, and it’s speeding up. Here’s a sketch of how my week has been. I’ll talk about five themes: Money, Time, Power, Control, and Direction.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*gdwF568ZEAFp6QHdgfLShQ.jpeg\" /><figcaption>Figure 1: A Busy Week</figcaption></figure><h3><strong>Part 1: Money</strong></h3><p>There is a lot of money in AI, deserved or no. And even more money is sniffing around trying to get <em>in</em> to AI. The world’s money is like a conscious thing, and it exerts pressure as it sloshes around. Money has a good nose, and it smells big changes in the air this year. First",
            "title": "Stevey’s Birthday Blog"
        },
        {
            "content": [
                "<p>The main thing to know this time around is that the whole crazy ‘what is causing the rise in autism?’ debacle is over actual nothing. There is no rise in autism. There is only a rise in the diagnosis of autism.</p>\n\n\n<h4 class=\"wp-block-heading\">Table of Contents</h4>\n\n\n<div>\n<figure>\n<div>\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!ompY!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd23aa2b5-e520-4064-9d5b-32dbd81ed461_1536x1024.png\" /></figure>\n\n\n<div></div>\n</div>\n</figure>\n</div>\n<ol>\n<li><a href=\"https://thezvi.substack.com/i/185107100/autism-speaks\">Autism Speaks.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/exercise-is-awesome\">Exercise Is Awesome.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/that-s-peanuts\">That’s Peanuts.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/an-age-of-wonders\">An Age Of Wonders.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/glp-1s-in-particular\">GLP-1s In Particular.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/the-superheroes\">The Superheroes.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/the-supervillains\">The Supervillains.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/fda-delenda-est\">FDA Delenda Est.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/hansonian-medicine\">Hansonian Medicine.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/hospital-strategy-101\">Hospital Strategy 101.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/mental-hospital-strategy-101\">Mental Hospital Strategy 101.</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/drugs-are-bad-mmmkay\">Drugs Are Bad, Mmmkay?</a></li>\n<li><a href=\"https://thezvi.substack.com/i/185107100/the-lighter-side\">The Lighter Side.</a></li>\n</ol>\n\n\n<h4 class=\"wp-block-heading\">Autism Speaks</h4>\n\n\n<p>It has not, however, risen in prevalence.</p>\n<p>The entire shift in the rate of diagnosis of autism is explained by expanding the criteria and diagnosing it more often. Nothing actually changed.</p>\n<div>\n\n\n<span id=\"more-25037\"></span>\n\n\n</div>\n<p>We already knew that vaccines don’t cause autism, and that Tylenol doesn’t cause autism, but now we know such things on an entirely different level.</p>\n<p>I admit that this result confirms all of my priors and thus I might be insufficiently skeptical of it, but there are a lot of people with what we in 2026 call autism that are out there, they love picking apart such findings, and I’ve seen zero of them question the statistical result.</p>\n<p>Autism used to mean something severe enough to render a child non-functional.</p>\n<p>It now means someone capable of thinking clearly who insists words have meaning.</p>\n<p>It also still means the first thing, and everything in between.</p>\n<p>Using the same word for all these things, and calling it the autism spectrum, does not, overall, do those on either end of that spectrum any favors.</p>\n<blockquote><p><a href=\"https://x.com/mattyglesias/status/2006396788484284757\">Matthew Yglesias</a>: ​Study confirms that neither Tylenol nor vaccines is responsible for the rise in autism <a href=\"https://www.slowboring.com/p/the-dangerous-war-on-tylenol\">BECAUSE THERE IS NO RISE IN AUTISM TO EXPLAIN</a> just a change in diagnostic standards.</p>\n<p>The <a href=\"https://pages.uoregon.edu/eherman/teaching/texts/DSM-I%20-%20DSM-IV%20diagnostic%20criteria.pdf\">D.S.M.-III</a> called for a diagnosis of infantile autism if all six of these criteria were met:</p>\n<ol>\n<li>Onset before 30 months of age</li>\n<li>Pervasive lack of responsiveness to other people</li>\n<li>Gross deficits in language development</li>\n<li>Peculiar speech patterns (if speech is present) such as immediate and delayed echolalia, metaphorical language, or pronominal reversal</li>\n<li>Bizarre responses to various aspects of the environment, e.g., resistance to change, peculiar interest in or attachments to animate or inanimate objects</li>\n<li>Absence of delusions, hallucinations, loosening of associations, and incoherence, as in schizophrenia</li>\n</ol>\n<p>This is clearly describing a uniformly debilitating condition, especially in terms of criteria (3) and (4).</p></blockquote>\n<p>That is very, very obviously not what anyone centrally means by ‘autism’ in 2025, and we are going searching for it under every corner.</p>\n<blockquote><p>By the time the D.S.M.-IV came out in 1994, things like “lack of social or emotional reciprocity” when combined with “lack of varied spontaneous make-believe play or social imitative play appropriate to developmental level” could qualify a child for an autism diagnosis, as long as they also have trouble making eye contact.​</p>\n<p><a href=\"https://x.com/cremieuxrecueil/status/2006449616359981280\">Cremieux</a>: <a href=\"https://www.cremieux.xyz/p/an-autism-challenge\">The result is consistent with 98.25% of the rise being due to diagnostic drift</a> and that’s not significantly different from 100%.</p>\n<p><a href=\"https://x.com/bryan_caplan/status/2006545490234716242\">Bryan Caplan</a>: Occam’s Razor. No one in my K-12 was called “autistic,” but there were plenty of weird kids.</p></blockquote>\n<p><a href=\"https://x.com/DKThomp/status/1973365094001050012\">Should the Autism Spectrum therefore be split apart?</a> Yes. Obviously yes.</p>\n<blockquote><p>Derek Thompson: I think the answer to this question is clearly yes.</p>\n<p>The expansion of the autism diagnosis in the last few decades has created a mess of meaning. It’s not helpful that “autism spectrum” now contains such an enormous bucket of symptoms that it applies to non-verbal adults requiring round-the-clock care and &#8230; Elon Musk.</p></blockquote>\n<p>The expansion of the autism spectrum label is especially poor for those at either extreme. It destroys clarity. It causes large underreactions in severe cases. It causes large overreactions in mild cases, including treating such children in well-intended but highly unproductive ways.</p>\n<p>It also is, as Michael Vassar points out, effectively part of a war against caring about truth and whether words have meaning, as anyone who does so care is now labeled as having a disorder. To be ‘normal’ rather than ‘neurodivergent’ you have to essentially show you care deeply about and handle social dynamics and trivialities without having to work at this, and that you don’t care about accuracy, whether words have meaning or whether maps match their territories.</p>\n\n\n<h4 class=\"wp-block-heading\">Exercise Is Awesome</h4>\n\n\n<p>Seriously, one cannot write ‘most people need to exercise more’ often enough.</p>\n<p>I heard a discussion on NPR’s Wait Wait Don’t Tell Me where a study uncovered that as little as half an hour a week of light exercise can do a substantial amount of good. The response from everyone was to joke that this means they didn’t need to do any more than that and doing anything at all made them heroes. And yes, there’s big gains for ‘do anything at all’ rather than nothing, but there’s quite a lot left to gain.</p>\n<p><a href=\"https://www.journals.uchicago.edu/doi/full/10.1086/738251\">University students given free gym memberships</a> exercised more and has a significant improvement in academic performance, dropping out of classes less and failing exams less, completing 0.15 SDs more courses. There’s a perversity to hearing ‘this made kids healthy, which is good because they got higher grades’ but if that’s what it takes, okay, sure. The cost-benefit here purely in increased earnings seems good enough.</p>\n<blockquote><p>A large majority of students do not report having financial or time constraints at baseline, which suggests that the free gym card primarily removed psychological barriers to exercise. This is in line with the fact that many participants reported at baseline that they did not exercise at the gym because they were lazy, which may be interpreted as a sign of procrastination.</p></blockquote>\n<p>This all came from an average of 5.7 additional gym visits per student, which isn’t that great a return on a gym membership at first glance. For the effect to be this big there have to be shifts beyond the exercise, something psychological or at least logistical.</p>\n<p>There still are very clear diminishing marginal returns.</p>\n<p>Thus here is your <a href=\"https://x.com/oscredwin/status/1987899138961236092\">periodic fitness reminder that although exercising and being in shape is great</a> but there are rapidly decreasing practical returns once you become an outlier in strength, and going deep into gym culture and ‘looking jacked’ has actively negative marginal returns, including in terms of attractiveness and also the injury risk rises a lot.</p>\n\n\n<h4 class=\"wp-block-heading\">That’s Peanuts</h4>\n\n\n<p><a href=\"https://x.com/robinhanson/status/2007877218400124987\">Exposure to potential allergens as infants</a> decreases allergies, with peanuts being the central example. Carefully avoiding them, as we were for a while told by doctors to do, is exactly wrong. It’s so crazy that our ‘experts’ could get this so exactly backwards for so long, luckily such allergies are on the decline again now that we realize. But as Robin Hanson says, who is there to sue over this epic failure?</p>\n\n\n<h4 class=\"wp-block-heading\">An Age Of Wonders</h4>\n\n\n<p><a href=\"https://x.com/GeneSmi96946389/status/2011621643068850440\">Gene Smith reports that some IVF doctors have figured out</a> how to get much more reliable embryo transfer than the traditional 70%, and also higher egg yields per round. A highly competent IVF practice and doctor can make a big difference, and for now its value could be bigger than those from finding superior embryo selection.</p>\n<p><a href=\"https://www.washingtonpost.com/science/2025/10/23/vaccine-cancer-covid-19-mrna/?utm_campaign=wp_main&amp;utm_source=twitter&amp;utm_medium=social\">Study finds mRNA Covid-19 vaccines prolonged life of cancer patients</a>, which they claim is via trained immunity from a Type I Interferon surge and activation of MDA5, but it seems they didn’t do a great job controlling for the obvious factor of whether this came from its protective effects against Covid-19? That seems like a giant hole in the study, but they are in Phase III which will settle it either way. If the effect is real you can likely enhance it quite a lot with a combination of mRNA composition and timing the shot to the start of using checkpoint inhibitors.</p>\n\n\n<h4 class=\"wp-block-heading\">GLP-1s In Particular</h4>\n\n\n<p><a href=\"https://www.nytimes.com/2025/12/11/health/eli-lilly-retatrutide-weight-loss-drug.html\">The latest experimental GLP-1 entry from Eli Lilly</a>, is showing the largest weight loss results we’ve seen so far, including big impacts on arthritis and knee pain.</p>\n<p><a href=\"https://www.nbcnews.com/news/rcna235471\">Costco to sell Ozempic and Wegovy at large discount for people without insurance</a>, at $499 a month, the same as Novo Nordisk’s direct-to-consumer website. You do still need a prescription.</p>\n<p><a href=\"https://x.com/cremieuxrecueil/status/1968096846548812105\">Eli Lilly seems to have made a once-daily weight loss pill</a> that works 80%-90% as well as injected Ozempic, with fewer side effects. It’s plausible this would make adaptation much more common, and definitely would if combined with affordable prices and easy access.</p>\n<p><a href=\"https://www.nber.org/papers/w34678\">Unfortunately an early study suggests that GLP-1s do not</a>, so far, reduce medical spending, with little offset in other spending being observed or projected. Given this is a highly effective treatment that reduces diabetes and cardiovascular risks, that is a weird result, and suggests something is broken in the medical system.</p>\n\n\n<h4 class=\"wp-block-heading\">The Superheroes</h4>\n\n\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/incentives-matter-and-supply-is-elastic.html\">Elasticity of the supply</a> of pharmaceutical development of new drugs is high. If you double the exclusivity period you get (in the <a href=\"https://o-zhao.github.io/files/Zhao_JMP_latest.pdf\">linked job market paper</a>) 47% more patent filings. We should absolutely be willing to grant more profitability or outright payments for such progress.</p>\n<p>Australia offers a strong pitch as a location for clinical trials, <a href=\"https://www.writingruxandrabio.com/p/for-clinical-trial-reform-we-need\">and as a blueprint for reform here in America</a> if we want to do something modest.</p>\n<blockquote><p><a href=\"https://x.com/shelbynewsad/status/1968361454358380806\">Dr. Shelby</a>: when people talk about Australia for clinical trials, most discourse is round the 40%+ rebates.</p>\n<p>BUT, what I haven’t heard discussed is that they don’t require IND packages in some cases. (eg. new insulin format, or new EPO analogues for anemia).</p>\n<p>drugs going through this path only need CMC and and ethics approval.</p>\n<p>Ruxandra Teslo: Also no full GMP for Phase I. Imo US should just literally copy the Phase I playbook from Australia.</p>\n<p>One of the most frustrating experiences in trying to propose ideas on how to make clinical development faster/cheaper, is that ppl who have on-the-ground experience are reluctant to share it, for fear of retribution. The cancel culture nobody talks about.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">The Supervillains</h4>\n\n\n<p>Your periodic reminder that today’s shortage of doctors <a href=\"https://x.com/Matthew_Meyers5/status/1974148023384170769\">is a policy choice intentionally engineered by the American Medical Association</a>.</p>\n<p><a href=\"https://www.writingruxandrabio.com/p/for-clinical-trial-reform-we-need\">Ruxandra Teslo offers another round</a> of pointing out that if we had less barriers to testing potential new treatments we’d get a lot more treatments, but that no one in the industry has the courage to talk about how bad things are or suggest fixes because you would get accused of the associated downside risks, even though the benefits outweigh the risks by orders of magnitude. Ruxandra notes that we have a desperate shortage of ‘Hobbit courage,’ or the type of intellectual courage where you speak up even though you yourself have little to gain. This is true in many contexts of course.</p>\n<blockquote><p>Patrick McKenzie (about Ruxandra’s article): A good argument about non-political professional courage, which is *also* an argument why those of us who have even moderate influence or position can give early career professionals an immense boost at almost trivial cost, by advancing them a tiny portion of their future self.</p>\n<p>This is one reason this sometimes Internet weirdo keeps his inbox open to anyone and why he routinely speaks to Internet weirdos. I’m not too useful on biotech but know a thing or two about things.</p>\n<p>Sometimes the only endorsement someone needs is “I read their stuff and they don’t seem to be an axe murderer.”</p>\n<p>Sarah Constantin: The most awful stories I heard about “he said this and never got a grant again” were criticisms of the scientific establishment, of funders, or regulators.</p>\n<p>Tame stuff like “there’s too much bureaucracy” or “science should be non-commercial.”</p></blockquote>\n<p>In terms of talking to internet weirdos who reach out, I can’t always engage, especially not at length, but I try to help when I can.</p>\n<p>I don’t see enough consideration of ‘goal factoring’ around the testing process and the FDA. As in, doing tests has two distinct purposes, that are less linked than you’d hope.</p>\n<ol>\n<li>Finding out if and in what ways the drug is safe and effective, or not.</li>\n<li>Providing the legal evidence to continue testing, and ultimately to sell your drug.</li>\n</ol>\n<p>If you outright knew the answer to #1, that would cut your effective costs for #2 dramatically, because now you only have to test one drug to find one success, whereas right now most drugs we test fail. So the underrated thing to do, even though it is a bit slower, is to do #1 first. As in, you gather strong Bayesian evidence on whether your drug works, however necessary and likely with a lot of AI help, then only after you know this do you go through formal channels and tests in America. I will keep periodically pointing this out in the hopes people listen.</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2025/11/why-are-us-clinical-trials-so-expensive.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=why-are-us-clinical-trials-so-expensive\">Why do clinical trials in America</a> <a href=\"https://cheekypint.transistor.fm/\">cost a median of $40,000 per enrollee?</a> Alex Tabarrok points us to an interview with Eli Lilly CEO Dave Ricks. There are a lot of factors making the situation quite bad.</p>\n<blockquote><p>Alex Tabarrok: One point is obvious once you hear it: Sponsors must provide high-end care to trial participants–thus because U.S. health care is expensive, US clinical trials are expensive. Clinical trial costs are lower in other countries because health care costs are lower in other countries but a surprising consequence is that it’s also easier to recruit patients in other countries because sponsors can offer them care that’s clearly better than what they normally receive. In the US, baseline care is already so good, at least at major hospital centers where you want to run clinical trials, that it’s more difficult to recruit patients.</p>\n<p>Add in IRB friction and other recruitment problems, and U.S. trial costs climb fast.</p>\n<p>See also Chertman and Teslo at IFP who have a lot of <a href=\"https://ifp.org/the-case-for-clinical-trial-abundance/\">excellent material on clinical trial abundance</a>.</p></blockquote>\n\n\n<h4 class=\"wp-block-heading\">FDA Delenda Est</h4>\n\n\n<p><a href=\"https://x.com/seconds_0/status/1972479305361039810\">Once again, FDA Delenda Est</a>.</p>\n<blockquote><p>Anatoly Karlin: Lilly stopped one of two trials of bimagrumab, a drug that preserves muscle mass during weight loss, after new FDA guidance suggested that body composition effects wouldn’t be enough for approval, but would need to show incremental weight loss beyond the GLPs.</p></blockquote>\n<p>GLP-1s help you lose weight. The biggest downside is potential loss of muscle composition. But the FDA has decided that fixing this problem is not good enough, and they won’t approve a new drug that is strictly better on an important metric than an existing drug. Not that they won’t recommend it, that they won’t approve it. As in, it’s strictly better, but it’s not enough strictly better in the ways they think count, so that’s a banning.</p>\n<p>Which is all Obvious Nonsense and will make people’s lives much worse, as some lose muscle mass, others put in a lot more stress and effort to not lose it, and others don’t take the GLP-1 and thus lose the weight.</p>\n<p>The second best answer is that things like muscle loss prevention should count as superior endpoints.</p>\n<p>The first best answer is that ‘superiority’ is a deeply stupid requirement. If you have drug [A] that does [X], and then I have drug [B] that also does [X] about as well, the existence of [A] should not mean we ban [B]. That’s crazy.</p>\n<p><a href=\"https://www.statnews.com/2025/10/16/fda-chaos-hurts-innovation-two-examples-replimune-capricor/\">Uncertainty at the new iteration of the FDA</a> is endangering drug development on top of the FDA’s usual job endangering drug development. You can’t make the huge investments necessary if you are at risk of getting rejected on drugs that have already been approved elsewhere, for reasons you had no ability to anticipate.</p>\n<p>It would be good not to have an FDA, or even better to have a much less restrictive FDA. But if we’re not going to relax the rules, incompetence only makes it all worse.</p>\n<p>Some good news: <a href=\"https://x.com/DrMakaryFDA/status/2010906917682757979\">The FDA is now ‘open to Bayesian statistical approaches</a>.’ I suspect this only means ‘you can use evidence from Phase 2 in Phase 3’ but it’s great to see them admitting in the announcement that Bayesian is better than frequentist.</p>\n\n\n<h4 class=\"wp-block-heading\">Hansonian Medicine</h4>\n\n\n<p><a href=\"https://x.com/robinhanson/status/2010828545946259832\">Robin Hanson finds</a> <a href=\"https://www.nber.org/papers/w34682\">the most Hansoninan Medical study</a>. Amy Finkelstein and Matthew Gentzkow use mover designs to estimate the causal impact of healthcare spending on mortality. They find that extra healthcare spending, on current margins, has slightly negative impact.</p>\n<blockquote><p>Robin Hanson: ​”we investigate whether places that increase health care spending also tend to be places that increase health. We find that they do not”</p>\n<p>Their point estimate is that residents <em>lose</em> ~5 days of lifespan at age 65 for every 10% increase in medical spending. Standard error of this estimate is ~7 days.</p>\n<p>So two sigma (95% confidence level) above the estimate is +9 days of lifespan. Really hard to see that being worth 2% of GDP.</p></blockquote>\n<p>The discussion is frank that this doesn’t rule out that different regions might be providing similar care with different levels of efficiency. In that case, there’s a lot of money to be saved by improving efficiency, but it doesn’t mean care is wasted. There’s also potential selection effects on who moves. You would also want to consider other endpoints beyond mortality, but it’s hard to see those improving much if mortality doesn’t also improve.</p>\n<p>Robin Hanson links us <a href=\"https://www.nber.org/papers/w34249\">to this paper</a>, showing that greater expected pension benefits led to more preventative care, better diagnosis of chronic diseases and improved mortality outcomes. As in, there is a real incentive effect on health, at least at some income levels.</p>\n\n\n<h4 class=\"wp-block-heading\">Hospital Strategy 101</h4>\n\n\n<p><a href=\"https://x.com/RealGeneKim/status/1975707331129450559\">Gene Kim offers a writeup of his wife’s hospital experience</a>, explaining some basics of what you need to do to ensure your loved ones get the care they need. Essentially, the Emergency Department is very good at handling things you can handle in the Emergency Department, but the wiring connecting the various departments is often quite poor, so anything else is on you to ensure the coordination, and that information reaches those who need it, figure out where you’re going and how to get there. The good news is that everyone wants it to work out, but no one else is going to step up. It’s on you to ask the questions, share and gather the info and so on. What’s missing here is don’t be afraid to ask LLMs for help too.</p>\n\n\n<h4 class=\"wp-block-heading\">Mental Hospital Strategy 101</h4>\n\n\n<p><a href=\"https://www.psychiatrymargins.com/p/a-groundbreaking-analysis-upends\">Being admitted to a mental hospital is very, very bad for you</a>. This is known. It severely disrupts and potentially ruins your life permanently. The two weeks after release from the hospital put you at very high risk of suicide. Having someone committed, even for a few days, is not something to be taken lightly.</p>\n<p>That doesn’t mean one should never do it. In sufficiently dire circumstances, where outcomes are going to be terrible no matter what you do, it is still superior to known alternatives. The question is, how dire must be the circumstances to make this true? Are we doing it too often, or not often enough?</p>\n<p><a href=\"https://www.psychiatrymargins.com/p/a-groundbreaking-analysis-upends\">A new study measures this</a> <a href=\"https://www.newyorkfed.org/research/staff_reports/sr1158\">by looking at marginal admissions</a>, as different doctors act very differently in marginal cases, allowing us to conduct something remarkably close to an RCT. Such disagreement is very common, 43% of those evaluated for involuntary commitment for the first time fall into this group in the sample.</p>\n<p>Even with 7,150 hospitalization decisions, the study’s power is still not what we would like (the results are statistically significant, but not by that much considered individually), but the damage measured is dramatic: The chance of a marginal admit being charged with a violent crime within three months increases from 3.3% to 5.9% if they get admitted, the risk of suicide or death by drug overdose rises from 1.1% to 2.1%.</p>\n<p>This matches the associated incentives. If you don’t refer or admit someone at risk, and something goes wrong, you are now blameworthy, and you put yourself in legal jeopardy. If you do refer or admit them, then you wash your hands of the situation, and what happens next is not on you. Thus, you would expect marginal cases to be committed too often, which is what we find here.</p>\n<p>It seems reasonable to conclude that the bar for involuntary commitment should be much higher, and along the lines of ‘only do this if there is no doubt and no choice.’</p>\n\n\n<h4 class=\"wp-block-heading\">Drugs Are Bad, Mmmkay?</h4>\n\n\n<p><a href=\"https://x.com/tenobrus/status/1964769667073102290\">Ketamine use is bad for you</a>.</p>\n\n\n<h4 class=\"wp-block-heading\">The Lighter Side</h4>\n\n\n<p><a href=\"https://x.com/IvanVendrov/status/1980836030396719451\">The best description I’ve seen of how to think about ‘biological age’ measures</a>:</p>\n<blockquote><p>Ivan: i will only trust your health app’s ‘biological age’ report if it comes bundled with a life insurance offer.</p></blockquote>"
            ],
            "link": "https://thezvi.wordpress.com/2026/01/19/medical-roundup-6/",
            "publishedAt": "2026-01-19",
            "source": "TheZvi",
            "summary": "The main thing to know this time around is that the whole crazy ‘what is causing the rise in autism?’ debacle is over actual nothing. There is no rise in autism. There is only a rise in the diagnosis of &#8230; <a href=\"https://thezvi.wordpress.com/2026/01/19/medical-roundup-6/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
            "title": "Medical Roundup #6"
        },
        {
            "content": [],
            "link": "https://lethain.com/everyinc-compound-engineering/",
            "publishedAt": "2026-01-19",
            "source": "Will Larson",
            "summary": "<p>One of the relatively few AI-native products I use is <a href=\"https://cora.computer/\">Cora.computer</a> which summarizes my personal inbox. It&rsquo;s not perfect, but it&rsquo;s done a much better job than my collection of filters at managing the ever-growing onslaught of spam and unsolicited email that flows in.</p> <p>I&rsquo;ve run into a few issues with Cora, which ended up in me following folks at <a href=\"https://every.to/\">Every</a> to report the issues, and more recently this led me to see their work on <a href=\"https://every.to/chain-of-thought/compound-engineering-how-every-codes-with-agents\">compound engineering</a> and specifically the <a href=\"https://github.com/EveryInc/compound-engineering-plugin/\">compound-engineering-plugin</a>.</p> <div class=\"ba b--light-gray\"> <p><img alt=\"Screenshot of EveryInc&rsquo;s Compound Engineering summary\" src=\"https://lethain.com/static/blog/2026/compound-eng.png\" /></p> </div> <p>Compound Engineering is two extremely well-known patterns, one moderately well-known pattern, and one pattern that I think many practitioners have intuited but have not found a consistent mechanism to implement. Those patterns are:</p> <ol> <li> <p><strong>Plan</strong> is decoupling implementation from research. This is well understood, e.g. Claude&rsquo;s plan mode, although it can certainly be done better or worse by being more specific about which resources to consult (specs, PRDs, RFCS, issues, etc)</p> </li> <li> <p><strong>Work</strong> is implementing a plan. This is well understood, and the core of agentic coding. Again, this can be done better or worse, but much of that",
            "title": "Learning from Every's Compound Engineering"
        },
        {
            "content": [],
            "link": "https://xkcd.com/3196/",
            "publishedAt": "2026-01-19",
            "source": "XKCD",
            "summary": "<img alt=\"I've had countless nights where the line never left the bottom zone of the graph, but the few moments where it's climbed all the way to the top have made up for them all.\" src=\"https://imgs.xkcd.com/comics/aurora_coolness.png\" title=\"I've had countless nights where the line never left the bottom zone of the graph, but the few moments where it's climbed all the way to the top have made up for them all.\" />",
            "title": "Aurora Coolness"
        }
    ],
    "lookbackDays": 1,
    "publishDate": "2026-01-19"
}